; ModuleID = 'src/http/ngx_http_request_body.c'
source_filename = "src/http/ngx_http_request_body.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/http/ngx_http_request_body.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !8, !9, !17, !21, !22, !26}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !6, line: 135, baseType: !7)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !10, line: 16, baseType: !11)
!10 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !12, line: 16, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !14, line: 79, baseType: !15)
!14 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !16)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !10, line: 17, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !12, line: 17, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !14, line: 78, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !7)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !16)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !24, line: 64, baseType: !25)
!24 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !27, line: 16, baseType: !4)
!27 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !{i32 2, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!31 = distinct !DISubprogram(name: "ngx_http_read_client_request_body", scope: !1, file: !1, line: 30, type: !32, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1776)
!32 = !DISubroutineType(types: !33)
!33 = !{!19, !34, !1421}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !36, line: 16, baseType: !37)
!36 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !38, line: 364, size: 5376, elements: !39)
!38 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = !{!40, !42, !388, !390, !391, !392, !393, !398, !399, !632, !1328, !1329, !1330, !1331, !1370, !1400, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1445, !1456, !1463, !1464, !1466, !1467, !1480, !1481, !1482, !1483, !1484, !1485, !1672, !1676, !1681, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !37, file: !38, line: 365, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 191, baseType: !16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !37, file: !38, line: 367, baseType: !43, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !45, line: 26, baseType: !46)
!45 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !47, line: 121, size: 896, elements: !48)
!47 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !{!49, !50, !154, !155, !158, !164, !166, !257, !262, !320, !321, !322, !359, !360, !361, !362, !363, !364, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !47, line: 122, baseType: !4, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !46, file: !47, line: 123, baseType: !51, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !45, line: 24, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !54, line: 30, size: 384, elements: !55)
!54 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !83, !84, !135, !146}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !54, line: 31, baseType: !4, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !53, file: !54, line: 33, baseType: !16, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !53, file: !54, line: 35, baseType: !16, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !53, file: !54, line: 38, baseType: !16, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !53, file: !54, line: 44, baseType: !16, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !53, file: !54, line: 46, baseType: !16, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !53, file: !54, line: 49, baseType: !16, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !53, file: !54, line: 51, baseType: !16, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !53, file: !54, line: 54, baseType: !16, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !53, file: !54, line: 56, baseType: !16, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !53, file: !54, line: 57, baseType: !16, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !53, file: !54, line: 59, baseType: !16, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !53, file: !54, line: 60, baseType: !16, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !53, file: !54, line: 62, baseType: !16, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !53, file: !54, line: 64, baseType: !16, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !53, file: !54, line: 67, baseType: !16, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !53, file: !54, line: 69, baseType: !16, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !53, file: !54, line: 71, baseType: !16, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !53, file: !54, line: 74, baseType: !16, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !53, file: !54, line: 75, baseType: !16, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !53, file: !54, line: 77, baseType: !16, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !53, file: !54, line: 107, baseType: !16, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !53, file: !54, line: 110, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !45, line: 31, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !51}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !53, file: !54, line: 117, baseType: !13, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !53, file: !54, line: 119, baseType: !85, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !45, line: 20, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !88, line: 50, size: 320, elements: !89)
!88 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!89 = !{!90, !91, !112, !116, !119, !124, !125, !130, !131, !134}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !87, file: !88, line: 51, baseType: !13, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !87, file: !88, line: 52, baseType: !92, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !45, line: 21, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !95, line: 89, size: 160, elements: !96)
!95 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = !{!97, !100, !107, !111}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !94, file: !95, line: 90, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !99, line: 16, baseType: !7)
!99 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 91, baseType: !101, size: 64, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !102, line: 19, baseType: !103)
!102 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 16, size: 64, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !103, file: !102, line: 17, baseType: !21, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !102, line: 18, baseType: !22, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !94, file: !95, line: 93, baseType: !108, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !92, !85}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !95, line: 94, baseType: !4, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !87, file: !88, line: 54, baseType: !113, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !114, line: 98, baseType: !115)
!114 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!115 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !87, file: !88, line: 56, baseType: !117, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !118)
!118 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !87, file: !88, line: 58, baseType: !120, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !88, line: 45, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{!22, !85, !22, !21}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !88, line: 59, baseType: !4, size: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !87, file: !88, line: 61, baseType: !126, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !88, line: 46, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !85, !13, !22, !21}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !87, file: !88, line: 62, baseType: !4, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !87, file: !88, line: 70, baseType: !132, size: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !88, line: 72, baseType: !85, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !53, file: !54, line: 121, baseType: !136, size: 160, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !12, line: 20, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !12, line: 22, size: 160, elements: !138)
!138 = !{!139, !140, !142, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !137, file: !12, line: 23, baseType: !11, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !137, file: !12, line: 24, baseType: !141, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !137, file: !12, line: 25, baseType: !141, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !137, file: !12, line: 26, baseType: !141, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !137, file: !12, line: 27, baseType: !23, size: 8, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !12, line: 28, baseType: !23, size: 8, offset: 136)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !53, file: !54, line: 124, baseType: !147, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !148, line: 16, baseType: !149)
!148 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !148, line: 18, size: 64, elements: !150)
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !148, line: 19, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !148, line: 20, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !46, file: !47, line: 124, baseType: !51, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !46, file: !47, line: 126, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !157, line: 17, baseType: !7)
!157 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !46, file: !47, line: 128, baseType: !159, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !160, line: 19, baseType: !161)
!160 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!8, !43, !22, !21}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !46, file: !47, line: 129, baseType: !165, size: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !160, line: 22, baseType: !161)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !46, file: !47, line: 130, baseType: !167, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !160, line: 20, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!8, !43, !171, !5}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !45, line: 19, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !27, line: 59, size: 64, elements: !174)
!174 = !{!175, !256}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !173, file: !27, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !27, line: 18, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !27, line: 20, size: 352, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !178, file: !27, line: 21, baseType: !22, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !178, file: !27, line: 22, baseType: !22, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !178, file: !27, line: 23, baseType: !5, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !178, file: !27, line: 24, baseType: !5, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !178, file: !27, line: 26, baseType: !22, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !178, file: !27, line: 27, baseType: !22, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !178, file: !27, line: 28, baseType: !26, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !178, file: !27, line: 29, baseType: !188, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !45, line: 23, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !191, line: 16, size: 1216, elements: !192)
!191 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!192 = !{!193, !194, !195, !238, !239, !240, !241, !242}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !190, file: !191, line: 17, baseType: !98, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !191, line: 18, baseType: !101, size: 64, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !190, file: !191, line: 19, baseType: !196, size: 960, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !99, line: 17, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !198, line: 4, size: 960, elements: !199)
!198 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!199 = !{!200, !202, !203, !205, !206, !208, !209, !211, !213, !215, !216, !217, !218, !219, !220, !222, !223, !225, !226, !231, !232, !233}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !197, file: !198, line: 6, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !197, file: !198, line: 7, baseType: !201, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !197, file: !198, line: 8, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !197, file: !198, line: 9, baseType: !204, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !197, file: !198, line: 10, baseType: !207, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !16)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !197, file: !198, line: 11, baseType: !207, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !197, file: !198, line: 13, baseType: !210, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !197, file: !198, line: 14, baseType: !212, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !197, file: !198, line: 15, baseType: !214, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !197, file: !198, line: 16, baseType: !16, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !197, file: !198, line: 17, baseType: !201, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !197, file: !198, line: 18, baseType: !201, size: 32, offset: 352)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !197, file: !198, line: 19, baseType: !5, size: 32, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !197, file: !198, line: 20, baseType: !5, size: 32, offset: 416)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !197, file: !198, line: 21, baseType: !221, size: 32, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !118)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !197, file: !198, line: 22, baseType: !221, size: 32, offset: 480)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !197, file: !198, line: 23, baseType: !224, size: 32, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !197, file: !198, line: 24, baseType: !224, size: 32, offset: 544)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !197, file: !198, line: 26, baseType: !227, size: 64, offset: 576)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !227, file: !6, line: 288, baseType: !117, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !227, file: !6, line: 288, baseType: !118, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !197, file: !198, line: 27, baseType: !227, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !197, file: !198, line: 28, baseType: !227, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !197, file: !198, line: 29, baseType: !234, size: 192, offset: 768)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 192, elements: !236)
!235 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !190, file: !191, line: 21, baseType: !5, size: 32, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !190, file: !191, line: 22, baseType: !5, size: 32, offset: 1120)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !190, file: !191, line: 24, baseType: !85, size: 32, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !190, file: !191, line: 37, baseType: !16, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !190, file: !191, line: 38, baseType: !16, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !178, file: !27, line: 30, baseType: !176, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !178, file: !27, line: 34, baseType: !16, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !178, file: !27, line: 40, baseType: !16, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !178, file: !27, line: 43, baseType: !16, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !178, file: !27, line: 45, baseType: !16, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !178, file: !27, line: 46, baseType: !16, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !178, file: !27, line: 47, baseType: !16, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !178, file: !27, line: 48, baseType: !16, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !178, file: !27, line: 49, baseType: !16, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !178, file: !27, line: 50, baseType: !16, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !178, file: !27, line: 52, baseType: !16, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !178, file: !27, line: 53, baseType: !16, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !178, file: !27, line: 55, baseType: !7, size: 32, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !27, line: 61, baseType: !171, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !46, file: !47, line: 131, baseType: !258, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !160, line: 23, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!171, !43, !171, !5}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !46, file: !47, line: 133, baseType: !263, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !47, line: 16, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !47, line: 18, size: 960, elements: !266)
!266 = !{!267, !268, !280, !282, !283, !284, !285, !286, !287, !288, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !265, file: !47, line: 19, baseType: !156, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !265, file: !47, line: 21, baseType: !269, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !271, line: 297, size: 128, elements: !272)
!271 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!272 = !{!273, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !270, file: !271, line: 298, baseType: !274, size: 16)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !6, line: 409, baseType: !275)
!275 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !270, file: !271, line: 299, baseType: !277, size: 112, offset: 16)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 112, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 14)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !265, file: !47, line: 22, baseType: !281, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !6, line: 404, baseType: !16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !265, file: !47, line: 23, baseType: !21, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !265, file: !47, line: 24, baseType: !101, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !47, line: 26, baseType: !7, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !265, file: !47, line: 28, baseType: !7, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !265, file: !47, line: 29, baseType: !7, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !265, file: !47, line: 30, baseType: !7, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !265, file: !47, line: 38, baseType: !289, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !45, line: 32, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !43}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !265, file: !47, line: 40, baseType: !4, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !265, file: !47, line: 42, baseType: !86, size: 320, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !265, file: !47, line: 43, baseType: !85, size: 32, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !265, file: !47, line: 45, baseType: !21, size: 32, offset: 736)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !265, file: !47, line: 47, baseType: !21, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !265, file: !47, line: 49, baseType: !9, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !265, file: !47, line: 51, baseType: !263, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !265, file: !47, line: 52, baseType: !43, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !265, file: !47, line: 54, baseType: !13, size: 32, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !265, file: !47, line: 56, baseType: !16, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !265, file: !47, line: 57, baseType: !16, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !265, file: !47, line: 58, baseType: !16, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !265, file: !47, line: 60, baseType: !16, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !265, file: !47, line: 61, baseType: !16, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !265, file: !47, line: 62, baseType: !16, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !265, file: !47, line: 63, baseType: !16, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !265, file: !47, line: 64, baseType: !16, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !265, file: !47, line: 65, baseType: !16, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !265, file: !47, line: 66, baseType: !16, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !265, file: !47, line: 67, baseType: !16, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !265, file: !47, line: 70, baseType: !16, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !265, file: !47, line: 72, baseType: !16, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !265, file: !47, line: 73, baseType: !16, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !265, file: !47, line: 74, baseType: !16, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !265, file: !47, line: 76, baseType: !16, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !265, file: !47, line: 77, baseType: !16, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !265, file: !47, line: 78, baseType: !16, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !46, file: !47, line: 135, baseType: !5, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !46, file: !47, line: 137, baseType: !85, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !46, file: !47, line: 139, baseType: !323, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !45, line: 18, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !326, line: 57, size: 320, elements: !327)
!326 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!327 = !{!328, !336, !337, !338, !339, !346, !358}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !325, file: !326, line: 58, baseType: !329, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !326, line: 54, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 49, size: 128, elements: !331)
!331 = !{!332, !333, !334, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !330, file: !326, line: 50, baseType: !22, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !330, file: !326, line: 51, baseType: !22, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !326, line: 52, baseType: !323, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !330, file: !326, line: 53, baseType: !13, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !325, file: !326, line: 59, baseType: !21, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !325, file: !326, line: 60, baseType: !323, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !325, file: !326, line: 61, baseType: !171, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !325, file: !326, line: 62, baseType: !340, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !326, line: 41, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !326, line: 43, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !326, line: 44, baseType: !340, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !342, file: !326, line: 45, baseType: !4, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !325, file: !326, line: 63, baseType: !347, size: 32, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !326, line: 32, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !326, line: 34, size: 96, elements: !350)
!350 = !{!351, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !349, file: !326, line: 35, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !326, line: 30, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !4}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !326, line: 36, baseType: !4, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !326, line: 37, baseType: !347, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !325, file: !326, line: 64, baseType: !85, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !47, line: 141, baseType: !7, size: 32, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !46, file: !47, line: 143, baseType: !269, size: 32, offset: 416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !46, file: !47, line: 144, baseType: !281, size: 32, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !46, file: !47, line: 145, baseType: !101, size: 64, offset: 480)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !46, file: !47, line: 147, baseType: !101, size: 64, offset: 544)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !46, file: !47, line: 148, baseType: !365, size: 16, offset: 608)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !366, line: 12, baseType: !367)
!366 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 186, baseType: !275)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !46, file: !47, line: 154, baseType: !269, size: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !46, file: !47, line: 155, baseType: !281, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !46, file: !47, line: 157, baseType: !176, size: 32, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !46, file: !47, line: 159, baseType: !147, size: 64, offset: 736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !46, file: !47, line: 161, baseType: !113, size: 32, offset: 800)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !46, file: !47, line: 163, baseType: !13, size: 32, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !46, file: !47, line: 165, baseType: !16, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !46, file: !47, line: 167, baseType: !16, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !46, file: !47, line: 169, baseType: !16, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !46, file: !47, line: 170, baseType: !16, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !46, file: !47, line: 171, baseType: !16, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !46, file: !47, line: 173, baseType: !16, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !46, file: !47, line: 174, baseType: !16, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !46, file: !47, line: 175, baseType: !16, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !46, file: !47, line: 176, baseType: !16, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !46, file: !47, line: 178, baseType: !16, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !46, file: !47, line: 179, baseType: !16, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !46, file: !47, line: 180, baseType: !16, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !46, file: !47, line: 181, baseType: !16, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !46, file: !47, line: 183, baseType: !16, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !37, file: !38, line: 369, baseType: !389, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !37, file: !38, line: 370, baseType: !389, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !37, file: !38, line: 371, baseType: !389, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !37, file: !38, line: 372, baseType: !389, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !37, file: !38, line: 374, baseType: !394, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !38, line: 361, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !34}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !37, file: !38, line: 375, baseType: !394, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !37, file: !38, line: 378, baseType: !400, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !36, line: 18, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !403, line: 65, size: 3008, elements: !404)
!403 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!404 = !{!405, !406, !416, !417, !421, !422, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !590, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !402, file: !403, line: 66, baseType: !189, size: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !402, file: !403, line: 67, baseType: !407, size: 160, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !408, line: 22, baseType: !409)
!408 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 16, size: 160, elements: !410)
!410 = !{!411, !412, !413, !414, !415}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !409, file: !408, line: 17, baseType: !4, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !409, file: !408, line: 18, baseType: !13, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !408, line: 19, baseType: !21, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !409, file: !408, line: 20, baseType: !13, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !409, file: !408, line: 21, baseType: !323, size: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !402, file: !403, line: 68, baseType: !41, size: 32, offset: 1376)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !402, file: !403, line: 69, baseType: !418, size: 128, offset: 1408)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !402, file: !403, line: 70, baseType: !418, size: 128, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !402, file: !403, line: 72, baseType: !423, size: 32, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !99, line: 18, baseType: !204)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !402, file: !403, line: 73, baseType: !117, size: 32, offset: 1696)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !402, file: !403, line: 74, baseType: !117, size: 32, offset: 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !402, file: !403, line: 75, baseType: !117, size: 32, offset: 1760)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !402, file: !403, line: 76, baseType: !117, size: 32, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !402, file: !403, line: 77, baseType: !117, size: 32, offset: 1824)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !402, file: !403, line: 79, baseType: !101, size: 64, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !402, file: !403, line: 80, baseType: !101, size: 64, offset: 1920)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !402, file: !403, line: 81, baseType: !418, size: 128, offset: 1984)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !402, file: !403, line: 83, baseType: !21, size: 32, offset: 2112)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !402, file: !403, line: 84, baseType: !21, size: 32, offset: 2144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !402, file: !403, line: 85, baseType: !5, size: 32, offset: 2176)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !402, file: !403, line: 86, baseType: !5, size: 32, offset: 2208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !402, file: !403, line: 88, baseType: !13, size: 32, offset: 2240)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !402, file: !403, line: 89, baseType: !13, size: 32, offset: 2272)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !402, file: !403, line: 90, baseType: !13, size: 32, offset: 2304)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !402, file: !403, line: 91, baseType: !13, size: 32, offset: 2336)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !402, file: !403, line: 93, baseType: !176, size: 32, offset: 2368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !402, file: !403, line: 95, baseType: !442, size: 32, offset: 2400)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !36, line: 19, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !403, line: 157, size: 544, elements: !445)
!445 = !{!446, !471, !532, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !589}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !444, file: !403, line: 158, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !403, line: 154, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 145, size: 480, elements: !450)
!450 = !{!451, !462, !463, !464, !467, !468, !469, !470}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !449, file: !403, line: 146, baseType: !452, size: 96)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !12, line: 32, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !12, line: 37, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !453, file: !12, line: 38, baseType: !141, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !453, file: !12, line: 39, baseType: !141, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !453, file: !12, line: 40, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !12, line: 34, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !141, !141, !141}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !449, file: !403, line: 147, baseType: !136, size: 160, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !449, file: !403, line: 148, baseType: !147, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !449, file: !403, line: 149, baseType: !465, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !114, line: 106, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !449, file: !403, line: 150, baseType: !465, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !449, file: !403, line: 151, baseType: !5, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !449, file: !403, line: 152, baseType: !13, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !449, file: !403, line: 153, baseType: !13, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !444, file: !403, line: 159, baseType: !472, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !474, line: 59, baseType: !475)
!474 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 34, size: 800, elements: !476)
!476 = !{!477, !484, !485, !486, !494, !495, !496, !505, !506, !507, !508, !527, !528, !529, !530, !531}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !475, file: !474, line: 35, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !479, line: 21, baseType: !480)
!479 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 16, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !479, line: 17, baseType: !465, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !480, file: !479, line: 19, baseType: !465, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !475, file: !474, line: 37, baseType: !21, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !475, file: !474, line: 38, baseType: !21, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !475, file: !474, line: 40, baseType: !487, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !474, line: 16, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !474, line: 18, size: 96, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !489, file: !474, line: 19, baseType: !15, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !474, line: 20, baseType: !487, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !474, line: 21, baseType: !15, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !475, file: !474, line: 41, baseType: !487, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !475, file: !474, line: 42, baseType: !488, size: 96, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !475, file: !474, line: 44, baseType: !497, size: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !474, line: 31, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 25, size: 128, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !499, file: !474, line: 26, baseType: !13, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !499, file: !474, line: 27, baseType: !13, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !499, file: !474, line: 29, baseType: !13, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !499, file: !474, line: 30, baseType: !13, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !475, file: !474, line: 45, baseType: !13, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !475, file: !474, line: 47, baseType: !22, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !475, file: !474, line: 48, baseType: !22, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !475, file: !474, line: 50, baseType: !509, size: 256, offset: 416)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !479, line: 37, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 24, size: 256, elements: !511)
!511 = !{!512, !514, !515, !516, !526}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !510, file: !479, line: 26, baseType: !513, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !510, file: !479, line: 28, baseType: !513, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !510, file: !479, line: 29, baseType: !13, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !510, file: !479, line: 30, baseType: !517, size: 128, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !518, line: 19, baseType: !519)
!518 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 17, size: 128, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !519, file: !518, line: 18, baseType: !522, size: 128)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 128, elements: !524)
!523 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!524 = !{!525}
!525 = !DISubrange(count: 4)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !510, file: !479, line: 36, baseType: !13, size: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !475, file: !474, line: 52, baseType: !22, size: 32, offset: 672)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !475, file: !474, line: 53, baseType: !23, size: 8, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !475, file: !474, line: 55, baseType: !16, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !474, line: 57, baseType: !4, size: 32, offset: 736)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !475, file: !474, line: 58, baseType: !4, size: 32, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !444, file: !403, line: 161, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !191, line: 62, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 50, size: 384, elements: !536)
!536 = !{!537, !538, !539, !541, !546, !548, !550, !551, !552}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !191, line: 51, baseType: !101, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !535, file: !191, line: 52, baseType: !21, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !535, file: !191, line: 53, baseType: !540, size: 96, offset: 96)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, elements: !236)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !535, file: !191, line: 55, baseType: !542, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !191, line: 45, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{!9, !4}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !535, file: !191, line: 56, baseType: !547, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !191, line: 46, baseType: !543)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !535, file: !191, line: 57, baseType: !549, size: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !191, line: 47, baseType: !353)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !191, line: 58, baseType: !4, size: 32, offset: 288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !535, file: !191, line: 60, baseType: !22, size: 32, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !535, file: !191, line: 61, baseType: !13, size: 32, offset: 352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !444, file: !403, line: 163, baseType: !5, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !444, file: !403, line: 164, baseType: !21, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !444, file: !403, line: 166, baseType: !117, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !444, file: !403, line: 168, baseType: !117, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !444, file: !403, line: 170, baseType: !13, size: 32, offset: 224)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !444, file: !403, line: 171, baseType: !13, size: 32, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !444, file: !403, line: 172, baseType: !9, size: 32, offset: 288)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !444, file: !403, line: 173, baseType: !9, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !444, file: !403, line: 174, baseType: !9, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !444, file: !403, line: 176, baseType: !13, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !444, file: !403, line: 177, baseType: !9, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !444, file: !403, line: 178, baseType: !9, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !444, file: !403, line: 180, baseType: !566, size: 32, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !568, line: 25, baseType: !569)
!568 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !568, line: 29, size: 320, elements: !570)
!570 = !{!571, !572, !582, !587, !588}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !569, file: !568, line: 30, baseType: !4, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !569, file: !568, line: 31, baseType: !573, size: 192, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !574, line: 22, baseType: !575)
!574 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 16, size: 192, elements: !576)
!576 = !{!577, !578, !579, !580, !581}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !575, file: !574, line: 17, baseType: !22, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !575, file: !574, line: 18, baseType: !21, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !575, file: !574, line: 19, baseType: !101, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !575, file: !574, line: 20, baseType: !85, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !575, file: !574, line: 21, baseType: !13, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !569, file: !568, line: 32, baseType: !583, size: 32, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !568, line: 27, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{!19, !566, !4}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !569, file: !568, line: 33, baseType: !4, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !569, file: !568, line: 34, baseType: !13, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !444, file: !403, line: 182, baseType: !13, size: 32, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !402, file: !403, line: 96, baseType: !591, size: 32, offset: 2432)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !403, line: 62, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 39, size: 576, elements: !594)
!594 = !{!595, !596, !597, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !593, file: !403, line: 40, baseType: !136, size: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !593, file: !403, line: 41, baseType: !147, size: 64, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !593, file: !403, line: 43, baseType: !598, size: 96, offset: 224)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 96, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 12)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !593, file: !403, line: 46, baseType: !16, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !593, file: !403, line: 47, baseType: !16, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !593, file: !403, line: 48, baseType: !16, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !593, file: !403, line: 49, baseType: !16, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !593, file: !403, line: 50, baseType: !16, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !593, file: !403, line: 51, baseType: !16, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !593, file: !403, line: 52, baseType: !16, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !593, file: !403, line: 53, baseType: !16, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !593, file: !403, line: 56, baseType: !423, size: 32, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !593, file: !403, line: 57, baseType: !117, size: 32, offset: 416)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !593, file: !403, line: 58, baseType: !117, size: 32, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !593, file: !403, line: 59, baseType: !21, size: 32, offset: 480)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !593, file: !403, line: 60, baseType: !5, size: 32, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !593, file: !403, line: 61, baseType: !9, size: 32, offset: 544)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !402, file: !403, line: 102, baseType: !9, size: 32, offset: 2464)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !402, file: !403, line: 103, baseType: !9, size: 32, offset: 2496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !402, file: !403, line: 104, baseType: !9, size: 32, offset: 2528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !402, file: !403, line: 105, baseType: !9, size: 32, offset: 2560)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !402, file: !403, line: 107, baseType: !52, size: 384, offset: 2592)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !402, file: !403, line: 109, baseType: !16, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !402, file: !403, line: 110, baseType: !16, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !402, file: !403, line: 112, baseType: !16, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !402, file: !403, line: 113, baseType: !16, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !402, file: !403, line: 114, baseType: !16, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !402, file: !403, line: 115, baseType: !16, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !402, file: !403, line: 116, baseType: !16, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !402, file: !403, line: 117, baseType: !16, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !402, file: !403, line: 118, baseType: !16, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !402, file: !403, line: 119, baseType: !16, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !402, file: !403, line: 121, baseType: !16, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !402, file: !403, line: 122, baseType: !16, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !37, file: !38, line: 381, baseType: !633, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !36, line: 17, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !636, line: 313, size: 4096, elements: !637)
!636 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!637 = !{!638, !643, !644, !685, !764, !765, !787, !796, !1055, !1056, !1057, !1095, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1273, !1277, !1278, !1282, !1283, !1284, !1285, !1286, !1290, !1294, !1298, !1299, !1311, !1312, !1313, !1314, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !635, file: !636, line: 314, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !636, line: 309, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !34, !633}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !635, file: !636, line: 315, baseType: !639, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !635, file: !636, line: 317, baseType: !645, size: 480, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !646, line: 22, baseType: !647)
!646 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !646, line: 36, size: 480, elements: !648)
!648 = !{!649, !650, !651, !652, !654, !655, !656, !662, !667, !669, !670, !679, !680, !681, !682, !683, !684}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !647, file: !646, line: 37, baseType: !43, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !647, file: !646, line: 39, baseType: !269, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !647, file: !646, line: 40, baseType: !281, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !646, line: 41, baseType: !653, size: 32, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !647, file: !646, line: 43, baseType: !13, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !647, file: !646, line: 44, baseType: !9, size: 32, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !647, file: !646, line: 46, baseType: !657, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !646, line: 24, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!19, !661, !4}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !647, file: !646, line: 47, baseType: !663, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !646, line: 26, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !661, !4, !13}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !647, file: !646, line: 48, baseType: !668, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !646, line: 28, baseType: !664)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !647, file: !646, line: 49, baseType: !4, size: 32, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !647, file: !646, line: 56, baseType: !671, size: 32, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !673, line: 78, baseType: !674)
!673 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 74, size: 128, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !674, file: !673, line: 75, baseType: !269, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !674, file: !673, line: 76, baseType: !281, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !673, line: 77, baseType: !101, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !646, line: 58, baseType: !7, size: 32, offset: 352)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !647, file: !646, line: 59, baseType: !7, size: 32, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !647, file: !646, line: 61, baseType: !85, size: 32, offset: 416)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !647, file: !646, line: 63, baseType: !16, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !647, file: !646, line: 64, baseType: !16, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !647, file: !646, line: 67, baseType: !16, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !635, file: !636, line: 319, baseType: !686, size: 32, offset: 544)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !688, line: 17, baseType: !689)
!688 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !688, line: 25, size: 1120, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !697, !698, !699, !700, !701, !706, !707, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !763}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !689, file: !688, line: 26, baseType: !43, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !689, file: !688, line: 27, baseType: !43, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !689, file: !688, line: 29, baseType: !171, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !689, file: !688, line: 30, baseType: !171, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !689, file: !688, line: 31, baseType: !696, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !689, file: !688, line: 33, baseType: !171, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !689, file: !688, line: 35, baseType: !171, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !689, file: !688, line: 36, baseType: !171, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !689, file: !688, line: 37, baseType: !171, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !689, file: !688, line: 44, baseType: !702, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !688, line: 19, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DISubroutineType(types: !705)
!705 = !{!19, !686, !176}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !689, file: !688, line: 45, baseType: !4, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !689, file: !688, line: 47, baseType: !708, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !688, line: 21, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{!19, !4, !171}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !689, file: !688, line: 48, baseType: !4, size: 32, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !689, file: !688, line: 57, baseType: !16, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !689, file: !688, line: 58, baseType: !16, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !689, file: !688, line: 59, baseType: !16, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !689, file: !688, line: 60, baseType: !16, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !689, file: !688, line: 61, baseType: !16, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !689, file: !688, line: 62, baseType: !16, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !689, file: !688, line: 63, baseType: !16, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !689, file: !688, line: 64, baseType: !16, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !689, file: !688, line: 65, baseType: !16, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !689, file: !688, line: 66, baseType: !16, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !689, file: !688, line: 67, baseType: !16, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !689, file: !688, line: 68, baseType: !16, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !689, file: !688, line: 70, baseType: !19, size: 32, offset: 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !689, file: !688, line: 71, baseType: !727, size: 64, offset: 480)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !27, line: 68, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 65, size: 64, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !728, file: !27, line: 66, baseType: !19, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !728, file: !27, line: 67, baseType: !21, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !689, file: !688, line: 72, baseType: !26, size: 32, offset: 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !689, file: !688, line: 74, baseType: !8, size: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !689, file: !688, line: 76, baseType: !5, size: 32, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !689, file: !688, line: 77, baseType: !5, size: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !689, file: !688, line: 79, baseType: !5, size: 32, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !689, file: !688, line: 80, baseType: !8, size: 32, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !689, file: !688, line: 82, baseType: !9, size: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !689, file: !688, line: 83, baseType: !9, size: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !689, file: !688, line: 84, baseType: !8, size: 32, offset: 800)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !689, file: !688, line: 86, baseType: !323, size: 32, offset: 832)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !689, file: !688, line: 87, baseType: !85, size: 32, offset: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !689, file: !688, line: 89, baseType: !171, size: 32, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !689, file: !688, line: 90, baseType: !21, size: 32, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !689, file: !688, line: 91, baseType: !176, size: 32, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !689, file: !688, line: 93, baseType: !21, size: 32, offset: 992)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !689, file: !688, line: 94, baseType: !117, size: 32, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !689, file: !688, line: 96, baseType: !749, size: 32, offset: 1056)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !191, line: 84, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 71, size: 1408, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !751, file: !191, line: 72, baseType: !189, size: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !751, file: !191, line: 73, baseType: !5, size: 32, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !751, file: !191, line: 74, baseType: !533, size: 32, offset: 1248)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !751, file: !191, line: 75, baseType: !323, size: 32, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !751, file: !191, line: 76, baseType: !132, size: 32, offset: 1312)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !751, file: !191, line: 78, baseType: !13, size: 32, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !751, file: !191, line: 80, baseType: !16, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !751, file: !191, line: 81, baseType: !16, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !751, file: !191, line: 82, baseType: !16, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !751, file: !191, line: 83, baseType: !16, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !689, file: !688, line: 98, baseType: !7, size: 32, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !635, file: !636, line: 321, baseType: !171, size: 32, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !635, file: !636, line: 323, baseType: !766, size: 416, offset: 608)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !27, line: 71, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !27, line: 78, size: 416, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !786}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !767, file: !27, line: 79, baseType: !176, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !767, file: !27, line: 80, baseType: !171, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !767, file: !27, line: 81, baseType: !171, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !767, file: !27, line: 82, baseType: !171, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !767, file: !27, line: 84, baseType: !16, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !767, file: !27, line: 85, baseType: !16, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !767, file: !27, line: 86, baseType: !16, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !767, file: !27, line: 87, baseType: !16, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !767, file: !27, line: 88, baseType: !16, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !767, file: !27, line: 89, baseType: !16, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !767, file: !27, line: 104, baseType: !5, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !767, file: !27, line: 106, baseType: !323, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !767, file: !27, line: 107, baseType: !19, size: 32, offset: 224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !767, file: !27, line: 108, baseType: !727, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !767, file: !27, line: 109, baseType: !26, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !767, file: !27, line: 111, baseType: !785, size: 32, offset: 352)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !27, line: 73, baseType: !709)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !767, file: !27, line: 112, baseType: !4, size: 32, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !635, file: !636, line: 324, baseType: !788, size: 160, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !27, line: 122, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 116, size: 160, elements: !790)
!790 = !{!791, !792, !793, !794, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !789, file: !27, line: 117, baseType: !171, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !789, file: !27, line: 118, baseType: !696, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !789, file: !27, line: 119, baseType: !43, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !789, file: !27, line: 120, baseType: !323, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !789, file: !27, line: 121, baseType: !5, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !635, file: !636, line: 326, baseType: !797, size: 32, offset: 1184)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_conf_t", file: !636, line: 238, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 147, size: 1760, elements: !800)
!800 = !{!801, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1013, !1014, !1015, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !799, file: !636, line: 148, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !636, line: 77, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !636, line: 119, size: 416, elements: !805)
!805 = !{!806, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !804, file: !636, line: 120, baseType: !807, size: 96)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !636, line: 89, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 85, size: 96, elements: !809)
!809 = !{!810, !951, !956}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !808, file: !636, line: 86, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !636, line: 79, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!19, !815, !802}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !45, line: 16, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !95, line: 116, size: 384, elements: !818)
!818 = !{!819, !820, !822, !933, !934, !935, !944, !945, !946, !947, !948, !950}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !95, line: 117, baseType: !132, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !817, file: !95, line: 118, baseType: !821, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !817, file: !95, line: 120, baseType: !823, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !45, line: 17, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !568, line: 38, size: 2496, elements: !826)
!826 = !{!827, !830, !831, !832, !833, !834, !836, !837, !838, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !825, file: !568, line: 39, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !825, file: !568, line: 40, baseType: !323, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !825, file: !568, line: 42, baseType: !85, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !825, file: !568, line: 43, baseType: !86, size: 320, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !825, file: !568, line: 45, baseType: !13, size: 32, offset: 416)
