; ModuleID = 'src/http/ngx_http.c'
source_filename = "src/http/ngx_http.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_core_module_t = type { %struct.ngx_str_t, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_html_default_types", scope: !2, file: !3, line: 77, type: !1894, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !1858)
!3 = !DIFile(filename: "src/http/ngx_http.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !21, !30, !228, !230, !231, !59, !38, !44, !1796, !1577, !1851}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 17, size: 96, elements: !25)
!25 = !{!26, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !24, file: !23, line: 18, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !24, file: !23, line: 19, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !24, file: !23, line: 20, baseType: !27, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !33, line: 22, baseType: !34)
!33 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 16, size: 160, elements: !35)
!35 = !{!36, !37, !43, !45, !46}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !34, file: !33, line: 17, baseType: !20, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !34, file: !33, line: 18, baseType: !38, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !39, line: 79, baseType: !40)
!39 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !41, line: 125, baseType: !42)
!41 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !34, file: !33, line: 19, baseType: !44, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 120, baseType: !42)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !34, file: !33, line: 20, baseType: !38, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !34, file: !33, line: 21, baseType: !47, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !49, line: 18, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !51, line: 57, size: 320, elements: !52)
!51 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = !{!53, !65, !66, !67, !208, !215, !227}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !50, file: !51, line: 58, baseType: !54, size: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !51, line: 54, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 49, size: 128, elements: !56)
!56 = !{!57, !62, !63, !64}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !55, file: !51, line: 50, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !60, line: 64, baseType: !61)
!60 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !55, file: !51, line: 51, baseType: !58, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !51, line: 52, baseType: !47, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !55, file: !51, line: 53, baseType: !38, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !50, file: !51, line: 59, baseType: !44, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !50, file: !51, line: 60, baseType: !47, size: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !50, file: !51, line: 61, baseType: !68, size: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !49, line: 19, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !71, line: 59, size: 64, elements: !72)
!71 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!72 = !{!73, !207}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !70, file: !71, line: 60, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !71, line: 18, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !71, line: 20, size: 352, elements: !77)
!77 = !{!78, !79, !80, !83, !84, !85, !86, !88, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !76, file: !71, line: 21, baseType: !58, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !76, file: !71, line: 22, baseType: !58, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !76, file: !71, line: 23, baseType: !81, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !41, line: 222, baseType: !82)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !76, file: !71, line: 24, baseType: !81, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !76, file: !71, line: 26, baseType: !58, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !76, file: !71, line: 27, baseType: !58, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !76, file: !71, line: 28, baseType: !87, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !71, line: 16, baseType: !20)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !76, file: !71, line: 29, baseType: !89, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !49, line: 23, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !92, line: 16, size: 1216, elements: !93)
!92 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = !{!94, !97, !104, !149, !150, !151, !192, !193}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !91, file: !92, line: 17, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !96, line: 16, baseType: !82)
!96 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !92, line: 18, baseType: !98, size: 64, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !99, line: 19, baseType: !100)
!99 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 16, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !99, line: 17, baseType: !44, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !99, line: 18, baseType: !58, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !91, file: !92, line: 19, baseType: !105, size: 960, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !96, line: 17, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !107, line: 4, size: 960, elements: !108)
!107 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!108 = !{!109, !111, !112, !114, !115, !117, !118, !120, !122, !124, !125, !126, !127, !128, !129, !132, !133, !135, !136, !142, !143, !144}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !106, file: !107, line: 6, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !41, line: 232, baseType: !42)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !106, file: !107, line: 7, baseType: !110, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !106, file: !107, line: 8, baseType: !113, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !41, line: 227, baseType: !42)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !106, file: !107, line: 9, baseType: !113, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !106, file: !107, line: 10, baseType: !116, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !41, line: 217, baseType: !42)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !106, file: !107, line: 11, baseType: !116, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !106, file: !107, line: 13, baseType: !119, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !41, line: 212, baseType: !42)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !106, file: !107, line: 14, baseType: !121, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !41, line: 304, baseType: !42)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !106, file: !107, line: 15, baseType: !123, size: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !41, line: 309, baseType: !42)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !106, file: !107, line: 16, baseType: !42, size: 32, offset: 288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !106, file: !107, line: 17, baseType: !110, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !106, file: !107, line: 18, baseType: !110, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !106, file: !107, line: 19, baseType: !81, size: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !106, file: !107, line: 20, baseType: !81, size: 32, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !106, file: !107, line: 21, baseType: !130, size: 32, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !41, line: 237, baseType: !131)
!131 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !106, file: !107, line: 22, baseType: !130, size: 32, offset: 480)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !106, file: !107, line: 23, baseType: !134, size: 32, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !41, line: 242, baseType: !82)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !106, file: !107, line: 24, baseType: !134, size: 32, offset: 544)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !106, file: !107, line: 26, baseType: !137, size: 64, offset: 576)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !41, line: 288, size: 64, elements: !138)
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !137, file: !41, line: 288, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !41, line: 75, baseType: !131)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !137, file: !41, line: 288, baseType: !131, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !106, file: !107, line: 27, baseType: !137, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !106, file: !107, line: 28, baseType: !137, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !106, file: !107, line: 29, baseType: !145, size: 192, offset: 768)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 192, elements: !147)
!146 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!147 = !{!148}
!148 = !DISubrange(count: 3)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !91, file: !92, line: 21, baseType: !81, size: 32, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !91, file: !92, line: 22, baseType: !81, size: 32, offset: 1120)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !91, file: !92, line: 24, baseType: !152, size: 32, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !49, line: 20, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !155, line: 50, size: 320, elements: !156)
!155 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!156 = !{!157, !158, !171, !175, !176, !181, !182, !187, !188, !191}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !154, file: !155, line: 51, baseType: !38, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !154, file: !155, line: 52, baseType: !159, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !49, line: 21, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !162, line: 89, size: 160, elements: !163)
!162 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !{!164, !165, !166, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !161, file: !162, line: 90, baseType: !95, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !162, line: 91, baseType: !98, size: 64, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !161, file: !162, line: 93, baseType: !167, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !159, !152}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !162, line: 94, baseType: !20, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !154, file: !155, line: 54, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !173, line: 98, baseType: !174)
!173 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!174 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !154, file: !155, line: 56, baseType: !140, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !154, file: !155, line: 58, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !155, line: 45, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!58, !152, !58, !44}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !155, line: 59, baseType: !20, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !154, file: !155, line: 61, baseType: !183, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !155, line: 46, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !152, !38, !58, !44}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !154, file: !155, line: 62, baseType: !20, size: 32, offset: 224)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !154, file: !155, line: 70, baseType: !189, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !155, line: 72, baseType: !152, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !91, file: !92, line: 37, baseType: !42, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !91, file: !92, line: 38, baseType: !42, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !76, file: !71, line: 30, baseType: !74, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !76, file: !71, line: 34, baseType: !42, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !76, file: !71, line: 40, baseType: !42, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !76, file: !71, line: 43, baseType: !42, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !76, file: !71, line: 45, baseType: !42, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !76, file: !71, line: 46, baseType: !42, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !76, file: !71, line: 47, baseType: !42, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !76, file: !71, line: 48, baseType: !42, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !76, file: !71, line: 49, baseType: !42, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !76, file: !71, line: 50, baseType: !42, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !76, file: !71, line: 52, baseType: !42, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !76, file: !71, line: 53, baseType: !42, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !76, file: !71, line: 55, baseType: !82, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !71, line: 61, baseType: !68, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !50, file: !51, line: 62, baseType: !209, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !51, line: 41, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !51, line: 43, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !51, line: 44, baseType: !209, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !211, file: !51, line: 45, baseType: !20, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !50, file: !51, line: 63, baseType: !216, size: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !51, line: 32, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !51, line: 34, size: 96, elements: !219)
!219 = !{!220, !225, !226}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !218, file: !51, line: 35, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !51, line: 30, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !20}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !51, line: 36, baseType: !20, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !51, line: 37, baseType: !216, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !50, file: !51, line: 64, baseType: !152, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_location_queue_t", file: !6, line: 459, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 451, size: 288, elements: !234)
!234 = !{!235, !243, !1791, !1792, !1793, !1794, !1795}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !233, file: !6, line: 452, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !237, line: 16, baseType: !238)
!237 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !237, line: 18, size: 64, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !237, line: 19, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !237, line: 20, baseType: !241, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !233, file: !6, line: 453, baseType: !244, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_core_loc_conf_t", file: !6, line: 64, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_core_loc_conf_s", file: !6, line: 309, size: 2496, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !271, !272, !274, !275, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1770, !1771, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !6, line: 310, baseType: !98, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "noname", scope: !246, file: !6, line: 316, baseType: !42, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lmt_excpt", scope: !246, file: !6, line: 317, baseType: !42, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !246, file: !6, line: 318, baseType: !42, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !246, file: !6, line: 320, baseType: !42, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "noregex", scope: !246, file: !6, line: 321, baseType: !42, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !246, file: !6, line: 323, baseType: !42, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "static_locations", scope: !246, file: !6, line: 329, baseType: !256, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_location_tree_node_t", file: !6, line: 63, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_location_tree_node_s", file: !6, line: 462, size: 192, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !258, file: !6, line: 463, baseType: !256, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !258, file: !6, line: 464, baseType: !256, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !258, file: !6, line: 465, baseType: !256, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !258, file: !6, line: 467, baseType: !244, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !258, file: !6, line: 468, baseType: !244, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !258, file: !6, line: 470, baseType: !59, size: 8, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !6, line: 471, baseType: !59, size: 8, offset: 168)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !6, line: 472, baseType: !268, size: 8, offset: 176)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 1)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !246, file: !6, line: 335, baseType: !27, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except", scope: !246, file: !6, line: 337, baseType: !273, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 191, baseType: !42)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except_loc_conf", scope: !246, file: !6, line: 338, baseType: !27, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !246, file: !6, line: 340, baseType: !276, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !277, line: 360, baseType: !278)
!277 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DISubroutineType(types: !280)
!280 = !{!281, !283}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !39, line: 78, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !41, line: 140, baseType: !82)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !285, line: 16, baseType: !286)
!285 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !277, line: 364, size: 5376, elements: !287)
!287 = !{!288, !289, !460, !461, !462, !463, !464, !469, !470, !694, !1381, !1382, !1383, !1384, !1423, !1453, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1498, !1509, !1516, !1517, !1518, !1519, !1532, !1533, !1534, !1535, !1536, !1537, !1601, !1605, !1610, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !286, file: !277, line: 365, baseType: !273, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !286, file: !277, line: 367, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !49, line: 26, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !293, line: 121, size: 896, elements: !294)
!293 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!294 = !{!295, !296, !345, !346, !349, !356, !358, !363, !368, !428, !429, !430, !431, !432, !433, !434, !435, !436, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !293, line: 122, baseType: !20, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !292, file: !293, line: 123, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !49, line: 24, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !300, line: 30, size: 384, elements: !301)
!300 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !329, !330, !331, !344}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 31, baseType: !20, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !299, file: !300, line: 33, baseType: !42, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !299, file: !300, line: 35, baseType: !42, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !299, file: !300, line: 38, baseType: !42, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !299, file: !300, line: 44, baseType: !42, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !299, file: !300, line: 46, baseType: !42, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !299, file: !300, line: 49, baseType: !42, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !299, file: !300, line: 51, baseType: !42, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !299, file: !300, line: 54, baseType: !42, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !299, file: !300, line: 56, baseType: !42, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !299, file: !300, line: 57, baseType: !42, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !299, file: !300, line: 59, baseType: !42, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !299, file: !300, line: 60, baseType: !42, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !299, file: !300, line: 62, baseType: !42, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !299, file: !300, line: 64, baseType: !42, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !299, file: !300, line: 67, baseType: !42, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !299, file: !300, line: 69, baseType: !42, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !299, file: !300, line: 71, baseType: !42, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !299, file: !300, line: 74, baseType: !42, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !299, file: !300, line: 75, baseType: !42, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !299, file: !300, line: 77, baseType: !42, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !299, file: !300, line: 107, baseType: !42, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !299, file: !300, line: 110, baseType: !325, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !49, line: 31, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !297}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !299, file: !300, line: 117, baseType: !38, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !299, file: !300, line: 119, baseType: !152, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !299, file: !300, line: 121, baseType: !332, size: 160, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !333, line: 20, baseType: !334)
!333 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !333, line: 22, size: 160, elements: !335)
!335 = !{!336, !338, !340, !341, !342, !343}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !334, file: !333, line: 23, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !333, line: 16, baseType: !38)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !334, file: !333, line: 24, baseType: !339, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !334, file: !333, line: 25, baseType: !339, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !334, file: !333, line: 26, baseType: !339, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !334, file: !333, line: 27, baseType: !59, size: 8, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !333, line: 28, baseType: !59, size: 8, offset: 136)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !299, file: !300, line: 124, baseType: !236, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !292, file: !293, line: 124, baseType: !297, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !292, file: !293, line: 126, baseType: !347, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !348, line: 17, baseType: !82)
!348 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !292, file: !293, line: 128, baseType: !350, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !351, line: 19, baseType: !352)
!351 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !290, !58, !44}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !41, line: 135, baseType: !82)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !292, file: !293, line: 129, baseType: !357, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !351, line: 22, baseType: !352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !292, file: !293, line: 130, baseType: !359, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !351, line: 20, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!355, !290, !68, !81}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !292, file: !293, line: 131, baseType: !364, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !351, line: 23, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DISubroutineType(types: !367)
!367 = !{!68, !290, !68, !81}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !292, file: !293, line: 133, baseType: !369, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !293, line: 16, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !293, line: 18, size: 960, elements: !372)
!372 = !{!373, !374, !386, !388, !389, !390, !391, !392, !393, !394, !399, !400, !401, !402, !403, !404, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !371, file: !293, line: 19, baseType: !347, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !371, file: !293, line: 21, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !377, line: 297, size: 128, elements: !378)
!377 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !{!379, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !376, file: !377, line: 298, baseType: !380, size: 16)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !41, line: 409, baseType: !381)
!381 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !376, file: !377, line: 299, baseType: !383, size: 112, offset: 16)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 112, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 14)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !371, file: !293, line: 22, baseType: !387, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !41, line: 404, baseType: !42)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !371, file: !293, line: 23, baseType: !44, size: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !371, file: !293, line: 24, baseType: !98, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !371, file: !293, line: 26, baseType: !82, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !371, file: !293, line: 28, baseType: !82, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !371, file: !293, line: 29, baseType: !82, size: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !371, file: !293, line: 30, baseType: !82, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !371, file: !293, line: 38, baseType: !395, size: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !49, line: 32, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !290}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !371, file: !293, line: 40, baseType: !20, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !371, file: !293, line: 42, baseType: !153, size: 320, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !371, file: !293, line: 43, baseType: !152, size: 32, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !371, file: !293, line: 45, baseType: !44, size: 32, offset: 736)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !371, file: !293, line: 47, baseType: !44, size: 32, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !371, file: !293, line: 49, baseType: !405, size: 32, offset: 800)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !406, line: 16, baseType: !337)
!406 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !371, file: !293, line: 51, baseType: !369, size: 32, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !371, file: !293, line: 52, baseType: !290, size: 32, offset: 864)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !371, file: !293, line: 54, baseType: !38, size: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !371, file: !293, line: 56, baseType: !42, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !371, file: !293, line: 57, baseType: !42, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !371, file: !293, line: 58, baseType: !42, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !371, file: !293, line: 60, baseType: !42, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !371, file: !293, line: 61, baseType: !42, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !371, file: !293, line: 62, baseType: !42, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !371, file: !293, line: 63, baseType: !42, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !371, file: !293, line: 64, baseType: !42, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !371, file: !293, line: 65, baseType: !42, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !371, file: !293, line: 66, baseType: !42, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !371, file: !293, line: 67, baseType: !42, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !371, file: !293, line: 70, baseType: !42, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !371, file: !293, line: 72, baseType: !42, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !371, file: !293, line: 73, baseType: !42, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !371, file: !293, line: 74, baseType: !42, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !371, file: !293, line: 76, baseType: !42, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !371, file: !293, line: 77, baseType: !42, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !371, file: !293, line: 78, baseType: !42, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !292, file: !293, line: 135, baseType: !81, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !292, file: !293, line: 137, baseType: !152, size: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !292, file: !293, line: 139, baseType: !47, size: 32, offset: 352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !293, line: 141, baseType: !82, size: 32, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !292, file: !293, line: 143, baseType: !375, size: 32, offset: 416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !292, file: !293, line: 144, baseType: !387, size: 32, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !292, file: !293, line: 145, baseType: !98, size: 64, offset: 480)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !292, file: !293, line: 147, baseType: !98, size: 64, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !292, file: !293, line: 148, baseType: !437, size: 16, offset: 608)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !438, line: 12, baseType: !439)
!438 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 186, baseType: !381)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !292, file: !293, line: 154, baseType: !375, size: 32, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !292, file: !293, line: 155, baseType: !387, size: 32, offset: 672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !292, file: !293, line: 157, baseType: !74, size: 32, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !292, file: !293, line: 159, baseType: !236, size: 64, offset: 736)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !292, file: !293, line: 161, baseType: !172, size: 32, offset: 800)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !292, file: !293, line: 163, baseType: !38, size: 32, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !292, file: !293, line: 165, baseType: !42, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !292, file: !293, line: 167, baseType: !42, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !292, file: !293, line: 169, baseType: !42, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !292, file: !293, line: 170, baseType: !42, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !292, file: !293, line: 171, baseType: !42, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !292, file: !293, line: 173, baseType: !42, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !292, file: !293, line: 174, baseType: !42, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !292, file: !293, line: 175, baseType: !42, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !292, file: !293, line: 176, baseType: !42, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !292, file: !293, line: 178, baseType: !42, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !292, file: !293, line: 179, baseType: !42, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !292, file: !293, line: 180, baseType: !42, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !292, file: !293, line: 181, baseType: !42, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !292, file: !293, line: 183, baseType: !42, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !286, file: !277, line: 369, baseType: !27, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !286, file: !277, line: 370, baseType: !27, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !286, file: !277, line: 371, baseType: !27, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !286, file: !277, line: 372, baseType: !27, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !286, file: !277, line: 374, baseType: !465, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !277, line: 361, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !283}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !286, file: !277, line: 375, baseType: !465, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !286, file: !277, line: 378, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !285, line: 18, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !474, line: 65, size: 3008, elements: !475)
!474 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!475 = !{!476, !477, !478, !479, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !652, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !473, file: !474, line: 66, baseType: !90, size: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !473, file: !474, line: 67, baseType: !32, size: 160, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !473, file: !474, line: 68, baseType: !273, size: 32, offset: 1376)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !473, file: !474, line: 69, baseType: !480, size: 128, offset: 1408)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 16)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !473, file: !474, line: 70, baseType: !480, size: 128, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !473, file: !474, line: 72, baseType: !485, size: 32, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !96, line: 18, baseType: !113)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !473, file: !474, line: 73, baseType: !140, size: 32, offset: 1696)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !473, file: !474, line: 74, baseType: !140, size: 32, offset: 1728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !473, file: !474, line: 75, baseType: !140, size: 32, offset: 1760)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !473, file: !474, line: 76, baseType: !140, size: 32, offset: 1792)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !473, file: !474, line: 77, baseType: !140, size: 32, offset: 1824)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !473, file: !474, line: 79, baseType: !98, size: 64, offset: 1856)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !473, file: !474, line: 80, baseType: !98, size: 64, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !473, file: !474, line: 81, baseType: !480, size: 128, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !473, file: !474, line: 83, baseType: !44, size: 32, offset: 2112)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !473, file: !474, line: 84, baseType: !44, size: 32, offset: 2144)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !473, file: !474, line: 85, baseType: !81, size: 32, offset: 2176)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !473, file: !474, line: 86, baseType: !81, size: 32, offset: 2208)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !473, file: !474, line: 88, baseType: !38, size: 32, offset: 2240)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !473, file: !474, line: 89, baseType: !38, size: 32, offset: 2272)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !473, file: !474, line: 90, baseType: !38, size: 32, offset: 2304)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !473, file: !474, line: 91, baseType: !38, size: 32, offset: 2336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !473, file: !474, line: 93, baseType: !74, size: 32, offset: 2368)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !473, file: !474, line: 95, baseType: !504, size: 32, offset: 2400)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !285, line: 19, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !474, line: 157, size: 544, elements: !507)
!507 = !{!508, !533, !594, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !651}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !506, file: !474, line: 158, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !474, line: 154, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 145, size: 480, elements: !512)
!512 = !{!513, !524, !525, !526, !529, !530, !531, !532}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !511, file: !474, line: 146, baseType: !514, size: 96)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !333, line: 32, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !333, line: 37, size: 96, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !515, file: !333, line: 38, baseType: !339, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !515, file: !333, line: 39, baseType: !339, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !515, file: !333, line: 40, baseType: !520, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !333, line: 34, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !339, !339, !339}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !511, file: !474, line: 147, baseType: !332, size: 160, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !511, file: !474, line: 148, baseType: !236, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !511, file: !474, line: 149, baseType: !527, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !173, line: 106, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !511, file: !474, line: 150, baseType: !527, size: 32, offset: 352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !474, line: 151, baseType: !81, size: 32, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !511, file: !474, line: 152, baseType: !38, size: 32, offset: 416)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !511, file: !474, line: 153, baseType: !38, size: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !506, file: !474, line: 159, baseType: !534, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !536, line: 59, baseType: !537)
!536 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 34, size: 800, elements: !538)
!538 = !{!539, !546, !547, !548, !556, !557, !558, !567, !568, !569, !570, !589, !590, !591, !592, !593}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !537, file: !536, line: 35, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !541, line: 21, baseType: !542)
!541 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 16, size: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !542, file: !541, line: 17, baseType: !527, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !542, file: !541, line: 19, baseType: !527, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !537, file: !536, line: 37, baseType: !44, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !537, file: !536, line: 38, baseType: !44, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !537, file: !536, line: 40, baseType: !549, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !536, line: 16, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !536, line: 18, size: 96, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !551, file: !536, line: 19, baseType: !40, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !536, line: 20, baseType: !549, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !551, file: !536, line: 21, baseType: !40, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !537, file: !536, line: 41, baseType: !549, size: 32, offset: 160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !537, file: !536, line: 42, baseType: !550, size: 96, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !537, file: !536, line: 44, baseType: !559, size: 32, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !536, line: 31, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 25, size: 128, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !561, file: !536, line: 26, baseType: !38, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !561, file: !536, line: 27, baseType: !38, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !561, file: !536, line: 29, baseType: !38, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !561, file: !536, line: 30, baseType: !38, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !537, file: !536, line: 45, baseType: !38, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !537, file: !536, line: 47, baseType: !58, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !537, file: !536, line: 48, baseType: !58, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !537, file: !536, line: 50, baseType: !571, size: 256, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !541, line: 37, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 24, size: 256, elements: !573)
!573 = !{!574, !576, !577, !578, !588}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !572, file: !541, line: 26, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !572, file: !541, line: 28, baseType: !575, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !572, file: !541, line: 29, baseType: !38, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !572, file: !541, line: 30, baseType: !579, size: 128, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !580, line: 19, baseType: !581)
!580 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 17, size: 128, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !581, file: !580, line: 18, baseType: !584, size: 128)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 128, elements: !586)
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!586 = !{!587}
!587 = !DISubrange(count: 4)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !572, file: !541, line: 36, baseType: !38, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !537, file: !536, line: 52, baseType: !58, size: 32, offset: 672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !537, file: !536, line: 53, baseType: !59, size: 8, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !537, file: !536, line: 55, baseType: !42, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !536, line: 57, baseType: !20, size: 32, offset: 736)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !537, file: !536, line: 58, baseType: !20, size: 32, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !506, file: !474, line: 161, baseType: !595, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !92, line: 62, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 50, size: 384, elements: !598)
!598 = !{!599, !600, !601, !603, !608, !610, !612, !613, !614}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !92, line: 51, baseType: !98, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !597, file: !92, line: 52, baseType: !44, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !597, file: !92, line: 53, baseType: !602, size: 96, offset: 96)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !147)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !597, file: !92, line: 55, baseType: !604, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !92, line: 45, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{!405, !20}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !597, file: !92, line: 56, baseType: !609, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !92, line: 46, baseType: !605)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !597, file: !92, line: 57, baseType: !611, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !92, line: 47, baseType: !222)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !92, line: 58, baseType: !20, size: 32, offset: 288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !597, file: !92, line: 60, baseType: !58, size: 32, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !597, file: !92, line: 61, baseType: !38, size: 32, offset: 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !506, file: !474, line: 163, baseType: !81, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !506, file: !474, line: 164, baseType: !44, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !506, file: !474, line: 166, baseType: !140, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !506, file: !474, line: 168, baseType: !140, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !506, file: !474, line: 170, baseType: !38, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !506, file: !474, line: 171, baseType: !38, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !506, file: !474, line: 172, baseType: !405, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !506, file: !474, line: 173, baseType: !405, size: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !506, file: !474, line: 174, baseType: !405, size: 32, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !506, file: !474, line: 176, baseType: !38, size: 32, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !506, file: !474, line: 177, baseType: !405, size: 32, offset: 416)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !506, file: !474, line: 178, baseType: !405, size: 32, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !506, file: !474, line: 180, baseType: !628, size: 32, offset: 480)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !630, line: 25, baseType: !631)
!630 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !630, line: 29, size: 320, elements: !632)
!632 = !{!633, !634, !644, !649, !650}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !631, file: !630, line: 30, baseType: !20, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !631, file: !630, line: 31, baseType: !635, size: 192, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !636, line: 22, baseType: !637)
!636 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 16, size: 192, elements: !638)
!638 = !{!639, !640, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !637, file: !636, line: 17, baseType: !58, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !636, line: 18, baseType: !44, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !636, line: 19, baseType: !98, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !637, file: !636, line: 20, baseType: !152, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !637, file: !636, line: 21, baseType: !38, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !631, file: !630, line: 32, baseType: !645, size: 32, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !630, line: 27, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{!281, !628, !20}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !631, file: !630, line: 33, baseType: !20, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !631, file: !630, line: 34, baseType: !38, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !506, file: !474, line: 182, baseType: !38, size: 32, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !474, line: 96, baseType: !653, size: 32, offset: 2432)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !474, line: 62, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 39, size: 576, elements: !656)
!656 = !{!657, !658, !659, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !474, line: 40, baseType: !332, size: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !655, file: !474, line: 41, baseType: !236, size: 64, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !655, file: !474, line: 43, baseType: !660, size: 96, offset: 224)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 96, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 12)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !655, file: !474, line: 46, baseType: !42, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !655, file: !474, line: 47, baseType: !42, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !655, file: !474, line: 48, baseType: !42, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !655, file: !474, line: 49, baseType: !42, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !655, file: !474, line: 50, baseType: !42, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !655, file: !474, line: 51, baseType: !42, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !655, file: !474, line: 52, baseType: !42, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !655, file: !474, line: 53, baseType: !42, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !655, file: !474, line: 56, baseType: !485, size: 32, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !655, file: !474, line: 57, baseType: !140, size: 32, offset: 416)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !655, file: !474, line: 58, baseType: !140, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !655, file: !474, line: 59, baseType: !44, size: 32, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !655, file: !474, line: 60, baseType: !81, size: 32, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !655, file: !474, line: 61, baseType: !405, size: 32, offset: 544)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !473, file: !474, line: 102, baseType: !405, size: 32, offset: 2464)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !473, file: !474, line: 103, baseType: !405, size: 32, offset: 2496)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !473, file: !474, line: 104, baseType: !405, size: 32, offset: 2528)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !473, file: !474, line: 105, baseType: !405, size: 32, offset: 2560)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !473, file: !474, line: 107, baseType: !298, size: 384, offset: 2592)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !473, file: !474, line: 109, baseType: !42, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !473, file: !474, line: 110, baseType: !42, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !473, file: !474, line: 112, baseType: !42, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !473, file: !474, line: 113, baseType: !42, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !473, file: !474, line: 114, baseType: !42, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !473, file: !474, line: 115, baseType: !42, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !473, file: !474, line: 116, baseType: !42, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !473, file: !474, line: 117, baseType: !42, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !473, file: !474, line: 118, baseType: !42, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !473, file: !474, line: 119, baseType: !42, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !473, file: !474, line: 121, baseType: !42, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !473, file: !474, line: 122, baseType: !42, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !286, file: !277, line: 381, baseType: !695, size: 32, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !285, line: 17, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !698, line: 313, size: 4096, elements: !699)
!698 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!699 = !{!700, !705, !706, !747, !826, !827, !849, !858, !1111, !1112, !1113, !1151, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1343, !1347, !1351, !1352, !1364, !1365, !1366, !1367, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !697, file: !698, line: 314, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !698, line: 309, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !283, !695}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !697, file: !698, line: 315, baseType: !701, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !697, file: !698, line: 317, baseType: !707, size: 480, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !708, line: 22, baseType: !709)
!708 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !708, line: 36, size: 480, elements: !710)
!710 = !{!711, !712, !713, !714, !716, !717, !718, !724, !729, !731, !732, !741, !742, !743, !744, !745, !746}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !709, file: !708, line: 37, baseType: !290, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !709, file: !708, line: 39, baseType: !375, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !709, file: !708, line: 40, baseType: !387, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !708, line: 41, baseType: !715, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !709, file: !708, line: 43, baseType: !38, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !709, file: !708, line: 44, baseType: !405, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !709, file: !708, line: 46, baseType: !719, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !708, line: 24, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{!281, !723, !20}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !709, file: !708, line: 47, baseType: !725, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !708, line: 26, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !723, !20, !38}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !709, file: !708, line: 48, baseType: !730, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !708, line: 28, baseType: !726)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !709, file: !708, line: 49, baseType: !20, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !709, file: !708, line: 56, baseType: !733, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !735, line: 78, baseType: !736)
!735 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !735, line: 74, size: 128, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !736, file: !735, line: 75, baseType: !375, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !736, file: !735, line: 76, baseType: !387, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !735, line: 77, baseType: !98, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !708, line: 58, baseType: !82, size: 32, offset: 352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !709, file: !708, line: 59, baseType: !82, size: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !709, file: !708, line: 61, baseType: !152, size: 32, offset: 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !709, file: !708, line: 63, baseType: !42, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !709, file: !708, line: 64, baseType: !42, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !709, file: !708, line: 67, baseType: !42, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !697, file: !698, line: 319, baseType: !748, size: 32, offset: 544)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !750, line: 17, baseType: !751)
!750 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !750, line: 25, size: 1120, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !759, !760, !761, !762, !763, !768, !769, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !825}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !751, file: !750, line: 26, baseType: !290, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !751, file: !750, line: 27, baseType: !290, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !751, file: !750, line: 29, baseType: !68, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !751, file: !750, line: 30, baseType: !68, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !751, file: !750, line: 31, baseType: !758, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !751, file: !750, line: 33, baseType: !68, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !751, file: !750, line: 35, baseType: !68, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !751, file: !750, line: 36, baseType: !68, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !751, file: !750, line: 37, baseType: !68, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !751, file: !750, line: 44, baseType: !764, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !750, line: 19, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!281, !748, !74}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !751, file: !750, line: 45, baseType: !20, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !751, file: !750, line: 47, baseType: !770, size: 32, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !750, line: 21, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DISubroutineType(types: !773)
!773 = !{!281, !20, !68}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !751, file: !750, line: 48, baseType: !20, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !751, file: !750, line: 57, baseType: !42, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !751, file: !750, line: 58, baseType: !42, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !751, file: !750, line: 59, baseType: !42, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !751, file: !750, line: 60, baseType: !42, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !751, file: !750, line: 61, baseType: !42, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !751, file: !750, line: 62, baseType: !42, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !751, file: !750, line: 63, baseType: !42, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !751, file: !750, line: 64, baseType: !42, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !751, file: !750, line: 65, baseType: !42, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !751, file: !750, line: 66, baseType: !42, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !751, file: !750, line: 67, baseType: !42, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !751, file: !750, line: 68, baseType: !42, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !751, file: !750, line: 70, baseType: !281, size: 32, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !751, file: !750, line: 71, baseType: !789, size: 64, offset: 480)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !71, line: 68, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 65, size: 64, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !790, file: !71, line: 66, baseType: !281, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !790, file: !71, line: 67, baseType: !44, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !751, file: !750, line: 72, baseType: !87, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !751, file: !750, line: 74, baseType: !355, size: 32, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !751, file: !750, line: 76, baseType: !81, size: 32, offset: 608)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !751, file: !750, line: 77, baseType: !81, size: 32, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !751, file: !750, line: 79, baseType: !81, size: 32, offset: 672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !751, file: !750, line: 80, baseType: !355, size: 32, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !751, file: !750, line: 82, baseType: !405, size: 32, offset: 736)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !751, file: !750, line: 83, baseType: !405, size: 32, offset: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !751, file: !750, line: 84, baseType: !355, size: 32, offset: 800)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !751, file: !750, line: 86, baseType: !47, size: 32, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !751, file: !750, line: 87, baseType: !152, size: 32, offset: 864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !751, file: !750, line: 89, baseType: !68, size: 32, offset: 896)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !751, file: !750, line: 90, baseType: !44, size: 32, offset: 928)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !751, file: !750, line: 91, baseType: !74, size: 32, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !751, file: !750, line: 93, baseType: !44, size: 32, offset: 992)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !751, file: !750, line: 94, baseType: !140, size: 32, offset: 1024)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !751, file: !750, line: 96, baseType: !811, size: 32, offset: 1056)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !92, line: 84, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 71, size: 1408, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !813, file: !92, line: 72, baseType: !90, size: 1216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !813, file: !92, line: 73, baseType: !81, size: 32, offset: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !813, file: !92, line: 74, baseType: !595, size: 32, offset: 1248)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !813, file: !92, line: 75, baseType: !47, size: 32, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !813, file: !92, line: 76, baseType: !189, size: 32, offset: 1312)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !813, file: !92, line: 78, baseType: !38, size: 32, offset: 1344)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !813, file: !92, line: 80, baseType: !42, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !813, file: !92, line: 81, baseType: !42, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !813, file: !92, line: 82, baseType: !42, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !813, file: !92, line: 83, baseType: !42, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !751, file: !750, line: 98, baseType: !82, size: 32, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !697, file: !698, line: 321, baseType: !68, size: 32, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !697, file: !698, line: 323, baseType: !828, size: 416, offset: 608)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !71, line: 71, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !71, line: 78, size: 416, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !829, file: !71, line: 79, baseType: !74, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !829, file: !71, line: 80, baseType: !68, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !829, file: !71, line: 81, baseType: !68, size: 32, offset: 64)
