; ModuleID = 'src/http/ngx_http_parse.c'
source_filename = "src/http/ngx_http_parse.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_request_s = type <{ i32, %struct.ngx_connection_s*, i8**, i8**, i8**, i8**, void (%struct.ngx_http_request_s*)*, void (%struct.ngx_http_request_s*)*, %struct.ngx_http_cache_s*, %struct.ngx_http_upstream_s*, %struct.ngx_array_t*, %struct.ngx_pool_s*, %struct.ngx_buf_s*, %struct.ngx_http_headers_in_t, %struct.ngx_http_headers_out_t, %struct.ngx_http_request_body_t*, i32, i32, i32, i32, i32, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_chain_s*, %struct.ngx_http_request_s*, %struct.ngx_http_request_s*, %struct.ngx_http_postponed_request_s*, %struct.ngx_http_post_subrequest_t*, %struct.ngx_http_posted_request_s*, i32, i32 (%struct.ngx_http_request_s*)*, i32, %struct.ngx_variable_value_t*, i32, i32, i32, i32, i32, %struct.ngx_http_connection_t*, %struct.ngx_http_v2_stream_s*, i8* (%struct.ngx_http_request_s*, %struct.ngx_http_request_s*, i8*, i32)*, %struct.ngx_http_cleanup_s*, i104, i32, i32, i32, [32 x i8], i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32 }>

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "usual", scope: !2, file: !3, line: 13, type: !1931, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1923, globals: !1925)
!3 = !DIFile(filename: "src/http/ngx_http_parse.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5, !1809, !1831, !1842, !1863, !1896}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 107, size: 32, elements: !1781)
!6 = distinct !DISubprogram(name: "ngx_http_parse_request_line", scope: !3, file: !3, line: 104, type: !7, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1773)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !14, !169}
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !10, line: 78, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !12, line: 140, baseType: !13)
!12 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !16, line: 16, baseType: !17)
!16 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !18, line: 364, size: 5376, elements: !19)
!18 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = !{!20, !23, !385, !387, !388, !389, !390, !395, !396, !629, !1325, !1326, !1327, !1328, !1367, !1397, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1442, !1453, !1460, !1461, !1463, !1464, !1477, !1478, !1479, !1480, !1481, !1482, !1669, !1673, !1678, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !17, file: !18, line: 365, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 191, baseType: !22)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !17, file: !18, line: 367, baseType: !24, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !26, line: 26, baseType: !27)
!26 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !28, line: 121, size: 896, elements: !29)
!28 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !{!30, !32, !145, !146, !149, !156, !158, !252, !257, !317, !318, !319, !356, !357, !358, !359, !360, !361, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !27, file: !28, line: 122, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !27, file: !28, line: 123, baseType: !33, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !26, line: 24, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !36, line: 30, size: 384, elements: !37)
!36 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !65, !68, !124, !137}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !35, file: !36, line: 31, baseType: !31, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !35, file: !36, line: 33, baseType: !22, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !35, file: !36, line: 35, baseType: !22, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !35, file: !36, line: 38, baseType: !22, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !35, file: !36, line: 44, baseType: !22, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !35, file: !36, line: 46, baseType: !22, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !35, file: !36, line: 49, baseType: !22, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !35, file: !36, line: 51, baseType: !22, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !35, file: !36, line: 54, baseType: !22, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !35, file: !36, line: 56, baseType: !22, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !35, file: !36, line: 57, baseType: !22, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !35, file: !36, line: 59, baseType: !22, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !35, file: !36, line: 60, baseType: !22, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !35, file: !36, line: 62, baseType: !22, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !35, file: !36, line: 64, baseType: !22, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !35, file: !36, line: 67, baseType: !22, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !35, file: !36, line: 69, baseType: !22, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !35, file: !36, line: 71, baseType: !22, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !35, file: !36, line: 74, baseType: !22, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !35, file: !36, line: 75, baseType: !22, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !35, file: !36, line: 77, baseType: !22, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !35, file: !36, line: 107, baseType: !22, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !35, file: !36, line: 110, baseType: !61, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !26, line: 31, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !33}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !35, file: !36, line: 117, baseType: !66, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !10, line: 79, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 125, baseType: !22)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !35, file: !36, line: 119, baseType: !69, size: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !26, line: 20, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !72, line: 50, size: 320, elements: !73)
!72 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = !{!74, !75, !101, !105, !108, !113, !114, !119, !120, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !71, file: !72, line: 51, baseType: !66, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !71, file: !72, line: 52, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !26, line: 21, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !79, line: 89, size: 160, elements: !80)
!79 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = !{!81, !84, !96, !100}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !78, file: !79, line: 90, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !83, line: 16, baseType: !13)
!83 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !79, line: 91, baseType: !85, size: 64, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !86, line: 19, baseType: !87)
!86 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 16, size: 64, elements: !88)
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !86, line: 17, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 120, baseType: !22)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !86, line: 18, baseType: !92, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !94, line: 64, baseType: !95)
!94 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !78, file: !79, line: 93, baseType: !97, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !76, !69}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !79, line: 94, baseType: !31, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !71, file: !72, line: 54, baseType: !102, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !103, line: 98, baseType: !104)
!103 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!104 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !71, file: !72, line: 56, baseType: !106, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !12, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !71, file: !72, line: 58, baseType: !109, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !72, line: 45, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DISubroutineType(types: !112)
!112 = !{!92, !69, !92, !90}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !72, line: 59, baseType: !31, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !71, file: !72, line: 61, baseType: !115, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !72, line: 46, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !69, !66, !92, !90}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !71, file: !72, line: 62, baseType: !31, size: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !71, file: !72, line: 70, baseType: !121, size: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !72, line: 72, baseType: !69, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !35, file: !36, line: 121, baseType: !125, size: 160, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !126, line: 20, baseType: !127)
!126 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !126, line: 22, size: 160, elements: !128)
!128 = !{!129, !131, !133, !134, !135, !136}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !127, file: !126, line: 23, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !126, line: 16, baseType: !66)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !127, file: !126, line: 24, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !127, file: !126, line: 25, baseType: !132, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !127, file: !126, line: 26, baseType: !132, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !127, file: !126, line: 27, baseType: !93, size: 8, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !126, line: 28, baseType: !93, size: 8, offset: 136)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !35, file: !36, line: 124, baseType: !138, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !139, line: 16, baseType: !140)
!139 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !139, line: 18, size: 64, elements: !141)
!141 = !{!142, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !139, line: 19, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !139, line: 20, baseType: !143, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !27, file: !28, line: 124, baseType: !33, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !27, file: !28, line: 126, baseType: !147, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !148, line: 17, baseType: !13)
!148 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!149 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !27, file: !28, line: 128, baseType: !150, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !151, line: 19, baseType: !152)
!151 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !24, !92, !90}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !12, line: 135, baseType: !13)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !28, line: 129, baseType: !157, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !151, line: 22, baseType: !152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !27, file: !28, line: 130, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !151, line: 20, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{!155, !24, !163, !176}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !26, line: 19, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !166, line: 59, size: 64, elements: !167)
!166 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = !{!168, !251}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !165, file: !166, line: 60, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !166, line: 18, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !166, line: 20, size: 352, elements: !172)
!172 = !{!173, !174, !175, !177, !178, !179, !180, !182, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !171, file: !166, line: 21, baseType: !92, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !171, file: !166, line: 22, baseType: !92, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !171, file: !166, line: 23, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !12, line: 222, baseType: !13)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !171, file: !166, line: 24, baseType: !176, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !171, file: !166, line: 26, baseType: !92, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !171, file: !166, line: 27, baseType: !92, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !171, file: !166, line: 28, baseType: !181, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !166, line: 16, baseType: !31)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !171, file: !166, line: 29, baseType: !183, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !26, line: 23, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !186, line: 16, size: 1216, elements: !187)
!186 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!187 = !{!188, !189, !190, !233, !234, !235, !236, !237}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !185, file: !186, line: 17, baseType: !82, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !186, line: 18, baseType: !85, size: 64, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !185, file: !186, line: 19, baseType: !191, size: 960, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !83, line: 17, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !193, line: 4, size: 960, elements: !194)
!193 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!194 = !{!195, !197, !198, !200, !201, !203, !204, !206, !208, !210, !211, !212, !213, !214, !215, !217, !218, !220, !221, !226, !227, !228}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !192, file: !193, line: 6, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !12, line: 232, baseType: !22)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !192, file: !193, line: 7, baseType: !196, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !192, file: !193, line: 8, baseType: !199, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !12, line: 227, baseType: !22)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !192, file: !193, line: 9, baseType: !199, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !192, file: !193, line: 10, baseType: !202, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !12, line: 217, baseType: !22)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !192, file: !193, line: 11, baseType: !202, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !192, file: !193, line: 13, baseType: !205, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !12, line: 212, baseType: !22)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !192, file: !193, line: 14, baseType: !207, size: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !12, line: 304, baseType: !22)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !192, file: !193, line: 15, baseType: !209, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !12, line: 309, baseType: !22)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !192, file: !193, line: 16, baseType: !22, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !192, file: !193, line: 17, baseType: !196, size: 32, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !192, file: !193, line: 18, baseType: !196, size: 32, offset: 352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !192, file: !193, line: 19, baseType: !176, size: 32, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !192, file: !193, line: 20, baseType: !176, size: 32, offset: 416)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !192, file: !193, line: 21, baseType: !216, size: 32, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !12, line: 237, baseType: !107)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !192, file: !193, line: 22, baseType: !216, size: 32, offset: 480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !192, file: !193, line: 23, baseType: !219, size: 32, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !12, line: 242, baseType: !13)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !192, file: !193, line: 24, baseType: !219, size: 32, offset: 544)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !192, file: !193, line: 26, baseType: !222, size: 64, offset: 576)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !12, line: 288, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !222, file: !12, line: 288, baseType: !106, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !222, file: !12, line: 288, baseType: !107, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !192, file: !193, line: 27, baseType: !222, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !192, file: !193, line: 28, baseType: !222, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !192, file: !193, line: 29, baseType: !229, size: 192, offset: 768)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 192, elements: !231)
!230 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!231 = !{!232}
!232 = !DISubrange(count: 3)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !185, file: !186, line: 21, baseType: !176, size: 32, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !185, file: !186, line: 22, baseType: !176, size: 32, offset: 1120)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !185, file: !186, line: 24, baseType: !69, size: 32, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !185, file: !186, line: 37, baseType: !22, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !185, file: !186, line: 38, baseType: !22, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !171, file: !166, line: 30, baseType: !169, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !171, file: !166, line: 34, baseType: !22, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !171, file: !166, line: 40, baseType: !22, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !171, file: !166, line: 43, baseType: !22, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !171, file: !166, line: 45, baseType: !22, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !171, file: !166, line: 46, baseType: !22, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !171, file: !166, line: 47, baseType: !22, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !171, file: !166, line: 48, baseType: !22, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !171, file: !166, line: 49, baseType: !22, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !171, file: !166, line: 50, baseType: !22, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !171, file: !166, line: 52, baseType: !22, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !171, file: !166, line: 53, baseType: !22, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !171, file: !166, line: 55, baseType: !13, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !166, line: 61, baseType: !163, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !27, file: !28, line: 131, baseType: !253, size: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !151, line: 23, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!163, !24, !163, !176}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !27, file: !28, line: 133, baseType: !258, size: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !28, line: 16, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !28, line: 18, size: 960, elements: !261)
!261 = !{!262, !263, !275, !277, !278, !279, !280, !281, !282, !283, !288, !289, !290, !291, !292, !293, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !260, file: !28, line: 19, baseType: !147, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !260, file: !28, line: 21, baseType: !264, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !266, line: 297, size: 128, elements: !267)
!266 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!267 = !{!268, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !265, file: !266, line: 298, baseType: !269, size: 16)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !12, line: 409, baseType: !270)
!270 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !265, file: !266, line: 299, baseType: !272, size: 112, offset: 16)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 112, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 14)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !260, file: !28, line: 22, baseType: !276, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !12, line: 404, baseType: !22)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !260, file: !28, line: 23, baseType: !90, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !260, file: !28, line: 24, baseType: !85, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !28, line: 26, baseType: !13, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !260, file: !28, line: 28, baseType: !13, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !260, file: !28, line: 29, baseType: !13, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !260, file: !28, line: 30, baseType: !13, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !260, file: !28, line: 38, baseType: !284, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !26, line: 32, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !24}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !260, file: !28, line: 40, baseType: !31, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !260, file: !28, line: 42, baseType: !70, size: 320, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !260, file: !28, line: 43, baseType: !69, size: 32, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !260, file: !28, line: 45, baseType: !90, size: 32, offset: 736)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !260, file: !28, line: 47, baseType: !90, size: 32, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !260, file: !28, line: 49, baseType: !294, size: 32, offset: 800)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !295, line: 16, baseType: !130)
!295 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !260, file: !28, line: 51, baseType: !258, size: 32, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !260, file: !28, line: 52, baseType: !24, size: 32, offset: 864)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !260, file: !28, line: 54, baseType: !66, size: 32, offset: 896)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !260, file: !28, line: 56, baseType: !22, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !260, file: !28, line: 57, baseType: !22, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !260, file: !28, line: 58, baseType: !22, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !260, file: !28, line: 60, baseType: !22, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !260, file: !28, line: 61, baseType: !22, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !260, file: !28, line: 62, baseType: !22, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !260, file: !28, line: 63, baseType: !22, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !260, file: !28, line: 64, baseType: !22, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !260, file: !28, line: 65, baseType: !22, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !260, file: !28, line: 66, baseType: !22, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !260, file: !28, line: 67, baseType: !22, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !260, file: !28, line: 70, baseType: !22, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !260, file: !28, line: 72, baseType: !22, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !260, file: !28, line: 73, baseType: !22, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !260, file: !28, line: 74, baseType: !22, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !260, file: !28, line: 76, baseType: !22, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !260, file: !28, line: 77, baseType: !22, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !260, file: !28, line: 78, baseType: !22, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !27, file: !28, line: 135, baseType: !176, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !27, file: !28, line: 137, baseType: !69, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !27, file: !28, line: 139, baseType: !320, size: 32, offset: 352)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !26, line: 18, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !323, line: 57, size: 320, elements: !324)
!323 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!324 = !{!325, !333, !334, !335, !336, !343, !355}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !322, file: !323, line: 58, baseType: !326, size: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !323, line: 54, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 49, size: 128, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !327, file: !323, line: 50, baseType: !92, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !327, file: !323, line: 51, baseType: !92, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !323, line: 52, baseType: !320, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !327, file: !323, line: 53, baseType: !66, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !322, file: !323, line: 59, baseType: !90, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !322, file: !323, line: 60, baseType: !320, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !322, file: !323, line: 61, baseType: !163, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !322, file: !323, line: 62, baseType: !337, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !323, line: 41, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !323, line: 43, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !323, line: 44, baseType: !337, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !339, file: !323, line: 45, baseType: !31, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !322, file: !323, line: 63, baseType: !344, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !323, line: 32, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !323, line: 34, size: 96, elements: !347)
!347 = !{!348, !353, !354}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !346, file: !323, line: 35, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !323, line: 30, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !31}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !323, line: 36, baseType: !31, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !323, line: 37, baseType: !344, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !322, file: !323, line: 64, baseType: !69, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 141, baseType: !13, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !27, file: !28, line: 143, baseType: !264, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !27, file: !28, line: 144, baseType: !276, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !27, file: !28, line: 145, baseType: !85, size: 64, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !27, file: !28, line: 147, baseType: !85, size: 64, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !27, file: !28, line: 148, baseType: !362, size: 16, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !363, line: 12, baseType: !364)
!363 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 186, baseType: !270)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !27, file: !28, line: 154, baseType: !264, size: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !27, file: !28, line: 155, baseType: !276, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !27, file: !28, line: 157, baseType: !169, size: 32, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !27, file: !28, line: 159, baseType: !138, size: 64, offset: 736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !27, file: !28, line: 161, baseType: !102, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !27, file: !28, line: 163, baseType: !66, size: 32, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !27, file: !28, line: 165, baseType: !22, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !27, file: !28, line: 167, baseType: !22, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !27, file: !28, line: 169, baseType: !22, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !27, file: !28, line: 170, baseType: !22, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !27, file: !28, line: 171, baseType: !22, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !27, file: !28, line: 173, baseType: !22, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !27, file: !28, line: 174, baseType: !22, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !27, file: !28, line: 175, baseType: !22, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !27, file: !28, line: 176, baseType: !22, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !27, file: !28, line: 178, baseType: !22, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !27, file: !28, line: 179, baseType: !22, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !27, file: !28, line: 180, baseType: !22, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !27, file: !28, line: 181, baseType: !22, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !27, file: !28, line: 183, baseType: !22, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !17, file: !18, line: 369, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !17, file: !18, line: 370, baseType: !386, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !17, file: !18, line: 371, baseType: !386, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !17, file: !18, line: 372, baseType: !386, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !17, file: !18, line: 374, baseType: !391, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !18, line: 361, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !14}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !17, file: !18, line: 375, baseType: !391, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !17, file: !18, line: 378, baseType: !397, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !16, line: 18, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !400, line: 65, size: 3008, elements: !401)
!400 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!401 = !{!402, !403, !413, !414, !418, !419, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !587, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !399, file: !400, line: 66, baseType: !184, size: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !399, file: !400, line: 67, baseType: !404, size: 160, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !405, line: 22, baseType: !406)
!405 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 16, size: 160, elements: !407)
!407 = !{!408, !409, !410, !411, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !406, file: !405, line: 17, baseType: !31, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !406, file: !405, line: 18, baseType: !66, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !405, line: 19, baseType: !90, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !406, file: !405, line: 20, baseType: !66, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !406, file: !405, line: 21, baseType: !320, size: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !399, file: !400, line: 68, baseType: !21, size: 32, offset: 1376)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !399, file: !400, line: 69, baseType: !415, size: 128, offset: 1408)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !399, file: !400, line: 70, baseType: !415, size: 128, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !399, file: !400, line: 72, baseType: !420, size: 32, offset: 1664)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !83, line: 18, baseType: !199)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !399, file: !400, line: 73, baseType: !106, size: 32, offset: 1696)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !399, file: !400, line: 74, baseType: !106, size: 32, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !399, file: !400, line: 75, baseType: !106, size: 32, offset: 1760)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !399, file: !400, line: 76, baseType: !106, size: 32, offset: 1792)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !399, file: !400, line: 77, baseType: !106, size: 32, offset: 1824)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !399, file: !400, line: 79, baseType: !85, size: 64, offset: 1856)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !399, file: !400, line: 80, baseType: !85, size: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !399, file: !400, line: 81, baseType: !415, size: 128, offset: 1984)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !399, file: !400, line: 83, baseType: !90, size: 32, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !399, file: !400, line: 84, baseType: !90, size: 32, offset: 2144)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !399, file: !400, line: 85, baseType: !176, size: 32, offset: 2176)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !399, file: !400, line: 86, baseType: !176, size: 32, offset: 2208)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !399, file: !400, line: 88, baseType: !66, size: 32, offset: 2240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !399, file: !400, line: 89, baseType: !66, size: 32, offset: 2272)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !399, file: !400, line: 90, baseType: !66, size: 32, offset: 2304)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !399, file: !400, line: 91, baseType: !66, size: 32, offset: 2336)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !399, file: !400, line: 93, baseType: !169, size: 32, offset: 2368)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !399, file: !400, line: 95, baseType: !439, size: 32, offset: 2400)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !16, line: 19, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !400, line: 157, size: 544, elements: !442)
!442 = !{!443, !468, !529, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !586}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !441, file: !400, line: 158, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !400, line: 154, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 145, size: 480, elements: !447)
!447 = !{!448, !459, !460, !461, !464, !465, !466, !467}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !446, file: !400, line: 146, baseType: !449, size: 96)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !126, line: 32, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !126, line: 37, size: 96, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !450, file: !126, line: 38, baseType: !132, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !450, file: !126, line: 39, baseType: !132, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !450, file: !126, line: 40, baseType: !455, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !126, line: 34, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !132, !132, !132}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !446, file: !400, line: 147, baseType: !125, size: 160, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !446, file: !400, line: 148, baseType: !138, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !446, file: !400, line: 149, baseType: !462, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !103, line: 106, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !446, file: !400, line: 150, baseType: !462, size: 32, offset: 352)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !446, file: !400, line: 151, baseType: !176, size: 32, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !446, file: !400, line: 152, baseType: !66, size: 32, offset: 416)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !446, file: !400, line: 153, baseType: !66, size: 32, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !441, file: !400, line: 159, baseType: !469, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !471, line: 59, baseType: !472)
!471 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 34, size: 800, elements: !473)
!473 = !{!474, !481, !482, !483, !491, !492, !493, !502, !503, !504, !505, !524, !525, !526, !527, !528}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !472, file: !471, line: 35, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !476, line: 21, baseType: !477)
!476 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 16, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !477, file: !476, line: 17, baseType: !462, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !477, file: !476, line: 19, baseType: !462, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !472, file: !471, line: 37, baseType: !90, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !472, file: !471, line: 38, baseType: !90, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !472, file: !471, line: 40, baseType: !484, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !471, line: 16, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !471, line: 18, size: 96, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !486, file: !471, line: 19, baseType: !67, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !471, line: 20, baseType: !484, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !486, file: !471, line: 21, baseType: !67, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !472, file: !471, line: 41, baseType: !484, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !472, file: !471, line: 42, baseType: !485, size: 96, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !472, file: !471, line: 44, baseType: !494, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !471, line: 31, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 25, size: 128, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !496, file: !471, line: 26, baseType: !66, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !496, file: !471, line: 27, baseType: !66, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !496, file: !471, line: 29, baseType: !66, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !496, file: !471, line: 30, baseType: !66, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !472, file: !471, line: 45, baseType: !66, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !472, file: !471, line: 47, baseType: !92, size: 32, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !472, file: !471, line: 48, baseType: !92, size: 32, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !472, file: !471, line: 50, baseType: !506, size: 256, offset: 416)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !476, line: 37, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 24, size: 256, elements: !508)
!508 = !{!509, !511, !512, !513, !523}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !476, line: 26, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !507, file: !476, line: 28, baseType: !510, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !507, file: !476, line: 29, baseType: !66, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !507, file: !476, line: 30, baseType: !514, size: 128, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !515, line: 19, baseType: !516)
!515 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !515, line: 17, size: 128, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !516, file: !515, line: 18, baseType: !519, size: 128)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 128, elements: !521)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !13)
!521 = !{!522}
!522 = !DISubrange(count: 4)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !507, file: !476, line: 36, baseType: !66, size: 32, offset: 224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !472, file: !471, line: 52, baseType: !92, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !472, file: !471, line: 53, baseType: !93, size: 8, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !472, file: !471, line: 55, baseType: !22, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !472, file: !471, line: 57, baseType: !31, size: 32, offset: 736)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !472, file: !471, line: 58, baseType: !31, size: 32, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !441, file: !400, line: 161, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !186, line: 62, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 50, size: 384, elements: !533)
!533 = !{!534, !535, !536, !538, !543, !545, !547, !548, !549}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !532, file: !186, line: 51, baseType: !85, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !532, file: !186, line: 52, baseType: !90, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !532, file: !186, line: 53, baseType: !537, size: 96, offset: 96)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, elements: !231)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !532, file: !186, line: 55, baseType: !539, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !186, line: 45, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{!294, !31}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !532, file: !186, line: 56, baseType: !544, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !186, line: 46, baseType: !540)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !532, file: !186, line: 57, baseType: !546, size: 32, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !186, line: 47, baseType: !350)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !532, file: !186, line: 58, baseType: !31, size: 32, offset: 288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !532, file: !186, line: 60, baseType: !92, size: 32, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !532, file: !186, line: 61, baseType: !66, size: 32, offset: 352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !441, file: !400, line: 163, baseType: !176, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !441, file: !400, line: 164, baseType: !90, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !441, file: !400, line: 166, baseType: !106, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !441, file: !400, line: 168, baseType: !106, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !441, file: !400, line: 170, baseType: !66, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !441, file: !400, line: 171, baseType: !66, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !441, file: !400, line: 172, baseType: !294, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !441, file: !400, line: 173, baseType: !294, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !441, file: !400, line: 174, baseType: !294, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !441, file: !400, line: 176, baseType: !66, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !441, file: !400, line: 177, baseType: !294, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !441, file: !400, line: 178, baseType: !294, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !441, file: !400, line: 180, baseType: !563, size: 32, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !565, line: 25, baseType: !566)
!565 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !565, line: 29, size: 320, elements: !567)
!567 = !{!568, !569, !579, !584, !585}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !565, line: 30, baseType: !31, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !566, file: !565, line: 31, baseType: !570, size: 192, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !571, line: 22, baseType: !572)
!571 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 16, size: 192, elements: !573)
!573 = !{!574, !575, !576, !577, !578}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !572, file: !571, line: 17, baseType: !92, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !572, file: !571, line: 18, baseType: !90, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !571, line: 19, baseType: !85, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !572, file: !571, line: 20, baseType: !69, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !572, file: !571, line: 21, baseType: !66, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !566, file: !565, line: 32, baseType: !580, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !565, line: 27, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!9, !563, !31}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !566, file: !565, line: 33, baseType: !31, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !566, file: !565, line: 34, baseType: !66, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !441, file: !400, line: 182, baseType: !66, size: 32, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !399, file: !400, line: 96, baseType: !588, size: 32, offset: 2432)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !400, line: 62, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 39, size: 576, elements: !591)
!591 = !{!592, !593, !594, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !590, file: !400, line: 40, baseType: !125, size: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !590, file: !400, line: 41, baseType: !138, size: 64, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !590, file: !400, line: 43, baseType: !595, size: 96, offset: 224)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 96, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 12)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !590, file: !400, line: 46, baseType: !22, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !590, file: !400, line: 47, baseType: !22, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !590, file: !400, line: 48, baseType: !22, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !590, file: !400, line: 49, baseType: !22, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !590, file: !400, line: 50, baseType: !22, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !590, file: !400, line: 51, baseType: !22, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !590, file: !400, line: 52, baseType: !22, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !590, file: !400, line: 53, baseType: !22, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !590, file: !400, line: 56, baseType: !420, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !590, file: !400, line: 57, baseType: !106, size: 32, offset: 416)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !590, file: !400, line: 58, baseType: !106, size: 32, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !590, file: !400, line: 59, baseType: !90, size: 32, offset: 480)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !590, file: !400, line: 60, baseType: !176, size: 32, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !590, file: !400, line: 61, baseType: !294, size: 32, offset: 544)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !399, file: !400, line: 102, baseType: !294, size: 32, offset: 2464)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !399, file: !400, line: 103, baseType: !294, size: 32, offset: 2496)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !399, file: !400, line: 104, baseType: !294, size: 32, offset: 2528)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !399, file: !400, line: 105, baseType: !294, size: 32, offset: 2560)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !399, file: !400, line: 107, baseType: !34, size: 384, offset: 2592)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !399, file: !400, line: 109, baseType: !22, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !399, file: !400, line: 110, baseType: !22, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !399, file: !400, line: 112, baseType: !22, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !399, file: !400, line: 113, baseType: !22, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !399, file: !400, line: 114, baseType: !22, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !399, file: !400, line: 115, baseType: !22, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !399, file: !400, line: 116, baseType: !22, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !399, file: !400, line: 117, baseType: !22, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !399, file: !400, line: 118, baseType: !22, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !399, file: !400, line: 119, baseType: !22, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !399, file: !400, line: 121, baseType: !22, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !399, file: !400, line: 122, baseType: !22, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !17, file: !18, line: 381, baseType: !630, size: 32, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !16, line: 17, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !633, line: 313, size: 4096, elements: !634)
!633 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!634 = !{!635, !640, !641, !682, !761, !762, !784, !793, !1052, !1053, !1054, !1092, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1270, !1274, !1275, !1279, !1280, !1281, !1282, !1283, !1287, !1291, !1295, !1296, !1308, !1309, !1310, !1311, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !632, file: !633, line: 314, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !633, line: 309, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !14, !630}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !632, file: !633, line: 315, baseType: !636, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !632, file: !633, line: 317, baseType: !642, size: 480, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !643, line: 22, baseType: !644)
!643 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !643, line: 36, size: 480, elements: !645)
!645 = !{!646, !647, !648, !649, !651, !652, !653, !659, !664, !666, !667, !676, !677, !678, !679, !680, !681}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !644, file: !643, line: 37, baseType: !24, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !644, file: !643, line: 39, baseType: !264, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !644, file: !643, line: 40, baseType: !276, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !643, line: 41, baseType: !650, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !644, file: !643, line: 43, baseType: !66, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !644, file: !643, line: 44, baseType: !294, size: 32, offset: 160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !644, file: !643, line: 46, baseType: !654, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !643, line: 24, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DISubroutineType(types: !657)
!657 = !{!9, !658, !31}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !644, file: !643, line: 47, baseType: !660, size: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !643, line: 26, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !658, !31, !66}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !644, file: !643, line: 48, baseType: !665, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !643, line: 28, baseType: !661)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !643, line: 49, baseType: !31, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !644, file: !643, line: 56, baseType: !668, size: 32, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !670, line: 78, baseType: !671)
!670 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 74, size: 128, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !671, file: !670, line: 75, baseType: !264, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !671, file: !670, line: 76, baseType: !276, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !670, line: 77, baseType: !85, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !643, line: 58, baseType: !13, size: 32, offset: 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !644, file: !643, line: 59, baseType: !13, size: 32, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !644, file: !643, line: 61, baseType: !69, size: 32, offset: 416)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !644, file: !643, line: 63, baseType: !22, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !644, file: !643, line: 64, baseType: !22, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !644, file: !643, line: 67, baseType: !22, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !632, file: !633, line: 319, baseType: !683, size: 32, offset: 544)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !685, line: 17, baseType: !686)
!685 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !685, line: 25, size: 1120, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !694, !695, !696, !697, !698, !703, !704, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !760}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !686, file: !685, line: 26, baseType: !24, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !686, file: !685, line: 27, baseType: !24, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !686, file: !685, line: 29, baseType: !163, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !686, file: !685, line: 30, baseType: !163, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !686, file: !685, line: 31, baseType: !693, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !686, file: !685, line: 33, baseType: !163, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !686, file: !685, line: 35, baseType: !163, size: 32, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !686, file: !685, line: 36, baseType: !163, size: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !686, file: !685, line: 37, baseType: !163, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !686, file: !685, line: 44, baseType: !699, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !685, line: 19, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DISubroutineType(types: !702)
!702 = !{!9, !683, !169}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !686, file: !685, line: 45, baseType: !31, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !686, file: !685, line: 47, baseType: !705, size: 32, offset: 352)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !685, line: 21, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DISubroutineType(types: !708)
!708 = !{!9, !31, !163}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !686, file: !685, line: 48, baseType: !31, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !686, file: !685, line: 57, baseType: !22, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !686, file: !685, line: 58, baseType: !22, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !686, file: !685, line: 59, baseType: !22, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !686, file: !685, line: 60, baseType: !22, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !686, file: !685, line: 61, baseType: !22, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !686, file: !685, line: 62, baseType: !22, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !686, file: !685, line: 63, baseType: !22, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !686, file: !685, line: 64, baseType: !22, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !686, file: !685, line: 65, baseType: !22, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !686, file: !685, line: 66, baseType: !22, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !686, file: !685, line: 67, baseType: !22, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !686, file: !685, line: 68, baseType: !22, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !686, file: !685, line: 70, baseType: !9, size: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !686, file: !685, line: 71, baseType: !724, size: 64, offset: 480)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !166, line: 68, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 65, size: 64, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !725, file: !166, line: 66, baseType: !9, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !166, line: 67, baseType: !90, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !686, file: !685, line: 72, baseType: !181, size: 32, offset: 544)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !686, file: !685, line: 74, baseType: !155, size: 32, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !686, file: !685, line: 76, baseType: !176, size: 32, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !686, file: !685, line: 77, baseType: !176, size: 32, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !686, file: !685, line: 79, baseType: !176, size: 32, offset: 672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !686, file: !685, line: 80, baseType: !155, size: 32, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !686, file: !685, line: 82, baseType: !294, size: 32, offset: 736)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !686, file: !685, line: 83, baseType: !294, size: 32, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !686, file: !685, line: 84, baseType: !155, size: 32, offset: 800)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !686, file: !685, line: 86, baseType: !320, size: 32, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !686, file: !685, line: 87, baseType: !69, size: 32, offset: 864)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !686, file: !685, line: 89, baseType: !163, size: 32, offset: 896)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !686, file: !685, line: 90, baseType: !90, size: 32, offset: 928)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !686, file: !685, line: 91, baseType: !169, size: 32, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !686, file: !685, line: 93, baseType: !90, size: 32, offset: 992)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !686, file: !685, line: 94, baseType: !106, size: 32, offset: 1024)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !686, file: !685, line: 96, baseType: !746, size: 32, offset: 1056)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !186, line: 84, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 71, size: 1408, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !748, file: !186, line: 72, baseType: !184, size: 1216)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !748, file: !186, line: 73, baseType: !176, size: 32, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !748, file: !186, line: 74, baseType: !530, size: 32, offset: 1248)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !748, file: !186, line: 75, baseType: !320, size: 32, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !748, file: !186, line: 76, baseType: !121, size: 32, offset: 1312)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !748, file: !186, line: 78, baseType: !66, size: 32, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !748, file: !186, line: 80, baseType: !22, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !748, file: !186, line: 81, baseType: !22, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !748, file: !186, line: 82, baseType: !22, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !748, file: !186, line: 83, baseType: !22, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !686, file: !685, line: 98, baseType: !13, size: 32, offset: 1088)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !632, file: !633, line: 321, baseType: !163, size: 32, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !632, file: !633, line: 323, baseType: !763, size: 416, offset: 608)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !166, line: 71, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !166, line: 78, size: 416, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !783}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !764, file: !166, line: 79, baseType: !169, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !764, file: !166, line: 80, baseType: !163, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !764, file: !166, line: 81, baseType: !163, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !764, file: !166, line: 82, baseType: !163, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !764, file: !166, line: 84, baseType: !22, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !764, file: !166, line: 85, baseType: !22, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !764, file: !166, line: 86, baseType: !22, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !764, file: !166, line: 87, baseType: !22, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !764, file: !166, line: 88, baseType: !22, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !764, file: !166, line: 89, baseType: !22, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !764, file: !166, line: 104, baseType: !176, size: 32, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !764, file: !166, line: 106, baseType: !320, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !764, file: !166, line: 107, baseType: !9, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !764, file: !166, line: 108, baseType: !724, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !764, file: !166, line: 109, baseType: !181, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !764, file: !166, line: 111, baseType: !782, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !166, line: 73, baseType: !706)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !764, file: !166, line: 112, baseType: !31, size: 32, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !632, file: !633, line: 324, baseType: !785, size: 160, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !166, line: 122, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 116, size: 160, elements: !787)
!787 = !{!788, !789, !790, !791, !792}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !786, file: !166, line: 117, baseType: !163, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !786, file: !166, line: 118, baseType: !693, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !786, file: !166, line: 119, baseType: !24, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !786, file: !166, line: 120, baseType: !320, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !786, file: !166, line: 121, baseType: !176, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !632, file: !633, line: 326, baseType: !794, size: 32, offset: 1184)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_conf_t", file: !633, line: 238, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 147, size: 1760, elements: !797)
!797 = !{!798, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !983, !984, !985, !986, !987, !988, !989, !990, !991, !1010, !1011, !1012, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !796, file: !633, line: 148, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !633, line: 77, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !633, line: 119, size: 416, elements: !802)
!802 = !{!803, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !801, file: !633, line: 120, baseType: !804, size: 96)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !633, line: 89, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 85, size: 96, elements: !806)
!806 = !{!807, !948, !953}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !805, file: !633, line: 86, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !633, line: 79, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!9, !812, !799}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !26, line: 16, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !79, line: 116, size: 384, elements: !815)
!815 = !{!816, !817, !819, !930, !931, !932, !941, !942, !943, !944, !945, !947}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !79, line: 117, baseType: !121, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !814, file: !79, line: 118, baseType: !818, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !814, file: !79, line: 120, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !26, line: 17, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !565, line: 38, size: 2496, elements: !823)
!823 = !{!824, !827, !828, !829, !830, !831, !833, !834, !835, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !822, file: !565, line: 39, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !822, file: !565, line: 40, baseType: !320, size: 32, offset: 32)
