; ModuleID = 'src/http/ngx_http_copy_filter_module.c'
source_filename = "src/http/ngx_http_copy_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_copy_filter_module_ctx", scope: !2, file: !3, line: 52, type: !1784, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !164)
!3 = !DIFile(filename: "src/http/ngx_http_copy_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !9, !35}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !8, line: 16, baseType: !6)
!8 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !8, line: 73, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !6, !18}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !14, line: 78, baseType: !15)
!14 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !16, line: 140, baseType: !17)
!16 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !20, line: 19, baseType: !21)
!20 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !8, line: 59, size: 64, elements: !22)
!22 = !{!23, !163}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !21, file: !8, line: 60, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !8, line: 18, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !8, line: 20, size: 352, elements: !27)
!27 = !{!28, !33, !34, !36, !37, !38, !39, !40, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !26, file: !8, line: 21, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !31, line: 64, baseType: !32)
!31 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !26, file: !8, line: 22, baseType: !29, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !26, file: !8, line: 23, baseType: !35, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !16, line: 222, baseType: !17)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !26, file: !8, line: 24, baseType: !35, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !26, file: !8, line: 26, baseType: !29, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !26, file: !8, line: 27, baseType: !29, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !26, file: !8, line: 28, baseType: !7, size: 32, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !26, file: !8, line: 29, baseType: !41, size: 32, offset: 224)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !20, line: 23, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !44, line: 16, size: 1216, elements: !45)
!44 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !{!46, !49, !58, !103, !104, !105, !148, !149}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !43, file: !44, line: 17, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !48, line: 16, baseType: !17)
!48 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !44, line: 18, baseType: !50, size: 64, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !51, line: 19, baseType: !52)
!51 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 16, size: 64, elements: !53)
!53 = !{!54, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, file: !51, line: 17, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 120, baseType: !56)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !51, line: 18, baseType: !29, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !43, file: !44, line: 19, baseType: !59, size: 960, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !48, line: 17, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !61, line: 4, size: 960, elements: !62)
!61 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !{!63, !65, !66, !68, !69, !71, !72, !74, !76, !78, !79, !80, !81, !82, !83, !86, !87, !89, !90, !96, !97, !98}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !60, file: !61, line: 6, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !16, line: 232, baseType: !56)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !60, file: !61, line: 7, baseType: !64, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !60, file: !61, line: 8, baseType: !67, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !16, line: 227, baseType: !56)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !60, file: !61, line: 9, baseType: !67, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !60, file: !61, line: 10, baseType: !70, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !16, line: 217, baseType: !56)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !60, file: !61, line: 11, baseType: !70, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !60, file: !61, line: 13, baseType: !73, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !16, line: 212, baseType: !56)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !60, file: !61, line: 14, baseType: !75, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !16, line: 304, baseType: !56)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !60, file: !61, line: 15, baseType: !77, size: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !16, line: 309, baseType: !56)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !60, file: !61, line: 16, baseType: !56, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !60, file: !61, line: 17, baseType: !64, size: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !60, file: !61, line: 18, baseType: !64, size: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !60, file: !61, line: 19, baseType: !35, size: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !60, file: !61, line: 20, baseType: !35, size: 32, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !60, file: !61, line: 21, baseType: !84, size: 32, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !16, line: 237, baseType: !85)
!85 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !60, file: !61, line: 22, baseType: !84, size: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !60, file: !61, line: 23, baseType: !88, size: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !16, line: 242, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !60, file: !61, line: 24, baseType: !88, size: 32, offset: 544)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !60, file: !61, line: 26, baseType: !91, size: 64, offset: 576)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !16, line: 288, size: 64, elements: !92)
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !91, file: !16, line: 288, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !16, line: 75, baseType: !85)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !91, file: !16, line: 288, baseType: !85, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !60, file: !61, line: 27, baseType: !91, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !60, file: !61, line: 28, baseType: !91, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !60, file: !61, line: 29, baseType: !99, size: 192, offset: 768)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 192, elements: !101)
!100 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !43, file: !44, line: 21, baseType: !35, size: 32, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !43, file: !44, line: 22, baseType: !35, size: 32, offset: 1120)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !43, file: !44, line: 24, baseType: !106, size: 32, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !20, line: 20, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !109, line: 50, size: 320, elements: !110)
!109 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!110 = !{!111, !114, !127, !131, !132, !137, !138, !143, !144, !147}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !108, file: !109, line: 51, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !14, line: 79, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 125, baseType: !56)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !108, file: !109, line: 52, baseType: !115, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !20, line: 21, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !118, line: 89, size: 160, elements: !119)
!118 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!119 = !{!120, !121, !122, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !117, file: !118, line: 90, baseType: !47, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 91, baseType: !50, size: 64, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !117, file: !118, line: 93, baseType: !123, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !115, !106}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 94, baseType: !6, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !108, file: !109, line: 54, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !129, line: 98, baseType: !130)
!129 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !108, file: !109, line: 56, baseType: !94, size: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !108, file: !109, line: 58, baseType: !133, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !109, line: 45, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DISubroutineType(types: !136)
!136 = !{!29, !106, !29, !55}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 59, baseType: !6, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !108, file: !109, line: 61, baseType: !139, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !109, line: 46, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !106, !112, !29, !55}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !108, file: !109, line: 62, baseType: !6, size: 32, offset: 224)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !108, file: !109, line: 70, baseType: !145, size: 32, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !109, line: 72, baseType: !106, size: 32, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !43, file: !44, line: 37, baseType: !56, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !43, file: !44, line: 38, baseType: !56, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !26, file: !8, line: 30, baseType: !24, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !26, file: !8, line: 34, baseType: !56, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !26, file: !8, line: 40, baseType: !56, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !26, file: !8, line: 43, baseType: !56, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !26, file: !8, line: 45, baseType: !56, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !26, file: !8, line: 46, baseType: !56, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !26, file: !8, line: 47, baseType: !56, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !26, file: !8, line: 48, baseType: !56, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !26, file: !8, line: 49, baseType: !56, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !26, file: !8, line: 50, baseType: !56, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !26, file: !8, line: 52, baseType: !56, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !26, file: !8, line: 53, baseType: !56, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !26, file: !8, line: 55, baseType: !17, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !8, line: 61, baseType: !18, size: 32, offset: 32)
!164 = !{!165, !0, !537, !1779}
!165 = !DIGlobalVariableExpression(var: !166)
!166 = distinct !DIGlobalVariable(name: "ngx_http_copy_filter_module", scope: !2, file: !3, line: 67, type: !167, isLocal: false, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !20, line: 15, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !169, line: 222, size: 800, elements: !170)
!169 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !180, !181, !512, !513, !517, !521, !522, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !168, file: !169, line: 223, baseType: !112, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !168, file: !169, line: 224, baseType: !112, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !169, line: 226, baseType: !145, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !168, file: !169, line: 228, baseType: !112, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !168, file: !169, line: 229, baseType: !112, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !168, file: !169, line: 231, baseType: !112, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !168, file: !169, line: 232, baseType: !178, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !168, file: !169, line: 234, baseType: !6, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !168, file: !169, line: 235, baseType: !182, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !20, line: 22, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !118, line: 77, size: 224, elements: !185)
!185 = !{!186, !187, !188, !509, !510, !511}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !118, line: 78, baseType: !50, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !118, line: 79, baseType: !112, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !184, file: !118, line: 80, baseType: !189, size: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!145, !192, !182, !6}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !20, line: 16, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !118, line: 116, size: 384, elements: !195)
!195 = !{!196, !197, !244, !491, !492, !493, !502, !503, !504, !505, !506, !508}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !118, line: 117, baseType: !145, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !194, file: !118, line: 118, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !200, line: 22, baseType: !201)
!200 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 16, size: 160, elements: !202)
!202 = !{!203, !204, !205, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !201, file: !200, line: 17, baseType: !6, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !201, file: !200, line: 18, baseType: !112, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !201, file: !200, line: 19, baseType: !55, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !201, file: !200, line: 20, baseType: !112, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !201, file: !200, line: 21, baseType: !208, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !20, line: 18, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !211, line: 57, size: 320, elements: !212)
!211 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!212 = !{!213, !221, !222, !223, !224, !231, !243}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !210, file: !211, line: 58, baseType: !214, size: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !211, line: 54, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 49, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !215, file: !211, line: 50, baseType: !29, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !215, file: !211, line: 51, baseType: !29, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !211, line: 52, baseType: !208, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !215, file: !211, line: 53, baseType: !112, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !210, file: !211, line: 59, baseType: !55, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !210, file: !211, line: 60, baseType: !208, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !210, file: !211, line: 61, baseType: !18, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !210, file: !211, line: 62, baseType: !225, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !211, line: 41, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !211, line: 43, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !211, line: 44, baseType: !225, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !227, file: !211, line: 45, baseType: !6, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !210, file: !211, line: 63, baseType: !232, size: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !211, line: 32, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !211, line: 34, size: 96, elements: !235)
!235 = !{!236, !241, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !234, file: !211, line: 35, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !211, line: 30, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !6}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !211, line: 36, baseType: !6, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !211, line: 37, baseType: !232, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !210, file: !211, line: 64, baseType: !106, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !194, file: !118, line: 120, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !20, line: 17, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !248, line: 38, size: 2496, elements: !249)
!248 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!249 = !{!250, !254, !255, !256, !257, !258, !437, !438, !439, !442, !443, !444, !445, !446, !447, !448, !449, !460, !461, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !247, file: !248, line: 39, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !247, file: !248, line: 40, baseType: !208, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !247, file: !248, line: 42, baseType: !106, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !247, file: !248, line: 43, baseType: !107, size: 320, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !247, file: !248, line: 45, baseType: !112, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !247, file: !248, line: 47, baseType: !259, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !20, line: 26, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !263, line: 121, size: 896, elements: !264)
!263 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!264 = !{!265, !266, !322, !323, !326, !333, !335, !340, !345, !405, !406, !407, !408, !409, !410, !411, !412, !413, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !263, line: 122, baseType: !6, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !262, file: !263, line: 123, baseType: !267, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !20, line: 24, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !270, line: 30, size: 384, elements: !271)
!270 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !299, !300, !301, !314}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 31, baseType: !6, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !269, file: !270, line: 33, baseType: !56, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !269, file: !270, line: 35, baseType: !56, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !269, file: !270, line: 38, baseType: !56, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !269, file: !270, line: 44, baseType: !56, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !269, file: !270, line: 46, baseType: !56, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !269, file: !270, line: 49, baseType: !56, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !269, file: !270, line: 51, baseType: !56, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !269, file: !270, line: 54, baseType: !56, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !269, file: !270, line: 56, baseType: !56, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !269, file: !270, line: 57, baseType: !56, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !269, file: !270, line: 59, baseType: !56, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !269, file: !270, line: 60, baseType: !56, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !269, file: !270, line: 62, baseType: !56, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !269, file: !270, line: 64, baseType: !56, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !269, file: !270, line: 67, baseType: !56, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !269, file: !270, line: 69, baseType: !56, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !269, file: !270, line: 71, baseType: !56, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !269, file: !270, line: 74, baseType: !56, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !269, file: !270, line: 75, baseType: !56, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !269, file: !270, line: 77, baseType: !56, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !269, file: !270, line: 107, baseType: !56, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !269, file: !270, line: 110, baseType: !295, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !20, line: 31, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !267}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !269, file: !270, line: 117, baseType: !112, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !269, file: !270, line: 119, baseType: !106, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !269, file: !270, line: 121, baseType: !302, size: 160, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !303, line: 20, baseType: !304)
!303 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !303, line: 22, size: 160, elements: !305)
!305 = !{!306, !308, !310, !311, !312, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !304, file: !303, line: 23, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !303, line: 16, baseType: !112)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !304, file: !303, line: 24, baseType: !309, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !304, file: !303, line: 25, baseType: !309, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !304, file: !303, line: 26, baseType: !309, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !304, file: !303, line: 27, baseType: !30, size: 8, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !303, line: 28, baseType: !30, size: 8, offset: 136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !270, line: 124, baseType: !315, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !316, line: 16, baseType: !317)
!316 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !316, line: 18, size: 64, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !316, line: 19, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !316, line: 20, baseType: !320, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !262, file: !263, line: 124, baseType: !267, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !262, file: !263, line: 126, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !325, line: 17, baseType: !17)
!325 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !262, file: !263, line: 128, baseType: !327, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !328, line: 19, baseType: !329)
!328 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !260, !29, !55}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !16, line: 135, baseType: !17)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !262, file: !263, line: 129, baseType: !334, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !328, line: 22, baseType: !329)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !262, file: !263, line: 130, baseType: !336, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !328, line: 20, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!332, !260, !18, !35}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !262, file: !263, line: 131, baseType: !341, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !328, line: 23, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{!18, !260, !18, !35}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !262, file: !263, line: 133, baseType: !346, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !263, line: 16, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !263, line: 18, size: 960, elements: !349)
!349 = !{!350, !351, !363, !365, !366, !367, !368, !369, !370, !371, !376, !377, !378, !379, !380, !381, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !348, file: !263, line: 19, baseType: !324, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !348, file: !263, line: 21, baseType: !352, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !354, line: 297, size: 128, elements: !355)
!354 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!355 = !{!356, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !353, file: !354, line: 298, baseType: !357, size: 16)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !16, line: 409, baseType: !358)
!358 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !353, file: !354, line: 299, baseType: !360, size: 112, offset: 16)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 112, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 14)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !348, file: !263, line: 22, baseType: !364, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !16, line: 404, baseType: !56)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !348, file: !263, line: 23, baseType: !55, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !348, file: !263, line: 24, baseType: !50, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !263, line: 26, baseType: !17, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !348, file: !263, line: 28, baseType: !17, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !348, file: !263, line: 29, baseType: !17, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !348, file: !263, line: 30, baseType: !17, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !348, file: !263, line: 38, baseType: !372, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !20, line: 32, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !260}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !348, file: !263, line: 40, baseType: !6, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !348, file: !263, line: 42, baseType: !107, size: 320, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !348, file: !263, line: 43, baseType: !106, size: 32, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !348, file: !263, line: 45, baseType: !55, size: 32, offset: 736)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !348, file: !263, line: 47, baseType: !55, size: 32, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !348, file: !263, line: 49, baseType: !382, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !383, line: 16, baseType: !307)
!383 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !348, file: !263, line: 51, baseType: !346, size: 32, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !348, file: !263, line: 52, baseType: !260, size: 32, offset: 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !348, file: !263, line: 54, baseType: !112, size: 32, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !348, file: !263, line: 56, baseType: !56, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !348, file: !263, line: 57, baseType: !56, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !348, file: !263, line: 58, baseType: !56, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !348, file: !263, line: 60, baseType: !56, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !348, file: !263, line: 61, baseType: !56, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !348, file: !263, line: 62, baseType: !56, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !348, file: !263, line: 63, baseType: !56, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !348, file: !263, line: 64, baseType: !56, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !348, file: !263, line: 65, baseType: !56, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !348, file: !263, line: 66, baseType: !56, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !348, file: !263, line: 67, baseType: !56, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !348, file: !263, line: 70, baseType: !56, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !348, file: !263, line: 72, baseType: !56, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !348, file: !263, line: 73, baseType: !56, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !348, file: !263, line: 74, baseType: !56, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !348, file: !263, line: 76, baseType: !56, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !348, file: !263, line: 77, baseType: !56, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !348, file: !263, line: 78, baseType: !56, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !262, file: !263, line: 135, baseType: !35, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !262, file: !263, line: 137, baseType: !106, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !262, file: !263, line: 139, baseType: !208, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !263, line: 141, baseType: !17, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !262, file: !263, line: 143, baseType: !352, size: 32, offset: 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !262, file: !263, line: 144, baseType: !364, size: 32, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !262, file: !263, line: 145, baseType: !50, size: 64, offset: 480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !262, file: !263, line: 147, baseType: !50, size: 64, offset: 544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !262, file: !263, line: 148, baseType: !414, size: 16, offset: 608)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !415, line: 12, baseType: !416)
!415 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 186, baseType: !358)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !262, file: !263, line: 154, baseType: !352, size: 32, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !262, file: !263, line: 155, baseType: !364, size: 32, offset: 672)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !262, file: !263, line: 157, baseType: !24, size: 32, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !262, file: !263, line: 159, baseType: !315, size: 64, offset: 736)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !262, file: !263, line: 161, baseType: !128, size: 32, offset: 800)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !262, file: !263, line: 163, baseType: !112, size: 32, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !262, file: !263, line: 165, baseType: !56, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !262, file: !263, line: 167, baseType: !56, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !262, file: !263, line: 169, baseType: !56, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !262, file: !263, line: 170, baseType: !56, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !262, file: !263, line: 171, baseType: !56, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !262, file: !263, line: 173, baseType: !56, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !262, file: !263, line: 174, baseType: !56, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !262, file: !263, line: 175, baseType: !56, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !262, file: !263, line: 176, baseType: !56, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !262, file: !263, line: 178, baseType: !56, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !262, file: !263, line: 179, baseType: !56, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !262, file: !263, line: 180, baseType: !56, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !262, file: !263, line: 181, baseType: !56, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !262, file: !263, line: 183, baseType: !56, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !247, file: !248, line: 48, baseType: !260, size: 32, offset: 480)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !247, file: !248, line: 49, baseType: !112, size: 32, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !247, file: !248, line: 51, baseType: !440, size: 32, offset: 544)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !247, file: !248, line: 52, baseType: !112, size: 32, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !247, file: !248, line: 53, baseType: !112, size: 32, offset: 608)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !247, file: !248, line: 55, baseType: !315, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !247, file: !248, line: 56, baseType: !112, size: 32, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !247, file: !248, line: 58, baseType: !199, size: 160, offset: 736)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !247, file: !248, line: 59, baseType: !199, size: 160, offset: 896)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !247, file: !248, line: 61, baseType: !199, size: 160, offset: 1056)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !247, file: !248, line: 62, baseType: !450, size: 96, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !303, line: 32, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !303, line: 37, size: 96, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !451, file: !303, line: 38, baseType: !309, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !451, file: !303, line: 39, baseType: !309, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !451, file: !303, line: 40, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !303, line: 34, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !309, !309, !309}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !247, file: !248, line: 63, baseType: !302, size: 160, offset: 1312)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !247, file: !248, line: 65, baseType: !462, size: 224, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !463, line: 31, baseType: !464)
!463 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 25, size: 224, elements: !465)
!465 = !{!466, !474, !475, !476, !477}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !464, file: !463, line: 26, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !463, line: 16, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !463, line: 18, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !469, file: !463, line: 19, baseType: !6, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !469, file: !463, line: 20, baseType: !112, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !463, line: 21, baseType: !467, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !464, file: !463, line: 27, baseType: !468, size: 96, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !463, line: 28, baseType: !55, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !464, file: !463, line: 29, baseType: !112, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !464, file: !463, line: 30, baseType: !208, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !247, file: !248, line: 66, baseType: !462, size: 224, offset: 1696)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !247, file: !248, line: 68, baseType: !112, size: 32, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !247, file: !248, line: 69, baseType: !112, size: 32, offset: 1952)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !247, file: !248, line: 71, baseType: !260, size: 32, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !247, file: !248, line: 72, baseType: !267, size: 32, offset: 2016)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !247, file: !248, line: 73, baseType: !267, size: 32, offset: 2048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !247, file: !248, line: 75, baseType: !245, size: 32, offset: 2080)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !247, file: !248, line: 77, baseType: !50, size: 64, offset: 2112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !247, file: !248, line: 78, baseType: !50, size: 64, offset: 2176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !247, file: !248, line: 79, baseType: !50, size: 64, offset: 2240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !247, file: !248, line: 80, baseType: !50, size: 64, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !247, file: !248, line: 81, baseType: !50, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !247, file: !248, line: 82, baseType: !50, size: 64, offset: 2432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !194, file: !118, line: 121, baseType: !208, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !194, file: !118, line: 122, baseType: !208, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !194, file: !118, line: 123, baseType: !494, size: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !118, line: 103, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 98, size: 1344, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !496, file: !118, line: 99, baseType: !42, size: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !496, file: !118, line: 100, baseType: !24, size: 32, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !496, file: !118, line: 101, baseType: !24, size: 32, offset: 1248)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !496, file: !118, line: 102, baseType: !112, size: 32, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !194, file: !118, line: 124, baseType: !106, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !194, file: !118, line: 126, baseType: !6, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !194, file: !118, line: 127, baseType: !112, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !194, file: !118, line: 128, baseType: !112, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !194, file: !118, line: 130, baseType: !507, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !118, line: 112, baseType: !189)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !194, file: !118, line: 131, baseType: !145, size: 32, offset: 352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !184, file: !118, line: 81, baseType: !112, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !184, file: !118, line: 82, baseType: !112, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !184, file: !118, line: 83, baseType: !6, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !169, line: 236, baseType: !112, size: 32, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !168, file: !169, line: 238, baseType: !514, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!13, !106}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !168, file: !169, line: 240, baseType: !518, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{!13, !245}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !168, file: !169, line: 242, baseType: !518, size: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !168, file: !169, line: 243, baseType: !518, size: 32, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !168, file: !169, line: 244, baseType: !524, size: 32, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !245}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !168, file: !169, line: 245, baseType: !524, size: 32, offset: 480)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !168, file: !169, line: 247, baseType: !524, size: 32, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !168, file: !169, line: 249, baseType: !113, size: 32, offset: 544)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !168, file: !169, line: 250, baseType: !113, size: 32, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !168, file: !169, line: 251, baseType: !113, size: 32, offset: 608)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !168, file: !169, line: 252, baseType: !113, size: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !168, file: !169, line: 253, baseType: !113, size: 32, offset: 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !168, file: !169, line: 254, baseType: !113, size: 32, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !168, file: !169, line: 255, baseType: !113, size: 32, offset: 736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !168, file: !169, line: 256, baseType: !113, size: 32, offset: 768)
!537 = !DIGlobalVariableExpression(var: !538)
!538 = distinct !DIGlobalVariable(name: "ngx_http_next_body_filter", scope: !2, file: !3, line: 83, type: !539, isLocal: true, isDefinition: true)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_body_filter_pt", file: !540, line: 522, baseType: !541)
!540 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DISubroutineType(types: !543)
!543 = !{!13, !544, !18}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !546, line: 16, baseType: !547)
!546 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !548, line: 364, size: 5376, elements: !549)
!548 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!549 = !{!550, !552, !553, !554, !555, !556, !557, !562, !563, !776, !1332, !1333, !1334, !1335, !1374, !1404, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1449, !1460, !1467, !1468, !1470, !1471, !1484, !1485, !1486, !1487, !1488, !1489, !1675, !1679, !1684, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !547, file: !548, line: 365, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 191, baseType: !56)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !547, file: !548, line: 367, baseType: !260, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !547, file: !548, line: 369, baseType: !253, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !547, file: !548, line: 370, baseType: !253, size: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !547, file: !548, line: 371, baseType: !253, size: 32, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !547, file: !548, line: 372, baseType: !253, size: 32, offset: 160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !547, file: !548, line: 374, baseType: !558, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !548, line: 361, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !544}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !547, file: !548, line: 375, baseType: !558, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !547, file: !548, line: 378, baseType: !564, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !546, line: 18, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !567, line: 65, size: 3008, elements: !568)
!567 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!568 = !{!569, !570, !571, !572, !576, !577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !734, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !566, file: !567, line: 66, baseType: !42, size: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !566, file: !567, line: 67, baseType: !199, size: 160, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !566, file: !567, line: 68, baseType: !551, size: 32, offset: 1376)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !566, file: !567, line: 69, baseType: !573, size: 128, offset: 1408)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !566, file: !567, line: 70, baseType: !573, size: 128, offset: 1536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !566, file: !567, line: 72, baseType: !578, size: 32, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !48, line: 18, baseType: !67)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !566, file: !567, line: 73, baseType: !94, size: 32, offset: 1696)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !566, file: !567, line: 74, baseType: !94, size: 32, offset: 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !566, file: !567, line: 75, baseType: !94, size: 32, offset: 1760)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !566, file: !567, line: 76, baseType: !94, size: 32, offset: 1792)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !566, file: !567, line: 77, baseType: !94, size: 32, offset: 1824)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !566, file: !567, line: 79, baseType: !50, size: 64, offset: 1856)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !566, file: !567, line: 80, baseType: !50, size: 64, offset: 1920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !566, file: !567, line: 81, baseType: !573, size: 128, offset: 1984)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !566, file: !567, line: 83, baseType: !55, size: 32, offset: 2112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !566, file: !567, line: 84, baseType: !55, size: 32, offset: 2144)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !566, file: !567, line: 85, baseType: !35, size: 32, offset: 2176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !566, file: !567, line: 86, baseType: !35, size: 32, offset: 2208)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !566, file: !567, line: 88, baseType: !112, size: 32, offset: 2240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !566, file: !567, line: 89, baseType: !112, size: 32, offset: 2272)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !566, file: !567, line: 90, baseType: !112, size: 32, offset: 2304)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !566, file: !567, line: 91, baseType: !112, size: 32, offset: 2336)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !566, file: !567, line: 93, baseType: !24, size: 32, offset: 2368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !566, file: !567, line: 95, baseType: !597, size: 32, offset: 2400)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !546, line: 19, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !567, line: 157, size: 544, elements: !600)
!600 = !{!601, !616, !677, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !733}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !599, file: !567, line: 158, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !567, line: 154, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 145, size: 480, elements: !605)
!605 = !{!606, !607, !608, !609, !612, !613, !614, !615}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !604, file: !567, line: 146, baseType: !450, size: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !604, file: !567, line: 147, baseType: !302, size: 160, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !604, file: !567, line: 148, baseType: !315, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !604, file: !567, line: 149, baseType: !610, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !129, line: 106, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !604, file: !567, line: 150, baseType: !610, size: 32, offset: 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !567, line: 151, baseType: !35, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !604, file: !567, line: 152, baseType: !112, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !604, file: !567, line: 153, baseType: !112, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !599, file: !567, line: 159, baseType: !617, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !619, line: 59, baseType: !620)
!619 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 34, size: 800, elements: !621)
!621 = !{!622, !629, !630, !631, !639, !640, !641, !650, !651, !652, !653, !672, !673, !674, !675, !676}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !620, file: !619, line: 35, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !624, line: 21, baseType: !625)
!624 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 16, size: 64, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !625, file: !624, line: 17, baseType: !610, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !625, file: !624, line: 19, baseType: !610, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !620, file: !619, line: 37, baseType: !55, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !620, file: !619, line: 38, baseType: !55, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !620, file: !619, line: 40, baseType: !632, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !619, line: 16, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !619, line: 18, size: 96, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !634, file: !619, line: 19, baseType: !113, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !634, file: !619, line: 20, baseType: !632, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !634, file: !619, line: 21, baseType: !113, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !620, file: !619, line: 41, baseType: !632, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !620, file: !619, line: 42, baseType: !633, size: 96, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !620, file: !619, line: 44, baseType: !642, size: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !619, line: 31, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 25, size: 128, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !644, file: !619, line: 26, baseType: !112, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !644, file: !619, line: 27, baseType: !112, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !644, file: !619, line: 29, baseType: !112, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !644, file: !619, line: 30, baseType: !112, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !620, file: !619, line: 45, baseType: !112, size: 32, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !620, file: !619, line: 47, baseType: !29, size: 32, offset: 352)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !620, file: !619, line: 48, baseType: !29, size: 32, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !620, file: !619, line: 50, baseType: !654, size: 256, offset: 416)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !624, line: 37, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 24, size: 256, elements: !656)
!656 = !{!657, !659, !660, !661, !671}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !655, file: !624, line: 26, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !655, file: !624, line: 28, baseType: !658, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !655, file: !624, line: 29, baseType: !112, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !655, file: !624, line: 30, baseType: !662, size: 128, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !663, line: 19, baseType: !664)
!663 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !663, line: 17, size: 128, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !664, file: !663, line: 18, baseType: !667, size: 128)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 128, elements: !669)
!668 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!669 = !{!670}
!670 = !DISubrange(count: 4)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !655, file: !624, line: 36, baseType: !112, size: 32, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !620, file: !619, line: 52, baseType: !29, size: 32, offset: 672)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !620, file: !619, line: 53, baseType: !30, size: 8, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !620, file: !619, line: 55, baseType: !56, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !620, file: !619, line: 57, baseType: !6, size: 32, offset: 736)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !620, file: !619, line: 58, baseType: !6, size: 32, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !599, file: !567, line: 161, baseType: !678, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !44, line: 62, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 50, size: 384, elements: !681)
!681 = !{!682, !683, !684, !686, !691, !693, !695, !696, !697}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !44, line: 51, baseType: !50, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !680, file: !44, line: 52, baseType: !55, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !680, file: !44, line: 53, baseType: !685, size: 96, offset: 96)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 96, elements: !101)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !680, file: !44, line: 55, baseType: !687, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !44, line: 45, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{!382, !6}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !680, file: !44, line: 56, baseType: !692, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !44, line: 46, baseType: !688)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !680, file: !44, line: 57, baseType: !694, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !44, line: 47, baseType: !238)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !44, line: 58, baseType: !6, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !680, file: !44, line: 60, baseType: !29, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !680, file: !44, line: 61, baseType: !112, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !599, file: !567, line: 163, baseType: !35, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !599, file: !567, line: 164, baseType: !55, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !599, file: !567, line: 166, baseType: !94, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !599, file: !567, line: 168, baseType: !94, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !599, file: !567, line: 170, baseType: !112, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !599, file: !567, line: 171, baseType: !112, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !599, file: !567, line: 172, baseType: !382, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !599, file: !567, line: 173, baseType: !382, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !599, file: !567, line: 174, baseType: !382, size: 32, offset: 352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !599, file: !567, line: 176, baseType: !112, size: 32, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !599, file: !567, line: 177, baseType: !382, size: 32, offset: 416)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !599, file: !567, line: 178, baseType: !382, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !599, file: !567, line: 180, baseType: !711, size: 32, offset: 480)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !248, line: 25, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !248, line: 29, size: 320, elements: !714)
!714 = !{!715, !716, !726, !731, !732}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !248, line: 30, baseType: !6, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !713, file: !248, line: 31, baseType: !717, size: 192, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !718, line: 22, baseType: !719)
!718 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 16, size: 192, elements: !720)
!720 = !{!721, !722, !723, !724, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !719, file: !718, line: 17, baseType: !29, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !719, file: !718, line: 18, baseType: !55, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !718, line: 19, baseType: !50, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !719, file: !718, line: 20, baseType: !106, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !719, file: !718, line: 21, baseType: !112, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !713, file: !248, line: 32, baseType: !727, size: 32, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !248, line: 27, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!13, !711, !6}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !713, file: !248, line: 33, baseType: !6, size: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !713, file: !248, line: 34, baseType: !112, size: 32, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !599, file: !567, line: 182, baseType: !112, size: 32, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !566, file: !567, line: 96, baseType: !735, size: 32, offset: 2432)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !567, line: 62, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 39, size: 576, elements: !738)
!738 = !{!739, !740, !741, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !737, file: !567, line: 40, baseType: !302, size: 160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !737, file: !567, line: 41, baseType: !315, size: 64, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !737, file: !567, line: 43, baseType: !742, size: 96, offset: 224)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 12)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !737, file: !567, line: 46, baseType: !56, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !737, file: !567, line: 47, baseType: !56, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !737, file: !567, line: 48, baseType: !56, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !737, file: !567, line: 49, baseType: !56, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !737, file: !567, line: 50, baseType: !56, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !737, file: !567, line: 51, baseType: !56, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !737, file: !567, line: 52, baseType: !56, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !737, file: !567, line: 53, baseType: !56, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !737, file: !567, line: 56, baseType: !578, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !737, file: !567, line: 57, baseType: !94, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !737, file: !567, line: 58, baseType: !94, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !737, file: !567, line: 59, baseType: !55, size: 32, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !737, file: !567, line: 60, baseType: !35, size: 32, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !737, file: !567, line: 61, baseType: !382, size: 32, offset: 544)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !566, file: !567, line: 102, baseType: !382, size: 32, offset: 2464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !566, file: !567, line: 103, baseType: !382, size: 32, offset: 2496)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !566, file: !567, line: 104, baseType: !382, size: 32, offset: 2528)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !566, file: !567, line: 105, baseType: !382, size: 32, offset: 2560)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !566, file: !567, line: 107, baseType: !268, size: 384, offset: 2592)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !566, file: !567, line: 109, baseType: !56, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !566, file: !567, line: 110, baseType: !56, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !566, file: !567, line: 112, baseType: !56, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !566, file: !567, line: 113, baseType: !56, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !566, file: !567, line: 114, baseType: !56, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !566, file: !567, line: 115, baseType: !56, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !566, file: !567, line: 116, baseType: !56, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !566, file: !567, line: 117, baseType: !56, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !566, file: !567, line: 118, baseType: !56, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !566, file: !567, line: 119, baseType: !56, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !566, file: !567, line: 121, baseType: !56, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !566, file: !567, line: 122, baseType: !56, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !547, file: !548, line: 381, baseType: !777, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !546, line: 17, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !780, line: 313, size: 4096, elements: !781)
!780 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!781 = !{!782, !787, !788, !829, !905, !906, !927, !936, !1059, !1060, !1061, !1099, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1277, !1281, !1282, !1286, !1287, !1288, !1289, !1290, !1294, !1298, !1302, !1303, !1315, !1316, !1317, !1318, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !779, file: !780, line: 314, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !780, line: 309, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !544, !777}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !779, file: !780, line: 315, baseType: !783, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !779, file: !780, line: 317, baseType: !789, size: 480, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !790, line: 22, baseType: !791)
!790 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !790, line: 36, size: 480, elements: !792)
!792 = !{!793, !794, !795, !796, !798, !799, !800, !806, !811, !813, !814, !823, !824, !825, !826, !827, !828}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !791, file: !790, line: 37, baseType: !260, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !791, file: !790, line: 39, baseType: !352, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !791, file: !790, line: 40, baseType: !364, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !791, file: !790, line: 41, baseType: !797, size: 32, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !791, file: !790, line: 43, baseType: !112, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !791, file: !790, line: 44, baseType: !382, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !791, file: !790, line: 46, baseType: !801, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !790, line: 24, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{!13, !805, !6}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !791, file: !790, line: 47, baseType: !807, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !790, line: 26, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !805, !6, !112}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !791, file: !790, line: 48, baseType: !812, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !790, line: 28, baseType: !808)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !790, line: 49, baseType: !6, size: 32, offset: 288)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !791, file: !790, line: 56, baseType: !815, size: 32, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !817, line: 78, baseType: !818)
!817 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 74, size: 128, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !818, file: !817, line: 75, baseType: !352, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !818, file: !817, line: 76, baseType: !364, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !817, line: 77, baseType: !50, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !791, file: !790, line: 58, baseType: !17, size: 32, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !791, file: !790, line: 59, baseType: !17, size: 32, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !791, file: !790, line: 61, baseType: !106, size: 32, offset: 416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !791, file: !790, line: 63, baseType: !56, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !791, file: !790, line: 64, baseType: !56, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !791, file: !790, line: 67, baseType: !56, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !779, file: !780, line: 319, baseType: !830, size: 32, offset: 544)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !832, line: 17, baseType: !833)
!832 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !832, line: 25, size: 1120, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !841, !842, !843, !844, !845, !850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !904}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !833, file: !832, line: 26, baseType: !260, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !833, file: !832, line: 27, baseType: !260, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !833, file: !832, line: 29, baseType: !18, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !833, file: !832, line: 30, baseType: !18, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !833, file: !832, line: 31, baseType: !840, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !833, file: !832, line: 33, baseType: !18, size: 32, offset: 160)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !833, file: !832, line: 35, baseType: !18, size: 32, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !833, file: !832, line: 36, baseType: !18, size: 32, offset: 224)
