; ModuleID = 'src/http/ngx_http_write_filter_module.c'
source_filename = "src/http/ngx_http_write_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_write_filter_module_ctx", scope: !2, file: !3, line: 16, type: !535, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !166)
!3 = !DIFile(filename: "src/http/ngx_http_write_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !9, !10, !18, !162}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !7, line: 222, baseType: !8)
!7 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !11, line: 16, baseType: !12)
!11 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !13, line: 16, baseType: !14)
!13 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !15, line: 79, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !7, line: 125, baseType: !17)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !20, line: 19, baseType: !21)
!20 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !22, line: 59, size: 64, elements: !23)
!22 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !{!24, !161}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !21, file: !22, line: 60, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !22, line: 18, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !22, line: 20, size: 352, elements: !28)
!28 = !{!29, !34, !35, !36, !37, !38, !39, !41, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !27, file: !22, line: 21, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !32, line: 64, baseType: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !27, file: !22, line: 22, baseType: !30, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !27, file: !22, line: 23, baseType: !6, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !27, file: !22, line: 24, baseType: !6, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !27, file: !22, line: 26, baseType: !30, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !27, file: !22, line: 27, baseType: !30, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !27, file: !22, line: 28, baseType: !40, size: 32, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !22, line: 16, baseType: !9)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !27, file: !22, line: 29, baseType: !42, size: 32, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !20, line: 23, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !45, line: 16, size: 1216, elements: !46)
!45 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !{!47, !50, !58, !103, !104, !105, !146, !147}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !44, file: !45, line: 17, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !49, line: 16, baseType: !8)
!49 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 18, baseType: !51, size: 64, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !52, line: 19, baseType: !53)
!52 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 16, size: 64, elements: !54)
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !53, file: !52, line: 17, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 120, baseType: !17)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !52, line: 18, baseType: !30, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !44, file: !45, line: 19, baseType: !59, size: 960, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !49, line: 17, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !61, line: 4, size: 960, elements: !62)
!61 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !{!63, !65, !66, !68, !69, !71, !72, !74, !76, !78, !79, !80, !81, !82, !83, !86, !87, !89, !90, !96, !97, !98}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !60, file: !61, line: 6, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !7, line: 232, baseType: !17)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !60, file: !61, line: 7, baseType: !64, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !60, file: !61, line: 8, baseType: !67, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !7, line: 227, baseType: !17)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !60, file: !61, line: 9, baseType: !67, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !60, file: !61, line: 10, baseType: !70, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !7, line: 217, baseType: !17)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !60, file: !61, line: 11, baseType: !70, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !60, file: !61, line: 13, baseType: !73, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !7, line: 212, baseType: !17)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !60, file: !61, line: 14, baseType: !75, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !7, line: 304, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !60, file: !61, line: 15, baseType: !77, size: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !7, line: 309, baseType: !17)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !60, file: !61, line: 16, baseType: !17, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !60, file: !61, line: 17, baseType: !64, size: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !60, file: !61, line: 18, baseType: !64, size: 32, offset: 352)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !60, file: !61, line: 19, baseType: !6, size: 32, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !60, file: !61, line: 20, baseType: !6, size: 32, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !60, file: !61, line: 21, baseType: !84, size: 32, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !7, line: 237, baseType: !85)
!85 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !60, file: !61, line: 22, baseType: !84, size: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !60, file: !61, line: 23, baseType: !88, size: 32, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !7, line: 242, baseType: !8)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !60, file: !61, line: 24, baseType: !88, size: 32, offset: 544)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !60, file: !61, line: 26, baseType: !91, size: 64, offset: 576)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !7, line: 288, size: 64, elements: !92)
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !91, file: !7, line: 288, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !7, line: 75, baseType: !85)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !91, file: !7, line: 288, baseType: !85, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !60, file: !61, line: 27, baseType: !91, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !60, file: !61, line: 28, baseType: !91, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !60, file: !61, line: 29, baseType: !99, size: 192, offset: 768)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 192, elements: !101)
!100 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!101 = !{!102}
!102 = !DISubrange(count: 3)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !44, file: !45, line: 21, baseType: !6, size: 32, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !44, file: !45, line: 22, baseType: !6, size: 32, offset: 1120)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !44, file: !45, line: 24, baseType: !106, size: 32, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !20, line: 20, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !109, line: 50, size: 320, elements: !110)
!109 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!110 = !{!111, !112, !125, !129, !130, !135, !136, !141, !142, !145}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !108, file: !109, line: 51, baseType: !14, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !108, file: !109, line: 52, baseType: !113, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !20, line: 21, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !116, line: 89, size: 160, elements: !117)
!116 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = !{!118, !119, !120, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !115, file: !116, line: 90, baseType: !48, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 91, baseType: !51, size: 64, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !115, file: !116, line: 93, baseType: !121, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !113, !106}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !116, line: 94, baseType: !9, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !108, file: !109, line: 54, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !127, line: 98, baseType: !128)
!127 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!128 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !108, file: !109, line: 56, baseType: !94, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !108, file: !109, line: 58, baseType: !131, size: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !109, line: 45, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{!30, !106, !30, !56}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 59, baseType: !9, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !108, file: !109, line: 61, baseType: !137, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !109, line: 46, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !106, !14, !30, !56}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !108, file: !109, line: 62, baseType: !9, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !108, file: !109, line: 70, baseType: !143, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !109, line: 72, baseType: !106, size: 32, offset: 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !44, file: !45, line: 37, baseType: !17, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !44, file: !45, line: 38, baseType: !17, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !27, file: !22, line: 30, baseType: !25, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !27, file: !22, line: 34, baseType: !17, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !27, file: !22, line: 40, baseType: !17, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !27, file: !22, line: 43, baseType: !17, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !27, file: !22, line: 45, baseType: !17, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !27, file: !22, line: 46, baseType: !17, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !27, file: !22, line: 47, baseType: !17, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !27, file: !22, line: 48, baseType: !17, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !27, file: !22, line: 49, baseType: !17, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !27, file: !22, line: 50, baseType: !17, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !27, file: !22, line: 52, baseType: !17, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !27, file: !22, line: 53, baseType: !17, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !27, file: !22, line: 55, baseType: !8, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !22, line: 61, baseType: !18, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !11, line: 17, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !13, line: 17, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !15, line: 78, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !7, line: 140, baseType: !8)
!166 = !{!167, !0}
!167 = !DIGlobalVariableExpression(var: !168)
!168 = distinct !DIGlobalVariable(name: "ngx_http_write_filter_module", scope: !2, file: !3, line: 31, type: !169, isLocal: false, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !20, line: 15, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !171, line: 222, size: 800, elements: !172)
!171 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !182, !183, !510, !511, !515, !519, !520, !521, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !170, file: !171, line: 223, baseType: !14, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !170, file: !171, line: 224, baseType: !14, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !171, line: 226, baseType: !143, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !170, file: !171, line: 228, baseType: !14, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !170, file: !171, line: 229, baseType: !14, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !170, file: !171, line: 231, baseType: !14, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !170, file: !171, line: 232, baseType: !180, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !170, file: !171, line: 234, baseType: !9, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !170, file: !171, line: 235, baseType: !184, size: 32, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !20, line: 22, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !116, line: 77, size: 224, elements: !187)
!187 = !{!188, !189, !190, !507, !508, !509}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !116, line: 78, baseType: !51, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !116, line: 79, baseType: !14, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !186, file: !116, line: 80, baseType: !191, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DISubroutineType(types: !193)
!193 = !{!143, !194, !184, !9}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !20, line: 16, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !116, line: 116, size: 384, elements: !197)
!197 = !{!198, !199, !246, !489, !490, !491, !500, !501, !502, !503, !504, !506}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !116, line: 117, baseType: !143, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !196, file: !116, line: 118, baseType: !200, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !202, line: 22, baseType: !203)
!202 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 16, size: 160, elements: !204)
!204 = !{!205, !206, !207, !208, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !203, file: !202, line: 17, baseType: !9, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !203, file: !202, line: 18, baseType: !14, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !202, line: 19, baseType: !56, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !203, file: !202, line: 20, baseType: !14, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !203, file: !202, line: 21, baseType: !210, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !20, line: 18, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !213, line: 57, size: 320, elements: !214)
!213 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!214 = !{!215, !223, !224, !225, !226, !233, !245}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !212, file: !213, line: 58, baseType: !216, size: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !213, line: 54, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 49, size: 128, elements: !218)
!218 = !{!219, !220, !221, !222}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !217, file: !213, line: 50, baseType: !30, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !217, file: !213, line: 51, baseType: !30, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !213, line: 52, baseType: !210, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !217, file: !213, line: 53, baseType: !14, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !212, file: !213, line: 59, baseType: !56, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !212, file: !213, line: 60, baseType: !210, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !212, file: !213, line: 61, baseType: !18, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !212, file: !213, line: 62, baseType: !227, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !213, line: 41, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !213, line: 43, size: 64, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !213, line: 44, baseType: !227, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !229, file: !213, line: 45, baseType: !9, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !212, file: !213, line: 63, baseType: !234, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !213, line: 32, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !213, line: 34, size: 96, elements: !237)
!237 = !{!238, !243, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !236, file: !213, line: 35, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !213, line: 30, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !9}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !213, line: 36, baseType: !9, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !213, line: 37, baseType: !234, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !212, file: !213, line: 64, baseType: !106, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !196, file: !116, line: 120, baseType: !247, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !20, line: 17, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !250, line: 38, size: 2496, elements: !251)
!250 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!251 = !{!252, !256, !257, !258, !259, !260, !435, !436, !437, !440, !441, !442, !443, !444, !445, !446, !447, !458, !459, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !249, file: !250, line: 39, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !249, file: !250, line: 40, baseType: !210, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !249, file: !250, line: 42, baseType: !106, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !249, file: !250, line: 43, baseType: !107, size: 320, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !249, file: !250, line: 45, baseType: !14, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !249, file: !250, line: 47, baseType: !261, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !20, line: 26, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !265, line: 121, size: 896, elements: !266)
!265 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!266 = !{!267, !268, !322, !323, !326, !333, !335, !340, !345, !403, !404, !405, !406, !407, !408, !409, !410, !411, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !265, line: 122, baseType: !9, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !264, file: !265, line: 123, baseType: !269, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !20, line: 24, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !272, line: 30, size: 384, elements: !273)
!272 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !301, !302, !303, !314}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !272, line: 31, baseType: !9, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !271, file: !272, line: 33, baseType: !17, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !271, file: !272, line: 35, baseType: !17, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !271, file: !272, line: 38, baseType: !17, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !271, file: !272, line: 44, baseType: !17, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !271, file: !272, line: 46, baseType: !17, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !271, file: !272, line: 49, baseType: !17, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !271, file: !272, line: 51, baseType: !17, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !271, file: !272, line: 54, baseType: !17, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !271, file: !272, line: 56, baseType: !17, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !271, file: !272, line: 57, baseType: !17, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !271, file: !272, line: 59, baseType: !17, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !271, file: !272, line: 60, baseType: !17, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !271, file: !272, line: 62, baseType: !17, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !271, file: !272, line: 64, baseType: !17, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !271, file: !272, line: 67, baseType: !17, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !271, file: !272, line: 69, baseType: !17, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !271, file: !272, line: 71, baseType: !17, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !271, file: !272, line: 74, baseType: !17, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !271, file: !272, line: 75, baseType: !17, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !271, file: !272, line: 77, baseType: !17, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !271, file: !272, line: 107, baseType: !17, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !271, file: !272, line: 110, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !20, line: 31, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !269}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !271, file: !272, line: 117, baseType: !14, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !271, file: !272, line: 119, baseType: !106, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !271, file: !272, line: 121, baseType: !304, size: 160, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !13, line: 20, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !13, line: 22, size: 160, elements: !306)
!306 = !{!307, !308, !310, !311, !312, !313}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !305, file: !13, line: 23, baseType: !12, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !305, file: !13, line: 24, baseType: !309, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !305, file: !13, line: 25, baseType: !309, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !305, file: !13, line: 26, baseType: !309, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !305, file: !13, line: 27, baseType: !31, size: 8, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !13, line: 28, baseType: !31, size: 8, offset: 136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !271, file: !272, line: 124, baseType: !315, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !316, line: 16, baseType: !317)
!316 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !316, line: 18, size: 64, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !316, line: 19, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !316, line: 20, baseType: !320, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !264, file: !265, line: 124, baseType: !269, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !264, file: !265, line: 126, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !325, line: 17, baseType: !8)
!325 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !264, file: !265, line: 128, baseType: !327, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !328, line: 19, baseType: !329)
!328 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !262, !30, !56}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !7, line: 135, baseType: !8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !264, file: !265, line: 129, baseType: !334, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !328, line: 22, baseType: !329)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !264, file: !265, line: 130, baseType: !336, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !328, line: 20, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!332, !262, !18, !6}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !264, file: !265, line: 131, baseType: !341, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !328, line: 23, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{!18, !262, !18, !6}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !264, file: !265, line: 133, baseType: !346, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !265, line: 16, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !265, line: 18, size: 960, elements: !349)
!349 = !{!350, !351, !363, !365, !366, !367, !368, !369, !370, !371, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !348, file: !265, line: 19, baseType: !324, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !348, file: !265, line: 21, baseType: !352, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !354, line: 297, size: 128, elements: !355)
!354 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!355 = !{!356, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !353, file: !354, line: 298, baseType: !357, size: 16)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !7, line: 409, baseType: !358)
!358 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !353, file: !354, line: 299, baseType: !360, size: 112, offset: 16)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 112, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 14)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !348, file: !265, line: 22, baseType: !364, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !7, line: 404, baseType: !17)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !348, file: !265, line: 23, baseType: !56, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !348, file: !265, line: 24, baseType: !51, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !265, line: 26, baseType: !8, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !348, file: !265, line: 28, baseType: !8, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !348, file: !265, line: 29, baseType: !8, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !348, file: !265, line: 30, baseType: !8, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !348, file: !265, line: 38, baseType: !372, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !20, line: 32, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !262}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !348, file: !265, line: 40, baseType: !9, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !348, file: !265, line: 42, baseType: !107, size: 320, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !348, file: !265, line: 43, baseType: !106, size: 32, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !348, file: !265, line: 45, baseType: !56, size: 32, offset: 736)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !348, file: !265, line: 47, baseType: !56, size: 32, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !348, file: !265, line: 49, baseType: !10, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !348, file: !265, line: 51, baseType: !346, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !348, file: !265, line: 52, baseType: !262, size: 32, offset: 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !348, file: !265, line: 54, baseType: !14, size: 32, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !348, file: !265, line: 56, baseType: !17, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !348, file: !265, line: 57, baseType: !17, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !348, file: !265, line: 58, baseType: !17, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !348, file: !265, line: 60, baseType: !17, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !348, file: !265, line: 61, baseType: !17, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !348, file: !265, line: 62, baseType: !17, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !348, file: !265, line: 63, baseType: !17, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !348, file: !265, line: 64, baseType: !17, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !348, file: !265, line: 65, baseType: !17, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !348, file: !265, line: 66, baseType: !17, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !348, file: !265, line: 67, baseType: !17, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !348, file: !265, line: 70, baseType: !17, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !348, file: !265, line: 72, baseType: !17, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !348, file: !265, line: 73, baseType: !17, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !348, file: !265, line: 74, baseType: !17, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !348, file: !265, line: 76, baseType: !17, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !348, file: !265, line: 77, baseType: !17, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !348, file: !265, line: 78, baseType: !17, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !264, file: !265, line: 135, baseType: !6, size: 32, offset: 288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !264, file: !265, line: 137, baseType: !106, size: 32, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !264, file: !265, line: 139, baseType: !210, size: 32, offset: 352)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !265, line: 141, baseType: !8, size: 32, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !264, file: !265, line: 143, baseType: !352, size: 32, offset: 416)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !264, file: !265, line: 144, baseType: !364, size: 32, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !264, file: !265, line: 145, baseType: !51, size: 64, offset: 480)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !264, file: !265, line: 147, baseType: !51, size: 64, offset: 544)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !264, file: !265, line: 148, baseType: !412, size: 16, offset: 608)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !413, line: 12, baseType: !414)
!413 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 186, baseType: !358)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !264, file: !265, line: 154, baseType: !352, size: 32, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !264, file: !265, line: 155, baseType: !364, size: 32, offset: 672)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !264, file: !265, line: 157, baseType: !25, size: 32, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !265, line: 159, baseType: !315, size: 64, offset: 736)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !264, file: !265, line: 161, baseType: !126, size: 32, offset: 800)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !264, file: !265, line: 163, baseType: !14, size: 32, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !264, file: !265, line: 165, baseType: !17, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !264, file: !265, line: 167, baseType: !17, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !264, file: !265, line: 169, baseType: !17, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !264, file: !265, line: 170, baseType: !17, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !264, file: !265, line: 171, baseType: !17, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !264, file: !265, line: 173, baseType: !17, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !264, file: !265, line: 174, baseType: !17, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !264, file: !265, line: 175, baseType: !17, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !264, file: !265, line: 176, baseType: !17, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !264, file: !265, line: 178, baseType: !17, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !264, file: !265, line: 179, baseType: !17, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !264, file: !265, line: 180, baseType: !17, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !264, file: !265, line: 181, baseType: !17, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !264, file: !265, line: 183, baseType: !17, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !249, file: !250, line: 48, baseType: !262, size: 32, offset: 480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !249, file: !250, line: 49, baseType: !14, size: 32, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !249, file: !250, line: 51, baseType: !438, size: 32, offset: 544)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !249, file: !250, line: 52, baseType: !14, size: 32, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !249, file: !250, line: 53, baseType: !14, size: 32, offset: 608)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !249, file: !250, line: 55, baseType: !315, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !249, file: !250, line: 56, baseType: !14, size: 32, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !249, file: !250, line: 58, baseType: !201, size: 160, offset: 736)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !249, file: !250, line: 59, baseType: !201, size: 160, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !249, file: !250, line: 61, baseType: !201, size: 160, offset: 1056)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !249, file: !250, line: 62, baseType: !448, size: 96, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !13, line: 32, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !13, line: 37, size: 96, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !449, file: !13, line: 38, baseType: !309, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !449, file: !13, line: 39, baseType: !309, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !449, file: !13, line: 40, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !13, line: 34, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !309, !309, !309}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !249, file: !250, line: 63, baseType: !304, size: 160, offset: 1312)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !249, file: !250, line: 65, baseType: !460, size: 224, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !461, line: 31, baseType: !462)
!461 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 25, size: 224, elements: !463)
!463 = !{!464, !472, !473, !474, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !462, file: !461, line: 26, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !461, line: 16, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !461, line: 18, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !467, file: !461, line: 19, baseType: !9, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !467, file: !461, line: 20, baseType: !14, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !461, line: 21, baseType: !465, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !462, file: !461, line: 27, baseType: !466, size: 96, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !462, file: !461, line: 28, baseType: !56, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !462, file: !461, line: 29, baseType: !14, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !462, file: !461, line: 30, baseType: !210, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !249, file: !250, line: 66, baseType: !460, size: 224, offset: 1696)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !249, file: !250, line: 68, baseType: !14, size: 32, offset: 1920)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !249, file: !250, line: 69, baseType: !14, size: 32, offset: 1952)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !249, file: !250, line: 71, baseType: !262, size: 32, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !249, file: !250, line: 72, baseType: !269, size: 32, offset: 2016)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !249, file: !250, line: 73, baseType: !269, size: 32, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !249, file: !250, line: 75, baseType: !247, size: 32, offset: 2080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !249, file: !250, line: 77, baseType: !51, size: 64, offset: 2112)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !249, file: !250, line: 78, baseType: !51, size: 64, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !249, file: !250, line: 79, baseType: !51, size: 64, offset: 2240)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !249, file: !250, line: 80, baseType: !51, size: 64, offset: 2304)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !249, file: !250, line: 81, baseType: !51, size: 64, offset: 2368)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !249, file: !250, line: 82, baseType: !51, size: 64, offset: 2432)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !196, file: !116, line: 121, baseType: !210, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !196, file: !116, line: 122, baseType: !210, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !196, file: !116, line: 123, baseType: !492, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !116, line: 103, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 98, size: 1344, elements: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !494, file: !116, line: 99, baseType: !43, size: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !494, file: !116, line: 100, baseType: !25, size: 32, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !494, file: !116, line: 101, baseType: !25, size: 32, offset: 1248)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !494, file: !116, line: 102, baseType: !14, size: 32, offset: 1280)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !196, file: !116, line: 124, baseType: !106, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !196, file: !116, line: 126, baseType: !9, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !196, file: !116, line: 127, baseType: !14, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !196, file: !116, line: 128, baseType: !14, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !196, file: !116, line: 130, baseType: !505, size: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !116, line: 112, baseType: !191)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !196, file: !116, line: 131, baseType: !143, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !186, file: !116, line: 81, baseType: !14, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !186, file: !116, line: 82, baseType: !14, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !186, file: !116, line: 83, baseType: !9, size: 32, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !171, line: 236, baseType: !14, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !170, file: !171, line: 238, baseType: !512, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DISubroutineType(types: !514)
!514 = !{!164, !106}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !170, file: !171, line: 240, baseType: !516, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DISubroutineType(types: !518)
!518 = !{!164, !247}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !170, file: !171, line: 242, baseType: !516, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !170, file: !171, line: 243, baseType: !516, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !170, file: !171, line: 244, baseType: !522, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !247}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !170, file: !171, line: 245, baseType: !522, size: 32, offset: 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !170, file: !171, line: 247, baseType: !522, size: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !170, file: !171, line: 249, baseType: !16, size: 32, offset: 544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !170, file: !171, line: 250, baseType: !16, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !170, file: !171, line: 251, baseType: !16, size: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !170, file: !171, line: 252, baseType: !16, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !170, file: !171, line: 253, baseType: !16, size: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !170, file: !171, line: 254, baseType: !16, size: 32, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !170, file: !171, line: 255, baseType: !16, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !170, file: !171, line: 256, baseType: !16, size: 32, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !536, line: 36, baseType: !537)
!536 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 24, size: 256, elements: !538)
!538 = !{!539, !543, !544, !548, !552, !553, !557, !558}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !537, file: !536, line: 25, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{!164, !194}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !537, file: !536, line: 26, baseType: !540, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !537, file: !536, line: 28, baseType: !545, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DISubroutineType(types: !547)
!547 = !{!9, !194}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !537, file: !536, line: 29, baseType: !549, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DISubroutineType(types: !551)
!551 = !{!143, !194, !9}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !537, file: !536, line: 31, baseType: !545, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !537, file: !536, line: 32, baseType: !554, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!143, !194, !9, !9}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !537, file: !536, line: 34, baseType: !545, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !537, file: !536, line: 35, baseType: !554, size: 32, offset: 224)
!559 = !{i32 2, !"Dwarf Version", i32 4}
!560 = !{i32 2, !"Debug Info Version", i32 3}
!561 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!562 = distinct !DISubprogram(name: "ngx_http_write_filter", scope: !3, file: !3, line: 48, type: !563, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1804)
!563 = !DISubroutineType(types: !564)
!564 = !{!164, !565, !18}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !567, line: 16, baseType: !568)
!567 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !569, line: 364, size: 5376, elements: !570)
!569 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!570 = !{!571, !573, !574, !575, !576, !577, !578, !583, !584, !797, !1357, !1358, !1359, !1360, !1399, !1429, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1474, !1485, !1492, !1493, !1495, !1496, !1509, !1510, !1511, !1512, !1513, !1514, !1700, !1704, !1709, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !568, file: !569, line: 365, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 191, baseType: !17)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !568, file: !569, line: 367, baseType: !262, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !568, file: !569, line: 369, baseType: !255, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !568, file: !569, line: 370, baseType: !255, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !568, file: !569, line: 371, baseType: !255, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !568, file: !569, line: 372, baseType: !255, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !568, file: !569, line: 374, baseType: !579, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !569, line: 361, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !565}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !568, file: !569, line: 375, baseType: !579, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !568, file: !569, line: 378, baseType: !585, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !567, line: 18, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !588, line: 65, size: 3008, elements: !589)
!588 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!589 = !{!590, !591, !592, !593, !597, !598, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !755, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !587, file: !588, line: 66, baseType: !43, size: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !587, file: !588, line: 67, baseType: !201, size: 160, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !587, file: !588, line: 68, baseType: !572, size: 32, offset: 1376)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !587, file: !588, line: 69, baseType: !594, size: 128, offset: 1408)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !587, file: !588, line: 70, baseType: !594, size: 128, offset: 1536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !587, file: !588, line: 72, baseType: !599, size: 32, offset: 1664)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !49, line: 18, baseType: !67)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !587, file: !588, line: 73, baseType: !94, size: 32, offset: 1696)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !587, file: !588, line: 74, baseType: !94, size: 32, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !587, file: !588, line: 75, baseType: !94, size: 32, offset: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !587, file: !588, line: 76, baseType: !94, size: 32, offset: 1792)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !587, file: !588, line: 77, baseType: !94, size: 32, offset: 1824)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !587, file: !588, line: 79, baseType: !51, size: 64, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !587, file: !588, line: 80, baseType: !51, size: 64, offset: 1920)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !587, file: !588, line: 81, baseType: !594, size: 128, offset: 1984)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !587, file: !588, line: 83, baseType: !56, size: 32, offset: 2112)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !587, file: !588, line: 84, baseType: !56, size: 32, offset: 2144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !587, file: !588, line: 85, baseType: !6, size: 32, offset: 2176)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !587, file: !588, line: 86, baseType: !6, size: 32, offset: 2208)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !587, file: !588, line: 88, baseType: !14, size: 32, offset: 2240)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !587, file: !588, line: 89, baseType: !14, size: 32, offset: 2272)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !587, file: !588, line: 90, baseType: !14, size: 32, offset: 2304)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !587, file: !588, line: 91, baseType: !14, size: 32, offset: 2336)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !587, file: !588, line: 93, baseType: !25, size: 32, offset: 2368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !587, file: !588, line: 95, baseType: !618, size: 32, offset: 2400)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !567, line: 19, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !588, line: 157, size: 544, elements: !621)
!621 = !{!622, !637, !698, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !754}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !620, file: !588, line: 158, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !588, line: 154, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 145, size: 480, elements: !626)
!626 = !{!627, !628, !629, !630, !633, !634, !635, !636}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !625, file: !588, line: 146, baseType: !448, size: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !625, file: !588, line: 147, baseType: !304, size: 160, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !625, file: !588, line: 148, baseType: !315, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !625, file: !588, line: 149, baseType: !631, size: 32, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !127, line: 106, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !625, file: !588, line: 150, baseType: !631, size: 32, offset: 352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !588, line: 151, baseType: !6, size: 32, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !625, file: !588, line: 152, baseType: !14, size: 32, offset: 416)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !625, file: !588, line: 153, baseType: !14, size: 32, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !620, file: !588, line: 159, baseType: !638, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !640, line: 59, baseType: !641)
!640 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 34, size: 800, elements: !642)
!642 = !{!643, !650, !651, !652, !660, !661, !662, !671, !672, !673, !674, !693, !694, !695, !696, !697}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !641, file: !640, line: 35, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !645, line: 21, baseType: !646)
!645 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 16, size: 64, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !646, file: !645, line: 17, baseType: !631, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !646, file: !645, line: 19, baseType: !631, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !641, file: !640, line: 37, baseType: !56, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !641, file: !640, line: 38, baseType: !56, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !641, file: !640, line: 40, baseType: !653, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !640, line: 16, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !640, line: 18, size: 96, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !655, file: !640, line: 19, baseType: !16, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !640, line: 20, baseType: !653, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !655, file: !640, line: 21, baseType: !16, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !641, file: !640, line: 41, baseType: !653, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !641, file: !640, line: 42, baseType: !654, size: 96, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !641, file: !640, line: 44, baseType: !663, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !640, line: 31, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 25, size: 128, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !665, file: !640, line: 26, baseType: !14, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !665, file: !640, line: 27, baseType: !14, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !665, file: !640, line: 29, baseType: !14, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !665, file: !640, line: 30, baseType: !14, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !641, file: !640, line: 45, baseType: !14, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !641, file: !640, line: 47, baseType: !30, size: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !641, file: !640, line: 48, baseType: !30, size: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !641, file: !640, line: 50, baseType: !675, size: 256, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !645, line: 37, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 24, size: 256, elements: !677)
!677 = !{!678, !680, !681, !682, !692}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !676, file: !645, line: 26, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !676, file: !645, line: 28, baseType: !679, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !676, file: !645, line: 29, baseType: !14, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !676, file: !645, line: 30, baseType: !683, size: 128, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !684, line: 19, baseType: !685)
!684 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 17, size: 128, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !685, file: !684, line: 18, baseType: !688, size: 128)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 128, elements: !690)
!689 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!690 = !{!691}
!691 = !DISubrange(count: 4)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !676, file: !645, line: 36, baseType: !14, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !641, file: !640, line: 52, baseType: !30, size: 32, offset: 672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !641, file: !640, line: 53, baseType: !31, size: 8, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !641, file: !640, line: 55, baseType: !17, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !641, file: !640, line: 57, baseType: !9, size: 32, offset: 736)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !641, file: !640, line: 58, baseType: !9, size: 32, offset: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !620, file: !588, line: 161, baseType: !699, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !45, line: 62, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 50, size: 384, elements: !702)
!702 = !{!703, !704, !705, !707, !712, !714, !716, !717, !718}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !45, line: 51, baseType: !51, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !701, file: !45, line: 52, baseType: !56, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !701, file: !45, line: 53, baseType: !706, size: 96, offset: 96)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !101)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !701, file: !45, line: 55, baseType: !708, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !45, line: 45, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{!10, !9}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !701, file: !45, line: 56, baseType: !713, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !45, line: 46, baseType: !709)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !701, file: !45, line: 57, baseType: !715, size: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !45, line: 47, baseType: !240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !45, line: 58, baseType: !9, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !701, file: !45, line: 60, baseType: !30, size: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !701, file: !45, line: 61, baseType: !14, size: 32, offset: 352)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !620, file: !588, line: 163, baseType: !6, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !620, file: !588, line: 164, baseType: !56, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !620, file: !588, line: 166, baseType: !94, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !620, file: !588, line: 168, baseType: !94, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !620, file: !588, line: 170, baseType: !14, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !620, file: !588, line: 171, baseType: !14, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !620, file: !588, line: 172, baseType: !10, size: 32, offset: 288)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !620, file: !588, line: 173, baseType: !10, size: 32, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !620, file: !588, line: 174, baseType: !10, size: 32, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !620, file: !588, line: 176, baseType: !14, size: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !620, file: !588, line: 177, baseType: !10, size: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !620, file: !588, line: 178, baseType: !10, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !620, file: !588, line: 180, baseType: !732, size: 32, offset: 480)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !250, line: 25, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !250, line: 29, size: 320, elements: !735)
!735 = !{!736, !737, !747, !752, !753}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !734, file: !250, line: 30, baseType: !9, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !734, file: !250, line: 31, baseType: !738, size: 192, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !739, line: 22, baseType: !740)
!739 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 16, size: 192, elements: !741)
!741 = !{!742, !743, !744, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !740, file: !739, line: 17, baseType: !30, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !740, file: !739, line: 18, baseType: !56, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !739, line: 19, baseType: !51, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !740, file: !739, line: 20, baseType: !106, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !740, file: !739, line: 21, baseType: !14, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !734, file: !250, line: 32, baseType: !748, size: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !250, line: 27, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{!164, !732, !9}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !734, file: !250, line: 33, baseType: !9, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !734, file: !250, line: 34, baseType: !14, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !620, file: !588, line: 182, baseType: !14, size: 32, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !587, file: !588, line: 96, baseType: !756, size: 32, offset: 2432)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !588, line: 62, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 39, size: 576, elements: !759)
!759 = !{!760, !761, !762, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !758, file: !588, line: 40, baseType: !304, size: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !758, file: !588, line: 41, baseType: !315, size: 64, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !758, file: !588, line: 43, baseType: !763, size: 96, offset: 224)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 12)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !758, file: !588, line: 46, baseType: !17, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !758, file: !588, line: 47, baseType: !17, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !758, file: !588, line: 48, baseType: !17, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !758, file: !588, line: 49, baseType: !17, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !758, file: !588, line: 50, baseType: !17, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !758, file: !588, line: 51, baseType: !17, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !758, file: !588, line: 52, baseType: !17, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !758, file: !588, line: 53, baseType: !17, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !758, file: !588, line: 56, baseType: !599, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !758, file: !588, line: 57, baseType: !94, size: 32, offset: 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !758, file: !588, line: 58, baseType: !94, size: 32, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !758, file: !588, line: 59, baseType: !56, size: 32, offset: 480)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !758, file: !588, line: 60, baseType: !6, size: 32, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !758, file: !588, line: 61, baseType: !10, size: 32, offset: 544)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !587, file: !588, line: 102, baseType: !10, size: 32, offset: 2464)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !587, file: !588, line: 103, baseType: !10, size: 32, offset: 2496)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !587, file: !588, line: 104, baseType: !10, size: 32, offset: 2528)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !587, file: !588, line: 105, baseType: !10, size: 32, offset: 2560)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !587, file: !588, line: 107, baseType: !270, size: 384, offset: 2592)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !587, file: !588, line: 109, baseType: !17, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !587, file: !588, line: 110, baseType: !17, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !587, file: !588, line: 112, baseType: !17, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !587, file: !588, line: 113, baseType: !17, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !587, file: !588, line: 114, baseType: !17, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !587, file: !588, line: 115, baseType: !17, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !587, file: !588, line: 116, baseType: !17, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !587, file: !588, line: 117, baseType: !17, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !587, file: !588, line: 118, baseType: !17, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !587, file: !588, line: 119, baseType: !17, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !587, file: !588, line: 121, baseType: !17, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !587, file: !588, line: 122, baseType: !17, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !568, file: !569, line: 381, baseType: !798, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !567, line: 17, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !801, line: 313, size: 4096, elements: !802)
!801 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!802 = !{!803, !808, !809, !850, !929, !930, !952, !961, !1084, !1085, !1086, !1124, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1302, !1306, !1307, !1311, !1312, !1313, !1314, !1315, !1319, !1323, !1327, !1328, !1340, !1341, !1342, !1343, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !800, file: !801, line: 314, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !801, line: 309, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !565, !798}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !800, file: !801, line: 315, baseType: !804, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !800, file: !801, line: 317, baseType: !810, size: 480, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !811, line: 22, baseType: !812)
!811 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !811, line: 36, size: 480, elements: !813)
!813 = !{!814, !815, !816, !817, !819, !820, !821, !827, !832, !834, !835, !844, !845, !846, !847, !848, !849}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !812, file: !811, line: 37, baseType: !262, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !812, file: !811, line: 39, baseType: !352, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !812, file: !811, line: 40, baseType: !364, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !812, file: !811, line: 41, baseType: !818, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !812, file: !811, line: 43, baseType: !14, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !812, file: !811, line: 44, baseType: !10, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !812, file: !811, line: 46, baseType: !822, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !811, line: 24, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!164, !826, !9}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !812, file: !811, line: 47, baseType: !828, size: 32, offset: 224)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !811, line: 26, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !826, !9, !14}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !812, file: !811, line: 48, baseType: !833, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !811, line: 28, baseType: !829)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !811, line: 49, baseType: !9, size: 32, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !812, file: !811, line: 56, baseType: !836, size: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !838, line: 78, baseType: !839)
!838 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !838, line: 74, size: 128, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !839, file: !838, line: 75, baseType: !352, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !839, file: !838, line: 76, baseType: !364, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !838, line: 77, baseType: !51, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !812, file: !811, line: 58, baseType: !8, size: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !812, file: !811, line: 59, baseType: !8, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !812, file: !811, line: 61, baseType: !106, size: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !812, file: !811, line: 63, baseType: !17, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !812, file: !811, line: 64, baseType: !17, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !812, file: !811, line: 67, baseType: !17, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !800, file: !801, line: 319, baseType: !851, size: 32, offset: 544)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
