; ModuleID = 'src/http/ngx_http_file_cache.c'
source_filename = "src/http/ngx_http_file_cache.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_cache_status", scope: !2, file: !3, line: 68, type: !1831, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1803)
!3 = !DIFile(filename: "src/http/ngx_http_file_cache.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !28, !34, !46, !47, !50, !51, !19, !52, !56, !239, !240, !244, !620, !1802, !96, !501, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_header_t", file: !9, line: 142, baseType: !10)
!9 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 126, size: 2464, elements: !11)
!11 = !{!12, !18, !21, !22, !23, !24, !25, !27, !31, !32, !33, !36, !40, !41, !42}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !10, file: !9, line: 127, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !14, line: 79, baseType: !15)
!14 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 125, baseType: !17)
!16 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !10, file: !9, line: 128, baseType: !19, size: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !16, line: 75, baseType: !20)
!20 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !10, file: !9, line: 129, baseType: !19, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !10, file: !9, line: 130, baseType: !19, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !10, file: !9, line: 131, baseType: !19, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !10, file: !9, line: 132, baseType: !19, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !10, file: !9, line: 133, baseType: !26, size: 32, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 191, baseType: !17)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !10, file: !9, line: 134, baseType: !28, size: 16, offset: 224)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !29, line: 65, baseType: !30)
!29 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !10, file: !9, line: 135, baseType: !28, size: 16, offset: 240)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !10, file: !9, line: 136, baseType: !28, size: 16, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "etag_len", scope: !10, file: !9, line: 137, baseType: !34, size: 8, offset: 272)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !29, line: 64, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !10, file: !9, line: 138, baseType: !37, size: 1024, offset: 280)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1024, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vary_len", scope: !10, file: !9, line: 139, baseType: !34, size: 8, offset: 1304)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !10, file: !9, line: 140, baseType: !37, size: 1024, offset: 1312)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !10, file: !9, line: 141, baseType: !43, size: 128, offset: 2336)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 128, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 16)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 120, baseType: !17)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !53, line: 16, baseType: !54)
!53 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !55, line: 16, baseType: !13)
!55 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !58, line: 22, baseType: !59)
!58 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 16, size: 160, elements: !60)
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !59, file: !58, line: 17, baseType: !6, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !59, file: !58, line: 18, baseType: !13, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !58, line: 19, baseType: !50, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !59, file: !58, line: 20, baseType: !13, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !59, file: !58, line: 21, baseType: !66, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !68, line: 18, baseType: !69)
!68 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !70, line: 57, size: 320, elements: !71)
!70 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = !{!72, !80, !81, !82, !219, !226, !238}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !69, file: !70, line: 58, baseType: !73, size: 128)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !70, line: 54, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 49, size: 128, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !74, file: !70, line: 50, baseType: !46, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !74, file: !70, line: 51, baseType: !46, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !70, line: 52, baseType: !66, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !74, file: !70, line: 53, baseType: !13, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !69, file: !70, line: 59, baseType: !50, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !69, file: !70, line: 60, baseType: !66, size: 32, offset: 160)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !69, file: !70, line: 61, baseType: !83, size: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !68, line: 19, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !86, line: 59, size: 64, elements: !87)
!86 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = !{!88, !218}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !85, file: !86, line: 60, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !86, line: 18, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !86, line: 20, size: 352, elements: !92)
!92 = !{!93, !94, !95, !97, !98, !99, !100, !102, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !91, file: !86, line: 21, baseType: !46, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !91, file: !86, line: 22, baseType: !46, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !91, file: !86, line: 23, baseType: !96, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !16, line: 222, baseType: !51)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !91, file: !86, line: 24, baseType: !96, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !91, file: !86, line: 26, baseType: !46, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !91, file: !86, line: 27, baseType: !46, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !91, file: !86, line: 28, baseType: !101, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !86, line: 16, baseType: !6)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !91, file: !86, line: 29, baseType: !103, size: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !68, line: 23, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !106, line: 16, size: 1216, elements: !107)
!106 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = !{!108, !111, !118, !161, !162, !163, !203, !204}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !105, file: !106, line: 17, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !110, line: 16, baseType: !51)
!110 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 18, baseType: !112, size: 64, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !113, line: 19, baseType: !114)
!113 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 16, size: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !113, line: 17, baseType: !50, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !113, line: 18, baseType: !46, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !105, file: !106, line: 19, baseType: !119, size: 960, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !110, line: 17, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !121, line: 4, size: 960, elements: !122)
!121 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !{!123, !125, !126, !128, !129, !131, !132, !134, !136, !138, !139, !140, !141, !142, !143, !145, !146, !148, !149, !154, !155, !156}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !120, file: !121, line: 6, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !16, line: 232, baseType: !17)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !120, file: !121, line: 7, baseType: !124, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !120, file: !121, line: 8, baseType: !127, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !16, line: 227, baseType: !17)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !120, file: !121, line: 9, baseType: !127, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !120, file: !121, line: 10, baseType: !130, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !16, line: 217, baseType: !17)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !120, file: !121, line: 11, baseType: !130, size: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !120, file: !121, line: 13, baseType: !133, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !16, line: 212, baseType: !17)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !120, file: !121, line: 14, baseType: !135, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !16, line: 304, baseType: !17)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !120, file: !121, line: 15, baseType: !137, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !16, line: 309, baseType: !17)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !120, file: !121, line: 16, baseType: !17, size: 32, offset: 288)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !120, file: !121, line: 17, baseType: !124, size: 32, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !120, file: !121, line: 18, baseType: !124, size: 32, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !120, file: !121, line: 19, baseType: !96, size: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !120, file: !121, line: 20, baseType: !96, size: 32, offset: 416)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !120, file: !121, line: 21, baseType: !144, size: 32, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !16, line: 237, baseType: !20)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !120, file: !121, line: 22, baseType: !144, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !120, file: !121, line: 23, baseType: !147, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !16, line: 242, baseType: !51)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !120, file: !121, line: 24, baseType: !147, size: 32, offset: 544)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !120, file: !121, line: 26, baseType: !150, size: 64, offset: 576)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !16, line: 288, size: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !150, file: !16, line: 288, baseType: !19, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !150, file: !16, line: 288, baseType: !20, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !120, file: !121, line: 27, baseType: !150, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !120, file: !121, line: 28, baseType: !150, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !120, file: !121, line: 29, baseType: !157, size: 192, offset: 768)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 192, elements: !159)
!158 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!159 = !{!160}
!160 = !DISubrange(count: 3)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !105, file: !106, line: 21, baseType: !96, size: 32, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !105, file: !106, line: 22, baseType: !96, size: 32, offset: 1120)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !105, file: !106, line: 24, baseType: !164, size: 32, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !68, line: 20, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !167, line: 50, size: 320, elements: !168)
!167 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!168 = !{!169, !170, !183, !187, !188, !193, !194, !199, !200, !202}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !166, file: !167, line: 51, baseType: !13, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !166, file: !167, line: 52, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !68, line: 21, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !174, line: 89, size: 160, elements: !175)
!174 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!175 = !{!176, !177, !178, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !173, file: !174, line: 90, baseType: !109, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !174, line: 91, baseType: !112, size: 64, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !173, file: !174, line: 93, baseType: !179, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !171, !164}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !174, line: 94, baseType: !6, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !166, file: !167, line: 54, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !185, line: 98, baseType: !186)
!185 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !166, file: !167, line: 56, baseType: !19, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !166, file: !167, line: 58, baseType: !189, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !167, line: 45, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!46, !164, !46, !50}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 59, baseType: !6, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !166, file: !167, line: 61, baseType: !195, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !167, line: 46, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !164, !13, !46, !50}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !166, file: !167, line: 62, baseType: !6, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !166, file: !167, line: 70, baseType: !201, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !167, line: 72, baseType: !164, size: 32, offset: 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !105, file: !106, line: 37, baseType: !17, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !105, file: !106, line: 38, baseType: !17, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !91, file: !86, line: 30, baseType: !89, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !91, file: !86, line: 34, baseType: !17, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !91, file: !86, line: 40, baseType: !17, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !91, file: !86, line: 43, baseType: !17, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !91, file: !86, line: 45, baseType: !17, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !91, file: !86, line: 46, baseType: !17, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !91, file: !86, line: 47, baseType: !17, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !91, file: !86, line: 48, baseType: !17, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !91, file: !86, line: 49, baseType: !17, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !91, file: !86, line: 50, baseType: !17, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !91, file: !86, line: 52, baseType: !17, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !91, file: !86, line: 53, baseType: !17, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !91, file: !86, line: 55, baseType: !51, size: 32, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !86, line: 61, baseType: !83, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !69, file: !70, line: 62, baseType: !220, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !70, line: 41, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !70, line: 43, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !70, line: 44, baseType: !220, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !222, file: !70, line: 45, baseType: !6, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !69, file: !70, line: 63, baseType: !227, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !70, line: 32, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !70, line: 34, size: 96, elements: !230)
!230 = !{!231, !236, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !229, file: !70, line: 35, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !70, line: 30, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !6}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !70, line: 36, baseType: !6, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !70, line: 37, baseType: !227, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !69, file: !70, line: 64, baseType: !164, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !53, line: 17, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !55, line: 17, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !14, line: 78, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !16, line: 140, baseType: !51)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_ctx_t", file: !246, line: 20, baseType: !247)
!246 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_log_ctx_s", file: !246, line: 52, size: 96, elements: !248)
!248 = !{!249, !422, !1801}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !247, file: !246, line: 53, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !68, line: 26, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !253, line: 121, size: 896, elements: !254)
!253 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!254 = !{!255, !256, !310, !311, !314, !321, !323, !328, !333, !390, !391, !392, !393, !394, !395, !396, !397, !398, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !253, line: 122, baseType: !6, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !252, file: !253, line: 123, baseType: !257, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !68, line: 24, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !260, line: 30, size: 384, elements: !261)
!260 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !289, !290, !291, !302}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !260, line: 31, baseType: !6, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !259, file: !260, line: 33, baseType: !17, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !259, file: !260, line: 35, baseType: !17, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !259, file: !260, line: 38, baseType: !17, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !259, file: !260, line: 44, baseType: !17, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !259, file: !260, line: 46, baseType: !17, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !259, file: !260, line: 49, baseType: !17, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !259, file: !260, line: 51, baseType: !17, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !259, file: !260, line: 54, baseType: !17, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !259, file: !260, line: 56, baseType: !17, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !259, file: !260, line: 57, baseType: !17, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !259, file: !260, line: 59, baseType: !17, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !259, file: !260, line: 60, baseType: !17, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !259, file: !260, line: 62, baseType: !17, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !259, file: !260, line: 64, baseType: !17, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !259, file: !260, line: 67, baseType: !17, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !259, file: !260, line: 69, baseType: !17, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !259, file: !260, line: 71, baseType: !17, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !259, file: !260, line: 74, baseType: !17, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !259, file: !260, line: 75, baseType: !17, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !259, file: !260, line: 77, baseType: !17, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !259, file: !260, line: 107, baseType: !17, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !259, file: !260, line: 110, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !68, line: 31, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !257}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !259, file: !260, line: 117, baseType: !13, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !259, file: !260, line: 119, baseType: !164, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !259, file: !260, line: 121, baseType: !292, size: 160, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !55, line: 20, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !55, line: 22, size: 160, elements: !294)
!294 = !{!295, !296, !298, !299, !300, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !293, file: !55, line: 23, baseType: !54, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !293, file: !55, line: 24, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !293, file: !55, line: 25, baseType: !297, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !293, file: !55, line: 26, baseType: !297, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !293, file: !55, line: 27, baseType: !34, size: 8, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !55, line: 28, baseType: !34, size: 8, offset: 136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !259, file: !260, line: 124, baseType: !303, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !304, line: 16, baseType: !305)
!304 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !304, line: 18, size: 64, elements: !306)
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !304, line: 19, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !304, line: 20, baseType: !308, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !252, file: !253, line: 124, baseType: !257, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !252, file: !253, line: 126, baseType: !312, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !313, line: 17, baseType: !51)
!313 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !252, file: !253, line: 128, baseType: !315, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !316, line: 19, baseType: !317)
!316 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !250, !46, !50}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !16, line: 135, baseType: !51)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !252, file: !253, line: 129, baseType: !322, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !316, line: 22, baseType: !317)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !252, file: !253, line: 130, baseType: !324, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !316, line: 20, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{!320, !250, !83, !96}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !252, file: !253, line: 131, baseType: !329, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !316, line: 23, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DISubroutineType(types: !332)
!332 = !{!83, !250, !83, !96}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !252, file: !253, line: 133, baseType: !334, size: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !253, line: 16, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !253, line: 18, size: 960, elements: !337)
!337 = !{!338, !339, !350, !352, !353, !354, !355, !356, !357, !358, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !336, file: !253, line: 19, baseType: !312, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !336, file: !253, line: 21, baseType: !340, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !342, line: 297, size: 128, elements: !343)
!342 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !341, file: !342, line: 298, baseType: !345, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !16, line: 409, baseType: !30)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !341, file: !342, line: 299, baseType: !347, size: 112, offset: 16)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 112, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 14)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !336, file: !253, line: 22, baseType: !351, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !16, line: 404, baseType: !17)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !336, file: !253, line: 23, baseType: !50, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !336, file: !253, line: 24, baseType: !112, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !253, line: 26, baseType: !51, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !336, file: !253, line: 28, baseType: !51, size: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !336, file: !253, line: 29, baseType: !51, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !336, file: !253, line: 30, baseType: !51, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !336, file: !253, line: 38, baseType: !359, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !68, line: 32, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !250}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !336, file: !253, line: 40, baseType: !6, size: 32, offset: 352)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !336, file: !253, line: 42, baseType: !165, size: 320, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !336, file: !253, line: 43, baseType: !164, size: 32, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !336, file: !253, line: 45, baseType: !50, size: 32, offset: 736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !336, file: !253, line: 47, baseType: !50, size: 32, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !336, file: !253, line: 49, baseType: !52, size: 32, offset: 800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !336, file: !253, line: 51, baseType: !334, size: 32, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !336, file: !253, line: 52, baseType: !250, size: 32, offset: 864)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !336, file: !253, line: 54, baseType: !13, size: 32, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !336, file: !253, line: 56, baseType: !17, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !336, file: !253, line: 57, baseType: !17, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !336, file: !253, line: 58, baseType: !17, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !336, file: !253, line: 60, baseType: !17, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !336, file: !253, line: 61, baseType: !17, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !336, file: !253, line: 62, baseType: !17, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !336, file: !253, line: 63, baseType: !17, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !336, file: !253, line: 64, baseType: !17, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !336, file: !253, line: 65, baseType: !17, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !336, file: !253, line: 66, baseType: !17, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !336, file: !253, line: 67, baseType: !17, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !336, file: !253, line: 70, baseType: !17, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !336, file: !253, line: 72, baseType: !17, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !336, file: !253, line: 73, baseType: !17, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !336, file: !253, line: 74, baseType: !17, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !336, file: !253, line: 76, baseType: !17, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !336, file: !253, line: 77, baseType: !17, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !336, file: !253, line: 78, baseType: !17, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !252, file: !253, line: 135, baseType: !96, size: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !252, file: !253, line: 137, baseType: !164, size: 32, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !252, file: !253, line: 139, baseType: !66, size: 32, offset: 352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !252, file: !253, line: 141, baseType: !51, size: 32, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !252, file: !253, line: 143, baseType: !340, size: 32, offset: 416)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !252, file: !253, line: 144, baseType: !351, size: 32, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !252, file: !253, line: 145, baseType: !112, size: 64, offset: 480)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !252, file: !253, line: 147, baseType: !112, size: 64, offset: 544)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !252, file: !253, line: 148, baseType: !399, size: 16, offset: 608)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !400, line: 12, baseType: !401)
!400 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 186, baseType: !30)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !252, file: !253, line: 154, baseType: !340, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !252, file: !253, line: 155, baseType: !351, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !252, file: !253, line: 157, baseType: !89, size: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !252, file: !253, line: 159, baseType: !303, size: 64, offset: 736)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !252, file: !253, line: 161, baseType: !184, size: 32, offset: 800)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !252, file: !253, line: 163, baseType: !13, size: 32, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !252, file: !253, line: 165, baseType: !17, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !252, file: !253, line: 167, baseType: !17, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !252, file: !253, line: 169, baseType: !17, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !252, file: !253, line: 170, baseType: !17, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !252, file: !253, line: 171, baseType: !17, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !252, file: !253, line: 173, baseType: !17, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !252, file: !253, line: 174, baseType: !17, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !252, file: !253, line: 175, baseType: !17, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !252, file: !253, line: 176, baseType: !17, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !252, file: !253, line: 178, baseType: !17, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !252, file: !253, line: 179, baseType: !17, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !252, file: !253, line: 180, baseType: !17, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !252, file: !253, line: 181, baseType: !17, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !252, file: !253, line: 183, baseType: !17, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !247, file: !246, line: 54, baseType: !423, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !246, line: 16, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !426, line: 364, size: 5376, elements: !427)
!426 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!427 = !{!428, !429, !430, !432, !433, !434, !435, !440, !441, !661, !1353, !1354, !1355, !1356, !1395, !1425, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1470, !1481, !1488, !1489, !1491, !1492, !1505, !1506, !1507, !1508, !1509, !1510, !1697, !1701, !1706, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !425, file: !426, line: 365, baseType: !26, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !425, file: !426, line: 367, baseType: !250, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !425, file: !426, line: 369, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !425, file: !426, line: 370, baseType: !431, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !425, file: !426, line: 371, baseType: !431, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !425, file: !426, line: 372, baseType: !431, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !425, file: !426, line: 374, baseType: !436, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !426, line: 361, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !423}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !425, file: !426, line: 375, baseType: !436, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !425, file: !426, line: 378, baseType: !442, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !246, line: 18, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !9, line: 65, size: 3008, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !619, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !444, file: !9, line: 66, baseType: !104, size: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !444, file: !9, line: 67, baseType: !57, size: 160, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !444, file: !9, line: 68, baseType: !26, size: 32, offset: 1376)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !444, file: !9, line: 69, baseType: !43, size: 128, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !444, file: !9, line: 70, baseType: !43, size: 128, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !444, file: !9, line: 72, baseType: !452, size: 32, offset: 1664)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !110, line: 18, baseType: !127)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !444, file: !9, line: 73, baseType: !19, size: 32, offset: 1696)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !444, file: !9, line: 74, baseType: !19, size: 32, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !444, file: !9, line: 75, baseType: !19, size: 32, offset: 1760)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !444, file: !9, line: 76, baseType: !19, size: 32, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !444, file: !9, line: 77, baseType: !19, size: 32, offset: 1824)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !444, file: !9, line: 79, baseType: !112, size: 64, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !444, file: !9, line: 80, baseType: !112, size: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !444, file: !9, line: 81, baseType: !43, size: 128, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !444, file: !9, line: 83, baseType: !50, size: 32, offset: 2112)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !444, file: !9, line: 84, baseType: !50, size: 32, offset: 2144)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !444, file: !9, line: 85, baseType: !96, size: 32, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !444, file: !9, line: 86, baseType: !96, size: 32, offset: 2208)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !444, file: !9, line: 88, baseType: !13, size: 32, offset: 2240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !444, file: !9, line: 89, baseType: !13, size: 32, offset: 2272)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !444, file: !9, line: 90, baseType: !13, size: 32, offset: 2304)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !444, file: !9, line: 91, baseType: !13, size: 32, offset: 2336)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !444, file: !9, line: 93, baseType: !89, size: 32, offset: 2368)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !444, file: !9, line: 95, baseType: !471, size: 32, offset: 2400)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !246, line: 19, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !9, line: 157, size: 544, elements: !474)
!474 = !{!475, !500, !561, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !618}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !473, file: !9, line: 158, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !9, line: 154, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 145, size: 480, elements: !479)
!479 = !{!480, !491, !492, !493, !496, !497, !498, !499}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !478, file: !9, line: 146, baseType: !481, size: 96)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !55, line: 32, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !55, line: 37, size: 96, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !482, file: !55, line: 38, baseType: !297, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !482, file: !55, line: 39, baseType: !297, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !482, file: !55, line: 40, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !55, line: 34, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !297, !297, !297}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !478, file: !9, line: 147, baseType: !292, size: 160, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !478, file: !9, line: 148, baseType: !303, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !478, file: !9, line: 149, baseType: !494, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !185, line: 106, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !478, file: !9, line: 150, baseType: !494, size: 32, offset: 352)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !478, file: !9, line: 151, baseType: !96, size: 32, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !478, file: !9, line: 152, baseType: !13, size: 32, offset: 416)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !478, file: !9, line: 153, baseType: !13, size: 32, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !473, file: !9, line: 159, baseType: !501, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !503, line: 59, baseType: !504)
!503 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 34, size: 800, elements: !505)
!505 = !{!506, !513, !514, !515, !523, !524, !525, !534, !535, !536, !537, !556, !557, !558, !559, !560}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !504, file: !503, line: 35, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !508, line: 21, baseType: !509)
!508 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 16, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !509, file: !508, line: 17, baseType: !494, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !509, file: !508, line: 19, baseType: !494, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !504, file: !503, line: 37, baseType: !50, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !504, file: !503, line: 38, baseType: !50, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !504, file: !503, line: 40, baseType: !516, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !503, line: 16, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !503, line: 18, size: 96, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !518, file: !503, line: 19, baseType: !15, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !503, line: 20, baseType: !516, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !518, file: !503, line: 21, baseType: !15, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !504, file: !503, line: 41, baseType: !516, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !504, file: !503, line: 42, baseType: !517, size: 96, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !504, file: !503, line: 44, baseType: !526, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !503, line: 31, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 25, size: 128, elements: !529)
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !528, file: !503, line: 26, baseType: !13, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !528, file: !503, line: 27, baseType: !13, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !528, file: !503, line: 29, baseType: !13, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !528, file: !503, line: 30, baseType: !13, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !504, file: !503, line: 45, baseType: !13, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !504, file: !503, line: 47, baseType: !46, size: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !504, file: !503, line: 48, baseType: !46, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !504, file: !503, line: 50, baseType: !538, size: 256, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !508, line: 37, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 24, size: 256, elements: !540)
!540 = !{!541, !543, !544, !545, !555}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !539, file: !508, line: 26, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !539, file: !508, line: 28, baseType: !542, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !539, file: !508, line: 29, baseType: !13, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !539, file: !508, line: 30, baseType: !546, size: 128, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !547, line: 19, baseType: !548)
!547 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 17, size: 128, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !548, file: !547, line: 18, baseType: !551, size: 128)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !553)
!552 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!553 = !{!554}
!554 = !DISubrange(count: 4)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !539, file: !508, line: 36, baseType: !13, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !504, file: !503, line: 52, baseType: !46, size: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !504, file: !503, line: 53, baseType: !34, size: 8, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !504, file: !503, line: 55, baseType: !17, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !504, file: !503, line: 57, baseType: !6, size: 32, offset: 736)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !504, file: !503, line: 58, baseType: !6, size: 32, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !473, file: !9, line: 161, baseType: !562, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !106, line: 62, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 50, size: 384, elements: !565)
!565 = !{!566, !567, !568, !570, !575, !577, !579, !580, !581}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !106, line: 51, baseType: !112, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !564, file: !106, line: 52, baseType: !50, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !564, file: !106, line: 53, baseType: !569, size: 96, offset: 96)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 96, elements: !159)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !564, file: !106, line: 55, baseType: !571, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !106, line: 45, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{!52, !6}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !564, file: !106, line: 56, baseType: !576, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !106, line: 46, baseType: !572)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !564, file: !106, line: 57, baseType: !578, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !106, line: 47, baseType: !233)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !106, line: 58, baseType: !6, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !564, file: !106, line: 60, baseType: !46, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !564, file: !106, line: 61, baseType: !13, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !473, file: !9, line: 163, baseType: !96, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !473, file: !9, line: 164, baseType: !50, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !473, file: !9, line: 166, baseType: !19, size: 32, offset: 160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !473, file: !9, line: 168, baseType: !19, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !473, file: !9, line: 170, baseType: !13, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !473, file: !9, line: 171, baseType: !13, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !473, file: !9, line: 172, baseType: !52, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !473, file: !9, line: 173, baseType: !52, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !473, file: !9, line: 174, baseType: !52, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !473, file: !9, line: 176, baseType: !13, size: 32, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !473, file: !9, line: 177, baseType: !52, size: 32, offset: 416)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !473, file: !9, line: 178, baseType: !52, size: 32, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !473, file: !9, line: 180, baseType: !595, size: 32, offset: 480)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !597, line: 25, baseType: !598)
!597 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !597, line: 29, size: 320, elements: !599)
!599 = !{!600, !601, !611, !616, !617}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !597, line: 30, baseType: !6, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !598, file: !597, line: 31, baseType: !602, size: 192, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !603, line: 22, baseType: !604)
!603 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 16, size: 192, elements: !605)
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !604, file: !603, line: 17, baseType: !46, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !603, line: 18, baseType: !50, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !603, line: 19, baseType: !112, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !604, file: !603, line: 20, baseType: !164, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !604, file: !603, line: 21, baseType: !13, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !598, file: !597, line: 32, baseType: !612, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !597, line: 27, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{!242, !595, !6}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !598, file: !597, line: 33, baseType: !6, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !598, file: !597, line: 34, baseType: !13, size: 32, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !473, file: !9, line: 182, baseType: !13, size: 32, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !444, file: !9, line: 96, baseType: !620, size: 32, offset: 2432)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !9, line: 62, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 39, size: 576, elements: !623)
!623 = !{!624, !625, !626, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !622, file: !9, line: 40, baseType: !292, size: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !622, file: !9, line: 41, baseType: !303, size: 64, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !622, file: !9, line: 43, baseType: !627, size: 96, offset: 224)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 96, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 12)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !622, file: !9, line: 46, baseType: !17, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !622, file: !9, line: 47, baseType: !17, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !622, file: !9, line: 48, baseType: !17, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !622, file: !9, line: 49, baseType: !17, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !622, file: !9, line: 50, baseType: !17, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !622, file: !9, line: 51, baseType: !17, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !622, file: !9, line: 52, baseType: !17, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !622, file: !9, line: 53, baseType: !17, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !622, file: !9, line: 56, baseType: !452, size: 32, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !622, file: !9, line: 57, baseType: !19, size: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !622, file: !9, line: 58, baseType: !19, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !622, file: !9, line: 59, baseType: !50, size: 32, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !622, file: !9, line: 60, baseType: !96, size: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !622, file: !9, line: 61, baseType: !52, size: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !444, file: !9, line: 102, baseType: !52, size: 32, offset: 2464)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !444, file: !9, line: 103, baseType: !52, size: 32, offset: 2496)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !444, file: !9, line: 104, baseType: !52, size: 32, offset: 2528)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !444, file: !9, line: 105, baseType: !52, size: 32, offset: 2560)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !444, file: !9, line: 107, baseType: !258, size: 384, offset: 2592)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !444, file: !9, line: 109, baseType: !17, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !444, file: !9, line: 110, baseType: !17, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !444, file: !9, line: 112, baseType: !17, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !444, file: !9, line: 113, baseType: !17, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !444, file: !9, line: 114, baseType: !17, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !444, file: !9, line: 115, baseType: !17, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !444, file: !9, line: 116, baseType: !17, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !444, file: !9, line: 117, baseType: !17, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !444, file: !9, line: 118, baseType: !17, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !444, file: !9, line: 119, baseType: !17, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !444, file: !9, line: 121, baseType: !17, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !444, file: !9, line: 122, baseType: !17, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !425, file: !426, line: 381, baseType: !662, size: 32, offset: 288)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !246, line: 17, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !665, line: 313, size: 4096, elements: !666)
!665 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!666 = !{!667, !672, !673, !714, !793, !794, !816, !825, !1080, !1081, !1082, !1120, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1298, !1302, !1303, !1307, !1308, !1309, !1310, !1311, !1315, !1319, !1323, !1324, !1336, !1337, !1338, !1339, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !664, file: !665, line: 314, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !665, line: 309, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !423, !662}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !664, file: !665, line: 315, baseType: !668, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !664, file: !665, line: 317, baseType: !674, size: 480, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !675, line: 22, baseType: !676)
!675 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !675, line: 36, size: 480, elements: !677)
!677 = !{!678, !679, !680, !681, !683, !684, !685, !691, !696, !698, !699, !708, !709, !710, !711, !712, !713}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !676, file: !675, line: 37, baseType: !250, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !676, file: !675, line: 39, baseType: !340, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !676, file: !675, line: 40, baseType: !351, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !675, line: 41, baseType: !682, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !676, file: !675, line: 43, baseType: !13, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !676, file: !675, line: 44, baseType: !52, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !676, file: !675, line: 46, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !675, line: 24, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{!242, !690, !6}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !676, file: !675, line: 47, baseType: !692, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !675, line: 26, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !690, !6, !13}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !676, file: !675, line: 48, baseType: !697, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !675, line: 28, baseType: !693)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !676, file: !675, line: 49, baseType: !6, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !676, file: !675, line: 56, baseType: !700, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !702, line: 78, baseType: !703)
!702 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 74, size: 128, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !703, file: !702, line: 75, baseType: !340, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !703, file: !702, line: 76, baseType: !351, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !703, file: !702, line: 77, baseType: !112, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !675, line: 58, baseType: !51, size: 32, offset: 352)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !676, file: !675, line: 59, baseType: !51, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !676, file: !675, line: 61, baseType: !164, size: 32, offset: 416)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !676, file: !675, line: 63, baseType: !17, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !676, file: !675, line: 64, baseType: !17, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !676, file: !675, line: 67, baseType: !17, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !664, file: !665, line: 319, baseType: !715, size: 32, offset: 544)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !717, line: 17, baseType: !718)
!717 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !717, line: 25, size: 1120, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !726, !727, !728, !729, !730, !735, !736, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !792}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !718, file: !717, line: 26, baseType: !250, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !718, file: !717, line: 27, baseType: !250, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !718, file: !717, line: 29, baseType: !83, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !718, file: !717, line: 30, baseType: !83, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !718, file: !717, line: 31, baseType: !725, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !718, file: !717, line: 33, baseType: !83, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !718, file: !717, line: 35, baseType: !83, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !718, file: !717, line: 36, baseType: !83, size: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !718, file: !717, line: 37, baseType: !83, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !718, file: !717, line: 44, baseType: !731, size: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !717, line: 19, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!242, !715, !89}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !718, file: !717, line: 45, baseType: !6, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !718, file: !717, line: 47, baseType: !737, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !717, line: 21, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!242, !6, !83}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !718, file: !717, line: 48, baseType: !6, size: 32, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !718, file: !717, line: 57, baseType: !17, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !718, file: !717, line: 58, baseType: !17, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !718, file: !717, line: 59, baseType: !17, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !718, file: !717, line: 60, baseType: !17, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !718, file: !717, line: 61, baseType: !17, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !718, file: !717, line: 62, baseType: !17, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !718, file: !717, line: 63, baseType: !17, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !718, file: !717, line: 64, baseType: !17, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !718, file: !717, line: 65, baseType: !17, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !718, file: !717, line: 66, baseType: !17, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !718, file: !717, line: 67, baseType: !17, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !718, file: !717, line: 68, baseType: !17, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !718, file: !717, line: 70, baseType: !242, size: 32, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !718, file: !717, line: 71, baseType: !756, size: 64, offset: 480)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !86, line: 68, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 65, size: 64, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !757, file: !86, line: 66, baseType: !242, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !86, line: 67, baseType: !50, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !718, file: !717, line: 72, baseType: !101, size: 32, offset: 544)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !718, file: !717, line: 74, baseType: !320, size: 32, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !718, file: !717, line: 76, baseType: !96, size: 32, offset: 608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !718, file: !717, line: 77, baseType: !96, size: 32, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !718, file: !717, line: 79, baseType: !96, size: 32, offset: 672)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !718, file: !717, line: 80, baseType: !320, size: 32, offset: 704)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !718, file: !717, line: 82, baseType: !52, size: 32, offset: 736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !718, file: !717, line: 83, baseType: !52, size: 32, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !718, file: !717, line: 84, baseType: !320, size: 32, offset: 800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !718, file: !717, line: 86, baseType: !66, size: 32, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !718, file: !717, line: 87, baseType: !164, size: 32, offset: 864)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !718, file: !717, line: 89, baseType: !83, size: 32, offset: 896)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !718, file: !717, line: 90, baseType: !50, size: 32, offset: 928)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !718, file: !717, line: 91, baseType: !89, size: 32, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !718, file: !717, line: 93, baseType: !50, size: 32, offset: 992)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !718, file: !717, line: 94, baseType: !19, size: 32, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !718, file: !717, line: 96, baseType: !778, size: 32, offset: 1056)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !106, line: 84, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 71, size: 1408, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !780, file: !106, line: 72, baseType: !104, size: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !780, file: !106, line: 73, baseType: !96, size: 32, offset: 1216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !780, file: !106, line: 74, baseType: !562, size: 32, offset: 1248)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !780, file: !106, line: 75, baseType: !66, size: 32, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !780, file: !106, line: 76, baseType: !201, size: 32, offset: 1312)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !780, file: !106, line: 78, baseType: !13, size: 32, offset: 1344)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !780, file: !106, line: 80, baseType: !17, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !780, file: !106, line: 81, baseType: !17, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !780, file: !106, line: 82, baseType: !17, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !780, file: !106, line: 83, baseType: !17, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !718, file: !717, line: 98, baseType: !51, size: 32, offset: 1088)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !664, file: !665, line: 321, baseType: !83, size: 32, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !664, file: !665, line: 323, baseType: !795, size: 416, offset: 608)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !86, line: 71, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !86, line: 78, size: 416, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !815}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !796, file: !86, line: 79, baseType: !89, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !796, file: !86, line: 80, baseType: !83, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !796, file: !86, line: 81, baseType: !83, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !796, file: !86, line: 82, baseType: !83, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !796, file: !86, line: 84, baseType: !17, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !796, file: !86, line: 85, baseType: !17, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !796, file: !86, line: 86, baseType: !17, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !796, file: !86, line: 87, baseType: !17, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !796, file: !86, line: 88, baseType: !17, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !796, file: !86, line: 89, baseType: !17, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !796, file: !86, line: 104, baseType: !96, size: 32, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !796, file: !86, line: 106, baseType: !66, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !796, file: !86, line: 107, baseType: !242, size: 32, offset: 224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !796, file: !86, line: 108, baseType: !756, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !796, file: !86, line: 109, baseType: !101, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !796, file: !86, line: 111, baseType: !814, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !86, line: 73, baseType: !738)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !796, file: !86, line: 112, baseType: !6, size: 32, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !664, file: !665, line: 324, baseType: !817, size: 160, offset: 1024)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !86, line: 122, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 116, size: 160, elements: !819)
!819 = !{!820, !821, !822, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !818, file: !86, line: 117, baseType: !83, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !818, file: !86, line: 118, baseType: !725, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !818, file: !86, line: 119, baseType: !250, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !818, file: !86, line: 120, baseType: !66, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !818, file: !86, line: 121, baseType: !96, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !664, file: !665, line: 326, baseType: !826, size: 32, offset: 1184)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_conf_t", file: !665, line: 238, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 147, size: 1760, elements: !829)
!829 = !{!830, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1038, !1039, !1040, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
