; ModuleID = 'src/http/ngx_http_core_module.c'
source_filename = "src/http/ngx_http_core_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_core_module_ctx", scope: !2, file: !3, line: 770, type: !1890, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !1811)
!3 = !DIFile(filename: "src/http/ngx_http_core_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 109, size: 32, elements: !7)
!6 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "NGX_TCP_NOPUSH_UNSET", value: 0)
!9 = !DIEnumerator(name: "NGX_TCP_NOPUSH_SET", value: 1)
!10 = !DIEnumerator(name: "NGX_TCP_NOPUSH_DISABLED", value: 2)
!11 = !{!12, !13, !17, !21, !1798, !28, !887, !14, !116, !688, !1803, !27, !332, !74, !1222, !65, !214, !144, !1525}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !15, line: 64, baseType: !16)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !19, line: 125, baseType: !20)
!19 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !23, line: 86, baseType: !24)
!23 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 120, baseType: !20)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !23, line: 36, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 17, size: 352, elements: !31)
!31 = !{!32, !33, !34, !48, !54, !55, !56, !57, !58, !59, !60, !61, !66}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !30, file: !23, line: 18, baseType: !13, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !30, file: !23, line: 19, baseType: !13, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !30, file: !23, line: 20, baseType: !35, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !37, line: 17, baseType: !38)
!37 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !39, line: 37, baseType: !40)
!39 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 28, size: 64, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 29, baseType: !20, size: 28, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !40, file: !39, line: 31, baseType: !20, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !40, file: !39, line: 32, baseType: !20, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !40, file: !39, line: 33, baseType: !20, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !40, file: !39, line: 34, baseType: !20, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 36, baseType: !13, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !30, file: !23, line: 22, baseType: !49, size: 64, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !39, line: 19, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 16, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !39, line: 17, baseType: !27, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !39, line: 18, baseType: !13, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !30, file: !23, line: 23, baseType: !49, size: 64, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !30, file: !23, line: 26, baseType: !13, size: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !30, file: !23, line: 28, baseType: !20, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !30, file: !23, line: 29, baseType: !20, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !30, file: !23, line: 30, baseType: !20, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !30, file: !23, line: 31, baseType: !20, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !30, file: !23, line: 32, baseType: !20, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !30, file: !23, line: 34, baseType: !62, size: 32, offset: 288)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !63, line: 78, baseType: !64)
!63 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !19, line: 140, baseType: !65)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !30, file: !23, line: 35, baseType: !67, size: 32, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !69, line: 16, baseType: !70)
!69 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !71, line: 364, size: 5376, elements: !72)
!71 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!72 = !{!73, !75, !423, !425, !426, !427, !428, !433, !434, !667, !1362, !1363, !1364, !1365, !1404, !1434, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1479, !1490, !1497, !1498, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1694, !1698, !1703, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !70, file: !71, line: 365, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 191, baseType: !20)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !70, file: !71, line: 367, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !78, line: 26, baseType: !79)
!78 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !6, line: 121, size: 896, elements: !80)
!80 = !{!81, !82, !183, !184, !187, !194, !196, !290, !295, !355, !356, !357, !394, !395, !396, !397, !398, !399, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !6, line: 122, baseType: !12, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !79, file: !6, line: 123, baseType: !83, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !78, line: 24, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !86, line: 30, size: 384, elements: !87)
!86 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !115, !117, !162, !175}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !86, line: 31, baseType: !12, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !85, file: !86, line: 33, baseType: !20, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !85, file: !86, line: 35, baseType: !20, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !85, file: !86, line: 38, baseType: !20, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !85, file: !86, line: 44, baseType: !20, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !85, file: !86, line: 46, baseType: !20, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !85, file: !86, line: 49, baseType: !20, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !85, file: !86, line: 51, baseType: !20, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !85, file: !86, line: 54, baseType: !20, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !85, file: !86, line: 56, baseType: !20, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !85, file: !86, line: 57, baseType: !20, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !85, file: !86, line: 59, baseType: !20, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !85, file: !86, line: 60, baseType: !20, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !85, file: !86, line: 62, baseType: !20, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !85, file: !86, line: 64, baseType: !20, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !85, file: !86, line: 67, baseType: !20, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !85, file: !86, line: 69, baseType: !20, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !85, file: !86, line: 71, baseType: !20, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !85, file: !86, line: 74, baseType: !20, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !85, file: !86, line: 75, baseType: !20, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !85, file: !86, line: 77, baseType: !20, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !85, file: !86, line: 107, baseType: !20, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !85, file: !86, line: 110, baseType: !111, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !78, line: 31, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !83}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !85, file: !86, line: 117, baseType: !116, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !63, line: 79, baseType: !18)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !85, file: !86, line: 119, baseType: !118, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !78, line: 20, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !121, line: 50, size: 320, elements: !122)
!121 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !{!123, !124, !139, !143, !146, !151, !152, !157, !158, !161}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !120, file: !121, line: 51, baseType: !116, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !120, file: !121, line: 52, baseType: !125, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !78, line: 21, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !128, line: 89, size: 160, elements: !129)
!128 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!129 = !{!130, !133, !134, !138}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !127, file: !128, line: 90, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !132, line: 16, baseType: !65)
!132 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 91, baseType: !49, size: 64, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !127, file: !128, line: 93, baseType: !135, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !125, !118}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !128, line: 94, baseType: !12, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !120, file: !121, line: 54, baseType: !140, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !141, line: 98, baseType: !142)
!141 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!142 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !120, file: !121, line: 56, baseType: !144, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !19, line: 75, baseType: !145)
!145 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !120, file: !121, line: 58, baseType: !147, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !121, line: 45, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!13, !118, !13, !27}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !121, line: 59, baseType: !12, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !120, file: !121, line: 61, baseType: !153, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !121, line: 46, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !118, !116, !13, !27}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !120, file: !121, line: 62, baseType: !12, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !120, file: !121, line: 70, baseType: !159, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !121, line: 72, baseType: !118, size: 32, offset: 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !85, file: !86, line: 121, baseType: !163, size: 160, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !164, line: 20, baseType: !165)
!164 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !164, line: 22, size: 160, elements: !166)
!166 = !{!167, !169, !171, !172, !173, !174}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !165, file: !164, line: 23, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !164, line: 16, baseType: !116)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !165, file: !164, line: 24, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !165, file: !164, line: 25, baseType: !170, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !165, file: !164, line: 26, baseType: !170, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !165, file: !164, line: 27, baseType: !14, size: 8, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !164, line: 28, baseType: !14, size: 8, offset: 136)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !85, file: !86, line: 124, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !177, line: 16, baseType: !178)
!177 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !177, line: 18, size: 64, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !177, line: 19, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !177, line: 20, baseType: !181, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !79, file: !6, line: 124, baseType: !83, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !79, file: !6, line: 126, baseType: !185, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !186, line: 17, baseType: !65)
!186 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !79, file: !6, line: 128, baseType: !188, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !189, line: 19, baseType: !190)
!189 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !76, !13, !27}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 135, baseType: !65)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !79, file: !6, line: 129, baseType: !195, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !189, line: 22, baseType: !190)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !79, file: !6, line: 130, baseType: !197, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !189, line: 20, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!193, !76, !201, !214}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !78, line: 19, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !204, line: 59, size: 64, elements: !205)
!204 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!205 = !{!206, !289}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !203, file: !204, line: 60, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !204, line: 18, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !204, line: 20, size: 352, elements: !210)
!210 = !{!211, !212, !213, !215, !216, !217, !218, !220, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !209, file: !204, line: 21, baseType: !13, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !209, file: !204, line: 22, baseType: !13, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !209, file: !204, line: 23, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 222, baseType: !65)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !209, file: !204, line: 24, baseType: !214, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !209, file: !204, line: 26, baseType: !13, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !209, file: !204, line: 27, baseType: !13, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !209, file: !204, line: 28, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !204, line: 16, baseType: !12)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !209, file: !204, line: 29, baseType: !221, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !78, line: 23, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !224, line: 16, size: 1216, elements: !225)
!224 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!225 = !{!226, !227, !228, !271, !272, !273, !274, !275}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !223, file: !224, line: 17, baseType: !131, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !224, line: 18, baseType: !49, size: 64, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !223, file: !224, line: 19, baseType: !229, size: 960, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !132, line: 17, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !231, line: 4, size: 960, elements: !232)
!231 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!232 = !{!233, !235, !236, !238, !239, !241, !242, !244, !246, !248, !249, !250, !251, !252, !253, !255, !256, !258, !259, !264, !265, !266}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !230, file: !231, line: 6, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !19, line: 232, baseType: !20)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !230, file: !231, line: 7, baseType: !234, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !230, file: !231, line: 8, baseType: !237, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !19, line: 227, baseType: !20)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !230, file: !231, line: 9, baseType: !237, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !230, file: !231, line: 10, baseType: !240, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !19, line: 217, baseType: !20)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !230, file: !231, line: 11, baseType: !240, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !230, file: !231, line: 13, baseType: !243, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !19, line: 212, baseType: !20)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !230, file: !231, line: 14, baseType: !245, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !19, line: 304, baseType: !20)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !230, file: !231, line: 15, baseType: !247, size: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !19, line: 309, baseType: !20)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !230, file: !231, line: 16, baseType: !20, size: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !230, file: !231, line: 17, baseType: !234, size: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !230, file: !231, line: 18, baseType: !234, size: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !230, file: !231, line: 19, baseType: !214, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !230, file: !231, line: 20, baseType: !214, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !230, file: !231, line: 21, baseType: !254, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !19, line: 237, baseType: !145)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !230, file: !231, line: 22, baseType: !254, size: 32, offset: 480)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !230, file: !231, line: 23, baseType: !257, size: 32, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !19, line: 242, baseType: !65)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !230, file: !231, line: 24, baseType: !257, size: 32, offset: 544)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !230, file: !231, line: 26, baseType: !260, size: 64, offset: 576)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !19, line: 288, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !260, file: !19, line: 288, baseType: !144, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !260, file: !19, line: 288, baseType: !145, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !230, file: !231, line: 27, baseType: !260, size: 64, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !230, file: !231, line: 28, baseType: !260, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !230, file: !231, line: 29, baseType: !267, size: 192, offset: 768)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 192, elements: !269)
!268 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!269 = !{!270}
!270 = !DISubrange(count: 3)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !223, file: !224, line: 21, baseType: !214, size: 32, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !223, file: !224, line: 22, baseType: !214, size: 32, offset: 1120)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !223, file: !224, line: 24, baseType: !118, size: 32, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !223, file: !224, line: 37, baseType: !20, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !223, file: !224, line: 38, baseType: !20, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !209, file: !204, line: 30, baseType: !207, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !209, file: !204, line: 34, baseType: !20, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !209, file: !204, line: 40, baseType: !20, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !209, file: !204, line: 43, baseType: !20, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !209, file: !204, line: 45, baseType: !20, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !209, file: !204, line: 46, baseType: !20, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !209, file: !204, line: 47, baseType: !20, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !209, file: !204, line: 48, baseType: !20, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !209, file: !204, line: 49, baseType: !20, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !209, file: !204, line: 50, baseType: !20, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !209, file: !204, line: 52, baseType: !20, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !209, file: !204, line: 53, baseType: !20, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !209, file: !204, line: 55, baseType: !65, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !204, line: 61, baseType: !201, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !79, file: !6, line: 131, baseType: !291, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !189, line: 23, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{!201, !76, !201, !214}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !79, file: !6, line: 133, baseType: !296, size: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !6, line: 16, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !6, line: 18, size: 960, elements: !299)
!299 = !{!300, !301, !313, !315, !316, !317, !318, !319, !320, !321, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !298, file: !6, line: 19, baseType: !185, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !298, file: !6, line: 21, baseType: !302, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !304, line: 297, size: 128, elements: !305)
!304 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!305 = !{!306, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !303, file: !304, line: 298, baseType: !307, size: 16)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !19, line: 409, baseType: !308)
!308 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !303, file: !304, line: 299, baseType: !310, size: 112, offset: 16)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 112, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 14)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !298, file: !6, line: 22, baseType: !314, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !19, line: 404, baseType: !20)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !298, file: !6, line: 23, baseType: !27, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !298, file: !6, line: 24, baseType: !49, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !6, line: 26, baseType: !65, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !298, file: !6, line: 28, baseType: !65, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !298, file: !6, line: 29, baseType: !65, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !298, file: !6, line: 30, baseType: !65, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !298, file: !6, line: 38, baseType: !322, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !78, line: 32, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !76}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !298, file: !6, line: 40, baseType: !12, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !298, file: !6, line: 42, baseType: !119, size: 320, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !298, file: !6, line: 43, baseType: !118, size: 32, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !298, file: !6, line: 45, baseType: !27, size: 32, offset: 736)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !298, file: !6, line: 47, baseType: !27, size: 32, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !298, file: !6, line: 49, baseType: !332, size: 32, offset: 800)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !333, line: 16, baseType: !168)
!333 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !298, file: !6, line: 51, baseType: !296, size: 32, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !298, file: !6, line: 52, baseType: !76, size: 32, offset: 864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !298, file: !6, line: 54, baseType: !116, size: 32, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !298, file: !6, line: 56, baseType: !20, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !298, file: !6, line: 57, baseType: !20, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !298, file: !6, line: 58, baseType: !20, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !298, file: !6, line: 60, baseType: !20, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !298, file: !6, line: 61, baseType: !20, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !298, file: !6, line: 62, baseType: !20, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !298, file: !6, line: 63, baseType: !20, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !298, file: !6, line: 64, baseType: !20, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !298, file: !6, line: 65, baseType: !20, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !298, file: !6, line: 66, baseType: !20, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !298, file: !6, line: 67, baseType: !20, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !298, file: !6, line: 70, baseType: !20, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !298, file: !6, line: 72, baseType: !20, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !298, file: !6, line: 73, baseType: !20, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !298, file: !6, line: 74, baseType: !20, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !298, file: !6, line: 76, baseType: !20, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !298, file: !6, line: 77, baseType: !20, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !298, file: !6, line: 78, baseType: !20, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !79, file: !6, line: 135, baseType: !214, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !79, file: !6, line: 137, baseType: !118, size: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !79, file: !6, line: 139, baseType: !358, size: 32, offset: 352)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !78, line: 18, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !361, line: 57, size: 320, elements: !362)
!361 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!362 = !{!363, !371, !372, !373, !374, !381, !393}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !360, file: !361, line: 58, baseType: !364, size: 128)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !361, line: 54, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 49, size: 128, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !365, file: !361, line: 50, baseType: !13, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !365, file: !361, line: 51, baseType: !13, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !361, line: 52, baseType: !358, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !365, file: !361, line: 53, baseType: !116, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !360, file: !361, line: 59, baseType: !27, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !360, file: !361, line: 60, baseType: !358, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !360, file: !361, line: 61, baseType: !201, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !360, file: !361, line: 62, baseType: !375, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !361, line: 41, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !361, line: 43, size: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !361, line: 44, baseType: !375, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !377, file: !361, line: 45, baseType: !12, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !360, file: !361, line: 63, baseType: !382, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !361, line: 32, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !361, line: 34, size: 96, elements: !385)
!385 = !{!386, !391, !392}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !384, file: !361, line: 35, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !361, line: 30, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !12}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !384, file: !361, line: 36, baseType: !12, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !361, line: 37, baseType: !382, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !360, file: !361, line: 64, baseType: !118, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !6, line: 141, baseType: !65, size: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !79, file: !6, line: 143, baseType: !302, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !79, file: !6, line: 144, baseType: !314, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !79, file: !6, line: 145, baseType: !49, size: 64, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !79, file: !6, line: 147, baseType: !49, size: 64, offset: 544)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !79, file: !6, line: 148, baseType: !400, size: 16, offset: 608)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !401, line: 12, baseType: !402)
!401 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 186, baseType: !308)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !79, file: !6, line: 154, baseType: !302, size: 32, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !79, file: !6, line: 155, baseType: !314, size: 32, offset: 672)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !79, file: !6, line: 157, baseType: !207, size: 32, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !79, file: !6, line: 159, baseType: !176, size: 64, offset: 736)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !79, file: !6, line: 161, baseType: !140, size: 32, offset: 800)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !79, file: !6, line: 163, baseType: !116, size: 32, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !79, file: !6, line: 165, baseType: !20, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !79, file: !6, line: 167, baseType: !20, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !79, file: !6, line: 169, baseType: !20, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !79, file: !6, line: 170, baseType: !20, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !79, file: !6, line: 171, baseType: !20, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !79, file: !6, line: 173, baseType: !20, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !79, file: !6, line: 174, baseType: !20, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !79, file: !6, line: 175, baseType: !20, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !79, file: !6, line: 176, baseType: !20, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !79, file: !6, line: 178, baseType: !20, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !79, file: !6, line: 179, baseType: !20, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !79, file: !6, line: 180, baseType: !20, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !79, file: !6, line: 181, baseType: !20, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !79, file: !6, line: 183, baseType: !20, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !70, file: !71, line: 369, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !70, file: !71, line: 370, baseType: !424, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !70, file: !71, line: 371, baseType: !424, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !70, file: !71, line: 372, baseType: !424, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !70, file: !71, line: 374, baseType: !429, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !71, line: 361, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !67}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !70, file: !71, line: 375, baseType: !429, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !70, file: !71, line: 378, baseType: !435, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !69, line: 18, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !438, line: 65, size: 3008, elements: !439)
!438 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!439 = !{!440, !441, !451, !452, !456, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !625, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !437, file: !438, line: 66, baseType: !222, size: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !437, file: !438, line: 67, baseType: !442, size: 160, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !443, line: 22, baseType: !444)
!443 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 16, size: 160, elements: !445)
!445 = !{!446, !447, !448, !449, !450}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !444, file: !443, line: 17, baseType: !12, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !444, file: !443, line: 18, baseType: !116, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !443, line: 19, baseType: !27, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !444, file: !443, line: 20, baseType: !116, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !444, file: !443, line: 21, baseType: !358, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !437, file: !438, line: 68, baseType: !74, size: 32, offset: 1376)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !437, file: !438, line: 69, baseType: !453, size: 128, offset: 1408)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 16)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !437, file: !438, line: 70, baseType: !453, size: 128, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !437, file: !438, line: 72, baseType: !458, size: 32, offset: 1664)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !132, line: 18, baseType: !237)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !437, file: !438, line: 73, baseType: !144, size: 32, offset: 1696)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !437, file: !438, line: 74, baseType: !144, size: 32, offset: 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !437, file: !438, line: 75, baseType: !144, size: 32, offset: 1760)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !437, file: !438, line: 76, baseType: !144, size: 32, offset: 1792)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !437, file: !438, line: 77, baseType: !144, size: 32, offset: 1824)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !437, file: !438, line: 79, baseType: !49, size: 64, offset: 1856)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !437, file: !438, line: 80, baseType: !49, size: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !437, file: !438, line: 81, baseType: !453, size: 128, offset: 1984)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !437, file: !438, line: 83, baseType: !27, size: 32, offset: 2112)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !437, file: !438, line: 84, baseType: !27, size: 32, offset: 2144)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !437, file: !438, line: 85, baseType: !214, size: 32, offset: 2176)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !437, file: !438, line: 86, baseType: !214, size: 32, offset: 2208)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !437, file: !438, line: 88, baseType: !116, size: 32, offset: 2240)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !437, file: !438, line: 89, baseType: !116, size: 32, offset: 2272)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !437, file: !438, line: 90, baseType: !116, size: 32, offset: 2304)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !437, file: !438, line: 91, baseType: !116, size: 32, offset: 2336)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !437, file: !438, line: 93, baseType: !207, size: 32, offset: 2368)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !437, file: !438, line: 95, baseType: !477, size: 32, offset: 2400)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !69, line: 19, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !438, line: 157, size: 544, elements: !480)
!480 = !{!481, !506, !567, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !624}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !479, file: !438, line: 158, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !438, line: 154, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 145, size: 480, elements: !485)
!485 = !{!486, !497, !498, !499, !502, !503, !504, !505}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !484, file: !438, line: 146, baseType: !487, size: 96)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !164, line: 32, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !164, line: 37, size: 96, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !488, file: !164, line: 38, baseType: !170, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !488, file: !164, line: 39, baseType: !170, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !488, file: !164, line: 40, baseType: !493, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !164, line: 34, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !170, !170, !170}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !484, file: !438, line: 147, baseType: !163, size: 160, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !484, file: !438, line: 148, baseType: !176, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !484, file: !438, line: 149, baseType: !500, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !141, line: 106, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !140)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !484, file: !438, line: 150, baseType: !500, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !484, file: !438, line: 151, baseType: !214, size: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !484, file: !438, line: 152, baseType: !116, size: 32, offset: 416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !484, file: !438, line: 153, baseType: !116, size: 32, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !479, file: !438, line: 159, baseType: !507, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !509, line: 59, baseType: !510)
!509 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 34, size: 800, elements: !511)
!511 = !{!512, !519, !520, !521, !529, !530, !531, !540, !541, !542, !543, !562, !563, !564, !565, !566}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !510, file: !509, line: 35, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !514, line: 21, baseType: !515)
!514 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 16, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !515, file: !514, line: 17, baseType: !500, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !515, file: !514, line: 19, baseType: !500, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !510, file: !509, line: 37, baseType: !27, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !510, file: !509, line: 38, baseType: !27, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !510, file: !509, line: 40, baseType: !522, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !509, line: 16, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !509, line: 18, size: 96, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !524, file: !509, line: 19, baseType: !18, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !509, line: 20, baseType: !522, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !509, line: 21, baseType: !18, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !510, file: !509, line: 41, baseType: !522, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !510, file: !509, line: 42, baseType: !523, size: 96, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !510, file: !509, line: 44, baseType: !532, size: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !509, line: 31, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 25, size: 128, elements: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !534, file: !509, line: 26, baseType: !116, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !534, file: !509, line: 27, baseType: !116, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !534, file: !509, line: 29, baseType: !116, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !534, file: !509, line: 30, baseType: !116, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !510, file: !509, line: 45, baseType: !116, size: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !510, file: !509, line: 47, baseType: !13, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !510, file: !509, line: 48, baseType: !13, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !510, file: !509, line: 50, baseType: !544, size: 256, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !514, line: 37, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 24, size: 256, elements: !546)
!546 = !{!547, !549, !550, !551, !561}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !545, file: !514, line: 26, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !545, file: !514, line: 28, baseType: !548, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !545, file: !514, line: 29, baseType: !116, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !545, file: !514, line: 30, baseType: !552, size: 128, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !553, line: 19, baseType: !554)
!553 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 17, size: 128, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !554, file: !553, line: 18, baseType: !557, size: 128)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !559)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!559 = !{!560}
!560 = !DISubrange(count: 4)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !545, file: !514, line: 36, baseType: !116, size: 32, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !510, file: !509, line: 52, baseType: !13, size: 32, offset: 672)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !510, file: !509, line: 53, baseType: !14, size: 8, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !510, file: !509, line: 55, baseType: !20, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !510, file: !509, line: 57, baseType: !12, size: 32, offset: 736)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !510, file: !509, line: 58, baseType: !12, size: 32, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !479, file: !438, line: 161, baseType: !568, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !224, line: 62, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !224, line: 50, size: 384, elements: !571)
!571 = !{!572, !573, !574, !576, !581, !583, !585, !586, !587}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !224, line: 51, baseType: !49, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !570, file: !224, line: 52, baseType: !27, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !570, file: !224, line: 53, baseType: !575, size: 96, offset: 96)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !269)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !570, file: !224, line: 55, baseType: !577, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !224, line: 45, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{!332, !12}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !570, file: !224, line: 56, baseType: !582, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !224, line: 46, baseType: !578)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !570, file: !224, line: 57, baseType: !584, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !224, line: 47, baseType: !388)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !224, line: 58, baseType: !12, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !570, file: !224, line: 60, baseType: !13, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !570, file: !224, line: 61, baseType: !116, size: 32, offset: 352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !479, file: !438, line: 163, baseType: !214, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !479, file: !438, line: 164, baseType: !27, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !479, file: !438, line: 166, baseType: !144, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !479, file: !438, line: 168, baseType: !144, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !479, file: !438, line: 170, baseType: !116, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !479, file: !438, line: 171, baseType: !116, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !479, file: !438, line: 172, baseType: !332, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !479, file: !438, line: 173, baseType: !332, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !479, file: !438, line: 174, baseType: !332, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !479, file: !438, line: 176, baseType: !116, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !479, file: !438, line: 177, baseType: !332, size: 32, offset: 416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !479, file: !438, line: 178, baseType: !332, size: 32, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !479, file: !438, line: 180, baseType: !601, size: 32, offset: 480)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !603, line: 25, baseType: !604)
!603 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !603, line: 29, size: 320, elements: !605)
!605 = !{!606, !607, !617, !622, !623}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !604, file: !603, line: 30, baseType: !12, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !604, file: !603, line: 31, baseType: !608, size: 192, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !609, line: 22, baseType: !610)
!609 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 16, size: 192, elements: !611)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !610, file: !609, line: 17, baseType: !13, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !609, line: 18, baseType: !27, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !609, line: 19, baseType: !49, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !610, file: !609, line: 20, baseType: !118, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !610, file: !609, line: 21, baseType: !116, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !604, file: !603, line: 32, baseType: !618, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !603, line: 27, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{!62, !601, !12}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !604, file: !603, line: 33, baseType: !12, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !604, file: !603, line: 34, baseType: !116, size: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !479, file: !438, line: 182, baseType: !116, size: 32, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !437, file: !438, line: 96, baseType: !626, size: 32, offset: 2432)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !438, line: 62, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 39, size: 576, elements: !629)
!629 = !{!630, !631, !632, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !628, file: !438, line: 40, baseType: !163, size: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !628, file: !438, line: 41, baseType: !176, size: 64, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !628, file: !438, line: 43, baseType: !633, size: 96, offset: 224)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 12)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !628, file: !438, line: 46, baseType: !20, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !628, file: !438, line: 47, baseType: !20, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !628, file: !438, line: 48, baseType: !20, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !628, file: !438, line: 49, baseType: !20, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !628, file: !438, line: 50, baseType: !20, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !628, file: !438, line: 51, baseType: !20, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !628, file: !438, line: 52, baseType: !20, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !628, file: !438, line: 53, baseType: !20, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !628, file: !438, line: 56, baseType: !458, size: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !628, file: !438, line: 57, baseType: !144, size: 32, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !628, file: !438, line: 58, baseType: !144, size: 32, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !628, file: !438, line: 59, baseType: !27, size: 32, offset: 480)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !628, file: !438, line: 60, baseType: !214, size: 32, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !628, file: !438, line: 61, baseType: !332, size: 32, offset: 544)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !437, file: !438, line: 102, baseType: !332, size: 32, offset: 2464)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !437, file: !438, line: 103, baseType: !332, size: 32, offset: 2496)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !437, file: !438, line: 104, baseType: !332, size: 32, offset: 2528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !437, file: !438, line: 105, baseType: !332, size: 32, offset: 2560)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !437, file: !438, line: 107, baseType: !84, size: 384, offset: 2592)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !437, file: !438, line: 109, baseType: !20, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !437, file: !438, line: 110, baseType: !20, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !437, file: !438, line: 112, baseType: !20, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !437, file: !438, line: 113, baseType: !20, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !437, file: !438, line: 114, baseType: !20, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !437, file: !438, line: 115, baseType: !20, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !437, file: !438, line: 116, baseType: !20, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !437, file: !438, line: 117, baseType: !20, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !437, file: !438, line: 118, baseType: !20, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !437, file: !438, line: 119, baseType: !20, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !437, file: !438, line: 121, baseType: !20, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !437, file: !438, line: 122, baseType: !20, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !70, file: !71, line: 381, baseType: !668, size: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !69, line: 17, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !671, line: 313, size: 4096, elements: !672)
!671 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!672 = !{!673, !678, !679, !720, !799, !800, !822, !831, !1089, !1090, !1091, !1129, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1307, !1311, !1312, !1316, !1317, !1318, !1319, !1320, !1324, !1328, !1332, !1333, !1345, !1346, !1347, !1348, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !670, file: !671, line: 314, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !671, line: 309, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !67, !668}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !670, file: !671, line: 315, baseType: !674, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !670, file: !671, line: 317, baseType: !680, size: 480, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !681, line: 22, baseType: !682)
!681 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !681, line: 36, size: 480, elements: !683)
!683 = !{!684, !685, !686, !687, !689, !690, !691, !697, !702, !704, !705, !714, !715, !716, !717, !718, !719}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !682, file: !681, line: 37, baseType: !76, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !682, file: !681, line: 39, baseType: !302, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !682, file: !681, line: 40, baseType: !314, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !681, line: 41, baseType: !688, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !682, file: !681, line: 43, baseType: !116, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !682, file: !681, line: 44, baseType: !332, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !682, file: !681, line: 46, baseType: !692, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !681, line: 24, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{!62, !696, !12}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !682, file: !681, line: 47, baseType: !698, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !681, line: 26, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !696, !12, !116}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !682, file: !681, line: 48, baseType: !703, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !681, line: 28, baseType: !699)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !682, file: !681, line: 49, baseType: !12, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !682, file: !681, line: 56, baseType: !706, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !708, line: 78, baseType: !709)
!708 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 74, size: 128, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !709, file: !708, line: 75, baseType: !302, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !709, file: !708, line: 76, baseType: !314, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !708, line: 77, baseType: !49, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !681, line: 58, baseType: !65, size: 32, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !682, file: !681, line: 59, baseType: !65, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !682, file: !681, line: 61, baseType: !118, size: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !682, file: !681, line: 63, baseType: !20, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !682, file: !681, line: 64, baseType: !20, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !682, file: !681, line: 67, baseType: !20, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !670, file: !671, line: 319, baseType: !721, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !723, line: 17, baseType: !724)
!723 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !723, line: 25, size: 1120, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !732, !733, !734, !735, !736, !741, !742, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !798}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !724, file: !723, line: 26, baseType: !76, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !724, file: !723, line: 27, baseType: !76, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !724, file: !723, line: 29, baseType: !201, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !724, file: !723, line: 30, baseType: !201, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !724, file: !723, line: 31, baseType: !731, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !724, file: !723, line: 33, baseType: !201, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !724, file: !723, line: 35, baseType: !201, size: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !724, file: !723, line: 36, baseType: !201, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !724, file: !723, line: 37, baseType: !201, size: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !724, file: !723, line: 44, baseType: !737, size: 32, offset: 288)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !723, line: 19, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!62, !721, !207}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !724, file: !723, line: 45, baseType: !12, size: 32, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !724, file: !723, line: 47, baseType: !743, size: 32, offset: 352)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !723, line: 21, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!62, !12, !201}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !724, file: !723, line: 48, baseType: !12, size: 32, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !724, file: !723, line: 57, baseType: !20, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !724, file: !723, line: 58, baseType: !20, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !724, file: !723, line: 59, baseType: !20, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !724, file: !723, line: 60, baseType: !20, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !724, file: !723, line: 61, baseType: !20, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !724, file: !723, line: 62, baseType: !20, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !724, file: !723, line: 63, baseType: !20, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !724, file: !723, line: 64, baseType: !20, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !724, file: !723, line: 65, baseType: !20, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !724, file: !723, line: 66, baseType: !20, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !724, file: !723, line: 67, baseType: !20, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !724, file: !723, line: 68, baseType: !20, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !724, file: !723, line: 70, baseType: !62, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !724, file: !723, line: 71, baseType: !762, size: 64, offset: 480)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !204, line: 68, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 65, size: 64, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !763, file: !204, line: 66, baseType: !62, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !204, line: 67, baseType: !27, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !724, file: !723, line: 72, baseType: !219, size: 32, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !724, file: !723, line: 74, baseType: !193, size: 32, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !724, file: !723, line: 76, baseType: !214, size: 32, offset: 608)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !724, file: !723, line: 77, baseType: !214, size: 32, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !724, file: !723, line: 79, baseType: !214, size: 32, offset: 672)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !724, file: !723, line: 80, baseType: !193, size: 32, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !724, file: !723, line: 82, baseType: !332, size: 32, offset: 736)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !724, file: !723, line: 83, baseType: !332, size: 32, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !724, file: !723, line: 84, baseType: !193, size: 32, offset: 800)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !724, file: !723, line: 86, baseType: !358, size: 32, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !724, file: !723, line: 87, baseType: !118, size: 32, offset: 864)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !724, file: !723, line: 89, baseType: !201, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !724, file: !723, line: 90, baseType: !27, size: 32, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !724, file: !723, line: 91, baseType: !207, size: 32, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !724, file: !723, line: 93, baseType: !27, size: 32, offset: 992)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !724, file: !723, line: 94, baseType: !144, size: 32, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !724, file: !723, line: 96, baseType: !784, size: 32, offset: 1056)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !224, line: 84, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !224, line: 71, size: 1408, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !786, file: !224, line: 72, baseType: !222, size: 1216)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !786, file: !224, line: 73, baseType: !214, size: 32, offset: 1216)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !786, file: !224, line: 74, baseType: !568, size: 32, offset: 1248)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !786, file: !224, line: 75, baseType: !358, size: 32, offset: 1280)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !786, file: !224, line: 76, baseType: !159, size: 32, offset: 1312)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !786, file: !224, line: 78, baseType: !116, size: 32, offset: 1344)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !786, file: !224, line: 80, baseType: !20, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !786, file: !224, line: 81, baseType: !20, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !786, file: !224, line: 82, baseType: !20, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !786, file: !224, line: 83, baseType: !20, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !724, file: !723, line: 98, baseType: !65, size: 32, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !670, file: !671, line: 321, baseType: !201, size: 32, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !670, file: !671, line: 323, baseType: !801, size: 416, offset: 608)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !204, line: 71, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !204, line: 78, size: 416, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !821}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !802, file: !204, line: 79, baseType: !207, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !802, file: !204, line: 80, baseType: !201, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !802, file: !204, line: 81, baseType: !201, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !802, file: !204, line: 82, baseType: !201, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !802, file: !204, line: 84, baseType: !20, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !802, file: !204, line: 85, baseType: !20, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !802, file: !204, line: 86, baseType: !20, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !802, file: !204, line: 87, baseType: !20, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !802, file: !204, line: 88, baseType: !20, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !802, file: !204, line: 89, baseType: !20, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !802, file: !204, line: 104, baseType: !214, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !802, file: !204, line: 106, baseType: !358, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !802, file: !204, line: 107, baseType: !62, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !802, file: !204, line: 108, baseType: !762, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !802, file: !204, line: 109, baseType: !219, size: 32, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !802, file: !204, line: 111, baseType: !820, size: 32, offset: 352)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !204, line: 73, baseType: !744)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !802, file: !204, line: 112, baseType: !12, size: 32, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !670, file: !671, line: 324, baseType: !823, size: 160, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !204, line: 122, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 116, size: 160, elements: !825)
!825 = !{!826, !827, !828, !829, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !824, file: !204, line: 117, baseType: !201, size: 32)
