; ModuleID = 'src/http/ngx_http_script.c'
source_filename = "src/http/ngx_http_script.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_script_exit_code", scope: !2, file: !3, line: 32, type: !8, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1863)
!3 = !DIFile(filename: "src/http/ngx_http_script.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !11, !12, !13, !1793, !20, !1798, !1799, !25, !1800, !1806, !1812, !1819, !882, !1826, !1832, !1838, !1846, !8, !1794, !1857, !683}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !7, line: 79, baseType: !8)
!7 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !9, line: 125, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !15, line: 86, baseType: !16)
!15 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !9, line: 120, baseType: !10)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !15, line: 36, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 17, size: 352, elements: !23)
!23 = !{!24, !29, !30, !44, !50, !51, !52, !53, !54, !55, !56, !57, !61}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !22, file: !15, line: 18, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !27, line: 64, baseType: !28)
!27 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !22, file: !15, line: 19, baseType: !25, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !22, file: !15, line: 20, baseType: !31, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !33, line: 17, baseType: !34)
!33 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !35, line: 37, baseType: !36)
!35 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 28, size: 64, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !35, line: 29, baseType: !10, size: 28, flags: DIFlagBitField, extraData: i64 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !36, file: !35, line: 31, baseType: !10, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !36, file: !35, line: 32, baseType: !10, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !36, file: !35, line: 33, baseType: !10, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !36, file: !35, line: 34, baseType: !10, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !35, line: 36, baseType: !25, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !22, file: !15, line: 22, baseType: !45, size: 64, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !35, line: 19, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 16, size: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !35, line: 17, baseType: !19, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !35, line: 18, baseType: !25, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !22, file: !15, line: 23, baseType: !45, size: 64, offset: 160)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !22, file: !15, line: 26, baseType: !25, size: 32, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !22, file: !15, line: 28, baseType: !10, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !22, file: !15, line: 29, baseType: !10, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !22, file: !15, line: 30, baseType: !10, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !22, file: !15, line: 31, baseType: !10, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !22, file: !15, line: 32, baseType: !10, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !22, file: !15, line: 34, baseType: !58, size: 32, offset: 288)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !7, line: 78, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !9, line: 140, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !22, file: !15, line: 35, baseType: !62, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !64, line: 16, baseType: !65)
!64 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !66, line: 364, size: 5376, elements: !67)
!66 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!67 = !{!68, !70, !418, !420, !421, !422, !423, !428, !429, !662, !1357, !1358, !1359, !1360, !1399, !1429, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1474, !1485, !1492, !1493, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1689, !1693, !1698, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !65, file: !66, line: 365, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 191, baseType: !10)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !65, file: !66, line: 367, baseType: !71, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !73, line: 26, baseType: !74)
!73 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !75, line: 121, size: 896, elements: !76)
!75 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!76 = !{!77, !78, !178, !179, !182, !189, !191, !285, !290, !350, !351, !352, !389, !390, !391, !392, !393, !394, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !75, line: 122, baseType: !11, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !74, file: !75, line: 123, baseType: !79, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !73, line: 24, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !82, line: 30, size: 384, elements: !83)
!82 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !111, !112, !157, !170}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !81, file: !82, line: 31, baseType: !11, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !81, file: !82, line: 33, baseType: !10, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !81, file: !82, line: 35, baseType: !10, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !81, file: !82, line: 38, baseType: !10, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !81, file: !82, line: 44, baseType: !10, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !81, file: !82, line: 46, baseType: !10, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !81, file: !82, line: 49, baseType: !10, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !81, file: !82, line: 51, baseType: !10, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !81, file: !82, line: 54, baseType: !10, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !81, file: !82, line: 56, baseType: !10, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !81, file: !82, line: 57, baseType: !10, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !81, file: !82, line: 59, baseType: !10, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !81, file: !82, line: 60, baseType: !10, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !81, file: !82, line: 62, baseType: !10, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !81, file: !82, line: 64, baseType: !10, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !81, file: !82, line: 67, baseType: !10, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !81, file: !82, line: 69, baseType: !10, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !81, file: !82, line: 71, baseType: !10, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !81, file: !82, line: 74, baseType: !10, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !81, file: !82, line: 75, baseType: !10, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !81, file: !82, line: 77, baseType: !10, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !81, file: !82, line: 107, baseType: !10, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !81, file: !82, line: 110, baseType: !107, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !73, line: 31, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !79}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !81, file: !82, line: 117, baseType: !6, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !81, file: !82, line: 119, baseType: !113, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !73, line: 20, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !116, line: 50, size: 320, elements: !117)
!116 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = !{!118, !119, !134, !138, !141, !146, !147, !152, !153, !156}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !115, file: !116, line: 51, baseType: !6, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !115, file: !116, line: 52, baseType: !120, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !73, line: 21, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !123, line: 89, size: 160, elements: !124)
!123 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!124 = !{!125, !128, !129, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !122, file: !123, line: 90, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !127, line: 16, baseType: !60)
!127 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !123, line: 91, baseType: !45, size: 64, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !122, file: !123, line: 93, baseType: !130, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !120, !113}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !123, line: 94, baseType: !11, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !115, file: !116, line: 54, baseType: !135, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !136, line: 98, baseType: !137)
!136 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!137 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !115, file: !116, line: 56, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !9, line: 75, baseType: !140)
!140 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !115, file: !116, line: 58, baseType: !142, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !116, line: 45, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DISubroutineType(types: !145)
!145 = !{!25, !113, !25, !19}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !116, line: 59, baseType: !11, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !115, file: !116, line: 61, baseType: !148, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !116, line: 46, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !113, !6, !25, !19}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !115, file: !116, line: 62, baseType: !11, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !115, file: !116, line: 70, baseType: !154, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !116, line: 72, baseType: !113, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !81, file: !82, line: 121, baseType: !158, size: 160, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !159, line: 20, baseType: !160)
!159 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !159, line: 22, size: 160, elements: !161)
!161 = !{!162, !164, !166, !167, !168, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !160, file: !159, line: 23, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !159, line: 16, baseType: !6)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !160, file: !159, line: 24, baseType: !165, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !160, file: !159, line: 25, baseType: !165, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !160, file: !159, line: 26, baseType: !165, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !160, file: !159, line: 27, baseType: !26, size: 8, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !159, line: 28, baseType: !26, size: 8, offset: 136)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !81, file: !82, line: 124, baseType: !171, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !172, line: 16, baseType: !173)
!172 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !172, line: 18, size: 64, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !172, line: 19, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !172, line: 20, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !74, file: !75, line: 124, baseType: !79, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !74, file: !75, line: 126, baseType: !180, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !181, line: 17, baseType: !60)
!181 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !74, file: !75, line: 128, baseType: !183, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !184, line: 19, baseType: !185)
!184 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !71, !25, !19}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !9, line: 135, baseType: !60)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !74, file: !75, line: 129, baseType: !190, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !184, line: 22, baseType: !185)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !74, file: !75, line: 130, baseType: !192, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !184, line: 20, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!188, !71, !196, !209}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !73, line: 19, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !199, line: 59, size: 64, elements: !200)
!199 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!200 = !{!201, !284}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !198, file: !199, line: 60, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !199, line: 18, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !199, line: 20, size: 352, elements: !205)
!205 = !{!206, !207, !208, !210, !211, !212, !213, !215, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !204, file: !199, line: 21, baseType: !25, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !204, file: !199, line: 22, baseType: !25, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !204, file: !199, line: 23, baseType: !209, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !9, line: 222, baseType: !60)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !204, file: !199, line: 24, baseType: !209, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !204, file: !199, line: 26, baseType: !25, size: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !204, file: !199, line: 27, baseType: !25, size: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !204, file: !199, line: 28, baseType: !214, size: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !199, line: 16, baseType: !11)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !204, file: !199, line: 29, baseType: !216, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !73, line: 23, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !219, line: 16, size: 1216, elements: !220)
!219 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!220 = !{!221, !222, !223, !266, !267, !268, !269, !270}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !218, file: !219, line: 17, baseType: !126, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !219, line: 18, baseType: !45, size: 64, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !218, file: !219, line: 19, baseType: !224, size: 960, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !127, line: 17, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !226, line: 4, size: 960, elements: !227)
!226 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!227 = !{!228, !230, !231, !233, !234, !236, !237, !239, !241, !243, !244, !245, !246, !247, !248, !250, !251, !253, !254, !259, !260, !261}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !225, file: !226, line: 6, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !9, line: 232, baseType: !10)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !225, file: !226, line: 7, baseType: !229, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !225, file: !226, line: 8, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !9, line: 227, baseType: !10)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !225, file: !226, line: 9, baseType: !232, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !225, file: !226, line: 10, baseType: !235, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !9, line: 217, baseType: !10)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !225, file: !226, line: 11, baseType: !235, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !225, file: !226, line: 13, baseType: !238, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !9, line: 212, baseType: !10)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !225, file: !226, line: 14, baseType: !240, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !9, line: 304, baseType: !10)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !225, file: !226, line: 15, baseType: !242, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !9, line: 309, baseType: !10)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !225, file: !226, line: 16, baseType: !10, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !225, file: !226, line: 17, baseType: !229, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !225, file: !226, line: 18, baseType: !229, size: 32, offset: 352)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !225, file: !226, line: 19, baseType: !209, size: 32, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !225, file: !226, line: 20, baseType: !209, size: 32, offset: 416)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !225, file: !226, line: 21, baseType: !249, size: 32, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !9, line: 237, baseType: !140)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !225, file: !226, line: 22, baseType: !249, size: 32, offset: 480)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !225, file: !226, line: 23, baseType: !252, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !9, line: 242, baseType: !60)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !225, file: !226, line: 24, baseType: !252, size: 32, offset: 544)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !225, file: !226, line: 26, baseType: !255, size: 64, offset: 576)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !9, line: 288, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !255, file: !9, line: 288, baseType: !139, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !255, file: !9, line: 288, baseType: !140, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !225, file: !226, line: 27, baseType: !255, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !225, file: !226, line: 28, baseType: !255, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !225, file: !226, line: 29, baseType: !262, size: 192, offset: 768)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 192, elements: !264)
!263 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!264 = !{!265}
!265 = !DISubrange(count: 3)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !218, file: !219, line: 21, baseType: !209, size: 32, offset: 1088)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !218, file: !219, line: 22, baseType: !209, size: 32, offset: 1120)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !218, file: !219, line: 24, baseType: !113, size: 32, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !218, file: !219, line: 37, baseType: !10, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !218, file: !219, line: 38, baseType: !10, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !204, file: !199, line: 30, baseType: !202, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !204, file: !199, line: 34, baseType: !10, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !204, file: !199, line: 40, baseType: !10, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !204, file: !199, line: 43, baseType: !10, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !204, file: !199, line: 45, baseType: !10, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !204, file: !199, line: 46, baseType: !10, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !204, file: !199, line: 47, baseType: !10, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !204, file: !199, line: 48, baseType: !10, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !204, file: !199, line: 49, baseType: !10, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !204, file: !199, line: 50, baseType: !10, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !204, file: !199, line: 52, baseType: !10, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !204, file: !199, line: 53, baseType: !10, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !204, file: !199, line: 55, baseType: !60, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !199, line: 61, baseType: !196, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !74, file: !75, line: 131, baseType: !286, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !184, line: 23, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!196, !71, !196, !209}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !74, file: !75, line: 133, baseType: !291, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !75, line: 16, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !75, line: 18, size: 960, elements: !294)
!294 = !{!295, !296, !308, !310, !311, !312, !313, !314, !315, !316, !321, !322, !323, !324, !325, !326, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !293, file: !75, line: 19, baseType: !180, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !293, file: !75, line: 21, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !299, line: 297, size: 128, elements: !300)
!299 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!300 = !{!301, !304}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !298, file: !299, line: 298, baseType: !302, size: 16)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !9, line: 409, baseType: !303)
!303 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !298, file: !299, line: 299, baseType: !305, size: 112, offset: 16)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 112, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 14)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !293, file: !75, line: 22, baseType: !309, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !9, line: 404, baseType: !10)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !293, file: !75, line: 23, baseType: !19, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !293, file: !75, line: 24, baseType: !45, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !75, line: 26, baseType: !60, size: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !293, file: !75, line: 28, baseType: !60, size: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !293, file: !75, line: 29, baseType: !60, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !293, file: !75, line: 30, baseType: !60, size: 32, offset: 288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !293, file: !75, line: 38, baseType: !317, size: 32, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !73, line: 32, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !71}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !293, file: !75, line: 40, baseType: !11, size: 32, offset: 352)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !293, file: !75, line: 42, baseType: !114, size: 320, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !293, file: !75, line: 43, baseType: !113, size: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !293, file: !75, line: 45, baseType: !19, size: 32, offset: 736)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !293, file: !75, line: 47, baseType: !19, size: 32, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !293, file: !75, line: 49, baseType: !327, size: 32, offset: 800)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !328, line: 16, baseType: !163)
!328 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !293, file: !75, line: 51, baseType: !291, size: 32, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !293, file: !75, line: 52, baseType: !71, size: 32, offset: 864)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !293, file: !75, line: 54, baseType: !6, size: 32, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !293, file: !75, line: 56, baseType: !10, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !293, file: !75, line: 57, baseType: !10, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !293, file: !75, line: 58, baseType: !10, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !293, file: !75, line: 60, baseType: !10, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !293, file: !75, line: 61, baseType: !10, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !293, file: !75, line: 62, baseType: !10, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !293, file: !75, line: 63, baseType: !10, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !293, file: !75, line: 64, baseType: !10, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !293, file: !75, line: 65, baseType: !10, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !293, file: !75, line: 66, baseType: !10, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !293, file: !75, line: 67, baseType: !10, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !293, file: !75, line: 70, baseType: !10, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !293, file: !75, line: 72, baseType: !10, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !293, file: !75, line: 73, baseType: !10, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !293, file: !75, line: 74, baseType: !10, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !293, file: !75, line: 76, baseType: !10, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !293, file: !75, line: 77, baseType: !10, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !293, file: !75, line: 78, baseType: !10, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !74, file: !75, line: 135, baseType: !209, size: 32, offset: 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !74, file: !75, line: 137, baseType: !113, size: 32, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !74, file: !75, line: 139, baseType: !353, size: 32, offset: 352)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !73, line: 18, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !356, line: 57, size: 320, elements: !357)
!356 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!357 = !{!358, !366, !367, !368, !369, !376, !388}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !355, file: !356, line: 58, baseType: !359, size: 128)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !356, line: 54, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 49, size: 128, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !360, file: !356, line: 50, baseType: !25, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !360, file: !356, line: 51, baseType: !25, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !356, line: 52, baseType: !353, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !360, file: !356, line: 53, baseType: !6, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !355, file: !356, line: 59, baseType: !19, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !355, file: !356, line: 60, baseType: !353, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !355, file: !356, line: 61, baseType: !196, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !355, file: !356, line: 62, baseType: !370, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !356, line: 41, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !356, line: 43, size: 64, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !356, line: 44, baseType: !370, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !372, file: !356, line: 45, baseType: !11, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !355, file: !356, line: 63, baseType: !377, size: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !356, line: 32, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !356, line: 34, size: 96, elements: !380)
!380 = !{!381, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !379, file: !356, line: 35, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !356, line: 30, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !11}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !356, line: 36, baseType: !11, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !356, line: 37, baseType: !377, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !355, file: !356, line: 64, baseType: !113, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 141, baseType: !60, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !74, file: !75, line: 143, baseType: !297, size: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !74, file: !75, line: 144, baseType: !309, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !74, file: !75, line: 145, baseType: !45, size: 64, offset: 480)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !74, file: !75, line: 147, baseType: !45, size: 64, offset: 544)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !74, file: !75, line: 148, baseType: !395, size: 16, offset: 608)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !396, line: 12, baseType: !397)
!396 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 186, baseType: !303)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !74, file: !75, line: 154, baseType: !297, size: 32, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !74, file: !75, line: 155, baseType: !309, size: 32, offset: 672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !74, file: !75, line: 157, baseType: !202, size: 32, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !74, file: !75, line: 159, baseType: !171, size: 64, offset: 736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !74, file: !75, line: 161, baseType: !135, size: 32, offset: 800)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !74, file: !75, line: 163, baseType: !6, size: 32, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !74, file: !75, line: 165, baseType: !10, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !74, file: !75, line: 167, baseType: !10, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !74, file: !75, line: 169, baseType: !10, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !74, file: !75, line: 170, baseType: !10, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !74, file: !75, line: 171, baseType: !10, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !74, file: !75, line: 173, baseType: !10, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !74, file: !75, line: 174, baseType: !10, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !74, file: !75, line: 175, baseType: !10, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !74, file: !75, line: 176, baseType: !10, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !74, file: !75, line: 178, baseType: !10, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !74, file: !75, line: 179, baseType: !10, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !74, file: !75, line: 180, baseType: !10, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !74, file: !75, line: 181, baseType: !10, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !74, file: !75, line: 183, baseType: !10, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !65, file: !66, line: 369, baseType: !419, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !65, file: !66, line: 370, baseType: !419, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !65, file: !66, line: 371, baseType: !419, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !65, file: !66, line: 372, baseType: !419, size: 32, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !65, file: !66, line: 374, baseType: !424, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !66, line: 361, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !62}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !65, file: !66, line: 375, baseType: !424, size: 32, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !65, file: !66, line: 378, baseType: !430, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !64, line: 18, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !433, line: 65, size: 3008, elements: !434)
!433 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!434 = !{!435, !436, !446, !447, !451, !452, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !620, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !432, file: !433, line: 66, baseType: !217, size: 1216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !432, file: !433, line: 67, baseType: !437, size: 160, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !438, line: 22, baseType: !439)
!438 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 16, size: 160, elements: !440)
!440 = !{!441, !442, !443, !444, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !439, file: !438, line: 17, baseType: !11, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !439, file: !438, line: 18, baseType: !6, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !439, file: !438, line: 19, baseType: !19, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !439, file: !438, line: 20, baseType: !6, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !439, file: !438, line: 21, baseType: !353, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !432, file: !433, line: 68, baseType: !69, size: 32, offset: 1376)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !432, file: !433, line: 69, baseType: !448, size: 128, offset: 1408)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !432, file: !433, line: 70, baseType: !448, size: 128, offset: 1536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !432, file: !433, line: 72, baseType: !453, size: 32, offset: 1664)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !127, line: 18, baseType: !232)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !432, file: !433, line: 73, baseType: !139, size: 32, offset: 1696)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !432, file: !433, line: 74, baseType: !139, size: 32, offset: 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !432, file: !433, line: 75, baseType: !139, size: 32, offset: 1760)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !432, file: !433, line: 76, baseType: !139, size: 32, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !432, file: !433, line: 77, baseType: !139, size: 32, offset: 1824)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !432, file: !433, line: 79, baseType: !45, size: 64, offset: 1856)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !432, file: !433, line: 80, baseType: !45, size: 64, offset: 1920)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !432, file: !433, line: 81, baseType: !448, size: 128, offset: 1984)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !432, file: !433, line: 83, baseType: !19, size: 32, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !432, file: !433, line: 84, baseType: !19, size: 32, offset: 2144)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !433, line: 85, baseType: !209, size: 32, offset: 2176)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !432, file: !433, line: 86, baseType: !209, size: 32, offset: 2208)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !432, file: !433, line: 88, baseType: !6, size: 32, offset: 2240)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !432, file: !433, line: 89, baseType: !6, size: 32, offset: 2272)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !432, file: !433, line: 90, baseType: !6, size: 32, offset: 2304)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !432, file: !433, line: 91, baseType: !6, size: 32, offset: 2336)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !432, file: !433, line: 93, baseType: !202, size: 32, offset: 2368)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !432, file: !433, line: 95, baseType: !472, size: 32, offset: 2400)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !64, line: 19, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !433, line: 157, size: 544, elements: !475)
!475 = !{!476, !501, !562, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !619}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !474, file: !433, line: 158, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !433, line: 154, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 145, size: 480, elements: !480)
!480 = !{!481, !492, !493, !494, !497, !498, !499, !500}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !479, file: !433, line: 146, baseType: !482, size: 96)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !159, line: 32, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !159, line: 37, size: 96, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !483, file: !159, line: 38, baseType: !165, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !483, file: !159, line: 39, baseType: !165, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !483, file: !159, line: 40, baseType: !488, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !159, line: 34, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !165, !165, !165}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !479, file: !433, line: 147, baseType: !158, size: 160, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !479, file: !433, line: 148, baseType: !171, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !479, file: !433, line: 149, baseType: !495, size: 32, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !136, line: 106, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !479, file: !433, line: 150, baseType: !495, size: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !479, file: !433, line: 151, baseType: !209, size: 32, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !479, file: !433, line: 152, baseType: !6, size: 32, offset: 416)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !479, file: !433, line: 153, baseType: !6, size: 32, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !474, file: !433, line: 159, baseType: !502, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !504, line: 59, baseType: !505)
!504 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 34, size: 800, elements: !506)
!506 = !{!507, !514, !515, !516, !524, !525, !526, !535, !536, !537, !538, !557, !558, !559, !560, !561}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !505, file: !504, line: 35, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !509, line: 21, baseType: !510)
!509 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 16, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !510, file: !509, line: 17, baseType: !495, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !510, file: !509, line: 19, baseType: !495, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !505, file: !504, line: 37, baseType: !19, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !505, file: !504, line: 38, baseType: !19, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !505, file: !504, line: 40, baseType: !517, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !504, line: 16, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !504, line: 18, size: 96, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !519, file: !504, line: 19, baseType: !8, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !504, line: 20, baseType: !517, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !519, file: !504, line: 21, baseType: !8, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !505, file: !504, line: 41, baseType: !517, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !505, file: !504, line: 42, baseType: !518, size: 96, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !505, file: !504, line: 44, baseType: !527, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !504, line: 31, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 25, size: 128, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !529, file: !504, line: 26, baseType: !6, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !529, file: !504, line: 27, baseType: !6, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !529, file: !504, line: 29, baseType: !6, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !529, file: !504, line: 30, baseType: !6, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !505, file: !504, line: 45, baseType: !6, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !505, file: !504, line: 47, baseType: !25, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !505, file: !504, line: 48, baseType: !25, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !505, file: !504, line: 50, baseType: !539, size: 256, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !509, line: 37, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 24, size: 256, elements: !541)
!541 = !{!542, !544, !545, !546, !556}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !540, file: !509, line: 26, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !540, file: !509, line: 28, baseType: !543, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !540, file: !509, line: 29, baseType: !6, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !540, file: !509, line: 30, baseType: !547, size: 128, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !548, line: 19, baseType: !549)
!548 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 17, size: 128, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !549, file: !548, line: 18, baseType: !552, size: 128)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !554)
!553 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!554 = !{!555}
!555 = !DISubrange(count: 4)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !540, file: !509, line: 36, baseType: !6, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !505, file: !504, line: 52, baseType: !25, size: 32, offset: 672)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !505, file: !504, line: 53, baseType: !26, size: 8, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !505, file: !504, line: 55, baseType: !10, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !505, file: !504, line: 57, baseType: !11, size: 32, offset: 736)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !505, file: !504, line: 58, baseType: !11, size: 32, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !474, file: !433, line: 161, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !219, line: 62, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 50, size: 384, elements: !566)
!566 = !{!567, !568, !569, !571, !576, !578, !580, !581, !582}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !219, line: 51, baseType: !45, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !565, file: !219, line: 52, baseType: !19, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !565, file: !219, line: 53, baseType: !570, size: 96, offset: 96)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !264)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !565, file: !219, line: 55, baseType: !572, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !219, line: 45, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!327, !11}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !565, file: !219, line: 56, baseType: !577, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !219, line: 46, baseType: !573)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !565, file: !219, line: 57, baseType: !579, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !219, line: 47, baseType: !383)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !219, line: 58, baseType: !11, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !565, file: !219, line: 60, baseType: !25, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !565, file: !219, line: 61, baseType: !6, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !474, file: !433, line: 163, baseType: !209, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !474, file: !433, line: 164, baseType: !19, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !474, file: !433, line: 166, baseType: !139, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !474, file: !433, line: 168, baseType: !139, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !474, file: !433, line: 170, baseType: !6, size: 32, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !474, file: !433, line: 171, baseType: !6, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !474, file: !433, line: 172, baseType: !327, size: 32, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !474, file: !433, line: 173, baseType: !327, size: 32, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !474, file: !433, line: 174, baseType: !327, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !474, file: !433, line: 176, baseType: !6, size: 32, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !474, file: !433, line: 177, baseType: !327, size: 32, offset: 416)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !474, file: !433, line: 178, baseType: !327, size: 32, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !474, file: !433, line: 180, baseType: !596, size: 32, offset: 480)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !598, line: 25, baseType: !599)
!598 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !598, line: 29, size: 320, elements: !600)
!600 = !{!601, !602, !612, !617, !618}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !598, line: 30, baseType: !11, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !599, file: !598, line: 31, baseType: !603, size: 192, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !604, line: 22, baseType: !605)
!604 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 16, size: 192, elements: !606)
!606 = !{!607, !608, !609, !610, !611}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !605, file: !604, line: 17, baseType: !25, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !605, file: !604, line: 18, baseType: !19, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !604, line: 19, baseType: !45, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !605, file: !604, line: 20, baseType: !113, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !605, file: !604, line: 21, baseType: !6, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !599, file: !598, line: 32, baseType: !613, size: 32, offset: 224)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !598, line: 27, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!58, !596, !11}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !599, file: !598, line: 33, baseType: !11, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !599, file: !598, line: 34, baseType: !6, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !474, file: !433, line: 182, baseType: !6, size: 32, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !432, file: !433, line: 96, baseType: !621, size: 32, offset: 2432)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !433, line: 62, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 39, size: 576, elements: !624)
!624 = !{!625, !626, !627, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !433, line: 40, baseType: !158, size: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !623, file: !433, line: 41, baseType: !171, size: 64, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !623, file: !433, line: 43, baseType: !628, size: 96, offset: 224)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 12)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !623, file: !433, line: 46, baseType: !10, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !623, file: !433, line: 47, baseType: !10, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !623, file: !433, line: 48, baseType: !10, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !623, file: !433, line: 49, baseType: !10, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !623, file: !433, line: 50, baseType: !10, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !623, file: !433, line: 51, baseType: !10, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !623, file: !433, line: 52, baseType: !10, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !623, file: !433, line: 53, baseType: !10, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !623, file: !433, line: 56, baseType: !453, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !623, file: !433, line: 57, baseType: !139, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !623, file: !433, line: 58, baseType: !139, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !623, file: !433, line: 59, baseType: !19, size: 32, offset: 480)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !623, file: !433, line: 60, baseType: !209, size: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !623, file: !433, line: 61, baseType: !327, size: 32, offset: 544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !432, file: !433, line: 102, baseType: !327, size: 32, offset: 2464)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !432, file: !433, line: 103, baseType: !327, size: 32, offset: 2496)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !432, file: !433, line: 104, baseType: !327, size: 32, offset: 2528)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !432, file: !433, line: 105, baseType: !327, size: 32, offset: 2560)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !432, file: !433, line: 107, baseType: !80, size: 384, offset: 2592)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !432, file: !433, line: 109, baseType: !10, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !432, file: !433, line: 110, baseType: !10, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !432, file: !433, line: 112, baseType: !10, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !432, file: !433, line: 113, baseType: !10, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !432, file: !433, line: 114, baseType: !10, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !432, file: !433, line: 115, baseType: !10, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !432, file: !433, line: 116, baseType: !10, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !432, file: !433, line: 117, baseType: !10, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !432, file: !433, line: 118, baseType: !10, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !432, file: !433, line: 119, baseType: !10, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !432, file: !433, line: 121, baseType: !10, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !432, file: !433, line: 122, baseType: !10, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !65, file: !66, line: 381, baseType: !663, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !64, line: 17, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !666, line: 313, size: 4096, elements: !667)
!666 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!667 = !{!668, !673, !674, !715, !794, !795, !817, !826, !1084, !1085, !1086, !1124, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1302, !1306, !1307, !1311, !1312, !1313, !1314, !1315, !1319, !1323, !1327, !1328, !1340, !1341, !1342, !1343, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !665, file: !666, line: 314, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !666, line: 309, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !62, !663}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !665, file: !666, line: 315, baseType: !669, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !665, file: !666, line: 317, baseType: !675, size: 480, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !676, line: 22, baseType: !677)
!676 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !676, line: 36, size: 480, elements: !678)
!678 = !{!679, !680, !681, !682, !684, !685, !686, !692, !697, !699, !700, !709, !710, !711, !712, !713, !714}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !677, file: !676, line: 37, baseType: !71, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !677, file: !676, line: 39, baseType: !297, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !677, file: !676, line: 40, baseType: !309, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !677, file: !676, line: 41, baseType: !683, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !677, file: !676, line: 43, baseType: !6, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !677, file: !676, line: 44, baseType: !327, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !677, file: !676, line: 46, baseType: !687, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !676, line: 24, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{!58, !691, !11}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !677, file: !676, line: 47, baseType: !693, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !676, line: 26, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !691, !11, !6}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !677, file: !676, line: 48, baseType: !698, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !676, line: 28, baseType: !694)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !676, line: 49, baseType: !11, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !677, file: !676, line: 56, baseType: !701, size: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !703, line: 78, baseType: !704)
!703 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 74, size: 128, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !704, file: !703, line: 75, baseType: !297, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !704, file: !703, line: 76, baseType: !309, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !703, line: 77, baseType: !45, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !676, line: 58, baseType: !60, size: 32, offset: 352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !677, file: !676, line: 59, baseType: !60, size: 32, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !677, file: !676, line: 61, baseType: !113, size: 32, offset: 416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !677, file: !676, line: 63, baseType: !10, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !677, file: !676, line: 64, baseType: !10, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !677, file: !676, line: 67, baseType: !10, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !665, file: !666, line: 319, baseType: !716, size: 32, offset: 544)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !718, line: 17, baseType: !719)
!718 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !718, line: 25, size: 1120, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !727, !728, !729, !730, !731, !736, !737, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !793}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !719, file: !718, line: 26, baseType: !71, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !719, file: !718, line: 27, baseType: !71, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !719, file: !718, line: 29, baseType: !196, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !719, file: !718, line: 30, baseType: !196, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !719, file: !718, line: 31, baseType: !726, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !719, file: !718, line: 33, baseType: !196, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !719, file: !718, line: 35, baseType: !196, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !719, file: !718, line: 36, baseType: !196, size: 32, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !719, file: !718, line: 37, baseType: !196, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !719, file: !718, line: 44, baseType: !732, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !718, line: 19, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DISubroutineType(types: !735)
!735 = !{!58, !716, !202}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !719, file: !718, line: 45, baseType: !11, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !719, file: !718, line: 47, baseType: !738, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !718, line: 21, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{!58, !11, !196}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !719, file: !718, line: 48, baseType: !11, size: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !719, file: !718, line: 57, baseType: !10, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !719, file: !718, line: 58, baseType: !10, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !719, file: !718, line: 59, baseType: !10, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !719, file: !718, line: 60, baseType: !10, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !719, file: !718, line: 61, baseType: !10, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !719, file: !718, line: 62, baseType: !10, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !719, file: !718, line: 63, baseType: !10, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !719, file: !718, line: 64, baseType: !10, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !719, file: !718, line: 65, baseType: !10, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !719, file: !718, line: 66, baseType: !10, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !719, file: !718, line: 67, baseType: !10, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !719, file: !718, line: 68, baseType: !10, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !719, file: !718, line: 70, baseType: !58, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !719, file: !718, line: 71, baseType: !757, size: 64, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !199, line: 68, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 65, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !758, file: !199, line: 66, baseType: !58, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !758, file: !199, line: 67, baseType: !19, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !719, file: !718, line: 72, baseType: !214, size: 32, offset: 544)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !719, file: !718, line: 74, baseType: !188, size: 32, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !719, file: !718, line: 76, baseType: !209, size: 32, offset: 608)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !719, file: !718, line: 77, baseType: !209, size: 32, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !719, file: !718, line: 79, baseType: !209, size: 32, offset: 672)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !719, file: !718, line: 80, baseType: !188, size: 32, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !719, file: !718, line: 82, baseType: !327, size: 32, offset: 736)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !719, file: !718, line: 83, baseType: !327, size: 32, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !719, file: !718, line: 84, baseType: !188, size: 32, offset: 800)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !719, file: !718, line: 86, baseType: !353, size: 32, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !719, file: !718, line: 87, baseType: !113, size: 32, offset: 864)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !719, file: !718, line: 89, baseType: !196, size: 32, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !719, file: !718, line: 90, baseType: !19, size: 32, offset: 928)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !719, file: !718, line: 91, baseType: !202, size: 32, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !719, file: !718, line: 93, baseType: !19, size: 32, offset: 992)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !719, file: !718, line: 94, baseType: !139, size: 32, offset: 1024)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !719, file: !718, line: 96, baseType: !779, size: 32, offset: 1056)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !219, line: 84, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 71, size: 1408, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !781, file: !219, line: 72, baseType: !217, size: 1216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !781, file: !219, line: 73, baseType: !209, size: 32, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !781, file: !219, line: 74, baseType: !563, size: 32, offset: 1248)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !781, file: !219, line: 75, baseType: !353, size: 32, offset: 1280)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !781, file: !219, line: 76, baseType: !154, size: 32, offset: 1312)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !781, file: !219, line: 78, baseType: !6, size: 32, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !781, file: !219, line: 80, baseType: !10, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !781, file: !219, line: 81, baseType: !10, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !781, file: !219, line: 82, baseType: !10, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !781, file: !219, line: 83, baseType: !10, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !719, file: !718, line: 98, baseType: !60, size: 32, offset: 1088)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !665, file: !666, line: 321, baseType: !196, size: 32, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !665, file: !666, line: 323, baseType: !796, size: 416, offset: 608)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !199, line: 71, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !199, line: 78, size: 416, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !816}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !797, file: !199, line: 79, baseType: !202, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !797, file: !199, line: 80, baseType: !196, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !797, file: !199, line: 81, baseType: !196, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !797, file: !199, line: 82, baseType: !196, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !797, file: !199, line: 84, baseType: !10, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !797, file: !199, line: 85, baseType: !10, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !797, file: !199, line: 86, baseType: !10, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !797, file: !199, line: 87, baseType: !10, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !797, file: !199, line: 88, baseType: !10, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !797, file: !199, line: 89, baseType: !10, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !797, file: !199, line: 104, baseType: !209, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !797, file: !199, line: 106, baseType: !353, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !797, file: !199, line: 107, baseType: !58, size: 32, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !797, file: !199, line: 108, baseType: !757, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !797, file: !199, line: 109, baseType: !214, size: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !797, file: !199, line: 111, baseType: !815, size: 32, offset: 352)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !199, line: 73, baseType: !739)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !797, file: !199, line: 112, baseType: !11, size: 32, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !665, file: !666, line: 324, baseType: !818, size: 160, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !199, line: 122, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 116, size: 160, elements: !820)
!820 = !{!821, !822, !823, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !819, file: !199, line: 117, baseType: !196, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !819, file: !199, line: 118, baseType: !726, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !819, file: !199, line: 119, baseType: !71, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !819, file: !199, line: 120, baseType: !353, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !819, file: !199, line: 121, baseType: !209, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !665, file: !666, line: 326, baseType: !827, size: 32, offset: 1184)
