; ModuleID = 'src/http/ngx_http_request.c'
source_filename = "src/http/ngx_http_request.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_header_t = type { %struct.ngx_str_t, i32, i32 (%struct.ngx_http_request_s*, %struct.ngx_table_elt_t*, i32)* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_http_request_s = type <{ i32, %struct.ngx_connection_s*, i8**, i8**, i8**, i8**, void (%struct.ngx_http_request_s*)*, void (%struct.ngx_http_request_s*)*, %struct.ngx_http_cache_s*, %struct.ngx_http_upstream_s*, %struct.ngx_array_t*, %struct.ngx_pool_s*, %struct.ngx_buf_s*, %struct.ngx_http_headers_in_t, %struct.ngx_http_headers_out_t, %struct.ngx_http_request_body_t*, i32, i32, i32, i32, i32, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_chain_s*, %struct.ngx_http_request_s*, %struct.ngx_http_request_s*, %struct.ngx_http_postponed_request_s*, %struct.ngx_http_post_subrequest_t*, %struct.ngx_http_posted_request_s*, i32, i32 (%struct.ngx_http_request_s*)*, i32, %struct.ngx_variable_value_t*, i32, i32, i32, i32, i32, %struct.ngx_http_connection_t*, %struct.ngx_http_v2_stream_s*, i8* (%struct.ngx_http_request_s*, %struct.ngx_http_request_s*, i8*, i32)*, %struct.ngx_http_cleanup_s*, i104, i32, i32, i32, [32 x i8], i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32 }>

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_headers_in", scope: !2, file: !3, line: 80, type: !1862, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !258, globals: !1858)
!3 = !DIFile(filename: "src/http/ngx_http_request.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5, !13, !25, !234, !239, !244}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 93, size: 32, elements: !7)
!6 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "NGX_ERROR_ALERT", value: 0)
!9 = !DIEnumerator(name: "NGX_ERROR_ERR", value: 1)
!10 = !DIEnumerator(name: "NGX_ERROR_INFO", value: 2)
!11 = !DIEnumerator(name: "NGX_ERROR_IGNORE_ECONNRESET", value: 3)
!12 = !DIEnumerator(name: "NGX_ERROR_IGNORE_EINVAL", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 149, size: 32, elements: !15)
!14 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIEnumerator(name: "NGX_HTTP_INITING_REQUEST_STATE", value: 0)
!17 = !DIEnumerator(name: "NGX_HTTP_READING_REQUEST_STATE", value: 1)
!18 = !DIEnumerator(name: "NGX_HTTP_PROCESS_REQUEST_STATE", value: 2)
!19 = !DIEnumerator(name: "NGX_HTTP_CONNECT_UPSTREAM_STATE", value: 3)
!20 = !DIEnumerator(name: "NGX_HTTP_WRITING_UPSTREAM_STATE", value: 4)
!21 = !DIEnumerator(name: "NGX_HTTP_READING_UPSTREAM_STATE", value: 5)
!22 = !DIEnumerator(name: "NGX_HTTP_WRITING_REQUEST_STATE", value: 6)
!23 = !DIEnumerator(name: "NGX_HTTP_LINGERING_CLOSE_STATE", value: 7)
!24 = !DIEnumerator(name: "NGX_HTTP_KEEPALIVE_STATE", value: 8)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !26, file: !3, line: 1933, size: 32, elements: !230)
!26 = distinct !DISubprogram(name: "ngx_http_validate_host", scope: !3, file: !3, line: 1928, type: !27, isLocal: true, isDefinition: true, scopeLine: 1929, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !220)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !34, !47, !61}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !30, line: 78, baseType: !31)
!30 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !32, line: 140, baseType: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !36, line: 19, baseType: !37)
!36 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 16, size: 64, elements: !38)
!38 = !{!39, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !37, file: !36, line: 17, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !32, line: 120, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !36, line: 18, baseType: !43, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !45, line: 64, baseType: !46)
!45 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !49, line: 18, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !51, line: 57, size: 320, elements: !52)
!51 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = !{!53, !63, !64, !65, !200, !207, !219}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !50, file: !51, line: 58, baseType: !54, size: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !51, line: 54, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 49, size: 128, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !55, file: !51, line: 50, baseType: !43, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !55, file: !51, line: 51, baseType: !43, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !51, line: 52, baseType: !47, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !55, file: !51, line: 53, baseType: !61, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !30, line: 79, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !32, line: 125, baseType: !41)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !50, file: !51, line: 59, baseType: !40, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !50, file: !51, line: 60, baseType: !47, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !50, file: !51, line: 61, baseType: !66, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !49, line: 19, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !69, line: 59, size: 64, elements: !70)
!69 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = !{!71, !199}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !68, file: !69, line: 60, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !69, line: 18, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !69, line: 20, size: 352, elements: !75)
!75 = !{!76, !77, !78, !80, !81, !82, !83, !86, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !74, file: !69, line: 21, baseType: !43, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !74, file: !69, line: 22, baseType: !43, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !74, file: !69, line: 23, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !32, line: 222, baseType: !33)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !74, file: !69, line: 24, baseType: !79, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !74, file: !69, line: 26, baseType: !43, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !74, file: !69, line: 27, baseType: !43, size: 32, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !74, file: !69, line: 28, baseType: !84, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !69, line: 16, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !74, file: !69, line: 29, baseType: !87, size: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !49, line: 23, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !90, line: 16, size: 1216, elements: !91)
!90 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = !{!92, !95, !96, !141, !142, !143, !184, !185}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !89, file: !90, line: 17, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !94, line: 16, baseType: !33)
!94 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !90, line: 18, baseType: !35, size: 64, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !89, file: !90, line: 19, baseType: !97, size: 960, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !94, line: 17, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !99, line: 4, size: 960, elements: !100)
!99 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = !{!101, !103, !104, !106, !107, !109, !110, !112, !114, !116, !117, !118, !119, !120, !121, !124, !125, !127, !128, !134, !135, !136}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !98, file: !99, line: 6, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !32, line: 232, baseType: !41)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !98, file: !99, line: 7, baseType: !102, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !98, file: !99, line: 8, baseType: !105, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !32, line: 227, baseType: !41)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !98, file: !99, line: 9, baseType: !105, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !98, file: !99, line: 10, baseType: !108, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !32, line: 217, baseType: !41)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !98, file: !99, line: 11, baseType: !108, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !98, file: !99, line: 13, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !32, line: 212, baseType: !41)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !98, file: !99, line: 14, baseType: !113, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !32, line: 304, baseType: !41)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !98, file: !99, line: 15, baseType: !115, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !32, line: 309, baseType: !41)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !98, file: !99, line: 16, baseType: !41, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !98, file: !99, line: 17, baseType: !102, size: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !98, file: !99, line: 18, baseType: !102, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !98, file: !99, line: 19, baseType: !79, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !98, file: !99, line: 20, baseType: !79, size: 32, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !98, file: !99, line: 21, baseType: !122, size: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !32, line: 237, baseType: !123)
!123 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !98, file: !99, line: 22, baseType: !122, size: 32, offset: 480)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !98, file: !99, line: 23, baseType: !126, size: 32, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !32, line: 242, baseType: !33)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !98, file: !99, line: 24, baseType: !126, size: 32, offset: 544)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !98, file: !99, line: 26, baseType: !129, size: 64, offset: 576)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !32, line: 288, size: 64, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !129, file: !32, line: 288, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !32, line: 75, baseType: !123)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !129, file: !32, line: 288, baseType: !123, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !98, file: !99, line: 27, baseType: !129, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !98, file: !99, line: 28, baseType: !129, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !98, file: !99, line: 29, baseType: !137, size: 192, offset: 768)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 192, elements: !139)
!138 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!139 = !{!140}
!140 = !DISubrange(count: 3)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !89, file: !90, line: 21, baseType: !79, size: 32, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !89, file: !90, line: 22, baseType: !79, size: 32, offset: 1120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !89, file: !90, line: 24, baseType: !144, size: 32, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !49, line: 20, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !147, line: 50, size: 320, elements: !148)
!147 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!148 = !{!149, !150, !163, !167, !168, !173, !174, !179, !180, !183}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !146, file: !147, line: 51, baseType: !61, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !146, file: !147, line: 52, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !49, line: 21, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !154, line: 89, size: 160, elements: !155)
!154 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!155 = !{!156, !157, !158, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !153, file: !154, line: 90, baseType: !93, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 91, baseType: !35, size: 64, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !153, file: !154, line: 93, baseType: !159, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !151, !144}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 94, baseType: !85, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !146, file: !147, line: 54, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !165, line: 98, baseType: !166)
!165 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!166 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !146, file: !147, line: 56, baseType: !132, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !146, file: !147, line: 58, baseType: !169, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !147, line: 45, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{!43, !144, !43, !40}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 59, baseType: !85, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !146, file: !147, line: 61, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !147, line: 46, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !144, !61, !43, !40}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !146, file: !147, line: 62, baseType: !85, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !146, file: !147, line: 70, baseType: !181, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 72, baseType: !144, size: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !89, file: !90, line: 37, baseType: !41, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !89, file: !90, line: 38, baseType: !41, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !74, file: !69, line: 30, baseType: !72, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !74, file: !69, line: 34, baseType: !41, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !74, file: !69, line: 40, baseType: !41, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !74, file: !69, line: 43, baseType: !41, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !74, file: !69, line: 45, baseType: !41, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !74, file: !69, line: 46, baseType: !41, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !74, file: !69, line: 47, baseType: !41, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !74, file: !69, line: 48, baseType: !41, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !74, file: !69, line: 49, baseType: !41, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !74, file: !69, line: 50, baseType: !41, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !74, file: !69, line: 52, baseType: !41, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !74, file: !69, line: 53, baseType: !41, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !74, file: !69, line: 55, baseType: !33, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !69, line: 61, baseType: !66, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !50, file: !51, line: 62, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !51, line: 41, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !51, line: 43, size: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !51, line: 44, baseType: !201, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !203, file: !51, line: 45, baseType: !85, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !50, file: !51, line: 63, baseType: !208, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !51, line: 32, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !51, line: 34, size: 96, elements: !211)
!211 = !{!212, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !210, file: !51, line: 35, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !51, line: 30, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !85}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !51, line: 36, baseType: !85, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !51, line: 37, baseType: !208, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !50, file: !51, line: 64, baseType: !144, size: 32, offset: 288)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DILocalVariable(name: "host", arg: 1, scope: !26, file: !3, line: 1928, type: !34)
!222 = !DILocalVariable(name: "pool", arg: 2, scope: !26, file: !3, line: 1928, type: !47)
!223 = !DILocalVariable(name: "alloc", arg: 3, scope: !26, file: !3, line: 1928, type: !61)
!224 = !DILocalVariable(name: "h", scope: !26, file: !3, line: 1930, type: !43)
!225 = !DILocalVariable(name: "ch", scope: !26, file: !3, line: 1930, type: !44)
!226 = !DILocalVariable(name: "i", scope: !26, file: !3, line: 1931, type: !40)
!227 = !DILocalVariable(name: "dot_pos", scope: !26, file: !3, line: 1931, type: !40)
!228 = !DILocalVariable(name: "host_len", scope: !26, file: !3, line: 1931, type: !40)
!229 = !DILocalVariable(name: "state", scope: !26, file: !3, line: 1937, type: !25)
!230 = !{!231, !232, !233}
!231 = !DIEnumerator(name: "sw_usual", value: 0)
!232 = !DIEnumerator(name: "sw_literal", value: 1)
!233 = !DIEnumerator(name: "sw_rest", value: 2)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 109, size: 32, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIEnumerator(name: "NGX_TCP_NOPUSH_UNSET", value: 0)
!237 = !DIEnumerator(name: "NGX_TCP_NOPUSH_SET", value: 1)
!238 = !DIEnumerator(name: "NGX_TCP_NOPUSH_DISABLED", value: 2)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 102, size: 32, elements: !240)
!240 = !{!241, !242, !243}
!241 = !DIEnumerator(name: "NGX_TCP_NODELAY_UNSET", value: 0)
!242 = !DIEnumerator(name: "NGX_TCP_NODELAY_SET", value: 1)
!243 = !DIEnumerator(name: "NGX_TCP_NODELAY_DISABLED", value: 2)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 108, size: 32, elements: !246)
!245 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!247 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!248 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!249 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!250 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!251 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!252 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!253 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!254 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!255 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!256 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!257 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!258 = !{!85, !259, !291, !293, !305, !43, !313, !1853, !1855, !40, !1857, !181, !925, !132, !438, !44}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !261, line: 34, size: 224, elements: !262)
!261 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!262 = !{!263, !266, !269, !271, !290}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !260, file: !261, line: 35, baseType: !264, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !32, line: 409, baseType: !265)
!265 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !260, file: !261, line: 36, baseType: !267, size: 16, offset: 16)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !261, line: 12, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 186, baseType: !265)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !260, file: !261, line: 37, baseType: !270, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 191, baseType: !41)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !260, file: !261, line: 38, baseType: !272, size: 128, offset: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !261, line: 23, size: 128, elements: !273)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !272, file: !261, line: 28, baseType: !275, size: 128)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !261, line: 24, size: 128, elements: !276)
!276 = !{!277, !282, !286}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !275, file: !261, line: 25, baseType: !278, size: 128)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !280)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 181, baseType: !46)
!280 = !{!281}
!281 = !DISubrange(count: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !275, file: !261, line: 26, baseType: !283, size: 128)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !275, file: !261, line: 27, baseType: !287, size: 128)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 128, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 4)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !260, file: !261, line: 39, baseType: !270, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !261, line: 16, size: 128, elements: !295)
!295 = !{!296, !297, !298, !303}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !294, file: !261, line: 17, baseType: !264, size: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !294, file: !261, line: 18, baseType: !267, size: 16, offset: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !294, file: !261, line: 19, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !261, line: 14, size: 32, elements: !300)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !299, file: !261, line: 14, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !261, line: 13, baseType: !270)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !294, file: !261, line: 20, baseType: !304, size: 64, offset: 64)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 64, elements: !284)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !307, line: 20, baseType: !308)
!307 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !307, line: 16, size: 96, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !308, file: !307, line: 17, baseType: !132, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !308, file: !307, line: 18, baseType: !61, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !308, file: !307, line: 19, baseType: !29, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_ctx_t", file: !315, line: 20, baseType: !316)
!315 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_log_ctx_s", file: !315, line: 52, size: 96, elements: !317)
!317 = !{!318, !490, !1852}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !316, file: !315, line: 53, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !49, line: 26, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !6, line: 121, size: 896, elements: !322)
!322 = !{!323, !324, !380, !381, !384, !391, !393, !398, !403, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !6, line: 122, baseType: !85, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !321, file: !6, line: 123, baseType: !325, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !49, line: 24, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !328, line: 30, size: 384, elements: !329)
!328 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !357, !358, !359, !372}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !328, line: 31, baseType: !85, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !327, file: !328, line: 33, baseType: !41, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !327, file: !328, line: 35, baseType: !41, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !327, file: !328, line: 38, baseType: !41, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !327, file: !328, line: 44, baseType: !41, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !327, file: !328, line: 46, baseType: !41, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !327, file: !328, line: 49, baseType: !41, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !327, file: !328, line: 51, baseType: !41, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !327, file: !328, line: 54, baseType: !41, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !327, file: !328, line: 56, baseType: !41, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !327, file: !328, line: 57, baseType: !41, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !327, file: !328, line: 59, baseType: !41, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !327, file: !328, line: 60, baseType: !41, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !327, file: !328, line: 62, baseType: !41, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !327, file: !328, line: 64, baseType: !41, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !327, file: !328, line: 67, baseType: !41, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !327, file: !328, line: 69, baseType: !41, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !327, file: !328, line: 71, baseType: !41, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !327, file: !328, line: 74, baseType: !41, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !327, file: !328, line: 75, baseType: !41, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !327, file: !328, line: 77, baseType: !41, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !327, file: !328, line: 107, baseType: !41, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !327, file: !328, line: 110, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !49, line: 31, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !325}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !327, file: !328, line: 117, baseType: !61, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !327, file: !328, line: 119, baseType: !144, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !327, file: !328, line: 121, baseType: !360, size: 160, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !361, line: 20, baseType: !362)
!361 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !361, line: 22, size: 160, elements: !363)
!363 = !{!364, !366, !368, !369, !370, !371}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !362, file: !361, line: 23, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !361, line: 16, baseType: !61)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !362, file: !361, line: 24, baseType: !367, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !362, file: !361, line: 25, baseType: !367, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !362, file: !361, line: 26, baseType: !367, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !362, file: !361, line: 27, baseType: !44, size: 8, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !361, line: 28, baseType: !44, size: 8, offset: 136)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !327, file: !328, line: 124, baseType: !373, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !374, line: 16, baseType: !375)
!374 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !374, line: 18, size: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !374, line: 19, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !374, line: 20, baseType: !378, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !321, file: !6, line: 124, baseType: !325, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !321, file: !6, line: 126, baseType: !382, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !383, line: 17, baseType: !33)
!383 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !321, file: !6, line: 128, baseType: !385, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !386, line: 19, baseType: !387)
!386 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !319, !43, !40}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !32, line: 135, baseType: !33)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !321, file: !6, line: 129, baseType: !392, size: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !386, line: 22, baseType: !387)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !321, file: !6, line: 130, baseType: !394, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !386, line: 20, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!390, !319, !66, !79}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !321, file: !6, line: 131, baseType: !399, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !386, line: 23, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DISubroutineType(types: !402)
!402 = !{!66, !319, !66, !79}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !321, file: !6, line: 133, baseType: !404, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !6, line: 16, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !6, line: 18, size: 960, elements: !407)
!407 = !{!408, !409, !419, !421, !422, !423, !424, !425, !426, !427, !432, !433, !434, !435, !436, !437, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !406, file: !6, line: 19, baseType: !382, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !406, file: !6, line: 21, baseType: !410, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !412, line: 297, size: 128, elements: !413)
!412 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !411, file: !412, line: 298, baseType: !264, size: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !411, file: !412, line: 299, baseType: !416, size: 112, offset: 16)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 112, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 14)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !406, file: !6, line: 22, baseType: !420, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !32, line: 404, baseType: !41)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !406, file: !6, line: 23, baseType: !40, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !406, file: !6, line: 24, baseType: !35, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !6, line: 26, baseType: !33, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !406, file: !6, line: 28, baseType: !33, size: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !406, file: !6, line: 29, baseType: !33, size: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !406, file: !6, line: 30, baseType: !33, size: 32, offset: 288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !406, file: !6, line: 38, baseType: !428, size: 32, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !49, line: 32, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !319}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !406, file: !6, line: 40, baseType: !85, size: 32, offset: 352)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !406, file: !6, line: 42, baseType: !145, size: 320, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !406, file: !6, line: 43, baseType: !144, size: 32, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !406, file: !6, line: 45, baseType: !40, size: 32, offset: 736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !406, file: !6, line: 47, baseType: !40, size: 32, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !406, file: !6, line: 49, baseType: !438, size: 32, offset: 800)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !439, line: 16, baseType: !365)
!439 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!440 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !406, file: !6, line: 51, baseType: !404, size: 32, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !406, file: !6, line: 52, baseType: !319, size: 32, offset: 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !406, file: !6, line: 54, baseType: !61, size: 32, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !406, file: !6, line: 56, baseType: !41, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !406, file: !6, line: 57, baseType: !41, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !406, file: !6, line: 58, baseType: !41, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !406, file: !6, line: 60, baseType: !41, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !406, file: !6, line: 61, baseType: !41, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !406, file: !6, line: 62, baseType: !41, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !406, file: !6, line: 63, baseType: !41, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !406, file: !6, line: 64, baseType: !41, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !406, file: !6, line: 65, baseType: !41, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !406, file: !6, line: 66, baseType: !41, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !406, file: !6, line: 67, baseType: !41, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !406, file: !6, line: 70, baseType: !41, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !406, file: !6, line: 72, baseType: !41, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !406, file: !6, line: 73, baseType: !41, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !406, file: !6, line: 74, baseType: !41, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !406, file: !6, line: 76, baseType: !41, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !406, file: !6, line: 77, baseType: !41, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !406, file: !6, line: 78, baseType: !41, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !321, file: !6, line: 135, baseType: !79, size: 32, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !321, file: !6, line: 137, baseType: !144, size: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !321, file: !6, line: 139, baseType: !47, size: 32, offset: 352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !6, line: 141, baseType: !33, size: 32, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !321, file: !6, line: 143, baseType: !410, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !321, file: !6, line: 144, baseType: !420, size: 32, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !321, file: !6, line: 145, baseType: !35, size: 64, offset: 480)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !321, file: !6, line: 147, baseType: !35, size: 64, offset: 544)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !321, file: !6, line: 148, baseType: !267, size: 16, offset: 608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !321, file: !6, line: 154, baseType: !410, size: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !321, file: !6, line: 155, baseType: !420, size: 32, offset: 672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !321, file: !6, line: 157, baseType: !72, size: 32, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !321, file: !6, line: 159, baseType: !373, size: 64, offset: 736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !321, file: !6, line: 161, baseType: !164, size: 32, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !321, file: !6, line: 163, baseType: !61, size: 32, offset: 832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !321, file: !6, line: 165, baseType: !41, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !321, file: !6, line: 167, baseType: !41, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !321, file: !6, line: 169, baseType: !41, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !321, file: !6, line: 170, baseType: !41, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !321, file: !6, line: 171, baseType: !41, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !321, file: !6, line: 173, baseType: !41, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !321, file: !6, line: 174, baseType: !41, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !321, file: !6, line: 175, baseType: !41, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !321, file: !6, line: 176, baseType: !41, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !321, file: !6, line: 178, baseType: !41, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !321, file: !6, line: 179, baseType: !41, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !321, file: !6, line: 180, baseType: !41, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !321, file: !6, line: 181, baseType: !41, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !321, file: !6, line: 183, baseType: !41, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !316, file: !315, line: 54, baseType: !491, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !315, line: 16, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !14, line: 364, size: 5376, elements: !494)
!494 = !{!495, !496, !497, !499, !500, !501, !502, !507, !508, !737, !1405, !1406, !1407, !1408, !1447, !1477, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1522, !1533, !1540, !1541, !1543, !1544, !1557, !1558, !1559, !1560, !1561, !1562, !1748, !1752, !1757, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !493, file: !14, line: 365, baseType: !270, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !493, file: !14, line: 367, baseType: !319, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !493, file: !14, line: 369, baseType: !498, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !493, file: !14, line: 370, baseType: !498, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !493, file: !14, line: 371, baseType: !498, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !493, file: !14, line: 372, baseType: !498, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !493, file: !14, line: 374, baseType: !503, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !14, line: 361, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !491}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !493, file: !14, line: 375, baseType: !503, size: 32, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !493, file: !14, line: 378, baseType: !509, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !315, line: 18, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !512, line: 65, size: 3008, elements: !513)
!512 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!513 = !{!514, !515, !525, !526, !528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !695, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !511, file: !512, line: 66, baseType: !88, size: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !511, file: !512, line: 67, baseType: !516, size: 160, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !517, line: 22, baseType: !518)
!517 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 16, size: 160, elements: !519)
!519 = !{!520, !521, !522, !523, !524}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !518, file: !517, line: 17, baseType: !85, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !518, file: !517, line: 18, baseType: !61, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !518, file: !517, line: 19, baseType: !40, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !518, file: !517, line: 20, baseType: !61, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !518, file: !517, line: 21, baseType: !47, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !511, file: !512, line: 68, baseType: !270, size: 32, offset: 1376)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !511, file: !512, line: 69, baseType: !527, size: 128, offset: 1408)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !511, file: !512, line: 70, baseType: !527, size: 128, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !511, file: !512, line: 72, baseType: !530, size: 32, offset: 1664)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !94, line: 18, baseType: !105)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !511, file: !512, line: 73, baseType: !132, size: 32, offset: 1696)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !511, file: !512, line: 74, baseType: !132, size: 32, offset: 1728)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !511, file: !512, line: 75, baseType: !132, size: 32, offset: 1760)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !511, file: !512, line: 76, baseType: !132, size: 32, offset: 1792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !511, file: !512, line: 77, baseType: !132, size: 32, offset: 1824)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !511, file: !512, line: 79, baseType: !35, size: 64, offset: 1856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !511, file: !512, line: 80, baseType: !35, size: 64, offset: 1920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !511, file: !512, line: 81, baseType: !527, size: 128, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !511, file: !512, line: 83, baseType: !40, size: 32, offset: 2112)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !511, file: !512, line: 84, baseType: !40, size: 32, offset: 2144)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !511, file: !512, line: 85, baseType: !79, size: 32, offset: 2176)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !511, file: !512, line: 86, baseType: !79, size: 32, offset: 2208)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !511, file: !512, line: 88, baseType: !61, size: 32, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !511, file: !512, line: 89, baseType: !61, size: 32, offset: 2272)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !511, file: !512, line: 90, baseType: !61, size: 32, offset: 2304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !511, file: !512, line: 91, baseType: !61, size: 32, offset: 2336)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !511, file: !512, line: 93, baseType: !72, size: 32, offset: 2368)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !511, file: !512, line: 95, baseType: !549, size: 32, offset: 2400)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !315, line: 19, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !512, line: 157, size: 544, elements: !552)
!552 = !{!553, !578, !637, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !694}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !551, file: !512, line: 158, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !512, line: 154, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 145, size: 480, elements: !557)
!557 = !{!558, !569, !570, !571, !574, !575, !576, !577}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !556, file: !512, line: 146, baseType: !559, size: 96)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !361, line: 32, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !361, line: 37, size: 96, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !560, file: !361, line: 38, baseType: !367, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !560, file: !361, line: 39, baseType: !367, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !560, file: !361, line: 40, baseType: !565, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !361, line: 34, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !367, !367, !367}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !556, file: !512, line: 147, baseType: !360, size: 160, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !556, file: !512, line: 148, baseType: !373, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !556, file: !512, line: 149, baseType: !572, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !165, line: 106, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !556, file: !512, line: 150, baseType: !572, size: 32, offset: 352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !512, line: 151, baseType: !79, size: 32, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !556, file: !512, line: 152, baseType: !61, size: 32, offset: 416)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !556, file: !512, line: 153, baseType: !61, size: 32, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !551, file: !512, line: 159, baseType: !579, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !581, line: 59, baseType: !582)
!581 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 34, size: 800, elements: !583)
!583 = !{!584, !591, !592, !593, !601, !602, !603, !612, !613, !614, !615, !632, !633, !634, !635, !636}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !582, file: !581, line: 35, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !586, line: 21, baseType: !587)
!586 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 16, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !587, file: !586, line: 17, baseType: !572, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !587, file: !586, line: 19, baseType: !572, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !582, file: !581, line: 37, baseType: !40, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !582, file: !581, line: 38, baseType: !40, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !582, file: !581, line: 40, baseType: !594, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !581, line: 16, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !581, line: 18, size: 96, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !596, file: !581, line: 19, baseType: !62, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !581, line: 20, baseType: !594, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !581, line: 21, baseType: !62, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !582, file: !581, line: 41, baseType: !594, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !582, file: !581, line: 42, baseType: !595, size: 96, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !582, file: !581, line: 44, baseType: !604, size: 32, offset: 288)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !581, line: 31, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 25, size: 128, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !606, file: !581, line: 26, baseType: !61, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !606, file: !581, line: 27, baseType: !61, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !606, file: !581, line: 29, baseType: !61, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !606, file: !581, line: 30, baseType: !61, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !582, file: !581, line: 45, baseType: !61, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !582, file: !581, line: 47, baseType: !43, size: 32, offset: 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !582, file: !581, line: 48, baseType: !43, size: 32, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !582, file: !581, line: 50, baseType: !616, size: 256, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !586, line: 37, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 24, size: 256, elements: !618)
!618 = !{!619, !621, !622, !623, !631}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !617, file: !586, line: 26, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !617, file: !586, line: 28, baseType: !620, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !617, file: !586, line: 29, baseType: !61, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !617, file: !586, line: 30, baseType: !624, size: 128, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !625, line: 19, baseType: !626)
!625 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 17, size: 128, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !626, file: !625, line: 18, baseType: !629, size: 128)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 128, elements: !288)
!630 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !617, file: !586, line: 36, baseType: !61, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !582, file: !581, line: 52, baseType: !43, size: 32, offset: 672)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !582, file: !581, line: 53, baseType: !44, size: 8, offset: 704)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !582, file: !581, line: 55, baseType: !41, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !582, file: !581, line: 57, baseType: !85, size: 32, offset: 736)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !582, file: !581, line: 58, baseType: !85, size: 32, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !551, file: !512, line: 161, baseType: !638, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !90, line: 62, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 50, size: 384, elements: !641)
!641 = !{!642, !643, !644, !646, !651, !653, !655, !656, !657}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !90, line: 51, baseType: !35, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !640, file: !90, line: 52, baseType: !40, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !640, file: !90, line: 53, baseType: !645, size: 96, offset: 96)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 96, elements: !139)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !640, file: !90, line: 55, baseType: !647, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !90, line: 45, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DISubroutineType(types: !650)
!650 = !{!438, !85}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !640, file: !90, line: 56, baseType: !652, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !90, line: 46, baseType: !648)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !640, file: !90, line: 57, baseType: !654, size: 32, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !90, line: 47, baseType: !214)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !640, file: !90, line: 58, baseType: !85, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !640, file: !90, line: 60, baseType: !43, size: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !640, file: !90, line: 61, baseType: !61, size: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !551, file: !512, line: 163, baseType: !79, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !551, file: !512, line: 164, baseType: !40, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !551, file: !512, line: 166, baseType: !132, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !551, file: !512, line: 168, baseType: !132, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !551, file: !512, line: 170, baseType: !61, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !551, file: !512, line: 171, baseType: !61, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !551, file: !512, line: 172, baseType: !438, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !551, file: !512, line: 173, baseType: !438, size: 32, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !551, file: !512, line: 174, baseType: !438, size: 32, offset: 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !551, file: !512, line: 176, baseType: !61, size: 32, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !551, file: !512, line: 177, baseType: !438, size: 32, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !551, file: !512, line: 178, baseType: !438, size: 32, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !551, file: !512, line: 180, baseType: !671, size: 32, offset: 480)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !673, line: 25, baseType: !674)
!673 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !673, line: 29, size: 320, elements: !675)
!675 = !{!676, !677, !687, !692, !693}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !674, file: !673, line: 30, baseType: !85, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !674, file: !673, line: 31, baseType: !678, size: 192, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !679, line: 22, baseType: !680)
!679 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !679, line: 16, size: 192, elements: !681)
!681 = !{!682, !683, !684, !685, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !680, file: !679, line: 17, baseType: !43, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !679, line: 18, baseType: !40, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !679, line: 19, baseType: !35, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !680, file: !679, line: 20, baseType: !144, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !680, file: !679, line: 21, baseType: !61, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !674, file: !673, line: 32, baseType: !688, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !673, line: 27, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DISubroutineType(types: !691)
!691 = !{!29, !671, !85}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !674, file: !673, line: 33, baseType: !85, size: 32, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !674, file: !673, line: 34, baseType: !61, size: 32, offset: 288)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !551, file: !512, line: 182, baseType: !61, size: 32, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !511, file: !512, line: 96, baseType: !696, size: 32, offset: 2432)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !512, line: 62, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 39, size: 576, elements: !699)
!699 = !{!700, !701, !702, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !698, file: !512, line: 40, baseType: !360, size: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !698, file: !512, line: 41, baseType: !373, size: 64, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !698, file: !512, line: 43, baseType: !703, size: 96, offset: 224)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 12)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !698, file: !512, line: 46, baseType: !41, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !698, file: !512, line: 47, baseType: !41, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !698, file: !512, line: 48, baseType: !41, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !698, file: !512, line: 49, baseType: !41, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !698, file: !512, line: 50, baseType: !41, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !698, file: !512, line: 51, baseType: !41, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !698, file: !512, line: 52, baseType: !41, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !698, file: !512, line: 53, baseType: !41, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !698, file: !512, line: 56, baseType: !530, size: 32, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !698, file: !512, line: 57, baseType: !132, size: 32, offset: 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !698, file: !512, line: 58, baseType: !132, size: 32, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !698, file: !512, line: 59, baseType: !40, size: 32, offset: 480)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !698, file: !512, line: 60, baseType: !79, size: 32, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !698, file: !512, line: 61, baseType: !438, size: 32, offset: 544)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !511, file: !512, line: 102, baseType: !438, size: 32, offset: 2464)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !511, file: !512, line: 103, baseType: !438, size: 32, offset: 2496)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !511, file: !512, line: 104, baseType: !438, size: 32, offset: 2528)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !511, file: !512, line: 105, baseType: !438, size: 32, offset: 2560)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !511, file: !512, line: 107, baseType: !326, size: 384, offset: 2592)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !511, file: !512, line: 109, baseType: !41, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !511, file: !512, line: 110, baseType: !41, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !511, file: !512, line: 112, baseType: !41, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !511, file: !512, line: 113, baseType: !41, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !511, file: !512, line: 114, baseType: !41, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !511, file: !512, line: 115, baseType: !41, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !511, file: !512, line: 116, baseType: !41, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !511, file: !512, line: 117, baseType: !41, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !511, file: !512, line: 118, baseType: !41, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !511, file: !512, line: 119, baseType: !41, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !511, file: !512, line: 121, baseType: !41, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !511, file: !512, line: 122, baseType: !41, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !493, file: !14, line: 381, baseType: !738, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !315, line: 17, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !741, line: 313, size: 4096, elements: !742)
!741 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!742 = !{!743, !748, !749, !789, !868, !869, !891, !900, !1157, !1158, !1159, !1197, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1350, !1354, !1355, !1359, !1360, !1361, !1362, !1363, !1367, !1371, !1375, !1376, !1388, !1389, !1390, !1391, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !740, file: !741, line: 314, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !741, line: 309, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !491, !738}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !740, file: !741, line: 315, baseType: !744, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !740, file: !741, line: 317, baseType: !750, size: 480, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !751, line: 22, baseType: !752)
!751 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !751, line: 36, size: 480, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !766, !771, !773, !774, !783, !784, !785, !786, !787, !788}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !752, file: !751, line: 37, baseType: !319, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !752, file: !751, line: 39, baseType: !410, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !752, file: !751, line: 40, baseType: !420, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !751, line: 41, baseType: !34, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !752, file: !751, line: 43, baseType: !61, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !752, file: !751, line: 44, baseType: !438, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !752, file: !751, line: 46, baseType: !761, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !751, line: 24, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!29, !765, !85}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !752, file: !751, line: 47, baseType: !767, size: 32, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !751, line: 26, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !765, !85, !61}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !752, file: !751, line: 48, baseType: !772, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !751, line: 28, baseType: !768)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !751, line: 49, baseType: !85, size: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !752, file: !751, line: 56, baseType: !775, size: 32, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !777, line: 78, baseType: !778)
!777 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !777, line: 74, size: 128, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !778, file: !777, line: 75, baseType: !410, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !778, file: !777, line: 76, baseType: !420, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !778, file: !777, line: 77, baseType: !35, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !751, line: 58, baseType: !33, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !752, file: !751, line: 59, baseType: !33, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !752, file: !751, line: 61, baseType: !144, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !752, file: !751, line: 63, baseType: !41, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !752, file: !751, line: 64, baseType: !41, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !752, file: !751, line: 67, baseType: !41, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !740, file: !741, line: 319, baseType: !790, size: 32, offset: 544)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !792, line: 17, baseType: !793)
!792 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !792, line: 25, size: 1120, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !801, !802, !803, !804, !805, !810, !811, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !867}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !793, file: !792, line: 26, baseType: !319, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !793, file: !792, line: 27, baseType: !319, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !793, file: !792, line: 29, baseType: !66, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !793, file: !792, line: 30, baseType: !66, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !793, file: !792, line: 31, baseType: !800, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !793, file: !792, line: 33, baseType: !66, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !793, file: !792, line: 35, baseType: !66, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !793, file: !792, line: 36, baseType: !66, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !793, file: !792, line: 37, baseType: !66, size: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !793, file: !792, line: 44, baseType: !806, size: 32, offset: 288)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !792, line: 19, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{!29, !790, !72}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !793, file: !792, line: 45, baseType: !85, size: 32, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !793, file: !792, line: 47, baseType: !812, size: 32, offset: 352)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !792, line: 21, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!29, !85, !66}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !793, file: !792, line: 48, baseType: !85, size: 32, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !793, file: !792, line: 57, baseType: !41, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !793, file: !792, line: 58, baseType: !41, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !793, file: !792, line: 59, baseType: !41, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !793, file: !792, line: 60, baseType: !41, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !793, file: !792, line: 61, baseType: !41, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !793, file: !792, line: 62, baseType: !41, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !793, file: !792, line: 63, baseType: !41, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !793, file: !792, line: 64, baseType: !41, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !793, file: !792, line: 65, baseType: !41, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !793, file: !792, line: 66, baseType: !41, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !793, file: !792, line: 67, baseType: !41, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !793, file: !792, line: 68, baseType: !41, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !793, file: !792, line: 70, baseType: !29, size: 32, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !793, file: !792, line: 71, baseType: !831, size: 64, offset: 480)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !69, line: 68, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 65, size: 64, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !832, file: !69, line: 66, baseType: !29, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !832, file: !69, line: 67, baseType: !40, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !793, file: !792, line: 72, baseType: !84, size: 32, offset: 544)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !793, file: !792, line: 74, baseType: !390, size: 32, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !793, file: !792, line: 76, baseType: !79, size: 32, offset: 608)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !793, file: !792, line: 77, baseType: !79, size: 32, offset: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !793, file: !792, line: 79, baseType: !79, size: 32, offset: 672)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !793, file: !792, line: 80, baseType: !390, size: 32, offset: 704)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !793, file: !792, line: 82, baseType: !438, size: 32, offset: 736)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !793, file: !792, line: 83, baseType: !438, size: 32, offset: 768)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !793, file: !792, line: 84, baseType: !390, size: 32, offset: 800)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !793, file: !792, line: 86, baseType: !47, size: 32, offset: 832)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !793, file: !792, line: 87, baseType: !144, size: 32, offset: 864)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !793, file: !792, line: 89, baseType: !66, size: 32, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !793, file: !792, line: 90, baseType: !40, size: 32, offset: 928)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !793, file: !792, line: 91, baseType: !72, size: 32, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !793, file: !792, line: 93, baseType: !40, size: 32, offset: 992)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !793, file: !792, line: 94, baseType: !132, size: 32, offset: 1024)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !793, file: !792, line: 96, baseType: !853, size: 32, offset: 1056)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !90, line: 84, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 71, size: 1408, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !855, file: !90, line: 72, baseType: !88, size: 1216)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !855, file: !90, line: 73, baseType: !79, size: 32, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !855, file: !90, line: 74, baseType: !638, size: 32, offset: 1248)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !855, file: !90, line: 75, baseType: !47, size: 32, offset: 1280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !855, file: !90, line: 76, baseType: !181, size: 32, offset: 1312)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !855, file: !90, line: 78, baseType: !61, size: 32, offset: 1344)
