; ModuleID = 'src/http/ngx_http_special_response.c'
source_filename = "src/http/ngx_http_special_response.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_error_full_tail", scope: !2, file: !3, line: 21, type: !14, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11)
!3 = !DIFile(filename: "src/http/ngx_http_special_response.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!0, !12, !17, !22, !36, !42, !47, !52, !57, !62, !67, !72, !74, !76, !78, !83, !85, !90, !95, !100, !105, !110, !115, !117, !122, !124, !126, !131, !136, !141, !146, !148, !150, !152, !154, !156, !161, !166, !171}
!12 = !DIGlobalVariableExpression(var: !13)
!13 = distinct !DIGlobalVariable(name: "ngx_http_error_build_tail", scope: !2, file: !3, line: 28, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 432, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 54)
!17 = !DIGlobalVariableExpression(var: !18)
!18 = distinct !DIGlobalVariable(name: "ngx_http_error_tail", scope: !2, file: !3, line: 35, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 376, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 47)
!22 = !DIGlobalVariableExpression(var: !23)
!23 = distinct !DIGlobalVariable(name: "ngx_http_error_pages", scope: !2, file: !3, line: 324, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 3328, elements: !34)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !26, line: 19, baseType: !27)
!26 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 16, size: 64, elements: !28)
!28 = !{!29, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, file: !26, line: 17, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 120, baseType: !32)
!31 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !27, file: !26, line: 18, baseType: !7, size: 32, offset: 32)
!34 = !{!35}
!35 = !DISubrange(count: 52)
!36 = !DIGlobalVariableExpression(var: !37)
!37 = distinct !DIGlobalVariable(name: "ngx_http_error_301_page", scope: !2, file: !3, line: 60, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1064, elements: !40)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !{!41}
!41 = !DISubrange(count: 133)
!42 = !DIGlobalVariableExpression(var: !43)
!43 = distinct !DIGlobalVariable(name: "ngx_http_error_302_page", scope: !2, file: !3, line: 68, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 872, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 109)
!47 = !DIGlobalVariableExpression(var: !48)
!48 = distinct !DIGlobalVariable(name: "ngx_http_error_303_page", scope: !2, file: !3, line: 76, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 936, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 117)
!52 = !DIGlobalVariableExpression(var: !53)
!53 = distinct !DIGlobalVariable(name: "ngx_http_error_307_page", scope: !2, file: !3, line: 84, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1080, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 135)
!57 = !DIGlobalVariableExpression(var: !58)
!58 = distinct !DIGlobalVariable(name: "ngx_http_error_400_page", scope: !2, file: !3, line: 92, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 968, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 121)
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "ngx_http_error_401_page", scope: !2, file: !3, line: 100, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1144, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 143)
!67 = !DIGlobalVariableExpression(var: !68)
!68 = distinct !DIGlobalVariable(name: "ngx_http_error_402_page", scope: !2, file: !3, line: 108, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1048, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 131)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "ngx_http_error_403_page", scope: !2, file: !3, line: 116, type: !49, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75)
!75 = distinct !DIGlobalVariable(name: "ngx_http_error_404_page", scope: !2, file: !3, line: 124, type: !49, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "ngx_http_error_405_page", scope: !2, file: !3, line: 132, type: !59, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79)
!79 = distinct !DIGlobalVariable(name: "ngx_http_error_406_page", scope: !2, file: !3, line: 140, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1016, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 127)
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "ngx_http_error_408_page", scope: !2, file: !3, line: 148, type: !69, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86)
!86 = distinct !DIGlobalVariable(name: "ngx_http_error_409_page", scope: !2, file: !3, line: 156, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 920, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 115)
!90 = !DIGlobalVariableExpression(var: !91)
!91 = distinct !DIGlobalVariable(name: "ngx_http_error_410_page", scope: !2, file: !3, line: 164, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 856, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 107)
!95 = !DIGlobalVariableExpression(var: !96)
!96 = distinct !DIGlobalVariable(name: "ngx_http_error_411_page", scope: !2, file: !3, line: 172, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1032, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 129)
!100 = !DIGlobalVariableExpression(var: !101)
!101 = distinct !DIGlobalVariable(name: "ngx_http_error_412_page", scope: !2, file: !3, line: 180, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1096, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 137)
!105 = !DIGlobalVariableExpression(var: !106)
!106 = distinct !DIGlobalVariable(name: "ngx_http_error_413_page", scope: !2, file: !3, line: 188, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1176, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 147)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "ngx_http_error_414_page", scope: !2, file: !3, line: 196, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1128, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 141)
!115 = !DIGlobalVariableExpression(var: !116)
!116 = distinct !DIGlobalVariable(name: "ngx_http_error_415_page", scope: !2, file: !3, line: 204, type: !64, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118)
!118 = distinct !DIGlobalVariable(name: "ngx_http_error_416_page", scope: !2, file: !3, line: 212, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1288, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 161)
!122 = !DIGlobalVariableExpression(var: !123)
!123 = distinct !DIGlobalVariable(name: "ngx_http_error_421_page", scope: !2, file: !3, line: 220, type: !102, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "ngx_http_error_429_page", scope: !2, file: !3, line: 228, type: !38, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127)
!127 = distinct !DIGlobalVariable(name: "ngx_http_error_494_page", scope: !2, file: !3, line: 236, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1576, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 197)
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "ngx_http_error_495_page", scope: !2, file: !3, line: 246, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1432, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 179)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "ngx_http_error_496_page", scope: !2, file: !3, line: 256, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1608, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 201)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "ngx_http_error_497_page", scope: !2, file: !3, line: 266, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1752, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 219)
!146 = !DIGlobalVariableExpression(var: !147)
!147 = distinct !DIGlobalVariable(name: "ngx_http_error_500_page", scope: !2, file: !3, line: 276, type: !112, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149)
!149 = distinct !DIGlobalVariable(name: "ngx_http_error_501_page", scope: !2, file: !3, line: 284, type: !97, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151)
!151 = distinct !DIGlobalVariable(name: "ngx_http_error_502_page", scope: !2, file: !3, line: 292, type: !59, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "ngx_http_error_503_page", scope: !2, file: !3, line: 300, type: !119, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155)
!155 = distinct !DIGlobalVariable(name: "ngx_http_error_504_page", scope: !2, file: !3, line: 308, type: !69, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157)
!157 = distinct !DIGlobalVariable(name: "ngx_http_error_507_page", scope: !2, file: !3, line: 316, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1112, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 139)
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "ngx_http_msie_padding", scope: !2, file: !3, line: 42, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 3224, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 403)
!166 = !DIGlobalVariableExpression(var: !167)
!167 = distinct !DIGlobalVariable(name: "ngx_http_msie_refresh_head", scope: !2, file: !3, line: 52, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 448, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 56)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "ngx_http_msie_refresh_tail", scope: !2, file: !3, line: 56, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 32)
!176 = !{i32 2, !"Dwarf Version", i32 4}
!177 = !{i32 2, !"Debug Info Version", i32 3}
!178 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!179 = distinct !DISubprogram(name: "ngx_http_special_response_handler", scope: !3, file: !3, line: 399, type: !180, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1928)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !186, !182}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !183, line: 78, baseType: !184)
!183 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !31, line: 140, baseType: !185)
!185 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !188, line: 16, baseType: !189)
!188 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !190, line: 364, size: 5376, elements: !191)
!190 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!191 = !{!192, !194, !543, !545, !546, !547, !548, !553, !554, !787, !1483, !1484, !1485, !1486, !1525, !1555, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1600, !1611, !1618, !1619, !1621, !1622, !1635, !1636, !1637, !1638, !1639, !1640, !1827, !1831, !1836, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !189, file: !190, line: 365, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 191, baseType: !32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !189, file: !190, line: 367, baseType: !195, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !197, line: 26, baseType: !198)
!197 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !199, line: 121, size: 896, elements: !200)
!199 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!200 = !{!201, !202, !303, !304, !307, !314, !316, !410, !415, !475, !476, !477, !514, !515, !516, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !199, line: 122, baseType: !6, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !198, file: !199, line: 123, baseType: !203, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !197, line: 24, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !206, line: 30, size: 384, elements: !207)
!206 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !235, !238, !282, !295}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !205, file: !206, line: 31, baseType: !6, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !205, file: !206, line: 33, baseType: !32, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !205, file: !206, line: 35, baseType: !32, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !205, file: !206, line: 38, baseType: !32, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !205, file: !206, line: 44, baseType: !32, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !205, file: !206, line: 46, baseType: !32, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !205, file: !206, line: 49, baseType: !32, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !205, file: !206, line: 51, baseType: !32, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !205, file: !206, line: 54, baseType: !32, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !205, file: !206, line: 56, baseType: !32, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !205, file: !206, line: 57, baseType: !32, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !205, file: !206, line: 59, baseType: !32, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !205, file: !206, line: 60, baseType: !32, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !205, file: !206, line: 62, baseType: !32, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !205, file: !206, line: 64, baseType: !32, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !205, file: !206, line: 67, baseType: !32, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !205, file: !206, line: 69, baseType: !32, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !205, file: !206, line: 71, baseType: !32, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !205, file: !206, line: 74, baseType: !32, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !205, file: !206, line: 75, baseType: !32, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !205, file: !206, line: 77, baseType: !32, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !205, file: !206, line: 107, baseType: !32, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !205, file: !206, line: 110, baseType: !231, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !197, line: 31, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !203}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !205, file: !206, line: 117, baseType: !236, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !183, line: 79, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 125, baseType: !32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !205, file: !206, line: 119, baseType: !239, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !197, line: 20, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !242, line: 50, size: 320, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !245, !260, !264, !267, !272, !273, !278, !279, !281}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !241, file: !242, line: 51, baseType: !236, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !241, file: !242, line: 52, baseType: !246, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !197, line: 21, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !249, line: 89, size: 160, elements: !250)
!249 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!250 = !{!251, !254, !255, !259}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !248, file: !249, line: 90, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !253, line: 16, baseType: !185)
!253 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !249, line: 91, baseType: !25, size: 64, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !248, file: !249, line: 93, baseType: !256, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !246, !239}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !249, line: 94, baseType: !6, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !241, file: !242, line: 54, baseType: !261, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !262, line: 98, baseType: !263)
!262 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!263 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !241, file: !242, line: 56, baseType: !265, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !31, line: 75, baseType: !266)
!266 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !241, file: !242, line: 58, baseType: !268, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !242, line: 45, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!7, !239, !7, !30}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !242, line: 59, baseType: !6, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !241, file: !242, line: 61, baseType: !274, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !242, line: 46, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !239, !236, !7, !30}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !241, file: !242, line: 62, baseType: !6, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !241, file: !242, line: 70, baseType: !280, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !242, line: 72, baseType: !239, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !205, file: !206, line: 121, baseType: !283, size: 160, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !284, line: 20, baseType: !285)
!284 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !284, line: 22, size: 160, elements: !286)
!286 = !{!287, !289, !291, !292, !293, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !285, file: !284, line: 23, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !284, line: 16, baseType: !236)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !285, file: !284, line: 24, baseType: !290, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !285, file: !284, line: 25, baseType: !290, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !285, file: !284, line: 26, baseType: !290, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !285, file: !284, line: 27, baseType: !8, size: 8, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !284, line: 28, baseType: !8, size: 8, offset: 136)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !205, file: !206, line: 124, baseType: !296, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !297, line: 16, baseType: !298)
!297 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !297, line: 18, size: 64, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !297, line: 19, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !297, line: 20, baseType: !301, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !198, file: !199, line: 124, baseType: !203, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !198, file: !199, line: 126, baseType: !305, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !306, line: 17, baseType: !185)
!306 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!307 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !198, file: !199, line: 128, baseType: !308, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !309, line: 19, baseType: !310)
!309 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !195, !7, !30}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !31, line: 135, baseType: !185)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !198, file: !199, line: 129, baseType: !315, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !309, line: 22, baseType: !310)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !198, file: !199, line: 130, baseType: !317, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !309, line: 20, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DISubroutineType(types: !320)
!320 = !{!313, !195, !321, !334}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !197, line: 19, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !324, line: 59, size: 64, elements: !325)
!324 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!325 = !{!326, !409}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !323, file: !324, line: 60, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !324, line: 18, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !324, line: 20, size: 352, elements: !330)
!330 = !{!331, !332, !333, !335, !336, !337, !338, !340, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !329, file: !324, line: 21, baseType: !7, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !329, file: !324, line: 22, baseType: !7, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !329, file: !324, line: 23, baseType: !334, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !31, line: 222, baseType: !185)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !329, file: !324, line: 24, baseType: !334, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !329, file: !324, line: 26, baseType: !7, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !329, file: !324, line: 27, baseType: !7, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !329, file: !324, line: 28, baseType: !339, size: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !324, line: 16, baseType: !6)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !329, file: !324, line: 29, baseType: !341, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !197, line: 23, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !344, line: 16, size: 1216, elements: !345)
!344 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!345 = !{!346, !347, !348, !391, !392, !393, !394, !395}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !343, file: !344, line: 17, baseType: !252, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !344, line: 18, baseType: !25, size: 64, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !343, file: !344, line: 19, baseType: !349, size: 960, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !253, line: 17, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !351, line: 4, size: 960, elements: !352)
!351 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!352 = !{!353, !355, !356, !358, !359, !361, !362, !364, !366, !368, !369, !370, !371, !372, !373, !375, !376, !378, !379, !384, !385, !386}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !350, file: !351, line: 6, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !31, line: 232, baseType: !32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !350, file: !351, line: 7, baseType: !354, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !350, file: !351, line: 8, baseType: !357, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !31, line: 227, baseType: !32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !350, file: !351, line: 9, baseType: !357, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !350, file: !351, line: 10, baseType: !360, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !31, line: 217, baseType: !32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !350, file: !351, line: 11, baseType: !360, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !350, file: !351, line: 13, baseType: !363, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !31, line: 212, baseType: !32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !350, file: !351, line: 14, baseType: !365, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !31, line: 304, baseType: !32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !350, file: !351, line: 15, baseType: !367, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !31, line: 309, baseType: !32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !350, file: !351, line: 16, baseType: !32, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !350, file: !351, line: 17, baseType: !354, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !350, file: !351, line: 18, baseType: !354, size: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !350, file: !351, line: 19, baseType: !334, size: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !350, file: !351, line: 20, baseType: !334, size: 32, offset: 416)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !350, file: !351, line: 21, baseType: !374, size: 32, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !31, line: 237, baseType: !266)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !350, file: !351, line: 22, baseType: !374, size: 32, offset: 480)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !350, file: !351, line: 23, baseType: !377, size: 32, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !31, line: 242, baseType: !185)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !350, file: !351, line: 24, baseType: !377, size: 32, offset: 544)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !350, file: !351, line: 26, baseType: !380, size: 64, offset: 576)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !31, line: 288, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !380, file: !31, line: 288, baseType: !265, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !380, file: !31, line: 288, baseType: !266, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !350, file: !351, line: 27, baseType: !380, size: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !350, file: !351, line: 28, baseType: !380, size: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !350, file: !351, line: 29, baseType: !387, size: 192, offset: 768)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 192, elements: !389)
!388 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!389 = !{!390}
!390 = !DISubrange(count: 3)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !343, file: !344, line: 21, baseType: !334, size: 32, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !343, file: !344, line: 22, baseType: !334, size: 32, offset: 1120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !343, file: !344, line: 24, baseType: !239, size: 32, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !343, file: !344, line: 37, baseType: !32, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !343, file: !344, line: 38, baseType: !32, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !329, file: !324, line: 30, baseType: !327, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !329, file: !324, line: 34, baseType: !32, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !329, file: !324, line: 40, baseType: !32, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !329, file: !324, line: 43, baseType: !32, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !329, file: !324, line: 45, baseType: !32, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !329, file: !324, line: 46, baseType: !32, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !329, file: !324, line: 47, baseType: !32, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !329, file: !324, line: 48, baseType: !32, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !329, file: !324, line: 49, baseType: !32, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !329, file: !324, line: 50, baseType: !32, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !329, file: !324, line: 52, baseType: !32, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !329, file: !324, line: 53, baseType: !32, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !329, file: !324, line: 55, baseType: !185, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !324, line: 61, baseType: !321, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !198, file: !199, line: 131, baseType: !411, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !309, line: 23, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{!321, !195, !321, !334}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !198, file: !199, line: 133, baseType: !416, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !199, line: 16, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !199, line: 18, size: 960, elements: !419)
!419 = !{!420, !421, !433, !435, !436, !437, !438, !439, !440, !441, !446, !447, !448, !449, !450, !451, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !418, file: !199, line: 19, baseType: !305, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !418, file: !199, line: 21, baseType: !422, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !424, line: 297, size: 128, elements: !425)
!424 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!425 = !{!426, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !423, file: !424, line: 298, baseType: !427, size: 16)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !31, line: 409, baseType: !428)
!428 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !423, file: !424, line: 299, baseType: !430, size: 112, offset: 16)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 112, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 14)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !418, file: !199, line: 22, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !31, line: 404, baseType: !32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !418, file: !199, line: 23, baseType: !30, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !418, file: !199, line: 24, baseType: !25, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !199, line: 26, baseType: !185, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !418, file: !199, line: 28, baseType: !185, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !418, file: !199, line: 29, baseType: !185, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !418, file: !199, line: 30, baseType: !185, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !418, file: !199, line: 38, baseType: !442, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !197, line: 32, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !195}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !418, file: !199, line: 40, baseType: !6, size: 32, offset: 352)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !418, file: !199, line: 42, baseType: !240, size: 320, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !418, file: !199, line: 43, baseType: !239, size: 32, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !418, file: !199, line: 45, baseType: !30, size: 32, offset: 736)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !418, file: !199, line: 47, baseType: !30, size: 32, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !418, file: !199, line: 49, baseType: !452, size: 32, offset: 800)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !453, line: 16, baseType: !288)
!453 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!454 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !418, file: !199, line: 51, baseType: !416, size: 32, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !418, file: !199, line: 52, baseType: !195, size: 32, offset: 864)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !418, file: !199, line: 54, baseType: !236, size: 32, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !418, file: !199, line: 56, baseType: !32, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !418, file: !199, line: 57, baseType: !32, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !418, file: !199, line: 58, baseType: !32, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !418, file: !199, line: 60, baseType: !32, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !418, file: !199, line: 61, baseType: !32, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !418, file: !199, line: 62, baseType: !32, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !418, file: !199, line: 63, baseType: !32, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !418, file: !199, line: 64, baseType: !32, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !418, file: !199, line: 65, baseType: !32, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !418, file: !199, line: 66, baseType: !32, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !418, file: !199, line: 67, baseType: !32, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !418, file: !199, line: 70, baseType: !32, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !418, file: !199, line: 72, baseType: !32, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !418, file: !199, line: 73, baseType: !32, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !418, file: !199, line: 74, baseType: !32, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !418, file: !199, line: 76, baseType: !32, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !418, file: !199, line: 77, baseType: !32, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !418, file: !199, line: 78, baseType: !32, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !198, file: !199, line: 135, baseType: !334, size: 32, offset: 288)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !198, file: !199, line: 137, baseType: !239, size: 32, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !198, file: !199, line: 139, baseType: !478, size: 32, offset: 352)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !197, line: 18, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !481, line: 57, size: 320, elements: !482)
!481 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!482 = !{!483, !491, !492, !493, !494, !501, !513}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !480, file: !481, line: 58, baseType: !484, size: 128)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !481, line: 54, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 49, size: 128, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !485, file: !481, line: 50, baseType: !7, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !485, file: !481, line: 51, baseType: !7, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !485, file: !481, line: 52, baseType: !478, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !485, file: !481, line: 53, baseType: !236, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !480, file: !481, line: 59, baseType: !30, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !480, file: !481, line: 60, baseType: !478, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !480, file: !481, line: 61, baseType: !321, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !480, file: !481, line: 62, baseType: !495, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !481, line: 41, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !481, line: 43, size: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !481, line: 44, baseType: !495, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !497, file: !481, line: 45, baseType: !6, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !480, file: !481, line: 63, baseType: !502, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !481, line: 32, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !481, line: 34, size: 96, elements: !505)
!505 = !{!506, !511, !512}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !504, file: !481, line: 35, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !481, line: 30, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !6}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !504, file: !481, line: 36, baseType: !6, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !481, line: 37, baseType: !502, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !480, file: !481, line: 64, baseType: !239, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !199, line: 141, baseType: !185, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !198, file: !199, line: 143, baseType: !422, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !198, file: !199, line: 144, baseType: !434, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !198, file: !199, line: 145, baseType: !25, size: 64, offset: 480)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !198, file: !199, line: 147, baseType: !25, size: 64, offset: 544)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !198, file: !199, line: 148, baseType: !520, size: 16, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !521, line: 12, baseType: !522)
!521 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 186, baseType: !428)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !198, file: !199, line: 154, baseType: !422, size: 32, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !198, file: !199, line: 155, baseType: !434, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !198, file: !199, line: 157, baseType: !327, size: 32, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !198, file: !199, line: 159, baseType: !296, size: 64, offset: 736)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !198, file: !199, line: 161, baseType: !261, size: 32, offset: 800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !198, file: !199, line: 163, baseType: !236, size: 32, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !198, file: !199, line: 165, baseType: !32, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !198, file: !199, line: 167, baseType: !32, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !198, file: !199, line: 169, baseType: !32, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !198, file: !199, line: 170, baseType: !32, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !198, file: !199, line: 171, baseType: !32, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !198, file: !199, line: 173, baseType: !32, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !198, file: !199, line: 174, baseType: !32, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !198, file: !199, line: 175, baseType: !32, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !198, file: !199, line: 176, baseType: !32, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !198, file: !199, line: 178, baseType: !32, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !198, file: !199, line: 179, baseType: !32, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !198, file: !199, line: 180, baseType: !32, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !198, file: !199, line: 181, baseType: !32, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !198, file: !199, line: 183, baseType: !32, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !189, file: !190, line: 369, baseType: !544, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !189, file: !190, line: 370, baseType: !544, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !189, file: !190, line: 371, baseType: !544, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !189, file: !190, line: 372, baseType: !544, size: 32, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !189, file: !190, line: 374, baseType: !549, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !190, line: 361, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !186}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !189, file: !190, line: 375, baseType: !549, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !189, file: !190, line: 378, baseType: !555, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !188, line: 18, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !558, line: 65, size: 3008, elements: !559)
!558 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!559 = !{!560, !561, !571, !572, !576, !577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !745, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !557, file: !558, line: 66, baseType: !342, size: 1216)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !557, file: !558, line: 67, baseType: !562, size: 160, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !563, line: 22, baseType: !564)
!563 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 16, size: 160, elements: !565)
!565 = !{!566, !567, !568, !569, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !564, file: !563, line: 17, baseType: !6, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !564, file: !563, line: 18, baseType: !236, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !563, line: 19, baseType: !30, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !564, file: !563, line: 20, baseType: !236, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !564, file: !563, line: 21, baseType: !478, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !557, file: !558, line: 68, baseType: !193, size: 32, offset: 1376)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !557, file: !558, line: 69, baseType: !573, size: 128, offset: 1408)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !557, file: !558, line: 70, baseType: !573, size: 128, offset: 1536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !557, file: !558, line: 72, baseType: !578, size: 32, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !253, line: 18, baseType: !357)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !557, file: !558, line: 73, baseType: !265, size: 32, offset: 1696)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !557, file: !558, line: 74, baseType: !265, size: 32, offset: 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !557, file: !558, line: 75, baseType: !265, size: 32, offset: 1760)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !557, file: !558, line: 76, baseType: !265, size: 32, offset: 1792)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !557, file: !558, line: 77, baseType: !265, size: 32, offset: 1824)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !557, file: !558, line: 79, baseType: !25, size: 64, offset: 1856)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !557, file: !558, line: 80, baseType: !25, size: 64, offset: 1920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !557, file: !558, line: 81, baseType: !573, size: 128, offset: 1984)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !557, file: !558, line: 83, baseType: !30, size: 32, offset: 2112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !557, file: !558, line: 84, baseType: !30, size: 32, offset: 2144)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !557, file: !558, line: 85, baseType: !334, size: 32, offset: 2176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !557, file: !558, line: 86, baseType: !334, size: 32, offset: 2208)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !557, file: !558, line: 88, baseType: !236, size: 32, offset: 2240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !557, file: !558, line: 89, baseType: !236, size: 32, offset: 2272)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !557, file: !558, line: 90, baseType: !236, size: 32, offset: 2304)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !557, file: !558, line: 91, baseType: !236, size: 32, offset: 2336)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !557, file: !558, line: 93, baseType: !327, size: 32, offset: 2368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !557, file: !558, line: 95, baseType: !597, size: 32, offset: 2400)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !188, line: 19, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !558, line: 157, size: 544, elements: !600)
!600 = !{!601, !626, !687, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !744}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !599, file: !558, line: 158, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !558, line: 154, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 145, size: 480, elements: !605)
!605 = !{!606, !617, !618, !619, !622, !623, !624, !625}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !604, file: !558, line: 146, baseType: !607, size: 96)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !284, line: 32, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !284, line: 37, size: 96, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !608, file: !284, line: 38, baseType: !290, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !608, file: !284, line: 39, baseType: !290, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !608, file: !284, line: 40, baseType: !613, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !284, line: 34, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !290, !290, !290}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !604, file: !558, line: 147, baseType: !283, size: 160, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !604, file: !558, line: 148, baseType: !296, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !604, file: !558, line: 149, baseType: !620, size: 32, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !262, line: 106, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !604, file: !558, line: 150, baseType: !620, size: 32, offset: 352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !604, file: !558, line: 151, baseType: !334, size: 32, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !604, file: !558, line: 152, baseType: !236, size: 32, offset: 416)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !604, file: !558, line: 153, baseType: !236, size: 32, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !599, file: !558, line: 159, baseType: !627, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !629, line: 59, baseType: !630)
!629 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 34, size: 800, elements: !631)
!631 = !{!632, !639, !640, !641, !649, !650, !651, !660, !661, !662, !663, !682, !683, !684, !685, !686}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !630, file: !629, line: 35, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !634, line: 21, baseType: !635)
!634 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 16, size: 64, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !634, line: 17, baseType: !620, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !635, file: !634, line: 19, baseType: !620, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !630, file: !629, line: 37, baseType: !30, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !630, file: !629, line: 38, baseType: !30, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !630, file: !629, line: 40, baseType: !642, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !629, line: 16, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !629, line: 18, size: 96, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !644, file: !629, line: 19, baseType: !237, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !629, line: 20, baseType: !642, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !629, line: 21, baseType: !237, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !630, file: !629, line: 41, baseType: !642, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !630, file: !629, line: 42, baseType: !643, size: 96, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !630, file: !629, line: 44, baseType: !652, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !629, line: 31, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 25, size: 128, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !654, file: !629, line: 26, baseType: !236, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !654, file: !629, line: 27, baseType: !236, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !654, file: !629, line: 29, baseType: !236, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !654, file: !629, line: 30, baseType: !236, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !630, file: !629, line: 45, baseType: !236, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !629, line: 47, baseType: !7, size: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !630, file: !629, line: 48, baseType: !7, size: 32, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !630, file: !629, line: 50, baseType: !664, size: 256, offset: 416)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !634, line: 37, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 24, size: 256, elements: !666)
!666 = !{!667, !669, !670, !671, !681}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !665, file: !634, line: 26, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !665, file: !634, line: 28, baseType: !668, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !665, file: !634, line: 29, baseType: !236, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !665, file: !634, line: 30, baseType: !672, size: 128, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !673, line: 19, baseType: !674)
!673 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 17, size: 128, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !674, file: !673, line: 18, baseType: !677, size: 128)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 128, elements: !679)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!679 = !{!680}
!680 = !DISubrange(count: 4)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !665, file: !634, line: 36, baseType: !236, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !630, file: !629, line: 52, baseType: !7, size: 32, offset: 672)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !630, file: !629, line: 53, baseType: !8, size: 8, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !630, file: !629, line: 55, baseType: !32, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !630, file: !629, line: 57, baseType: !6, size: 32, offset: 736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !630, file: !629, line: 58, baseType: !6, size: 32, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !599, file: !558, line: 161, baseType: !688, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !344, line: 62, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 50, size: 384, elements: !691)
!691 = !{!692, !693, !694, !696, !701, !703, !705, !706, !707}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !690, file: !344, line: 51, baseType: !25, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !690, file: !344, line: 52, baseType: !30, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !690, file: !344, line: 53, baseType: !695, size: 96, offset: 96)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !389)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !690, file: !344, line: 55, baseType: !697, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !344, line: 45, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DISubroutineType(types: !700)
!700 = !{!452, !6}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !690, file: !344, line: 56, baseType: !702, size: 32, offset: 224)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !344, line: 46, baseType: !698)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !690, file: !344, line: 57, baseType: !704, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !344, line: 47, baseType: !508)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !690, file: !344, line: 58, baseType: !6, size: 32, offset: 288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !690, file: !344, line: 60, baseType: !7, size: 32, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !690, file: !344, line: 61, baseType: !236, size: 32, offset: 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !599, file: !558, line: 163, baseType: !334, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !599, file: !558, line: 164, baseType: !30, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !599, file: !558, line: 166, baseType: !265, size: 32, offset: 160)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !599, file: !558, line: 168, baseType: !265, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !599, file: !558, line: 170, baseType: !236, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !599, file: !558, line: 171, baseType: !236, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !599, file: !558, line: 172, baseType: !452, size: 32, offset: 288)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !599, file: !558, line: 173, baseType: !452, size: 32, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !599, file: !558, line: 174, baseType: !452, size: 32, offset: 352)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !599, file: !558, line: 176, baseType: !236, size: 32, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !599, file: !558, line: 177, baseType: !452, size: 32, offset: 416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !599, file: !558, line: 178, baseType: !452, size: 32, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !599, file: !558, line: 180, baseType: !721, size: 32, offset: 480)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !723, line: 25, baseType: !724)
!723 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !723, line: 29, size: 320, elements: !725)
!725 = !{!726, !727, !737, !742, !743}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !724, file: !723, line: 30, baseType: !6, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !724, file: !723, line: 31, baseType: !728, size: 192, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !729, line: 22, baseType: !730)
!729 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !729, line: 16, size: 192, elements: !731)
!731 = !{!732, !733, !734, !735, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !730, file: !729, line: 17, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !730, file: !729, line: 18, baseType: !30, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !729, line: 19, baseType: !25, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !730, file: !729, line: 20, baseType: !239, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !730, file: !729, line: 21, baseType: !236, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !724, file: !723, line: 32, baseType: !738, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !723, line: 27, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{!182, !721, !6}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !724, file: !723, line: 33, baseType: !6, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !724, file: !723, line: 34, baseType: !236, size: 32, offset: 288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !599, file: !558, line: 182, baseType: !236, size: 32, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !557, file: !558, line: 96, baseType: !746, size: 32, offset: 2432)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !558, line: 62, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 39, size: 576, elements: !749)
!749 = !{!750, !751, !752, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !748, file: !558, line: 40, baseType: !283, size: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !748, file: !558, line: 41, baseType: !296, size: 64, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !748, file: !558, line: 43, baseType: !753, size: 96, offset: 224)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 12)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !748, file: !558, line: 46, baseType: !32, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !748, file: !558, line: 47, baseType: !32, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !748, file: !558, line: 48, baseType: !32, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !748, file: !558, line: 49, baseType: !32, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !748, file: !558, line: 50, baseType: !32, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !748, file: !558, line: 51, baseType: !32, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !748, file: !558, line: 52, baseType: !32, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !748, file: !558, line: 53, baseType: !32, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !748, file: !558, line: 56, baseType: !578, size: 32, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !748, file: !558, line: 57, baseType: !265, size: 32, offset: 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !748, file: !558, line: 58, baseType: !265, size: 32, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !748, file: !558, line: 59, baseType: !30, size: 32, offset: 480)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !748, file: !558, line: 60, baseType: !334, size: 32, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !748, file: !558, line: 61, baseType: !452, size: 32, offset: 544)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !557, file: !558, line: 102, baseType: !452, size: 32, offset: 2464)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !557, file: !558, line: 103, baseType: !452, size: 32, offset: 2496)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !557, file: !558, line: 104, baseType: !452, size: 32, offset: 2528)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !557, file: !558, line: 105, baseType: !452, size: 32, offset: 2560)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !557, file: !558, line: 107, baseType: !204, size: 384, offset: 2592)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !557, file: !558, line: 109, baseType: !32, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !557, file: !558, line: 110, baseType: !32, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !557, file: !558, line: 112, baseType: !32, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !557, file: !558, line: 113, baseType: !32, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !557, file: !558, line: 114, baseType: !32, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !557, file: !558, line: 115, baseType: !32, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !557, file: !558, line: 116, baseType: !32, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !557, file: !558, line: 117, baseType: !32, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !557, file: !558, line: 118, baseType: !32, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !557, file: !558, line: 119, baseType: !32, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !557, file: !558, line: 121, baseType: !32, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !557, file: !558, line: 122, baseType: !32, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !189, file: !190, line: 381, baseType: !788, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !188, line: 17, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !791, line: 313, size: 4096, elements: !792)
!791 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!792 = !{!793, !798, !799, !840, !919, !920, !942, !951, !1210, !1211, !1212, !1250, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1428, !1432, !1433, !1437, !1438, !1439, !1440, !1441, !1445, !1449, !1453, !1454, !1466, !1467, !1468, !1469, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !790, file: !791, line: 314, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !791, line: 309, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !186, !788}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !790, file: !791, line: 315, baseType: !794, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !790, file: !791, line: 317, baseType: !800, size: 480, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !801, line: 22, baseType: !802)
!801 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !801, line: 36, size: 480, elements: !803)
!803 = !{!804, !805, !806, !807, !809, !810, !811, !817, !822, !824, !825, !834, !835, !836, !837, !838, !839}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !802, file: !801, line: 37, baseType: !195, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !802, file: !801, line: 39, baseType: !422, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !802, file: !801, line: 40, baseType: !434, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !802, file: !801, line: 41, baseType: !808, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !802, file: !801, line: 43, baseType: !236, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !802, file: !801, line: 44, baseType: !452, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !802, file: !801, line: 46, baseType: !812, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !801, line: 24, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!182, !816, !6}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !802, file: !801, line: 47, baseType: !818, size: 32, offset: 224)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !801, line: 26, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !816, !6, !236}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !802, file: !801, line: 48, baseType: !823, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !801, line: 28, baseType: !819)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !801, line: 49, baseType: !6, size: 32, offset: 288)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !802, file: !801, line: 56, baseType: !826, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !828, line: 78, baseType: !829)
!828 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 74, size: 128, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !829, file: !828, line: 75, baseType: !422, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !829, file: !828, line: 76, baseType: !434, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !829, file: !828, line: 77, baseType: !25, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !802, file: !801, line: 58, baseType: !185, size: 32, offset: 352)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !802, file: !801, line: 59, baseType: !185, size: 32, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !802, file: !801, line: 61, baseType: !239, size: 32, offset: 416)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !802, file: !801, line: 63, baseType: !32, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !802, file: !801, line: 64, baseType: !32, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !802, file: !801, line: 67, baseType: !32, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !790, file: !791, line: 319, baseType: !841, size: 32, offset: 544)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !843, line: 17, baseType: !844)
!843 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !843, line: 25, size: 1120, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !852, !853, !854, !855, !856, !861, !862, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !918}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !844, file: !843, line: 26, baseType: !195, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !844, file: !843, line: 27, baseType: !195, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !844, file: !843, line: 29, baseType: !321, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !844, file: !843, line: 30, baseType: !321, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !844, file: !843, line: 31, baseType: !851, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !844, file: !843, line: 33, baseType: !321, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !844, file: !843, line: 35, baseType: !321, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !844, file: !843, line: 36, baseType: !321, size: 32, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !844, file: !843, line: 37, baseType: !321, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !844, file: !843, line: 44, baseType: !857, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !843, line: 19, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DISubroutineType(types: !860)
!860 = !{!182, !841, !327}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !844, file: !843, line: 45, baseType: !6, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !844, file: !843, line: 47, baseType: !863, size: 32, offset: 352)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !843, line: 21, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!182, !6, !321}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !844, file: !843, line: 48, baseType: !6, size: 32, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !844, file: !843, line: 57, baseType: !32, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !844, file: !843, line: 58, baseType: !32, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !844, file: !843, line: 59, baseType: !32, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !844, file: !843, line: 60, baseType: !32, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !844, file: !843, line: 61, baseType: !32, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !844, file: !843, line: 62, baseType: !32, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !844, file: !843, line: 63, baseType: !32, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !844, file: !843, line: 64, baseType: !32, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !844, file: !843, line: 65, baseType: !32, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !844, file: !843, line: 66, baseType: !32, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !844, file: !843, line: 67, baseType: !32, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !844, file: !843, line: 68, baseType: !32, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !844, file: !843, line: 70, baseType: !182, size: 32, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !844, file: !843, line: 71, baseType: !882, size: 64, offset: 480)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !324, line: 68, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 65, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !883, file: !324, line: 66, baseType: !182, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !883, file: !324, line: 67, baseType: !30, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !844, file: !843, line: 72, baseType: !339, size: 32, offset: 544)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !844, file: !843, line: 74, baseType: !313, size: 32, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !844, file: !843, line: 76, baseType: !334, size: 32, offset: 608)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !844, file: !843, line: 77, baseType: !334, size: 32, offset: 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !844, file: !843, line: 79, baseType: !334, size: 32, offset: 672)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !844, file: !843, line: 80, baseType: !313, size: 32, offset: 704)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !844, file: !843, line: 82, baseType: !452, size: 32, offset: 736)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !844, file: !843, line: 83, baseType: !452, size: 32, offset: 768)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !844, file: !843, line: 84, baseType: !313, size: 32, offset: 800)
