; ModuleID = 'src/http/ngx_http_variables.c'
source_filename = "src/http/ngx_http_variables.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_variable_null_value", scope: !2, file: !3, line: 378, type: !290, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !287)
!3 = !DIFile(filename: "src/http/ngx_http_variables.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !13, !16, !19, !22, !45, !46, !39, !225, !257, !269, !40, !270, !280, !139, !236, !284, !286}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 17, size: 96, elements: !10)
!10 = !{!11, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !9, file: !8, line: 18, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !9, file: !8, line: 19, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !9, file: !8, line: 20, baseType: !12, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !20, line: 125, baseType: !21)
!20 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_table_elt_t", file: !25, line: 97, baseType: !26)
!25 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 92, size: 192, elements: !27)
!27 = !{!28, !31, !43, !44}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !26, file: !25, line: 93, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !30, line: 79, baseType: !19)
!30 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !26, file: !25, line: 94, baseType: !32, size: 64, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !33, line: 19, baseType: !34)
!33 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 16, size: 64, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !33, line: 17, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 120, baseType: !21)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !33, line: 18, baseType: !39, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !41, line: 64, baseType: !42)
!41 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !26, file: !25, line: 95, baseType: !32, size: 64, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "lowcase_key", scope: !26, file: !25, line: 96, baseType: !39, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !48, line: 22, baseType: !49)
!48 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 16, size: 160, elements: !50)
!50 = !{!51, !52, !53, !54, !55}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !49, file: !48, line: 17, baseType: !13, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !49, file: !48, line: 18, baseType: !29, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !49, file: !48, line: 19, baseType: !37, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !49, file: !48, line: 20, baseType: !29, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !49, file: !48, line: 21, baseType: !56, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !58, line: 18, baseType: !59)
!58 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !60, line: 57, size: 320, elements: !61)
!60 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!61 = !{!62, !70, !71, !72, !205, !212, !224}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !59, file: !60, line: 58, baseType: !63, size: 128)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !60, line: 54, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 49, size: 128, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !64, file: !60, line: 50, baseType: !39, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !64, file: !60, line: 51, baseType: !39, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !60, line: 52, baseType: !56, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !64, file: !60, line: 53, baseType: !29, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !59, file: !60, line: 59, baseType: !37, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !59, file: !60, line: 60, baseType: !56, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !59, file: !60, line: 61, baseType: !73, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !58, line: 19, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !76, line: 59, size: 64, elements: !77)
!76 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!77 = !{!78, !204}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !75, file: !76, line: 60, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !76, line: 18, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !76, line: 20, size: 352, elements: !82)
!82 = !{!83, !84, !85, !88, !89, !90, !91, !93, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !81, file: !76, line: 21, baseType: !39, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !81, file: !76, line: 22, baseType: !39, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !81, file: !76, line: 23, baseType: !86, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !20, line: 222, baseType: !87)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !81, file: !76, line: 24, baseType: !86, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !81, file: !76, line: 26, baseType: !39, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !81, file: !76, line: 27, baseType: !39, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !76, line: 28, baseType: !92, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !76, line: 16, baseType: !13)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !81, file: !76, line: 29, baseType: !94, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !58, line: 23, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !97, line: 16, size: 1216, elements: !98)
!97 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = !{!99, !102, !103, !148, !149, !150, !189, !190}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !96, file: !97, line: 17, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !101, line: 16, baseType: !87)
!101 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !97, line: 18, baseType: !32, size: 64, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !96, file: !97, line: 19, baseType: !104, size: 960, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !101, line: 17, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !106, line: 4, size: 960, elements: !107)
!106 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = !{!108, !110, !111, !113, !114, !116, !117, !119, !121, !123, !124, !125, !126, !127, !128, !131, !132, !134, !135, !141, !142, !143}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !105, file: !106, line: 6, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !20, line: 232, baseType: !21)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !105, file: !106, line: 7, baseType: !109, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !105, file: !106, line: 8, baseType: !112, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !20, line: 227, baseType: !21)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !105, file: !106, line: 9, baseType: !112, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !105, file: !106, line: 10, baseType: !115, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !20, line: 217, baseType: !21)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !105, file: !106, line: 11, baseType: !115, size: 32, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !105, file: !106, line: 13, baseType: !118, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !20, line: 212, baseType: !21)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !105, file: !106, line: 14, baseType: !120, size: 32, offset: 224)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !20, line: 304, baseType: !21)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !105, file: !106, line: 15, baseType: !122, size: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !20, line: 309, baseType: !21)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !105, file: !106, line: 16, baseType: !21, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !105, file: !106, line: 17, baseType: !109, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !105, file: !106, line: 18, baseType: !109, size: 32, offset: 352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !105, file: !106, line: 19, baseType: !86, size: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !105, file: !106, line: 20, baseType: !86, size: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !105, file: !106, line: 21, baseType: !129, size: 32, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !20, line: 237, baseType: !130)
!130 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !105, file: !106, line: 22, baseType: !129, size: 32, offset: 480)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !105, file: !106, line: 23, baseType: !133, size: 32, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !20, line: 242, baseType: !87)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !105, file: !106, line: 24, baseType: !133, size: 32, offset: 544)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !105, file: !106, line: 26, baseType: !136, size: 64, offset: 576)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !20, line: 288, size: 64, elements: !137)
!137 = !{!138, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !136, file: !20, line: 288, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !20, line: 75, baseType: !130)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !136, file: !20, line: 288, baseType: !130, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !105, file: !106, line: 27, baseType: !136, size: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !105, file: !106, line: 28, baseType: !136, size: 64, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !105, file: !106, line: 29, baseType: !144, size: 192, offset: 768)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !146)
!145 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!146 = !{!147}
!147 = !DISubrange(count: 3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !96, file: !97, line: 21, baseType: !86, size: 32, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !96, file: !97, line: 22, baseType: !86, size: 32, offset: 1120)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !96, file: !97, line: 24, baseType: !151, size: 32, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !58, line: 20, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !154, line: 50, size: 320, elements: !155)
!154 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!155 = !{!156, !157, !170, !174, !175, !180, !181, !186, !187, !188}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !153, file: !154, line: 51, baseType: !29, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !153, file: !154, line: 52, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !58, line: 21, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !161, line: 89, size: 160, elements: !162)
!161 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!162 = !{!163, !164, !165, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !160, file: !161, line: 90, baseType: !100, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 91, baseType: !32, size: 64, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !160, file: !161, line: 93, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !158, !151}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !161, line: 94, baseType: !13, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !153, file: !154, line: 54, baseType: !171, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !172, line: 98, baseType: !173)
!172 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !153, file: !154, line: 56, baseType: !139, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !153, file: !154, line: 58, baseType: !176, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !154, line: 45, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!39, !151, !39, !37}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 59, baseType: !13, size: 32, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !153, file: !154, line: 61, baseType: !182, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !154, line: 46, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !151, !29, !39, !37}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !153, file: !154, line: 62, baseType: !13, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !153, file: !154, line: 70, baseType: !45, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !154, line: 72, baseType: !151, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !96, file: !97, line: 37, baseType: !21, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !96, file: !97, line: 38, baseType: !21, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !81, file: !76, line: 30, baseType: !79, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !81, file: !76, line: 34, baseType: !21, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !81, file: !76, line: 40, baseType: !21, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !81, file: !76, line: 43, baseType: !21, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !81, file: !76, line: 45, baseType: !21, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !81, file: !76, line: 46, baseType: !21, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !81, file: !76, line: 47, baseType: !21, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !81, file: !76, line: 48, baseType: !21, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !81, file: !76, line: 49, baseType: !21, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !81, file: !76, line: 50, baseType: !21, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !81, file: !76, line: 52, baseType: !21, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !81, file: !76, line: 53, baseType: !21, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !81, file: !76, line: 55, baseType: !87, size: 32, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !75, file: !76, line: 61, baseType: !73, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !59, file: !60, line: 62, baseType: !206, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !60, line: 41, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !60, line: 43, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !60, line: 44, baseType: !206, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !208, file: !60, line: 45, baseType: !13, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !59, file: !60, line: 63, baseType: !213, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !60, line: 32, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !60, line: 34, size: 96, elements: !216)
!216 = !{!217, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !215, file: !60, line: 35, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !60, line: 30, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !13}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !60, line: 36, baseType: !13, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !60, line: 37, baseType: !213, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !59, file: !60, line: 64, baseType: !151, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !227, line: 34, size: 224, elements: !228)
!227 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!228 = !{!229, !232, !235, !237, !256}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !226, file: !227, line: 35, baseType: !230, size: 16)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !20, line: 409, baseType: !231)
!231 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !226, file: !227, line: 36, baseType: !233, size: 16, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !227, line: 12, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 186, baseType: !231)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !226, file: !227, line: 37, baseType: !236, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 191, baseType: !21)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !226, file: !227, line: 38, baseType: !238, size: 128, offset: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !227, line: 23, size: 128, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !238, file: !227, line: 28, baseType: !241, size: 128)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !227, line: 24, size: 128, elements: !242)
!242 = !{!243, !248, !252}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !241, file: !227, line: 25, baseType: !244, size: 128)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !246)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 181, baseType: !42)
!246 = !{!247}
!247 = !DISubrange(count: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !241, file: !227, line: 26, baseType: !249, size: 128)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 128, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !241, file: !227, line: 27, baseType: !253, size: 128)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 128, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 4)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !226, file: !227, line: 39, baseType: !236, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !227, line: 16, size: 128, elements: !259)
!259 = !{!260, !261, !262, !267}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !258, file: !227, line: 17, baseType: !230, size: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !258, file: !227, line: 18, baseType: !233, size: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !258, file: !227, line: 19, baseType: !263, size: 32, offset: 32)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !227, line: 14, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !263, file: !227, line: 14, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !227, line: 13, baseType: !236)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !258, file: !227, line: 20, baseType: !268, size: 64, offset: 64)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 64, elements: !250)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !272, line: 20, baseType: !273)
!272 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 16, size: 96, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !273, file: !272, line: 17, baseType: !139, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !273, file: !272, line: 18, baseType: !29, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !273, file: !272, line: 19, baseType: !278, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !30, line: 78, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !20, line: 140, baseType: !87)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !281, line: 17, baseType: !282)
!281 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !283, line: 17, baseType: !278)
!283 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 135, baseType: !87)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!287 = !{!0, !288, !301, !303}
!288 = !DIGlobalVariableExpression(var: !289)
!289 = distinct !DIGlobalVariable(name: "ngx_http_variable_true_value", scope: !2, file: !3, line: 380, type: !290, isLocal: false, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !291, line: 17, baseType: !292)
!291 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !33, line: 37, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 28, size: 64, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !293, file: !33, line: 29, baseType: !21, size: 28, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !293, file: !33, line: 31, baseType: !21, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !293, file: !33, line: 32, baseType: !21, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !293, file: !33, line: 33, baseType: !21, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !293, file: !33, line: 34, baseType: !21, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !293, file: !33, line: 36, baseType: !39, size: 32, offset: 32)
!301 = !DIGlobalVariableExpression(var: !302)
!302 = distinct !DIGlobalVariable(name: "ngx_http_variable_depth", scope: !2, file: !3, line: 384, type: !29, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304)
!304 = distinct !DIGlobalVariable(name: "ngx_http_core_variables", scope: !2, file: !3, line: 160, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 14112, elements: !1817)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_t", file: !291, line: 21, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_variable_s", file: !291, line: 37, size: 224, elements: !308)
!308 = !{!309, !310, !1809, !1814, !1815, !1816}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !291, line: 38, baseType: !32, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "set_handler", scope: !307, file: !291, line: 39, baseType: !311, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_set_variable_pt", file: !291, line: 23, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !1520, !19}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !317, line: 16, baseType: !318)
!317 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !319, line: 364, size: 5376, elements: !320)
!319 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!320 = !{!321, !322, !492, !493, !494, !495, !496, !501, !502, !722, !1380, !1381, !1382, !1383, !1422, !1452, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1497, !1508, !1515, !1516, !1518, !1519, !1521, !1522, !1523, !1524, !1525, !1526, !1705, !1709, !1714, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !318, file: !319, line: 365, baseType: !236, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !318, file: !319, line: 367, baseType: !323, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !58, line: 26, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !326, line: 121, size: 896, elements: !327)
!326 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!327 = !{!328, !329, !384, !385, !388, !394, !396, !401, !406, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !326, line: 122, baseType: !13, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !325, file: !326, line: 123, baseType: !330, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !58, line: 24, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !333, line: 30, size: 384, elements: !334)
!333 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !362, !363, !364, !376}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !332, file: !333, line: 31, baseType: !13, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !332, file: !333, line: 33, baseType: !21, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !332, file: !333, line: 35, baseType: !21, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !332, file: !333, line: 38, baseType: !21, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !332, file: !333, line: 44, baseType: !21, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !332, file: !333, line: 46, baseType: !21, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !332, file: !333, line: 49, baseType: !21, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !332, file: !333, line: 51, baseType: !21, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !332, file: !333, line: 54, baseType: !21, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !332, file: !333, line: 56, baseType: !21, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !332, file: !333, line: 57, baseType: !21, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !332, file: !333, line: 59, baseType: !21, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !332, file: !333, line: 60, baseType: !21, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !332, file: !333, line: 62, baseType: !21, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !332, file: !333, line: 64, baseType: !21, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !332, file: !333, line: 67, baseType: !21, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !332, file: !333, line: 69, baseType: !21, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !332, file: !333, line: 71, baseType: !21, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !332, file: !333, line: 74, baseType: !21, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !332, file: !333, line: 75, baseType: !21, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !332, file: !333, line: 77, baseType: !21, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !332, file: !333, line: 107, baseType: !21, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !332, file: !333, line: 110, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !58, line: 31, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !330}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !332, file: !333, line: 117, baseType: !29, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !332, file: !333, line: 119, baseType: !151, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !332, file: !333, line: 121, baseType: !365, size: 160, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !283, line: 20, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !283, line: 22, size: 160, elements: !367)
!367 = !{!368, !370, !372, !373, !374, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !366, file: !283, line: 23, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !283, line: 16, baseType: !29)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !366, file: !283, line: 24, baseType: !371, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !366, file: !283, line: 25, baseType: !371, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !366, file: !283, line: 26, baseType: !371, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !366, file: !283, line: 27, baseType: !40, size: 8, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !283, line: 28, baseType: !40, size: 8, offset: 136)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !332, file: !333, line: 124, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !378, line: 16, baseType: !379)
!378 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !378, line: 18, size: 64, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !378, line: 19, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !378, line: 20, baseType: !382, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !325, file: !326, line: 124, baseType: !330, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !325, file: !326, line: 126, baseType: !386, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !387, line: 17, baseType: !87)
!387 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !325, file: !326, line: 128, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !390, line: 19, baseType: !391)
!390 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DISubroutineType(types: !393)
!393 = !{!285, !323, !39, !37}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !325, file: !326, line: 129, baseType: !395, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !390, line: 22, baseType: !391)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !325, file: !326, line: 130, baseType: !397, size: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !390, line: 20, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{!285, !323, !73, !86}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !325, file: !326, line: 131, baseType: !402, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !390, line: 23, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{!73, !323, !73, !86}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !325, file: !326, line: 133, baseType: !407, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !326, line: 16, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !326, line: 18, size: 960, elements: !410)
!410 = !{!411, !412, !422, !424, !425, !426, !427, !428, !429, !430, !435, !436, !437, !438, !439, !440, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !409, file: !326, line: 19, baseType: !386, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !409, file: !326, line: 21, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !415, line: 297, size: 128, elements: !416)
!415 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !414, file: !415, line: 298, baseType: !230, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !414, file: !415, line: 299, baseType: !419, size: 112, offset: 16)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 112, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 14)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !409, file: !326, line: 22, baseType: !423, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !20, line: 404, baseType: !21)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !409, file: !326, line: 23, baseType: !37, size: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !409, file: !326, line: 24, baseType: !32, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !326, line: 26, baseType: !87, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !409, file: !326, line: 28, baseType: !87, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !409, file: !326, line: 29, baseType: !87, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !409, file: !326, line: 30, baseType: !87, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !409, file: !326, line: 38, baseType: !431, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !58, line: 32, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !323}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !409, file: !326, line: 40, baseType: !13, size: 32, offset: 352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !409, file: !326, line: 42, baseType: !152, size: 320, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !409, file: !326, line: 43, baseType: !151, size: 32, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !409, file: !326, line: 45, baseType: !37, size: 32, offset: 736)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !409, file: !326, line: 47, baseType: !37, size: 32, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !409, file: !326, line: 49, baseType: !441, size: 32, offset: 800)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !281, line: 16, baseType: !369)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !409, file: !326, line: 51, baseType: !407, size: 32, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !409, file: !326, line: 52, baseType: !323, size: 32, offset: 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !409, file: !326, line: 54, baseType: !29, size: 32, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !409, file: !326, line: 56, baseType: !21, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !409, file: !326, line: 57, baseType: !21, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !409, file: !326, line: 58, baseType: !21, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !409, file: !326, line: 60, baseType: !21, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !409, file: !326, line: 61, baseType: !21, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !409, file: !326, line: 62, baseType: !21, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !409, file: !326, line: 63, baseType: !21, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !409, file: !326, line: 64, baseType: !21, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !409, file: !326, line: 65, baseType: !21, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !409, file: !326, line: 66, baseType: !21, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !409, file: !326, line: 67, baseType: !21, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !409, file: !326, line: 70, baseType: !21, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !409, file: !326, line: 72, baseType: !21, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !409, file: !326, line: 73, baseType: !21, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !409, file: !326, line: 74, baseType: !21, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !409, file: !326, line: 76, baseType: !21, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !409, file: !326, line: 77, baseType: !21, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !409, file: !326, line: 78, baseType: !21, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !325, file: !326, line: 135, baseType: !86, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !325, file: !326, line: 137, baseType: !151, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !325, file: !326, line: 139, baseType: !56, size: 32, offset: 352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !326, line: 141, baseType: !87, size: 32, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !325, file: !326, line: 143, baseType: !413, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !325, file: !326, line: 144, baseType: !423, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !325, file: !326, line: 145, baseType: !32, size: 64, offset: 480)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !325, file: !326, line: 147, baseType: !32, size: 64, offset: 544)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !325, file: !326, line: 148, baseType: !233, size: 16, offset: 608)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !325, file: !326, line: 154, baseType: !413, size: 32, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !325, file: !326, line: 155, baseType: !423, size: 32, offset: 672)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !325, file: !326, line: 157, baseType: !79, size: 32, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !325, file: !326, line: 159, baseType: !377, size: 64, offset: 736)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !325, file: !326, line: 161, baseType: !171, size: 32, offset: 800)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !325, file: !326, line: 163, baseType: !29, size: 32, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !325, file: !326, line: 165, baseType: !21, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !325, file: !326, line: 167, baseType: !21, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !325, file: !326, line: 169, baseType: !21, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !325, file: !326, line: 170, baseType: !21, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !325, file: !326, line: 171, baseType: !21, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !325, file: !326, line: 173, baseType: !21, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !325, file: !326, line: 174, baseType: !21, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !325, file: !326, line: 175, baseType: !21, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !325, file: !326, line: 176, baseType: !21, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !325, file: !326, line: 178, baseType: !21, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !325, file: !326, line: 179, baseType: !21, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !325, file: !326, line: 180, baseType: !21, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !325, file: !326, line: 181, baseType: !21, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !325, file: !326, line: 183, baseType: !21, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !318, file: !319, line: 369, baseType: !12, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !318, file: !319, line: 370, baseType: !12, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !318, file: !319, line: 371, baseType: !12, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !318, file: !319, line: 372, baseType: !12, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !318, file: !319, line: 374, baseType: !497, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !319, line: 361, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !315}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !318, file: !319, line: 375, baseType: !497, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !318, file: !319, line: 378, baseType: !503, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !317, line: 18, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !506, line: 65, size: 3008, elements: !507)
!506 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!507 = !{!508, !509, !510, !511, !513, !514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !680, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !505, file: !506, line: 66, baseType: !95, size: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !505, file: !506, line: 67, baseType: !47, size: 160, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !505, file: !506, line: 68, baseType: !236, size: 32, offset: 1376)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !505, file: !506, line: 69, baseType: !512, size: 128, offset: 1408)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !246)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !505, file: !506, line: 70, baseType: !512, size: 128, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !505, file: !506, line: 72, baseType: !515, size: 32, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !101, line: 18, baseType: !112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !505, file: !506, line: 73, baseType: !139, size: 32, offset: 1696)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !505, file: !506, line: 74, baseType: !139, size: 32, offset: 1728)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !505, file: !506, line: 75, baseType: !139, size: 32, offset: 1760)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !505, file: !506, line: 76, baseType: !139, size: 32, offset: 1792)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !505, file: !506, line: 77, baseType: !139, size: 32, offset: 1824)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !505, file: !506, line: 79, baseType: !32, size: 64, offset: 1856)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !505, file: !506, line: 80, baseType: !32, size: 64, offset: 1920)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !505, file: !506, line: 81, baseType: !512, size: 128, offset: 1984)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !505, file: !506, line: 83, baseType: !37, size: 32, offset: 2112)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !505, file: !506, line: 84, baseType: !37, size: 32, offset: 2144)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !505, file: !506, line: 85, baseType: !86, size: 32, offset: 2176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !505, file: !506, line: 86, baseType: !86, size: 32, offset: 2208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !505, file: !506, line: 88, baseType: !29, size: 32, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !505, file: !506, line: 89, baseType: !29, size: 32, offset: 2272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !505, file: !506, line: 90, baseType: !29, size: 32, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !505, file: !506, line: 91, baseType: !29, size: 32, offset: 2336)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !505, file: !506, line: 93, baseType: !79, size: 32, offset: 2368)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !505, file: !506, line: 95, baseType: !534, size: 32, offset: 2400)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !317, line: 19, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !506, line: 157, size: 544, elements: !537)
!537 = !{!538, !563, !622, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !679}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !536, file: !506, line: 158, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !506, line: 154, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 145, size: 480, elements: !542)
!542 = !{!543, !554, !555, !556, !559, !560, !561, !562}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !541, file: !506, line: 146, baseType: !544, size: 96)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !283, line: 32, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !283, line: 37, size: 96, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !545, file: !283, line: 38, baseType: !371, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !545, file: !283, line: 39, baseType: !371, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !545, file: !283, line: 40, baseType: !550, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !283, line: 34, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !371, !371, !371}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !541, file: !506, line: 147, baseType: !365, size: 160, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !541, file: !506, line: 148, baseType: !377, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !541, file: !506, line: 149, baseType: !557, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !172, line: 106, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !171)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !541, file: !506, line: 150, baseType: !557, size: 32, offset: 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !506, line: 151, baseType: !86, size: 32, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !541, file: !506, line: 152, baseType: !29, size: 32, offset: 416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !541, file: !506, line: 153, baseType: !29, size: 32, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !536, file: !506, line: 159, baseType: !564, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !566, line: 59, baseType: !567)
!566 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !566, line: 34, size: 800, elements: !568)
!568 = !{!569, !576, !577, !578, !586, !587, !588, !597, !598, !599, !600, !617, !618, !619, !620, !621}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !567, file: !566, line: 35, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !571, line: 21, baseType: !572)
!571 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 16, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !572, file: !571, line: 17, baseType: !557, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !572, file: !571, line: 19, baseType: !557, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !567, file: !566, line: 37, baseType: !37, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !567, file: !566, line: 38, baseType: !37, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !567, file: !566, line: 40, baseType: !579, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !566, line: 16, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !566, line: 18, size: 96, elements: !582)
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !581, file: !566, line: 19, baseType: !19, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !566, line: 20, baseType: !579, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !566, line: 21, baseType: !19, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !567, file: !566, line: 41, baseType: !579, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !567, file: !566, line: 42, baseType: !580, size: 96, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !567, file: !566, line: 44, baseType: !589, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !566, line: 31, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !566, line: 25, size: 128, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !591, file: !566, line: 26, baseType: !29, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !591, file: !566, line: 27, baseType: !29, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !591, file: !566, line: 29, baseType: !29, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !591, file: !566, line: 30, baseType: !29, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !567, file: !566, line: 45, baseType: !29, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !567, file: !566, line: 47, baseType: !39, size: 32, offset: 352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !567, file: !566, line: 48, baseType: !39, size: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !567, file: !566, line: 50, baseType: !601, size: 256, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !571, line: 37, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 24, size: 256, elements: !603)
!603 = !{!604, !606, !607, !608, !616}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !602, file: !571, line: 26, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !602, file: !571, line: 28, baseType: !605, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !602, file: !571, line: 29, baseType: !29, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !602, file: !571, line: 30, baseType: !609, size: 128, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !610, line: 19, baseType: !611)
!610 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 17, size: 128, elements: !612)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !611, file: !610, line: 18, baseType: !614, size: 128)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 128, elements: !254)
!615 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !602, file: !571, line: 36, baseType: !29, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !567, file: !566, line: 52, baseType: !39, size: 32, offset: 672)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !567, file: !566, line: 53, baseType: !40, size: 8, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !567, file: !566, line: 55, baseType: !21, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !567, file: !566, line: 57, baseType: !13, size: 32, offset: 736)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !567, file: !566, line: 58, baseType: !13, size: 32, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !536, file: !506, line: 161, baseType: !623, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !97, line: 62, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 50, size: 384, elements: !626)
!626 = !{!627, !628, !629, !631, !636, !638, !640, !641, !642}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !97, line: 51, baseType: !32, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !625, file: !97, line: 52, baseType: !37, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !625, file: !97, line: 53, baseType: !630, size: 96, offset: 96)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !146)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !625, file: !97, line: 55, baseType: !632, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !97, line: 45, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{!441, !13}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !625, file: !97, line: 56, baseType: !637, size: 32, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !97, line: 46, baseType: !633)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !625, file: !97, line: 57, baseType: !639, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !97, line: 47, baseType: !219)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !625, file: !97, line: 58, baseType: !13, size: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !625, file: !97, line: 60, baseType: !39, size: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !625, file: !97, line: 61, baseType: !29, size: 32, offset: 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !536, file: !506, line: 163, baseType: !86, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !536, file: !506, line: 164, baseType: !37, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !536, file: !506, line: 166, baseType: !139, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !536, file: !506, line: 168, baseType: !139, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !536, file: !506, line: 170, baseType: !29, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !536, file: !506, line: 171, baseType: !29, size: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !536, file: !506, line: 172, baseType: !441, size: 32, offset: 288)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !536, file: !506, line: 173, baseType: !441, size: 32, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !536, file: !506, line: 174, baseType: !441, size: 32, offset: 352)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !536, file: !506, line: 176, baseType: !29, size: 32, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !536, file: !506, line: 177, baseType: !441, size: 32, offset: 416)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !536, file: !506, line: 178, baseType: !441, size: 32, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !536, file: !506, line: 180, baseType: !656, size: 32, offset: 480)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !658, line: 25, baseType: !659)
!658 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !658, line: 29, size: 320, elements: !660)
!660 = !{!661, !662, !672, !677, !678}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !658, line: 30, baseType: !13, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !659, file: !658, line: 31, baseType: !663, size: 192, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !664, line: 22, baseType: !665)
!664 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 16, size: 192, elements: !666)
!666 = !{!667, !668, !669, !670, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !665, file: !664, line: 17, baseType: !39, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !664, line: 18, baseType: !37, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !664, line: 19, baseType: !32, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !665, file: !664, line: 20, baseType: !151, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !665, file: !664, line: 21, baseType: !29, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !659, file: !658, line: 32, baseType: !673, size: 32, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !658, line: 27, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{!278, !656, !13}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !659, file: !658, line: 33, baseType: !13, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !659, file: !658, line: 34, baseType: !29, size: 32, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !536, file: !506, line: 182, baseType: !29, size: 32, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !505, file: !506, line: 96, baseType: !681, size: 32, offset: 2432)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !506, line: 62, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 39, size: 576, elements: !684)
!684 = !{!685, !686, !687, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !683, file: !506, line: 40, baseType: !365, size: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !683, file: !506, line: 41, baseType: !377, size: 64, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !683, file: !506, line: 43, baseType: !688, size: 96, offset: 224)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 96, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 12)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !683, file: !506, line: 46, baseType: !21, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !683, file: !506, line: 47, baseType: !21, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !683, file: !506, line: 48, baseType: !21, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !683, file: !506, line: 49, baseType: !21, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !683, file: !506, line: 50, baseType: !21, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !683, file: !506, line: 51, baseType: !21, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !683, file: !506, line: 52, baseType: !21, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !683, file: !506, line: 53, baseType: !21, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !683, file: !506, line: 56, baseType: !515, size: 32, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !683, file: !506, line: 57, baseType: !139, size: 32, offset: 416)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !683, file: !506, line: 58, baseType: !139, size: 32, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !683, file: !506, line: 59, baseType: !37, size: 32, offset: 480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !683, file: !506, line: 60, baseType: !86, size: 32, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !683, file: !506, line: 61, baseType: !441, size: 32, offset: 544)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !505, file: !506, line: 102, baseType: !441, size: 32, offset: 2464)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !505, file: !506, line: 103, baseType: !441, size: 32, offset: 2496)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !505, file: !506, line: 104, baseType: !441, size: 32, offset: 2528)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !505, file: !506, line: 105, baseType: !441, size: 32, offset: 2560)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !505, file: !506, line: 107, baseType: !331, size: 384, offset: 2592)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !505, file: !506, line: 109, baseType: !21, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !505, file: !506, line: 110, baseType: !21, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !505, file: !506, line: 112, baseType: !21, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !505, file: !506, line: 113, baseType: !21, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !505, file: !506, line: 114, baseType: !21, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !505, file: !506, line: 115, baseType: !21, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !505, file: !506, line: 116, baseType: !21, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !505, file: !506, line: 117, baseType: !21, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !505, file: !506, line: 118, baseType: !21, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !505, file: !506, line: 119, baseType: !21, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !505, file: !506, line: 121, baseType: !21, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !505, file: !506, line: 122, baseType: !21, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !318, file: !319, line: 381, baseType: !723, size: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !317, line: 17, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !726, line: 313, size: 4096, elements: !727)
!726 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!727 = !{!728, !733, !734, !774, !853, !854, !876, !885, !1140, !1141, !1142, !1172, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1325, !1329, !1330, !1334, !1335, !1336, !1337, !1338, !1342, !1346, !1350, !1351, !1363, !1364, !1365, !1366, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !725, file: !726, line: 314, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !726, line: 309, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !315, !723}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !725, file: !726, line: 315, baseType: !729, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !725, file: !726, line: 317, baseType: !735, size: 480, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !736, line: 22, baseType: !737)
!736 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !736, line: 36, size: 480, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !751, !756, !758, !759, !768, !769, !770, !771, !772, !773}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !737, file: !736, line: 37, baseType: !323, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !737, file: !736, line: 39, baseType: !413, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !737, file: !736, line: 40, baseType: !423, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !736, line: 41, baseType: !269, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !737, file: !736, line: 43, baseType: !29, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !737, file: !736, line: 44, baseType: !441, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !737, file: !736, line: 46, baseType: !746, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !736, line: 24, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{!278, !750, !13}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !737, file: !736, line: 47, baseType: !752, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !736, line: 26, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !750, !13, !29}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !737, file: !736, line: 48, baseType: !757, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !736, line: 28, baseType: !753)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !737, file: !736, line: 49, baseType: !13, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !737, file: !736, line: 56, baseType: !760, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !762, line: 78, baseType: !763)
!762 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !762, line: 74, size: 128, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !763, file: !762, line: 75, baseType: !413, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !763, file: !762, line: 76, baseType: !423, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !762, line: 77, baseType: !32, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !736, line: 58, baseType: !87, size: 32, offset: 352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !737, file: !736, line: 59, baseType: !87, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !737, file: !736, line: 61, baseType: !151, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !737, file: !736, line: 63, baseType: !21, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !737, file: !736, line: 64, baseType: !21, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !737, file: !736, line: 67, baseType: !21, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !725, file: !726, line: 319, baseType: !775, size: 32, offset: 544)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !777, line: 17, baseType: !778)
!777 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !777, line: 25, size: 1120, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !786, !787, !788, !789, !790, !795, !796, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !852}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !778, file: !777, line: 26, baseType: !323, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !778, file: !777, line: 27, baseType: !323, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !778, file: !777, line: 29, baseType: !73, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !778, file: !777, line: 30, baseType: !73, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !778, file: !777, line: 31, baseType: !785, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !778, file: !777, line: 33, baseType: !73, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !778, file: !777, line: 35, baseType: !73, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !778, file: !777, line: 36, baseType: !73, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !778, file: !777, line: 37, baseType: !73, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !778, file: !777, line: 44, baseType: !791, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !777, line: 19, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!278, !775, !79}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !778, file: !777, line: 45, baseType: !13, size: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !778, file: !777, line: 47, baseType: !797, size: 32, offset: 352)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !777, line: 21, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!278, !13, !73}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !778, file: !777, line: 48, baseType: !13, size: 32, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !778, file: !777, line: 57, baseType: !21, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !778, file: !777, line: 58, baseType: !21, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !778, file: !777, line: 59, baseType: !21, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !778, file: !777, line: 60, baseType: !21, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !778, file: !777, line: 61, baseType: !21, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !778, file: !777, line: 62, baseType: !21, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !778, file: !777, line: 63, baseType: !21, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !778, file: !777, line: 64, baseType: !21, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !778, file: !777, line: 65, baseType: !21, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !778, file: !777, line: 66, baseType: !21, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !778, file: !777, line: 67, baseType: !21, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !778, file: !777, line: 68, baseType: !21, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !778, file: !777, line: 70, baseType: !278, size: 32, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !778, file: !777, line: 71, baseType: !816, size: 64, offset: 480)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !76, line: 68, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 65, size: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !817, file: !76, line: 66, baseType: !278, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !817, file: !76, line: 67, baseType: !37, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !778, file: !777, line: 72, baseType: !92, size: 32, offset: 544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !778, file: !777, line: 74, baseType: !285, size: 32, offset: 576)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !778, file: !777, line: 76, baseType: !86, size: 32, offset: 608)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !778, file: !777, line: 77, baseType: !86, size: 32, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !778, file: !777, line: 79, baseType: !86, size: 32, offset: 672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !778, file: !777, line: 80, baseType: !285, size: 32, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !778, file: !777, line: 82, baseType: !441, size: 32, offset: 736)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !778, file: !777, line: 83, baseType: !441, size: 32, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !778, file: !777, line: 84, baseType: !285, size: 32, offset: 800)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !778, file: !777, line: 86, baseType: !56, size: 32, offset: 832)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !778, file: !777, line: 87, baseType: !151, size: 32, offset: 864)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !778, file: !777, line: 89, baseType: !73, size: 32, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !778, file: !777, line: 90, baseType: !37, size: 32, offset: 928)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !778, file: !777, line: 91, baseType: !79, size: 32, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !778, file: !777, line: 93, baseType: !37, size: 32, offset: 992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !778, file: !777, line: 94, baseType: !139, size: 32, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !778, file: !777, line: 96, baseType: !838, size: 32, offset: 1056)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !97, line: 84, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 71, size: 1408, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !840, file: !97, line: 72, baseType: !95, size: 1216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !840, file: !97, line: 73, baseType: !86, size: 32, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !840, file: !97, line: 74, baseType: !623, size: 32, offset: 1248)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !840, file: !97, line: 75, baseType: !56, size: 32, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !840, file: !97, line: 76, baseType: !45, size: 32, offset: 1312)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !840, file: !97, line: 78, baseType: !29, size: 32, offset: 1344)
