; ModuleID = 'src/http/ngx_http_header_filter_module.c'
source_filename = "src/http/ngx_http_header_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_header_filter_module_ctx", scope: !2, file: !3, line: 18, type: !561, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11)
!3 = !DIFile(filename: "src/http/ngx_http_header_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12, !533, !0, !544, !549, !554, !556}
!12 = !DIGlobalVariableExpression(var: !13)
!13 = distinct !DIGlobalVariable(name: "ngx_http_header_filter_module", scope: !2, file: !3, line: 33, type: !14, isLocal: false, isDefinition: true)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !15, line: 15, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !17, line: 222, size: 800, elements: !18)
!17 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !{!19, !25, !26, !29, !30, !31, !32, !35, !36, !506, !507, !513, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !16, file: !17, line: 223, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !21, line: 79, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 125, baseType: !24)
!23 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !16, file: !17, line: 224, baseType: !20, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !16, file: !17, line: 226, baseType: !27, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !16, file: !17, line: 228, baseType: !20, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !16, file: !17, line: 229, baseType: !20, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !16, file: !17, line: 231, baseType: !20, size: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !16, file: !17, line: 232, baseType: !33, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !16, file: !17, line: 234, baseType: !6, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !16, file: !17, line: 235, baseType: !37, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !15, line: 22, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !40, line: 77, size: 224, elements: !41)
!40 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !{!42, !50, !51, !503, !504, !505}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 78, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !44, line: 19, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 16, size: 64, elements: !46)
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !44, line: 17, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 120, baseType: !24)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !44, line: 18, baseType: !7, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !40, line: 79, baseType: !20, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !39, file: !40, line: 80, baseType: !52, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!27, !55, !37, !6}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !15, line: 16, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !40, line: 116, size: 384, elements: !58)
!58 = !{!59, !60, !238, !485, !486, !487, !496, !497, !498, !499, !500, !502}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !40, line: 117, baseType: !27, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !57, file: !40, line: 118, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !63, line: 22, baseType: !64)
!63 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 16, size: 160, elements: !65)
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !64, file: !63, line: 17, baseType: !6, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !64, file: !63, line: 18, baseType: !20, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !64, file: !63, line: 19, baseType: !48, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !64, file: !63, line: 20, baseType: !20, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !64, file: !63, line: 21, baseType: !71, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !15, line: 18, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !74, line: 57, size: 320, elements: !75)
!74 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = !{!76, !84, !85, !86, !218, !225, !237}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !73, file: !74, line: 58, baseType: !77, size: 128)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !74, line: 54, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 49, size: 128, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !78, file: !74, line: 50, baseType: !7, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !78, file: !74, line: 51, baseType: !7, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !74, line: 52, baseType: !71, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !78, file: !74, line: 53, baseType: !20, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !73, file: !74, line: 59, baseType: !48, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !73, file: !74, line: 60, baseType: !71, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !73, file: !74, line: 61, baseType: !87, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !15, line: 19, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !90, line: 59, size: 64, elements: !91)
!90 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = !{!92, !217}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !89, file: !90, line: 60, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !90, line: 18, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !90, line: 20, size: 352, elements: !96)
!96 = !{!97, !98, !99, !102, !103, !104, !105, !107, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !95, file: !90, line: 21, baseType: !7, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !90, line: 22, baseType: !7, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !95, file: !90, line: 23, baseType: !100, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !23, line: 222, baseType: !101)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !95, file: !90, line: 24, baseType: !100, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !95, file: !90, line: 26, baseType: !7, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !95, file: !90, line: 27, baseType: !7, size: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !95, file: !90, line: 28, baseType: !106, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !90, line: 16, baseType: !6)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !95, file: !90, line: 29, baseType: !108, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !15, line: 23, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !111, line: 16, size: 1216, elements: !112)
!111 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!112 = !{!113, !116, !117, !162, !163, !164, !202, !203}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !110, file: !111, line: 17, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !115, line: 16, baseType: !101)
!115 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 18, baseType: !43, size: 64, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !110, file: !111, line: 19, baseType: !118, size: 960, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !115, line: 17, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !120, line: 4, size: 960, elements: !121)
!120 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = !{!122, !124, !125, !127, !128, !130, !131, !133, !135, !137, !138, !139, !140, !141, !142, !145, !146, !148, !149, !155, !156, !157}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !119, file: !120, line: 6, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !23, line: 232, baseType: !24)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !119, file: !120, line: 7, baseType: !123, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !119, file: !120, line: 8, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !23, line: 227, baseType: !24)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !119, file: !120, line: 9, baseType: !126, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !119, file: !120, line: 10, baseType: !129, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !23, line: 217, baseType: !24)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !119, file: !120, line: 11, baseType: !129, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !119, file: !120, line: 13, baseType: !132, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !23, line: 212, baseType: !24)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !119, file: !120, line: 14, baseType: !134, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !23, line: 304, baseType: !24)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !119, file: !120, line: 15, baseType: !136, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !23, line: 309, baseType: !24)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !119, file: !120, line: 16, baseType: !24, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !119, file: !120, line: 17, baseType: !123, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !119, file: !120, line: 18, baseType: !123, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !119, file: !120, line: 19, baseType: !100, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !119, file: !120, line: 20, baseType: !100, size: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !119, file: !120, line: 21, baseType: !143, size: 32, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !23, line: 237, baseType: !144)
!144 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !119, file: !120, line: 22, baseType: !143, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !119, file: !120, line: 23, baseType: !147, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !23, line: 242, baseType: !101)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !119, file: !120, line: 24, baseType: !147, size: 32, offset: 544)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !119, file: !120, line: 26, baseType: !150, size: 64, offset: 576)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !23, line: 288, size: 64, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !150, file: !23, line: 288, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !23, line: 75, baseType: !144)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !150, file: !23, line: 288, baseType: !144, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !119, file: !120, line: 27, baseType: !150, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !119, file: !120, line: 28, baseType: !150, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !119, file: !120, line: 29, baseType: !158, size: 192, offset: 768)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 192, elements: !160)
!159 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !110, file: !111, line: 21, baseType: !100, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !110, file: !111, line: 22, baseType: !100, size: 32, offset: 1120)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !110, file: !111, line: 24, baseType: !165, size: 32, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !15, line: 20, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !168, line: 50, size: 320, elements: !169)
!168 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!169 = !{!170, !171, !183, !187, !188, !193, !194, !199, !200, !201}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !167, file: !168, line: 51, baseType: !20, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !167, file: !168, line: 52, baseType: !172, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !15, line: 21, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !40, line: 89, size: 160, elements: !175)
!175 = !{!176, !177, !178, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !174, file: !40, line: 90, baseType: !114, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !40, line: 91, baseType: !43, size: 64, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !174, file: !40, line: 93, baseType: !179, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !172, !165}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !40, line: 94, baseType: !6, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !167, file: !168, line: 54, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !185, line: 98, baseType: !186)
!185 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !167, file: !168, line: 56, baseType: !153, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !167, file: !168, line: 58, baseType: !189, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !168, line: 45, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!7, !165, !7, !48}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !168, line: 59, baseType: !6, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !167, file: !168, line: 61, baseType: !195, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !168, line: 46, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !165, !20, !7, !48}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !167, file: !168, line: 62, baseType: !6, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !167, file: !168, line: 70, baseType: !27, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 72, baseType: !165, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !110, file: !111, line: 37, baseType: !24, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !110, file: !111, line: 38, baseType: !24, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !95, file: !90, line: 30, baseType: !93, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !95, file: !90, line: 34, baseType: !24, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !95, file: !90, line: 40, baseType: !24, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !95, file: !90, line: 43, baseType: !24, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !95, file: !90, line: 45, baseType: !24, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !95, file: !90, line: 46, baseType: !24, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !95, file: !90, line: 47, baseType: !24, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !95, file: !90, line: 48, baseType: !24, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !95, file: !90, line: 49, baseType: !24, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !95, file: !90, line: 50, baseType: !24, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !95, file: !90, line: 52, baseType: !24, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !95, file: !90, line: 53, baseType: !24, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !95, file: !90, line: 55, baseType: !101, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !90, line: 61, baseType: !87, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !73, file: !74, line: 62, baseType: !219, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !74, line: 41, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !74, line: 43, size: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !74, line: 44, baseType: !219, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !221, file: !74, line: 45, baseType: !6, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !73, file: !74, line: 63, baseType: !226, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !74, line: 32, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !74, line: 34, size: 96, elements: !229)
!229 = !{!230, !235, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !228, file: !74, line: 35, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !74, line: 30, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !6}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !74, line: 36, baseType: !6, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !74, line: 37, baseType: !226, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !73, file: !74, line: 64, baseType: !165, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !57, file: !40, line: 120, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !15, line: 17, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !242, line: 38, size: 2496, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !248, !249, !250, !251, !252, !431, !432, !433, !436, !437, !438, !439, !440, !441, !442, !443, !454, !455, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !241, file: !242, line: 39, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !241, file: !242, line: 40, baseType: !71, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 42, baseType: !165, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !241, file: !242, line: 43, baseType: !166, size: 320, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !241, file: !242, line: 45, baseType: !20, size: 32, offset: 416)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !241, file: !242, line: 47, baseType: !253, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !15, line: 26, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !257, line: 121, size: 896, elements: !258)
!257 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!258 = !{!259, !260, !316, !317, !320, !327, !329, !334, !339, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !257, line: 122, baseType: !6, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !256, file: !257, line: 123, baseType: !261, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !15, line: 24, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !264, line: 30, size: 384, elements: !265)
!264 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !293, !294, !295, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 31, baseType: !6, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !263, file: !264, line: 33, baseType: !24, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !263, file: !264, line: 35, baseType: !24, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !263, file: !264, line: 38, baseType: !24, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !263, file: !264, line: 44, baseType: !24, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !263, file: !264, line: 46, baseType: !24, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !263, file: !264, line: 49, baseType: !24, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !263, file: !264, line: 51, baseType: !24, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !263, file: !264, line: 54, baseType: !24, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !263, file: !264, line: 56, baseType: !24, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !263, file: !264, line: 57, baseType: !24, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !263, file: !264, line: 59, baseType: !24, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !263, file: !264, line: 60, baseType: !24, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !263, file: !264, line: 62, baseType: !24, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !263, file: !264, line: 64, baseType: !24, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !263, file: !264, line: 67, baseType: !24, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !263, file: !264, line: 69, baseType: !24, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !263, file: !264, line: 71, baseType: !24, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !263, file: !264, line: 74, baseType: !24, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !263, file: !264, line: 75, baseType: !24, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !263, file: !264, line: 77, baseType: !24, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !263, file: !264, line: 107, baseType: !24, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !263, file: !264, line: 110, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !15, line: 31, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !261}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !263, file: !264, line: 117, baseType: !20, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !263, file: !264, line: 119, baseType: !165, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !263, file: !264, line: 121, baseType: !296, size: 160, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !297, line: 20, baseType: !298)
!297 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !297, line: 22, size: 160, elements: !299)
!299 = !{!300, !302, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !298, file: !297, line: 23, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !297, line: 16, baseType: !20)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !298, file: !297, line: 24, baseType: !303, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !298, file: !297, line: 25, baseType: !303, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !298, file: !297, line: 26, baseType: !303, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !298, file: !297, line: 27, baseType: !8, size: 8, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !297, line: 28, baseType: !8, size: 8, offset: 136)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !264, line: 124, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !310, line: 16, baseType: !311)
!310 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !310, line: 18, size: 64, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !310, line: 19, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !310, line: 20, baseType: !314, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !256, file: !257, line: 124, baseType: !261, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !256, file: !257, line: 126, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !319, line: 17, baseType: !101)
!319 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !256, file: !257, line: 128, baseType: !321, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !322, line: 19, baseType: !323)
!322 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !254, !7, !48}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !23, line: 135, baseType: !101)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !256, file: !257, line: 129, baseType: !328, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !322, line: 22, baseType: !323)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !256, file: !257, line: 130, baseType: !330, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !322, line: 20, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!326, !254, !87, !100}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !256, file: !257, line: 131, baseType: !335, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !322, line: 23, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{!87, !254, !87, !100}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !256, file: !257, line: 133, baseType: !340, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !257, line: 16, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !257, line: 18, size: 960, elements: !343)
!343 = !{!344, !345, !357, !359, !360, !361, !362, !363, !364, !365, !370, !371, !372, !373, !374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !342, file: !257, line: 19, baseType: !318, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !342, file: !257, line: 21, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !348, line: 297, size: 128, elements: !349)
!348 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!349 = !{!350, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !347, file: !348, line: 298, baseType: !351, size: 16)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !23, line: 409, baseType: !352)
!352 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !347, file: !348, line: 299, baseType: !354, size: 112, offset: 16)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 112, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 14)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !342, file: !257, line: 22, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !23, line: 404, baseType: !24)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !342, file: !257, line: 23, baseType: !48, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !342, file: !257, line: 24, baseType: !43, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !257, line: 26, baseType: !101, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !342, file: !257, line: 28, baseType: !101, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !342, file: !257, line: 29, baseType: !101, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !342, file: !257, line: 30, baseType: !101, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !342, file: !257, line: 38, baseType: !366, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !15, line: 32, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !254}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !342, file: !257, line: 40, baseType: !6, size: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !342, file: !257, line: 42, baseType: !166, size: 320, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !342, file: !257, line: 43, baseType: !165, size: 32, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !342, file: !257, line: 45, baseType: !48, size: 32, offset: 736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !342, file: !257, line: 47, baseType: !48, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !342, file: !257, line: 49, baseType: !376, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !377, line: 16, baseType: !301)
!377 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !342, file: !257, line: 51, baseType: !340, size: 32, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !342, file: !257, line: 52, baseType: !254, size: 32, offset: 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !342, file: !257, line: 54, baseType: !20, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !342, file: !257, line: 56, baseType: !24, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !342, file: !257, line: 57, baseType: !24, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !342, file: !257, line: 58, baseType: !24, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !342, file: !257, line: 60, baseType: !24, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !342, file: !257, line: 61, baseType: !24, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !342, file: !257, line: 62, baseType: !24, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !342, file: !257, line: 63, baseType: !24, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !342, file: !257, line: 64, baseType: !24, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !342, file: !257, line: 65, baseType: !24, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !342, file: !257, line: 66, baseType: !24, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !342, file: !257, line: 67, baseType: !24, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !342, file: !257, line: 70, baseType: !24, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !342, file: !257, line: 72, baseType: !24, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !342, file: !257, line: 73, baseType: !24, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !342, file: !257, line: 74, baseType: !24, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !342, file: !257, line: 76, baseType: !24, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !342, file: !257, line: 77, baseType: !24, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !342, file: !257, line: 78, baseType: !24, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !256, file: !257, line: 135, baseType: !100, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !256, file: !257, line: 137, baseType: !165, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !257, line: 139, baseType: !71, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !257, line: 141, baseType: !101, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !256, file: !257, line: 143, baseType: !346, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !256, file: !257, line: 144, baseType: !358, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !256, file: !257, line: 145, baseType: !43, size: 64, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !256, file: !257, line: 147, baseType: !43, size: 64, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !256, file: !257, line: 148, baseType: !408, size: 16, offset: 608)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !409, line: 12, baseType: !410)
!409 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 186, baseType: !352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !256, file: !257, line: 154, baseType: !346, size: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !256, file: !257, line: 155, baseType: !358, size: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !256, file: !257, line: 157, baseType: !93, size: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !256, file: !257, line: 159, baseType: !309, size: 64, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !256, file: !257, line: 161, baseType: !184, size: 32, offset: 800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !256, file: !257, line: 163, baseType: !20, size: 32, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !256, file: !257, line: 165, baseType: !24, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !256, file: !257, line: 167, baseType: !24, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !256, file: !257, line: 169, baseType: !24, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !256, file: !257, line: 170, baseType: !24, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !256, file: !257, line: 171, baseType: !24, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !256, file: !257, line: 173, baseType: !24, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !256, file: !257, line: 174, baseType: !24, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !256, file: !257, line: 175, baseType: !24, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !256, file: !257, line: 176, baseType: !24, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !256, file: !257, line: 178, baseType: !24, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !256, file: !257, line: 179, baseType: !24, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !256, file: !257, line: 180, baseType: !24, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !256, file: !257, line: 181, baseType: !24, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !256, file: !257, line: 183, baseType: !24, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !241, file: !242, line: 48, baseType: !254, size: 32, offset: 480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !241, file: !242, line: 49, baseType: !20, size: 32, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !241, file: !242, line: 51, baseType: !434, size: 32, offset: 544)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !241, file: !242, line: 52, baseType: !20, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !241, file: !242, line: 53, baseType: !20, size: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !241, file: !242, line: 55, baseType: !309, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !241, file: !242, line: 56, baseType: !20, size: 32, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !241, file: !242, line: 58, baseType: !62, size: 160, offset: 736)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !241, file: !242, line: 59, baseType: !62, size: 160, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !241, file: !242, line: 61, baseType: !62, size: 160, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !241, file: !242, line: 62, baseType: !444, size: 96, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !297, line: 32, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !297, line: 37, size: 96, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !445, file: !297, line: 38, baseType: !303, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !445, file: !297, line: 39, baseType: !303, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !445, file: !297, line: 40, baseType: !450, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !297, line: 34, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !303, !303, !303}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !241, file: !242, line: 63, baseType: !296, size: 160, offset: 1312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !241, file: !242, line: 65, baseType: !456, size: 224, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 25, size: 224, elements: !459)
!459 = !{!460, !468, !469, !470, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !458, file: !457, line: 26, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !457, line: 16, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !457, line: 18, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !463, file: !457, line: 19, baseType: !6, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !463, file: !457, line: 20, baseType: !20, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !457, line: 21, baseType: !461, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !458, file: !457, line: 27, baseType: !462, size: 96, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !457, line: 28, baseType: !48, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !458, file: !457, line: 29, baseType: !20, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !458, file: !457, line: 30, baseType: !71, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !241, file: !242, line: 66, baseType: !456, size: 224, offset: 1696)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !241, file: !242, line: 68, baseType: !20, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !241, file: !242, line: 69, baseType: !20, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !241, file: !242, line: 71, baseType: !254, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !241, file: !242, line: 72, baseType: !261, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !241, file: !242, line: 73, baseType: !261, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !241, file: !242, line: 75, baseType: !239, size: 32, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !241, file: !242, line: 77, baseType: !43, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !241, file: !242, line: 78, baseType: !43, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !241, file: !242, line: 79, baseType: !43, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !241, file: !242, line: 80, baseType: !43, size: 64, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !241, file: !242, line: 81, baseType: !43, size: 64, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !241, file: !242, line: 82, baseType: !43, size: 64, offset: 2432)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !57, file: !40, line: 121, baseType: !71, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !57, file: !40, line: 122, baseType: !71, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !57, file: !40, line: 123, baseType: !488, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !40, line: 103, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 98, size: 1344, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !490, file: !40, line: 99, baseType: !109, size: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !490, file: !40, line: 100, baseType: !93, size: 32, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !490, file: !40, line: 101, baseType: !93, size: 32, offset: 1248)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !490, file: !40, line: 102, baseType: !20, size: 32, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !57, file: !40, line: 124, baseType: !165, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !57, file: !40, line: 126, baseType: !6, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !57, file: !40, line: 127, baseType: !20, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !57, file: !40, line: 128, baseType: !20, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !57, file: !40, line: 130, baseType: !501, size: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !40, line: 112, baseType: !52)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !57, file: !40, line: 131, baseType: !27, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !39, file: !40, line: 81, baseType: !20, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !39, file: !40, line: 82, baseType: !20, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !39, file: !40, line: 83, baseType: !6, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, file: !17, line: 236, baseType: !20, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !16, file: !17, line: 238, baseType: !508, size: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !165}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !21, line: 78, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 140, baseType: !101)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !16, file: !17, line: 240, baseType: !514, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!511, !239}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !16, file: !17, line: 242, baseType: !514, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !16, file: !17, line: 243, baseType: !514, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !16, file: !17, line: 244, baseType: !520, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !239}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !16, file: !17, line: 245, baseType: !520, size: 32, offset: 480)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !16, file: !17, line: 247, baseType: !520, size: 32, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !16, file: !17, line: 249, baseType: !22, size: 32, offset: 544)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !16, file: !17, line: 250, baseType: !22, size: 32, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !16, file: !17, line: 251, baseType: !22, size: 32, offset: 608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !16, file: !17, line: 252, baseType: !22, size: 32, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !16, file: !17, line: 253, baseType: !22, size: 32, offset: 672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !16, file: !17, line: 254, baseType: !22, size: 32, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !16, file: !17, line: 255, baseType: !22, size: 32, offset: 736)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !16, file: !17, line: 256, baseType: !22, size: 32, offset: 768)
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "ngx_http_headers_out", scope: !2, file: !3, line: 134, type: !535, isLocal: false, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 1056, elements: !542)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_header_out_t", file: !537, line: 174, baseType: !538)
!537 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 171, size: 96, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !537, line: 172, baseType: !43, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !538, file: !537, line: 173, baseType: !20, size: 32, offset: 64)
!542 = !{!543}
!543 = !DISubrange(count: 11)
!544 = !DIGlobalVariableExpression(var: !545)
!545 = distinct !DIGlobalVariable(name: "ngx_http_status_lines", scope: !2, file: !3, line: 54, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 3328, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 52)
!549 = !DIGlobalVariableExpression(var: !550)
!550 = distinct !DIGlobalVariable(name: "ngx_http_server_full_string", scope: !2, file: !3, line: 50, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 184, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 23)
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "ngx_http_server_build_string", scope: !2, file: !3, line: 51, type: !551, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557)
!557 = distinct !DIGlobalVariable(name: "ngx_http_server_string", scope: !2, file: !3, line: 49, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 16)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !562, line: 36, baseType: !563)
!562 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 24, size: 256, elements: !564)
!564 = !{!565, !569, !570, !574, !578, !579, !583, !584}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !563, file: !562, line: 25, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!511, !55}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !563, file: !562, line: 26, baseType: !566, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !563, file: !562, line: 28, baseType: !571, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!6, !55}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !563, file: !562, line: 29, baseType: !575, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DISubroutineType(types: !577)
!577 = !{!27, !55, !6}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !563, file: !562, line: 31, baseType: !571, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !563, file: !562, line: 32, baseType: !580, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!27, !55, !6, !6}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !563, file: !562, line: 34, baseType: !571, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !563, file: !562, line: 35, baseType: !580, size: 32, offset: 224)
!585 = !{i32 2, !"Dwarf Version", i32 4}
!586 = !{i32 2, !"Debug Info Version", i32 3}
!587 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!588 = distinct !DISubprogram(name: "ngx_http_header_filter_init", scope: !3, file: !3, line: 624, type: !567, isLocal: true, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !589)
!589 = !{!590}
!590 = !DILocalVariable(name: "cf", arg: 1, scope: !588, file: !3, line: 624, type: !55)
!591 = !{!592, !592, i64 0}
!592 = !{!"any pointer", !593, i64 0}
!593 = !{!"omnipotent char", !594, i64 0}
!594 = !{!"Simple C/C++ TBAA"}
!595 = !DIExpression()
!596 = !DILocation(line: 624, column: 41, scope: !588)
!597 = !DILocation(line: 626, column: 32, scope: !588)
!598 = !DILocation(line: 628, column: 5, scope: !588)
!599 = distinct !DISubprogram(name: "ngx_http_header_filter", scope: !3, file: !3, line: 156, type: !600, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1835)
!600 = !DISubroutineType(types: !601)
!601 = !{!511, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !604, line: 16, baseType: !605)
!604 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !537, line: 364, size: 5376, elements: !606)
!606 = !{!607, !609, !610, !611, !612, !613, !614, !619, !620, !830, !1388, !1389, !1390, !1391, !1430, !1460, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1505, !1516, !1523, !1524, !1526, !1527, !1540, !1541, !1542, !1543, !1544, !1545, !1731, !1735, !1740, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !605, file: !537, line: 365, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 191, baseType: !24)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !605, file: !537, line: 367, baseType: !254, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !605, file: !537, line: 369, baseType: !247, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !605, file: !537, line: 370, baseType: !247, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !605, file: !537, line: 371, baseType: !247, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !605, file: !537, line: 372, baseType: !247, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !605, file: !537, line: 374, baseType: !615, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !537, line: 361, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !602}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !605, file: !537, line: 375, baseType: !615, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !605, file: !537, line: 378, baseType: !621, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !604, line: 18, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !624, line: 65, size: 3008, elements: !625)
!624 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!625 = !{!626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !788, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !623, file: !624, line: 66, baseType: !109, size: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !623, file: !624, line: 67, baseType: !62, size: 160, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !623, file: !624, line: 68, baseType: !608, size: 32, offset: 1376)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !623, file: !624, line: 69, baseType: !558, size: 128, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !623, file: !624, line: 70, baseType: !558, size: 128, offset: 1536)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !623, file: !624, line: 72, baseType: !632, size: 32, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !115, line: 18, baseType: !126)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !623, file: !624, line: 73, baseType: !153, size: 32, offset: 1696)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !623, file: !624, line: 74, baseType: !153, size: 32, offset: 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !623, file: !624, line: 75, baseType: !153, size: 32, offset: 1760)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !623, file: !624, line: 76, baseType: !153, size: 32, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !623, file: !624, line: 77, baseType: !153, size: 32, offset: 1824)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !623, file: !624, line: 79, baseType: !43, size: 64, offset: 1856)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !623, file: !624, line: 80, baseType: !43, size: 64, offset: 1920)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !623, file: !624, line: 81, baseType: !558, size: 128, offset: 1984)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !623, file: !624, line: 83, baseType: !48, size: 32, offset: 2112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !623, file: !624, line: 84, baseType: !48, size: 32, offset: 2144)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !623, file: !624, line: 85, baseType: !100, size: 32, offset: 2176)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !623, file: !624, line: 86, baseType: !100, size: 32, offset: 2208)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !623, file: !624, line: 88, baseType: !20, size: 32, offset: 2240)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !623, file: !624, line: 89, baseType: !20, size: 32, offset: 2272)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !623, file: !624, line: 90, baseType: !20, size: 32, offset: 2304)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !623, file: !624, line: 91, baseType: !20, size: 32, offset: 2336)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !623, file: !624, line: 93, baseType: !93, size: 32, offset: 2368)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !623, file: !624, line: 95, baseType: !651, size: 32, offset: 2400)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !604, line: 19, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !624, line: 157, size: 544, elements: !654)
!654 = !{!655, !670, !731, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !787}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !653, file: !624, line: 158, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !624, line: 154, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 145, size: 480, elements: !659)
!659 = !{!660, !661, !662, !663, !666, !667, !668, !669}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !658, file: !624, line: 146, baseType: !444, size: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !658, file: !624, line: 147, baseType: !296, size: 160, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !658, file: !624, line: 148, baseType: !309, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !658, file: !624, line: 149, baseType: !664, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !185, line: 106, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !658, file: !624, line: 150, baseType: !664, size: 32, offset: 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !658, file: !624, line: 151, baseType: !100, size: 32, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !658, file: !624, line: 152, baseType: !20, size: 32, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !658, file: !624, line: 153, baseType: !20, size: 32, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !653, file: !624, line: 159, baseType: !671, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !673, line: 59, baseType: !674)
!673 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 34, size: 800, elements: !675)
!675 = !{!676, !683, !684, !685, !693, !694, !695, !704, !705, !706, !707, !726, !727, !728, !729, !730}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !674, file: !673, line: 35, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !678, line: 21, baseType: !679)
!678 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 16, size: 64, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !679, file: !678, line: 17, baseType: !664, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !679, file: !678, line: 19, baseType: !664, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !674, file: !673, line: 37, baseType: !48, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !674, file: !673, line: 38, baseType: !48, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !674, file: !673, line: 40, baseType: !686, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !673, line: 16, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !673, line: 18, size: 96, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !688, file: !673, line: 19, baseType: !22, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !673, line: 20, baseType: !686, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !688, file: !673, line: 21, baseType: !22, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !674, file: !673, line: 41, baseType: !686, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !674, file: !673, line: 42, baseType: !687, size: 96, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !674, file: !673, line: 44, baseType: !696, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !673, line: 31, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 25, size: 128, elements: !699)
!699 = !{!700, !701, !702, !703}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !698, file: !673, line: 26, baseType: !20, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !698, file: !673, line: 27, baseType: !20, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !698, file: !673, line: 29, baseType: !20, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !698, file: !673, line: 30, baseType: !20, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !674, file: !673, line: 45, baseType: !20, size: 32, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !674, file: !673, line: 47, baseType: !7, size: 32, offset: 352)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !674, file: !673, line: 48, baseType: !7, size: 32, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !674, file: !673, line: 50, baseType: !708, size: 256, offset: 416)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !678, line: 37, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 24, size: 256, elements: !710)
!710 = !{!711, !713, !714, !715, !725}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !678, line: 26, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !709, file: !678, line: 28, baseType: !712, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !709, file: !678, line: 29, baseType: !20, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !709, file: !678, line: 30, baseType: !716, size: 128, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !717, line: 19, baseType: !718)
!717 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 17, size: 128, elements: !719)
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !718, file: !717, line: 18, baseType: !721, size: 128)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 128, elements: !723)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !101)
!723 = !{!724}
!724 = !DISubrange(count: 4)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !709, file: !678, line: 36, baseType: !20, size: 32, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !674, file: !673, line: 52, baseType: !7, size: 32, offset: 672)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !674, file: !673, line: 53, baseType: !8, size: 8, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !674, file: !673, line: 55, baseType: !24, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !674, file: !673, line: 57, baseType: !6, size: 32, offset: 736)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !674, file: !673, line: 58, baseType: !6, size: 32, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !653, file: !624, line: 161, baseType: !732, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !111, line: 62, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 50, size: 384, elements: !735)
!735 = !{!736, !737, !738, !740, !745, !747, !749, !750, !751}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !111, line: 51, baseType: !43, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !734, file: !111, line: 52, baseType: !48, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !734, file: !111, line: 53, baseType: !739, size: 96, offset: 96)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !734, file: !111, line: 55, baseType: !741, size: 32, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !111, line: 45, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{!376, !6}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !734, file: !111, line: 56, baseType: !746, size: 32, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !111, line: 46, baseType: !742)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !734, file: !111, line: 57, baseType: !748, size: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !111, line: 47, baseType: !232)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !734, file: !111, line: 58, baseType: !6, size: 32, offset: 288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !734, file: !111, line: 60, baseType: !7, size: 32, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !734, file: !111, line: 61, baseType: !20, size: 32, offset: 352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !653, file: !624, line: 163, baseType: !100, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !653, file: !624, line: 164, baseType: !48, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !653, file: !624, line: 166, baseType: !153, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !653, file: !624, line: 168, baseType: !153, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !653, file: !624, line: 170, baseType: !20, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !653, file: !624, line: 171, baseType: !20, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !653, file: !624, line: 172, baseType: !376, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !653, file: !624, line: 173, baseType: !376, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !653, file: !624, line: 174, baseType: !376, size: 32, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !653, file: !624, line: 176, baseType: !20, size: 32, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !653, file: !624, line: 177, baseType: !376, size: 32, offset: 416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !653, file: !624, line: 178, baseType: !376, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !653, file: !624, line: 180, baseType: !765, size: 32, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !242, line: 25, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !242, line: 29, size: 320, elements: !768)
!768 = !{!769, !770, !780, !785, !786}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !242, line: 30, baseType: !6, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !767, file: !242, line: 31, baseType: !771, size: 192, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !772, line: 22, baseType: !773)
!772 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !772, line: 16, size: 192, elements: !774)
!774 = !{!775, !776, !777, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !773, file: !772, line: 17, baseType: !7, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !773, file: !772, line: 18, baseType: !48, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !773, file: !772, line: 19, baseType: !43, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !773, file: !772, line: 20, baseType: !165, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !773, file: !772, line: 21, baseType: !20, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !767, file: !242, line: 32, baseType: !781, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !242, line: 27, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!511, !765, !6}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !767, file: !242, line: 33, baseType: !6, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !767, file: !242, line: 34, baseType: !20, size: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !653, file: !624, line: 182, baseType: !20, size: 32, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !624, line: 96, baseType: !789, size: 32, offset: 2432)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !624, line: 62, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 39, size: 576, elements: !792)
!792 = !{!793, !794, !795, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !791, file: !624, line: 40, baseType: !296, size: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !791, file: !624, line: 41, baseType: !309, size: 64, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !791, file: !624, line: 43, baseType: !796, size: 96, offset: 224)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 12)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !791, file: !624, line: 46, baseType: !24, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !791, file: !624, line: 47, baseType: !24, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !791, file: !624, line: 48, baseType: !24, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !791, file: !624, line: 49, baseType: !24, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !791, file: !624, line: 50, baseType: !24, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !791, file: !624, line: 51, baseType: !24, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !791, file: !624, line: 52, baseType: !24, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !791, file: !624, line: 53, baseType: !24, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !791, file: !624, line: 56, baseType: !632, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !791, file: !624, line: 57, baseType: !153, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !791, file: !624, line: 58, baseType: !153, size: 32, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !791, file: !624, line: 59, baseType: !48, size: 32, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !791, file: !624, line: 60, baseType: !100, size: 32, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !791, file: !624, line: 61, baseType: !376, size: 32, offset: 544)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !623, file: !624, line: 102, baseType: !376, size: 32, offset: 2464)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !623, file: !624, line: 103, baseType: !376, size: 32, offset: 2496)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !623, file: !624, line: 104, baseType: !376, size: 32, offset: 2528)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !623, file: !624, line: 105, baseType: !376, size: 32, offset: 2560)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !623, file: !624, line: 107, baseType: !262, size: 384, offset: 2592)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !623, file: !624, line: 109, baseType: !24, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !623, file: !624, line: 110, baseType: !24, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !623, file: !624, line: 112, baseType: !24, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !623, file: !624, line: 113, baseType: !24, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !623, file: !624, line: 114, baseType: !24, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !623, file: !624, line: 115, baseType: !24, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !623, file: !624, line: 116, baseType: !24, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !623, file: !624, line: 117, baseType: !24, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !623, file: !624, line: 118, baseType: !24, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !623, file: !624, line: 119, baseType: !24, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !623, file: !624, line: 121, baseType: !24, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !623, file: !624, line: 122, baseType: !24, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !605, file: !537, line: 381, baseType: !831, size: 32, offset: 288)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !604, line: 17, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !834, line: 313, size: 4096, elements: !835)
!834 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!835 = !{!836, !841, !842, !883, !962, !963, !985, !994, !1117, !1118, !1119, !1157, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1335, !1339, !1340, !1342, !1343, !1344, !1345, !1346, !1350, !1354, !1358, !1359, !1371, !1372, !1373, !1374, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !833, file: !834, line: 314, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !834, line: 309, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !602, !831}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !833, file: !834, line: 315, baseType: !837, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !833, file: !834, line: 317, baseType: !843, size: 480, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !844, line: 22, baseType: !845)
!844 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !844, line: 36, size: 480, elements: !846)
!846 = !{!847, !848, !849, !850, !852, !853, !854, !860, !865, !867, !868, !877, !878, !879, !880, !881, !882}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !845, file: !844, line: 37, baseType: !254, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !845, file: !844, line: 39, baseType: !346, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !845, file: !844, line: 40, baseType: !358, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !844, line: 41, baseType: !851, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !845, file: !844, line: 43, baseType: !20, size: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !845, file: !844, line: 44, baseType: !376, size: 32, offset: 160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !845, file: !844, line: 46, baseType: !855, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !844, line: 24, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!511, !859, !6}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !845, file: !844, line: 47, baseType: !861, size: 32, offset: 224)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !844, line: 26, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !859, !6, !20}
