; ModuleID = 'src/http/ngx_http_upstream.c'
source_filename = "src/http/ngx_http_upstream.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_upstream_module_ctx", scope: !2, file: !3, line: 345, type: !1868, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !1801)
!3 = !DIFile(filename: "src/http/ngx_http_upstream.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5, !13, !18}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 93, size: 32, elements: !7)
!6 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "NGX_ERROR_ALERT", value: 0)
!9 = !DIEnumerator(name: "NGX_ERROR_ERR", value: 1)
!10 = !DIEnumerator(name: "NGX_ERROR_INFO", value: 2)
!11 = !DIEnumerator(name: "NGX_ERROR_IGNORE_ECONNRESET", value: 3)
!12 = !DIEnumerator(name: "NGX_ERROR_IGNORE_EINVAL", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 102, size: 32, elements: !14)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "NGX_TCP_NODELAY_UNSET", value: 0)
!16 = !DIEnumerator(name: "NGX_TCP_NODELAY_SET", value: 1)
!17 = !DIEnumerator(name: "NGX_TCP_NODELAY_DISABLED", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 109, size: 32, elements: !19)
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "NGX_TCP_NOPUSH_UNSET", value: 0)
!21 = !DIEnumerator(name: "NGX_TCP_NOPUSH_SET", value: 1)
!22 = !DIEnumerator(name: "NGX_TCP_NOPUSH_DISABLED", value: 2)
!23 = !{!24, !25, !34, !89, !91, !71, !272, !185, !276, !277, !234, !92, !69, !72, !287, !1797, !1059, !132, !1799}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !27, line: 21, baseType: !28)
!27 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 17, size: 96, elements: !29)
!29 = !{!30, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !28, file: !27, line: 18, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !28, file: !27, line: 19, baseType: !31, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !28, file: !27, line: 20, baseType: !31, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_local_t", file: !37, line: 144, baseType: !38)
!37 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 138, size: 64, elements: !39)
!39 = !{!40, !75}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !38, file: !37, line: 139, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !43, line: 78, baseType: !44)
!43 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 74, size: 128, elements: !45)
!45 = !{!46, !60, !63}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !44, file: !43, line: 75, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !49, line: 297, size: 128, elements: !50)
!49 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = !{!51, !55}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !48, file: !49, line: 298, baseType: !52, size: 16)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !53, line: 409, baseType: !54)
!53 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !48, file: !49, line: 299, baseType: !56, size: 112, offset: 16)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 112, elements: !58)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !{!59}
!59 = !DISubrange(count: 14)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !44, file: !43, line: 76, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !53, line: 404, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !43, line: 77, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !65, line: 19, baseType: !66)
!65 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 16, size: 64, elements: !67)
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !65, line: 17, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 120, baseType: !62)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !65, line: 18, baseType: !71, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !73, line: 64, baseType: !74)
!73 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !38, file: !37, line: 140, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_complex_value_t", file: !78, line: 71, baseType: !79)
!78 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 66, size: 160, elements: !80)
!80 = !{!81, !82, !87, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !78, line: 67, baseType: !64, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flushes", scope: !79, file: !78, line: 68, baseType: !83, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !85, line: 79, baseType: !86)
!85 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 125, baseType: !62)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !79, file: !78, line: 69, baseType: !24, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !79, file: !78, line: 70, baseType: !24, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !94, line: 22, baseType: !95)
!94 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 16, size: 160, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !95, file: !94, line: 17, baseType: !24, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !95, file: !94, line: 18, baseType: !84, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !94, line: 19, baseType: !69, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !95, file: !94, line: 20, baseType: !84, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !95, file: !94, line: 21, baseType: !102, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !104, line: 18, baseType: !105)
!104 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !106, line: 57, size: 320, elements: !107)
!106 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = !{!108, !116, !117, !118, !252, !259, !271}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !105, file: !106, line: 58, baseType: !109, size: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !106, line: 54, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 49, size: 128, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !106, line: 50, baseType: !71, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !110, file: !106, line: 51, baseType: !71, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !106, line: 52, baseType: !102, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !110, file: !106, line: 53, baseType: !84, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !105, file: !106, line: 59, baseType: !69, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !105, file: !106, line: 60, baseType: !102, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !105, file: !106, line: 61, baseType: !119, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !104, line: 19, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !122, line: 59, size: 64, elements: !123)
!122 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !{!124, !251}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !121, file: !122, line: 60, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !122, line: 18, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !122, line: 20, size: 352, elements: !128)
!128 = !{!129, !130, !131, !134, !135, !136, !137, !139, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !127, file: !122, line: 21, baseType: !71, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !127, file: !122, line: 22, baseType: !71, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !127, file: !122, line: 23, baseType: !132, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !53, line: 222, baseType: !133)
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !127, file: !122, line: 24, baseType: !132, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !127, file: !122, line: 26, baseType: !71, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !127, file: !122, line: 27, baseType: !71, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !127, file: !122, line: 28, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !122, line: 16, baseType: !24)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !127, file: !122, line: 29, baseType: !140, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !104, line: 23, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !143, line: 16, size: 1216, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !148, !149, !194, !195, !196, !236, !237}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !142, file: !143, line: 17, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !147, line: 16, baseType: !133)
!147 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 18, baseType: !64, size: 64, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !142, file: !143, line: 19, baseType: !150, size: 960, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !147, line: 17, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !152, line: 4, size: 960, elements: !153)
!152 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!153 = !{!154, !156, !157, !159, !160, !162, !163, !165, !167, !169, !170, !171, !172, !173, !174, !177, !178, !180, !181, !187, !188, !189}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !151, file: !152, line: 6, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !53, line: 232, baseType: !62)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !151, file: !152, line: 7, baseType: !155, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !151, file: !152, line: 8, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !53, line: 227, baseType: !62)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !151, file: !152, line: 9, baseType: !158, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !151, file: !152, line: 10, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !53, line: 217, baseType: !62)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !151, file: !152, line: 11, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !151, file: !152, line: 13, baseType: !164, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !53, line: 212, baseType: !62)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !151, file: !152, line: 14, baseType: !166, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !53, line: 304, baseType: !62)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !151, file: !152, line: 15, baseType: !168, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !53, line: 309, baseType: !62)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !151, file: !152, line: 16, baseType: !62, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !151, file: !152, line: 17, baseType: !155, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !151, file: !152, line: 18, baseType: !155, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !151, file: !152, line: 19, baseType: !132, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !151, file: !152, line: 20, baseType: !132, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !151, file: !152, line: 21, baseType: !175, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !53, line: 237, baseType: !176)
!176 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !151, file: !152, line: 22, baseType: !175, size: 32, offset: 480)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !151, file: !152, line: 23, baseType: !179, size: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !53, line: 242, baseType: !133)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !151, file: !152, line: 24, baseType: !179, size: 32, offset: 544)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !151, file: !152, line: 26, baseType: !182, size: 64, offset: 576)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !53, line: 288, size: 64, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !182, file: !53, line: 288, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !53, line: 75, baseType: !176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !182, file: !53, line: 288, baseType: !176, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !151, file: !152, line: 27, baseType: !182, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !151, file: !152, line: 28, baseType: !182, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !151, file: !152, line: 29, baseType: !190, size: 192, offset: 768)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 192, elements: !192)
!191 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !142, file: !143, line: 21, baseType: !132, size: 32, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !142, file: !143, line: 22, baseType: !132, size: 32, offset: 1120)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !142, file: !143, line: 24, baseType: !197, size: 32, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !104, line: 20, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !200, line: 50, size: 320, elements: !201)
!200 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = !{!202, !203, !216, !220, !221, !226, !227, !232, !233, !235}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !199, file: !200, line: 51, baseType: !84, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !199, file: !200, line: 52, baseType: !204, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !104, line: 21, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !207, line: 89, size: 160, elements: !208)
!207 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!208 = !{!209, !210, !211, !215}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !206, file: !207, line: 90, baseType: !146, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !207, line: 91, baseType: !64, size: 64, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !206, file: !207, line: 93, baseType: !212, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !204, !197}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 94, baseType: !24, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !199, file: !200, line: 54, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !218, line: 98, baseType: !219)
!218 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!219 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !199, file: !200, line: 56, baseType: !185, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !199, file: !200, line: 58, baseType: !222, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !200, line: 45, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{!71, !197, !71, !69}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !200, line: 59, baseType: !24, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !199, file: !200, line: 61, baseType: !228, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !200, line: 46, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !197, !84, !71, !69}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !199, file: !200, line: 62, baseType: !24, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !199, file: !200, line: 70, baseType: !234, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !200, line: 72, baseType: !197, size: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !142, file: !143, line: 37, baseType: !62, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !142, file: !143, line: 38, baseType: !62, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !127, file: !122, line: 30, baseType: !125, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !127, file: !122, line: 34, baseType: !62, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !127, file: !122, line: 40, baseType: !62, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !127, file: !122, line: 43, baseType: !62, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !127, file: !122, line: 45, baseType: !62, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !127, file: !122, line: 46, baseType: !62, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !127, file: !122, line: 47, baseType: !62, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !127, file: !122, line: 48, baseType: !62, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !127, file: !122, line: 49, baseType: !62, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !127, file: !122, line: 50, baseType: !62, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !127, file: !122, line: 52, baseType: !62, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !127, file: !122, line: 53, baseType: !62, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !127, file: !122, line: 55, baseType: !133, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !122, line: 61, baseType: !119, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !105, file: !106, line: 62, baseType: !253, size: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !106, line: 41, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !106, line: 43, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !106, line: 44, baseType: !253, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !255, file: !106, line: 45, baseType: !24, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !105, file: !106, line: 63, baseType: !260, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !106, line: 32, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !106, line: 34, size: 96, elements: !263)
!263 = !{!264, !269, !270}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !262, file: !106, line: 35, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !106, line: 30, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !24}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !106, line: 36, baseType: !24, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !106, line: 37, baseType: !260, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !105, file: !106, line: 64, baseType: !197, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !273, line: 16, baseType: !274)
!273 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !275, line: 16, baseType: !84)
!275 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_table_elt_t", file: !280, line: 97, baseType: !281)
!280 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 92, size: 192, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !281, file: !280, line: 93, baseType: !84, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !281, file: !280, line: 94, baseType: !64, size: 64, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !280, line: 95, baseType: !64, size: 64, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lowcase_key", scope: !281, file: !280, line: 96, baseType: !71, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_ctx_t", file: !289, line: 20, baseType: !290)
!289 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_log_ctx_s", file: !289, line: 52, size: 96, elements: !291)
!291 = !{!292, !453, !1796}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !290, file: !289, line: 53, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !104, line: 26, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !6, line: 121, size: 896, elements: !296)
!296 = !{!297, !298, !352, !353, !356, !363, !365, !370, !375, !421, !422, !423, !424, !425, !426, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !6, line: 122, baseType: !24, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !295, file: !6, line: 123, baseType: !299, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !104, line: 24, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !302, line: 30, size: 384, elements: !303)
!302 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !331, !332, !333, !344}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 31, baseType: !24, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !301, file: !302, line: 33, baseType: !62, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !301, file: !302, line: 35, baseType: !62, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !301, file: !302, line: 38, baseType: !62, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !301, file: !302, line: 44, baseType: !62, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !301, file: !302, line: 46, baseType: !62, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !301, file: !302, line: 49, baseType: !62, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !301, file: !302, line: 51, baseType: !62, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !301, file: !302, line: 54, baseType: !62, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !301, file: !302, line: 56, baseType: !62, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !301, file: !302, line: 57, baseType: !62, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !301, file: !302, line: 59, baseType: !62, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !301, file: !302, line: 60, baseType: !62, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !301, file: !302, line: 62, baseType: !62, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !301, file: !302, line: 64, baseType: !62, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !301, file: !302, line: 67, baseType: !62, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !301, file: !302, line: 69, baseType: !62, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !301, file: !302, line: 71, baseType: !62, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !301, file: !302, line: 74, baseType: !62, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !301, file: !302, line: 75, baseType: !62, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !301, file: !302, line: 77, baseType: !62, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !301, file: !302, line: 107, baseType: !62, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !301, file: !302, line: 110, baseType: !327, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !104, line: 31, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !299}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !301, file: !302, line: 117, baseType: !84, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !301, file: !302, line: 119, baseType: !197, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !301, file: !302, line: 121, baseType: !334, size: 160, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !275, line: 20, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !275, line: 22, size: 160, elements: !336)
!336 = !{!337, !338, !340, !341, !342, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !335, file: !275, line: 23, baseType: !274, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !335, file: !275, line: 24, baseType: !339, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !335, file: !275, line: 25, baseType: !339, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !335, file: !275, line: 26, baseType: !339, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !335, file: !275, line: 27, baseType: !72, size: 8, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !275, line: 28, baseType: !72, size: 8, offset: 136)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !301, file: !302, line: 124, baseType: !345, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !346, line: 16, baseType: !347)
!346 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !346, line: 18, size: 64, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !347, file: !346, line: 19, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !346, line: 20, baseType: !350, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !295, file: !6, line: 124, baseType: !299, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !295, file: !6, line: 126, baseType: !354, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !355, line: 17, baseType: !133)
!355 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !295, file: !6, line: 128, baseType: !357, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !358, line: 19, baseType: !359)
!358 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DISubroutineType(types: !361)
!361 = !{!362, !293, !71, !69}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !53, line: 135, baseType: !133)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !295, file: !6, line: 129, baseType: !364, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !358, line: 22, baseType: !359)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !295, file: !6, line: 130, baseType: !366, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !358, line: 20, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{!362, !293, !119, !132}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !295, file: !6, line: 131, baseType: !371, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !358, line: 23, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DISubroutineType(types: !374)
!374 = !{!119, !293, !119, !132}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !295, file: !6, line: 133, baseType: !376, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !6, line: 16, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !6, line: 18, size: 960, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !378, file: !6, line: 19, baseType: !354, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !378, file: !6, line: 21, baseType: !47, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !378, file: !6, line: 22, baseType: !61, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !378, file: !6, line: 23, baseType: !69, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !378, file: !6, line: 24, baseType: !64, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !6, line: 26, baseType: !133, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !378, file: !6, line: 28, baseType: !133, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !378, file: !6, line: 29, baseType: !133, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !378, file: !6, line: 30, baseType: !133, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !378, file: !6, line: 38, baseType: !390, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !104, line: 32, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !293}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !378, file: !6, line: 40, baseType: !24, size: 32, offset: 352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !378, file: !6, line: 42, baseType: !198, size: 320, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !378, file: !6, line: 43, baseType: !197, size: 32, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !378, file: !6, line: 45, baseType: !69, size: 32, offset: 736)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !378, file: !6, line: 47, baseType: !69, size: 32, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !378, file: !6, line: 49, baseType: !272, size: 32, offset: 800)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !378, file: !6, line: 51, baseType: !376, size: 32, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !378, file: !6, line: 52, baseType: !293, size: 32, offset: 864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !378, file: !6, line: 54, baseType: !84, size: 32, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !378, file: !6, line: 56, baseType: !62, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !378, file: !6, line: 57, baseType: !62, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !378, file: !6, line: 58, baseType: !62, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !378, file: !6, line: 60, baseType: !62, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !378, file: !6, line: 61, baseType: !62, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !378, file: !6, line: 62, baseType: !62, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !378, file: !6, line: 63, baseType: !62, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !378, file: !6, line: 64, baseType: !62, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !378, file: !6, line: 65, baseType: !62, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !378, file: !6, line: 66, baseType: !62, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !378, file: !6, line: 67, baseType: !62, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !378, file: !6, line: 70, baseType: !62, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !378, file: !6, line: 72, baseType: !62, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !378, file: !6, line: 73, baseType: !62, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !378, file: !6, line: 74, baseType: !62, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !378, file: !6, line: 76, baseType: !62, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !378, file: !6, line: 77, baseType: !62, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !378, file: !6, line: 78, baseType: !62, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !295, file: !6, line: 135, baseType: !132, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !295, file: !6, line: 137, baseType: !197, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !295, file: !6, line: 139, baseType: !102, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !6, line: 141, baseType: !133, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !295, file: !6, line: 143, baseType: !47, size: 32, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !295, file: !6, line: 144, baseType: !61, size: 32, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !295, file: !6, line: 145, baseType: !64, size: 64, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !295, file: !6, line: 147, baseType: !64, size: 64, offset: 544)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !295, file: !6, line: 148, baseType: !430, size: 16, offset: 608)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !431, line: 12, baseType: !432)
!431 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 186, baseType: !54)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !295, file: !6, line: 154, baseType: !47, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !295, file: !6, line: 155, baseType: !61, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !295, file: !6, line: 157, baseType: !125, size: 32, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !295, file: !6, line: 159, baseType: !345, size: 64, offset: 736)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !295, file: !6, line: 161, baseType: !217, size: 32, offset: 800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !295, file: !6, line: 163, baseType: !84, size: 32, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !295, file: !6, line: 165, baseType: !62, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !295, file: !6, line: 167, baseType: !62, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !295, file: !6, line: 169, baseType: !62, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !295, file: !6, line: 170, baseType: !62, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !295, file: !6, line: 171, baseType: !62, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !295, file: !6, line: 173, baseType: !62, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !295, file: !6, line: 174, baseType: !62, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !295, file: !6, line: 175, baseType: !62, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !295, file: !6, line: 176, baseType: !62, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !295, file: !6, line: 178, baseType: !62, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !295, file: !6, line: 179, baseType: !62, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !295, file: !6, line: 180, baseType: !62, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !295, file: !6, line: 181, baseType: !62, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !295, file: !6, line: 183, baseType: !62, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !290, file: !289, line: 54, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !289, line: 16, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !457, line: 364, size: 5376, elements: !458)
!457 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!458 = !{!459, !461, !462, !463, !464, !465, !466, !471, !472, !698, !1356, !1357, !1358, !1359, !1398, !1428, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1473, !1484, !1491, !1492, !1494, !1495, !1508, !1509, !1510, !1511, !1512, !1513, !1692, !1696, !1701, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !456, file: !457, line: 365, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 191, baseType: !62)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !456, file: !457, line: 367, baseType: !293, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !456, file: !457, line: 369, baseType: !31, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !456, file: !457, line: 370, baseType: !31, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !456, file: !457, line: 371, baseType: !31, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !456, file: !457, line: 372, baseType: !31, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !456, file: !457, line: 374, baseType: !467, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !457, line: 361, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !454}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !456, file: !457, line: 375, baseType: !467, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !456, file: !457, line: 378, baseType: !473, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !289, line: 18, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !476, line: 65, size: 3008, elements: !477)
!476 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!477 = !{!478, !479, !480, !481, !485, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !656, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !475, file: !476, line: 66, baseType: !141, size: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !475, file: !476, line: 67, baseType: !93, size: 160, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !475, file: !476, line: 68, baseType: !460, size: 32, offset: 1376)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !475, file: !476, line: 69, baseType: !482, size: 128, offset: 1408)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !475, file: !476, line: 70, baseType: !482, size: 128, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !475, file: !476, line: 72, baseType: !487, size: 32, offset: 1664)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !147, line: 18, baseType: !158)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !475, file: !476, line: 73, baseType: !185, size: 32, offset: 1696)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !475, file: !476, line: 74, baseType: !185, size: 32, offset: 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !475, file: !476, line: 75, baseType: !185, size: 32, offset: 1760)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !475, file: !476, line: 76, baseType: !185, size: 32, offset: 1792)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !475, file: !476, line: 77, baseType: !185, size: 32, offset: 1824)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !475, file: !476, line: 79, baseType: !64, size: 64, offset: 1856)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !475, file: !476, line: 80, baseType: !64, size: 64, offset: 1920)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !475, file: !476, line: 81, baseType: !482, size: 128, offset: 1984)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !475, file: !476, line: 83, baseType: !69, size: 32, offset: 2112)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !475, file: !476, line: 84, baseType: !69, size: 32, offset: 2144)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !475, file: !476, line: 85, baseType: !132, size: 32, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !475, file: !476, line: 86, baseType: !132, size: 32, offset: 2208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !475, file: !476, line: 88, baseType: !84, size: 32, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !475, file: !476, line: 89, baseType: !84, size: 32, offset: 2272)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !475, file: !476, line: 90, baseType: !84, size: 32, offset: 2304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !475, file: !476, line: 91, baseType: !84, size: 32, offset: 2336)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !475, file: !476, line: 93, baseType: !125, size: 32, offset: 2368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !475, file: !476, line: 95, baseType: !506, size: 32, offset: 2400)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !289, line: 19, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !476, line: 157, size: 544, elements: !509)
!509 = !{!510, !535, !596, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !655}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !508, file: !476, line: 158, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !476, line: 154, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 145, size: 480, elements: !514)
!514 = !{!515, !526, !527, !528, !531, !532, !533, !534}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !513, file: !476, line: 146, baseType: !516, size: 96)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !275, line: 32, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !275, line: 37, size: 96, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !517, file: !275, line: 38, baseType: !339, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !517, file: !275, line: 39, baseType: !339, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !517, file: !275, line: 40, baseType: !522, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !275, line: 34, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !339, !339, !339}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !513, file: !476, line: 147, baseType: !334, size: 160, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !513, file: !476, line: 148, baseType: !345, size: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !513, file: !476, line: 149, baseType: !529, size: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !218, line: 106, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !217)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !513, file: !476, line: 150, baseType: !529, size: 32, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !513, file: !476, line: 151, baseType: !132, size: 32, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !513, file: !476, line: 152, baseType: !84, size: 32, offset: 416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !513, file: !476, line: 153, baseType: !84, size: 32, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !508, file: !476, line: 159, baseType: !536, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !538, line: 59, baseType: !539)
!538 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 34, size: 800, elements: !540)
!540 = !{!541, !548, !549, !550, !558, !559, !560, !569, !570, !571, !572, !591, !592, !593, !594, !595}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !539, file: !538, line: 35, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !543, line: 21, baseType: !544)
!543 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 16, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !544, file: !543, line: 17, baseType: !529, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !544, file: !543, line: 19, baseType: !529, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !539, file: !538, line: 37, baseType: !69, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !539, file: !538, line: 38, baseType: !69, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !539, file: !538, line: 40, baseType: !551, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !538, line: 16, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !538, line: 18, size: 96, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !553, file: !538, line: 19, baseType: !86, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !538, line: 20, baseType: !551, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !553, file: !538, line: 21, baseType: !86, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !539, file: !538, line: 41, baseType: !551, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !539, file: !538, line: 42, baseType: !552, size: 96, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !539, file: !538, line: 44, baseType: !561, size: 32, offset: 288)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !538, line: 31, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 25, size: 128, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !563, file: !538, line: 26, baseType: !84, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !563, file: !538, line: 27, baseType: !84, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !563, file: !538, line: 29, baseType: !84, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !563, file: !538, line: 30, baseType: !84, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !539, file: !538, line: 45, baseType: !84, size: 32, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !539, file: !538, line: 47, baseType: !71, size: 32, offset: 352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !539, file: !538, line: 48, baseType: !71, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !539, file: !538, line: 50, baseType: !573, size: 256, offset: 416)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !543, line: 37, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 24, size: 256, elements: !575)
!575 = !{!576, !578, !579, !580, !590}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !574, file: !543, line: 26, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !574, file: !543, line: 28, baseType: !577, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !574, file: !543, line: 29, baseType: !84, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !574, file: !543, line: 30, baseType: !581, size: 128, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !582, line: 19, baseType: !583)
!582 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 17, size: 128, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !583, file: !582, line: 18, baseType: !586, size: 128)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 128, elements: !588)
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!588 = !{!589}
!589 = !DISubrange(count: 4)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !574, file: !543, line: 36, baseType: !84, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !539, file: !538, line: 52, baseType: !71, size: 32, offset: 672)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !539, file: !538, line: 53, baseType: !72, size: 8, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !539, file: !538, line: 55, baseType: !62, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !539, file: !538, line: 57, baseType: !24, size: 32, offset: 736)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !539, file: !538, line: 58, baseType: !24, size: 32, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !508, file: !476, line: 161, baseType: !597, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !143, line: 62, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 50, size: 384, elements: !600)
!600 = !{!601, !602, !603, !605, !610, !612, !614, !615, !616}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !143, line: 51, baseType: !64, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !599, file: !143, line: 52, baseType: !69, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !599, file: !143, line: 53, baseType: !604, size: 96, offset: 96)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 96, elements: !192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !599, file: !143, line: 55, baseType: !606, size: 32, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !143, line: 45, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!272, !24}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !599, file: !143, line: 56, baseType: !611, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !143, line: 46, baseType: !607)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !599, file: !143, line: 57, baseType: !613, size: 32, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !143, line: 47, baseType: !266)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !143, line: 58, baseType: !24, size: 32, offset: 288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !599, file: !143, line: 60, baseType: !71, size: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !599, file: !143, line: 61, baseType: !84, size: 32, offset: 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !508, file: !476, line: 163, baseType: !132, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !508, file: !476, line: 164, baseType: !69, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !508, file: !476, line: 166, baseType: !185, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !508, file: !476, line: 168, baseType: !185, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !508, file: !476, line: 170, baseType: !84, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !508, file: !476, line: 171, baseType: !84, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !508, file: !476, line: 172, baseType: !272, size: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !508, file: !476, line: 173, baseType: !272, size: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !508, file: !476, line: 174, baseType: !272, size: 32, offset: 352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !508, file: !476, line: 176, baseType: !84, size: 32, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !508, file: !476, line: 177, baseType: !272, size: 32, offset: 416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !508, file: !476, line: 178, baseType: !272, size: 32, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !508, file: !476, line: 180, baseType: !630, size: 32, offset: 480)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !632, line: 25, baseType: !633)
!632 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !632, line: 29, size: 320, elements: !634)
!634 = !{!635, !636, !646, !653, !654}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !633, file: !632, line: 30, baseType: !24, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !633, file: !632, line: 31, baseType: !637, size: 192, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !638, line: 22, baseType: !639)
!638 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 16, size: 192, elements: !640)
!640 = !{!641, !642, !643, !644, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !639, file: !638, line: 17, baseType: !71, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !639, file: !638, line: 18, baseType: !69, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !638, line: 19, baseType: !64, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !639, file: !638, line: 20, baseType: !197, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !639, file: !638, line: 21, baseType: !84, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !633, file: !632, line: 32, baseType: !647, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !632, line: 27, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DISubroutineType(types: !650)
!650 = !{!651, !630, !24}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !85, line: 78, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !53, line: 140, baseType: !133)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !633, file: !632, line: 33, baseType: !24, size: 32, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !633, file: !632, line: 34, baseType: !84, size: 32, offset: 288)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !508, file: !476, line: 182, baseType: !84, size: 32, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !475, file: !476, line: 96, baseType: !657, size: 32, offset: 2432)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !476, line: 62, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 39, size: 576, elements: !660)
!660 = !{!661, !662, !663, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !659, file: !476, line: 40, baseType: !334, size: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !659, file: !476, line: 41, baseType: !345, size: 64, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !659, file: !476, line: 43, baseType: !664, size: 96, offset: 224)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 96, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 12)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !659, file: !476, line: 46, baseType: !62, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !659, file: !476, line: 47, baseType: !62, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !659, file: !476, line: 48, baseType: !62, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !659, file: !476, line: 49, baseType: !62, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !659, file: !476, line: 50, baseType: !62, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !659, file: !476, line: 51, baseType: !62, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !659, file: !476, line: 52, baseType: !62, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !659, file: !476, line: 53, baseType: !62, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !659, file: !476, line: 56, baseType: !487, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !659, file: !476, line: 57, baseType: !185, size: 32, offset: 416)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !659, file: !476, line: 58, baseType: !185, size: 32, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !659, file: !476, line: 59, baseType: !69, size: 32, offset: 480)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !659, file: !476, line: 60, baseType: !132, size: 32, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !659, file: !476, line: 61, baseType: !272, size: 32, offset: 544)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !475, file: !476, line: 102, baseType: !272, size: 32, offset: 2464)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !475, file: !476, line: 103, baseType: !272, size: 32, offset: 2496)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !475, file: !476, line: 104, baseType: !272, size: 32, offset: 2528)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !475, file: !476, line: 105, baseType: !272, size: 32, offset: 2560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !475, file: !476, line: 107, baseType: !300, size: 384, offset: 2592)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !475, file: !476, line: 109, baseType: !62, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !475, file: !476, line: 110, baseType: !62, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !475, file: !476, line: 112, baseType: !62, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !475, file: !476, line: 113, baseType: !62, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !475, file: !476, line: 114, baseType: !62, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !475, file: !476, line: 115, baseType: !62, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !475, file: !476, line: 116, baseType: !62, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !475, file: !476, line: 117, baseType: !62, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !475, file: !476, line: 118, baseType: !62, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !475, file: !476, line: 119, baseType: !62, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !475, file: !476, line: 121, baseType: !62, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !475, file: !476, line: 122, baseType: !62, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !456, file: !457, line: 381, baseType: !699, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !289, line: 17, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !37, line: 313, size: 4096, elements: !702)
!702 = !{!703, !708, !709, !741, !820, !821, !843, !852, !1091, !1092, !1093, !1123, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1305, !1306, !1310, !1311, !1312, !1313, !1314, !1318, !1322, !1326, !1327, !1339, !1340, !1341, !1342, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !701, file: !37, line: 314, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !37, line: 309, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !454, !699}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !701, file: !37, line: 315, baseType: !704, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !701, file: !37, line: 317, baseType: !710, size: 480, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !711, line: 22, baseType: !712)
!711 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !711, line: 36, size: 480, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !726, !731, !733, !734, !735, !736, !737, !738, !739, !740}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !712, file: !711, line: 37, baseType: !293, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !712, file: !711, line: 39, baseType: !47, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !712, file: !711, line: 40, baseType: !61, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !711, line: 41, baseType: !276, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !712, file: !711, line: 43, baseType: !84, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !712, file: !711, line: 44, baseType: !272, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !712, file: !711, line: 46, baseType: !721, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !711, line: 24, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{!651, !725, !24}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !712, file: !711, line: 47, baseType: !727, size: 32, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !711, line: 26, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !725, !24, !84}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !712, file: !711, line: 48, baseType: !732, size: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !711, line: 28, baseType: !728)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !712, file: !711, line: 49, baseType: !24, size: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !712, file: !711, line: 56, baseType: !41, size: 32, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !711, line: 58, baseType: !133, size: 32, offset: 352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !712, file: !711, line: 59, baseType: !133, size: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !712, file: !711, line: 61, baseType: !197, size: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !712, file: !711, line: 63, baseType: !62, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !712, file: !711, line: 64, baseType: !62, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !712, file: !711, line: 67, baseType: !62, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !701, file: !37, line: 319, baseType: !742, size: 32, offset: 544)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !744, line: 17, baseType: !745)
!744 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !744, line: 25, size: 1120, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !753, !754, !755, !756, !757, !762, !763, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !819}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !745, file: !744, line: 26, baseType: !293, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !745, file: !744, line: 27, baseType: !293, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !745, file: !744, line: 29, baseType: !119, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !745, file: !744, line: 30, baseType: !119, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !745, file: !744, line: 31, baseType: !752, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !745, file: !744, line: 33, baseType: !119, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !745, file: !744, line: 35, baseType: !119, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !745, file: !744, line: 36, baseType: !119, size: 32, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !745, file: !744, line: 37, baseType: !119, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !745, file: !744, line: 44, baseType: !758, size: 32, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !744, line: 19, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!651, !742, !125}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !745, file: !744, line: 45, baseType: !24, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !745, file: !744, line: 47, baseType: !764, size: 32, offset: 352)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !744, line: 21, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!651, !24, !119}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !745, file: !744, line: 48, baseType: !24, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !745, file: !744, line: 57, baseType: !62, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !745, file: !744, line: 58, baseType: !62, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !745, file: !744, line: 59, baseType: !62, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !745, file: !744, line: 60, baseType: !62, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !745, file: !744, line: 61, baseType: !62, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !745, file: !744, line: 62, baseType: !62, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !745, file: !744, line: 63, baseType: !62, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !745, file: !744, line: 64, baseType: !62, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !745, file: !744, line: 65, baseType: !62, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !745, file: !744, line: 66, baseType: !62, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !745, file: !744, line: 67, baseType: !62, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !745, file: !744, line: 68, baseType: !62, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !745, file: !744, line: 70, baseType: !651, size: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !745, file: !744, line: 71, baseType: !783, size: 64, offset: 480)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !122, line: 68, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 65, size: 64, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !784, file: !122, line: 66, baseType: !651, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !784, file: !122, line: 67, baseType: !69, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !745, file: !744, line: 72, baseType: !138, size: 32, offset: 544)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !745, file: !744, line: 74, baseType: !362, size: 32, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !745, file: !744, line: 76, baseType: !132, size: 32, offset: 608)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !745, file: !744, line: 77, baseType: !132, size: 32, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !745, file: !744, line: 79, baseType: !132, size: 32, offset: 672)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !745, file: !744, line: 80, baseType: !362, size: 32, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !745, file: !744, line: 82, baseType: !272, size: 32, offset: 736)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !745, file: !744, line: 83, baseType: !272, size: 32, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !745, file: !744, line: 84, baseType: !362, size: 32, offset: 800)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !745, file: !744, line: 86, baseType: !102, size: 32, offset: 832)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !745, file: !744, line: 87, baseType: !197, size: 32, offset: 864)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !745, file: !744, line: 89, baseType: !119, size: 32, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !745, file: !744, line: 90, baseType: !69, size: 32, offset: 928)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !745, file: !744, line: 91, baseType: !125, size: 32, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !745, file: !744, line: 93, baseType: !69, size: 32, offset: 992)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !745, file: !744, line: 94, baseType: !185, size: 32, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !745, file: !744, line: 96, baseType: !805, size: 32, offset: 1056)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !143, line: 84, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 71, size: 1408, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !807, file: !143, line: 72, baseType: !141, size: 1216)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !807, file: !143, line: 73, baseType: !132, size: 32, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !807, file: !143, line: 74, baseType: !597, size: 32, offset: 1248)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !807, file: !143, line: 75, baseType: !102, size: 32, offset: 1280)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !807, file: !143, line: 76, baseType: !234, size: 32, offset: 1312)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !807, file: !143, line: 78, baseType: !84, size: 32, offset: 1344)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !807, file: !143, line: 80, baseType: !62, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !807, file: !143, line: 81, baseType: !62, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !807, file: !143, line: 82, baseType: !62, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !807, file: !143, line: 83, baseType: !62, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !745, file: !744, line: 98, baseType: !133, size: 32, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !701, file: !37, line: 321, baseType: !119, size: 32, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !701, file: !37, line: 323, baseType: !822, size: 416, offset: 608)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !122, line: 71, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !122, line: 78, size: 416, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !842}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !823, file: !122, line: 79, baseType: !125, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !823, file: !122, line: 80, baseType: !119, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !823, file: !122, line: 81, baseType: !119, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !823, file: !122, line: 82, baseType: !119, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !823, file: !122, line: 84, baseType: !62, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !823, file: !122, line: 85, baseType: !62, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !823, file: !122, line: 86, baseType: !62, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !823, file: !122, line: 87, baseType: !62, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !823, file: !122, line: 88, baseType: !62, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !823, file: !122, line: 89, baseType: !62, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !823, file: !122, line: 104, baseType: !132, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !823, file: !122, line: 106, baseType: !102, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !823, file: !122, line: 107, baseType: !651, size: 32, offset: 224)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !823, file: !122, line: 108, baseType: !783, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !823, file: !122, line: 109, baseType: !138, size: 32, offset: 320)
