; ModuleID = 'src/http/ngx_http_upstream_round_robin.c'
source_filename = "src/http/ngx_http_upstream_round_robin.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_time_t = type { i32, i32, i32 }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/http/ngx_http_upstream_round_robin.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!11 = distinct !DISubprogram(name: "ngx_http_upstream_init_round_robin", scope: !1, file: !1, line: 31, type: !12, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1772)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !18, !534}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !15, line: 78, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !17)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !20, line: 16, baseType: !21)
!20 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !22, line: 116, size: 384, elements: !23)
!22 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !{!24, !27, !216, !516, !517, !518, !527, !528, !529, !530, !531, !533}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !22, line: 117, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !21, file: !22, line: 118, baseType: !28, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !30, line: 22, baseType: !31)
!30 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 16, size: 160, elements: !32)
!32 = !{!33, !34, !36, !38, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !31, file: !30, line: 17, baseType: !4, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !31, file: !30, line: 18, baseType: !35, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !15, line: 79, baseType: !5)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !31, file: !30, line: 19, baseType: !37, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !7)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !31, file: !30, line: 20, baseType: !35, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !31, file: !30, line: 21, baseType: !40, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !20, line: 18, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !43, line: 57, size: 320, elements: !44)
!43 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !{!45, !57, !58, !59, !196, !203, !215}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !42, file: !43, line: 58, baseType: !46, size: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !43, line: 54, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 49, size: 128, elements: !48)
!48 = !{!49, !54, !55, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !47, file: !43, line: 50, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !52, line: 64, baseType: !53)
!52 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !47, file: !43, line: 51, baseType: !50, size: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !43, line: 52, baseType: !40, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !47, file: !43, line: 53, baseType: !35, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !42, file: !43, line: 59, baseType: !37, size: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !42, file: !43, line: 60, baseType: !40, size: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !42, file: !43, line: 61, baseType: !60, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !20, line: 19, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !63, line: 59, size: 64, elements: !64)
!63 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = !{!65, !195}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !62, file: !63, line: 60, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !63, line: 18, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !63, line: 20, size: 352, elements: !69)
!69 = !{!70, !71, !72, !74, !75, !76, !77, !79, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !68, file: !63, line: 21, baseType: !50, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !68, file: !63, line: 22, baseType: !50, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !68, file: !63, line: 23, baseType: !73, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !17)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !68, file: !63, line: 24, baseType: !73, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !68, file: !63, line: 26, baseType: !50, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !68, file: !63, line: 27, baseType: !50, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !68, file: !63, line: 28, baseType: !78, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !63, line: 16, baseType: !4)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !68, file: !63, line: 29, baseType: !80, size: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !20, line: 23, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !83, line: 16, size: 1216, elements: !84)
!83 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = !{!85, !88, !95, !140, !141, !142, !180, !181}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !82, file: !83, line: 17, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !87, line: 16, baseType: !17)
!87 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 18, baseType: !89, size: 64, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !90, line: 19, baseType: !91)
!90 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 16, size: 64, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, file: !90, line: 17, baseType: !37, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !90, line: 18, baseType: !50, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !82, file: !83, line: 19, baseType: !96, size: 960, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !87, line: 17, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !98, line: 4, size: 960, elements: !99)
!98 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = !{!100, !102, !103, !105, !106, !108, !109, !111, !113, !115, !116, !117, !118, !119, !120, !123, !124, !126, !127, !133, !134, !135}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !97, file: !98, line: 6, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !7)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !97, file: !98, line: 7, baseType: !101, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !97, file: !98, line: 8, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !97, file: !98, line: 9, baseType: !104, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !97, file: !98, line: 10, baseType: !107, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !7)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !97, file: !98, line: 11, baseType: !107, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !97, file: !98, line: 13, baseType: !110, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !7)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !97, file: !98, line: 14, baseType: !112, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !7)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !97, file: !98, line: 15, baseType: !114, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !97, file: !98, line: 16, baseType: !7, size: 32, offset: 288)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !97, file: !98, line: 17, baseType: !101, size: 32, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !97, file: !98, line: 18, baseType: !101, size: 32, offset: 352)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !97, file: !98, line: 19, baseType: !73, size: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !97, file: !98, line: 20, baseType: !73, size: 32, offset: 416)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !97, file: !98, line: 21, baseType: !121, size: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !122)
!122 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !97, file: !98, line: 22, baseType: !121, size: 32, offset: 480)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !97, file: !98, line: 23, baseType: !125, size: 32, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !17)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !97, file: !98, line: 24, baseType: !125, size: 32, offset: 544)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !97, file: !98, line: 26, baseType: !128, size: 64, offset: 576)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !129)
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !128, file: !6, line: 288, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !122)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !128, file: !6, line: 288, baseType: !122, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !97, file: !98, line: 27, baseType: !128, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !97, file: !98, line: 28, baseType: !128, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !97, file: !98, line: 29, baseType: !136, size: 192, offset: 768)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, elements: !138)
!137 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !82, file: !83, line: 21, baseType: !73, size: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !82, file: !83, line: 22, baseType: !73, size: 32, offset: 1120)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !82, file: !83, line: 24, baseType: !143, size: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !20, line: 20, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !146, line: 50, size: 320, elements: !147)
!146 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!147 = !{!148, !149, !161, !165, !166, !171, !172, !177, !178, !179}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !145, file: !146, line: 51, baseType: !35, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !145, file: !146, line: 52, baseType: !150, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !20, line: 21, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !22, line: 89, size: 160, elements: !153)
!153 = !{!154, !155, !156, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !152, file: !22, line: 90, baseType: !86, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !22, line: 91, baseType: !89, size: 64, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !152, file: !22, line: 93, baseType: !157, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !150, !143}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !22, line: 94, baseType: !4, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !145, file: !146, line: 54, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !163, line: 98, baseType: !164)
!163 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!164 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !145, file: !146, line: 56, baseType: !131, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !145, file: !146, line: 58, baseType: !167, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !146, line: 45, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!50, !143, !50, !37}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !146, line: 59, baseType: !4, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !145, file: !146, line: 61, baseType: !173, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !146, line: 46, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !143, !35, !50, !37}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !145, file: !146, line: 62, baseType: !4, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !145, file: !146, line: 70, baseType: !25, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !146, line: 72, baseType: !143, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !82, file: !83, line: 37, baseType: !7, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !82, file: !83, line: 38, baseType: !7, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !68, file: !63, line: 30, baseType: !66, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !68, file: !63, line: 34, baseType: !7, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !68, file: !63, line: 40, baseType: !7, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !68, file: !63, line: 43, baseType: !7, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !68, file: !63, line: 45, baseType: !7, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !68, file: !63, line: 46, baseType: !7, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !68, file: !63, line: 47, baseType: !7, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !68, file: !63, line: 48, baseType: !7, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !68, file: !63, line: 49, baseType: !7, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !68, file: !63, line: 50, baseType: !7, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !68, file: !63, line: 52, baseType: !7, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !68, file: !63, line: 53, baseType: !7, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !68, file: !63, line: 55, baseType: !17, size: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !63, line: 61, baseType: !60, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !42, file: !43, line: 62, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !43, line: 41, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !43, line: 43, size: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !43, line: 44, baseType: !197, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !199, file: !43, line: 45, baseType: !4, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !42, file: !43, line: 63, baseType: !204, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !43, line: 32, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !43, line: 34, size: 96, elements: !207)
!207 = !{!208, !213, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !206, file: !43, line: 35, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !43, line: 30, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !43, line: 36, baseType: !4, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !43, line: 37, baseType: !204, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !42, file: !43, line: 64, baseType: !143, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !21, file: !22, line: 120, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !20, line: 17, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !220, line: 38, size: 2496, elements: !221)
!220 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!221 = !{!222, !226, !227, !228, !229, !230, !409, !410, !411, !467, !468, !469, !470, !471, !472, !473, !474, !485, !486, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !219, file: !220, line: 39, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !219, file: !220, line: 40, baseType: !40, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !219, file: !220, line: 42, baseType: !143, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !219, file: !220, line: 43, baseType: !144, size: 320, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !219, file: !220, line: 45, baseType: !35, size: 32, offset: 416)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !219, file: !220, line: 47, baseType: !231, size: 32, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !20, line: 26, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !235, line: 121, size: 896, elements: !236)
!235 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!236 = !{!237, !238, !294, !295, !298, !305, !307, !312, !317, !377, !378, !379, !380, !381, !382, !383, !384, !385, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !235, line: 122, baseType: !4, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !234, file: !235, line: 123, baseType: !239, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !20, line: 24, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !242, line: 30, size: 384, elements: !243)
!242 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !271, !272, !273, !286}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !242, line: 31, baseType: !4, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !241, file: !242, line: 33, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !241, file: !242, line: 35, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !241, file: !242, line: 38, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !241, file: !242, line: 44, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !241, file: !242, line: 46, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !241, file: !242, line: 49, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !241, file: !242, line: 51, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !241, file: !242, line: 54, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !241, file: !242, line: 56, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !241, file: !242, line: 57, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !241, file: !242, line: 59, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !241, file: !242, line: 60, baseType: !7, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !241, file: !242, line: 62, baseType: !7, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !241, file: !242, line: 64, baseType: !7, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !241, file: !242, line: 67, baseType: !7, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !241, file: !242, line: 69, baseType: !7, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !241, file: !242, line: 71, baseType: !7, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !241, file: !242, line: 74, baseType: !7, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !241, file: !242, line: 75, baseType: !7, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !241, file: !242, line: 77, baseType: !7, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !241, file: !242, line: 107, baseType: !7, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !241, file: !242, line: 110, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !20, line: 31, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !239}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !241, file: !242, line: 117, baseType: !35, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 119, baseType: !143, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !241, file: !242, line: 121, baseType: !274, size: 160, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !275, line: 20, baseType: !276)
!275 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !275, line: 22, size: 160, elements: !277)
!277 = !{!278, !280, !282, !283, !284, !285}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !276, file: !275, line: 23, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !275, line: 16, baseType: !35)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !276, file: !275, line: 24, baseType: !281, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !276, file: !275, line: 25, baseType: !281, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !276, file: !275, line: 26, baseType: !281, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !276, file: !275, line: 27, baseType: !51, size: 8, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !275, line: 28, baseType: !51, size: 8, offset: 136)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !241, file: !242, line: 124, baseType: !287, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !288, line: 16, baseType: !289)
!288 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !288, line: 18, size: 64, elements: !290)
!290 = !{!291, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !289, file: !288, line: 19, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !288, line: 20, baseType: !292, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !234, file: !235, line: 124, baseType: !239, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !234, file: !235, line: 126, baseType: !296, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !297, line: 17, baseType: !17)
!297 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !234, file: !235, line: 128, baseType: !299, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !300, line: 19, baseType: !301)
!300 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !232, !50, !37}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !6, line: 135, baseType: !17)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !234, file: !235, line: 129, baseType: !306, size: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !300, line: 22, baseType: !301)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !234, file: !235, line: 130, baseType: !308, size: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !300, line: 20, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!304, !232, !60, !73}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !234, file: !235, line: 131, baseType: !313, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !300, line: 23, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(types: !316)
!316 = !{!60, !232, !60, !73}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !234, file: !235, line: 133, baseType: !318, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !235, line: 16, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !235, line: 18, size: 960, elements: !321)
!321 = !{!322, !323, !335, !337, !338, !339, !340, !341, !342, !343, !348, !349, !350, !351, !352, !353, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !320, file: !235, line: 19, baseType: !296, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !320, file: !235, line: 21, baseType: !324, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !326, line: 297, size: 128, elements: !327)
!326 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!327 = !{!328, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !325, file: !326, line: 298, baseType: !329, size: 16)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !6, line: 409, baseType: !330)
!330 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !325, file: !326, line: 299, baseType: !332, size: 112, offset: 16)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 112, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 14)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !320, file: !235, line: 22, baseType: !336, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !6, line: 404, baseType: !7)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !320, file: !235, line: 23, baseType: !37, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !320, file: !235, line: 24, baseType: !89, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !235, line: 26, baseType: !17, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !320, file: !235, line: 28, baseType: !17, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !320, file: !235, line: 29, baseType: !17, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !320, file: !235, line: 30, baseType: !17, size: 32, offset: 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !320, file: !235, line: 38, baseType: !344, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !20, line: 32, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !232}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !320, file: !235, line: 40, baseType: !4, size: 32, offset: 352)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !320, file: !235, line: 42, baseType: !144, size: 320, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !320, file: !235, line: 43, baseType: !143, size: 32, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !320, file: !235, line: 45, baseType: !37, size: 32, offset: 736)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !320, file: !235, line: 47, baseType: !37, size: 32, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !320, file: !235, line: 49, baseType: !354, size: 32, offset: 800)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !355, line: 16, baseType: !279)
!355 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !320, file: !235, line: 51, baseType: !318, size: 32, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !320, file: !235, line: 52, baseType: !232, size: 32, offset: 864)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !320, file: !235, line: 54, baseType: !35, size: 32, offset: 896)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !320, file: !235, line: 56, baseType: !7, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !320, file: !235, line: 57, baseType: !7, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !320, file: !235, line: 58, baseType: !7, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !320, file: !235, line: 60, baseType: !7, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !320, file: !235, line: 61, baseType: !7, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !320, file: !235, line: 62, baseType: !7, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !320, file: !235, line: 63, baseType: !7, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !320, file: !235, line: 64, baseType: !7, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !320, file: !235, line: 65, baseType: !7, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !320, file: !235, line: 66, baseType: !7, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !320, file: !235, line: 67, baseType: !7, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !320, file: !235, line: 70, baseType: !7, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !320, file: !235, line: 72, baseType: !7, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !320, file: !235, line: 73, baseType: !7, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !320, file: !235, line: 74, baseType: !7, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !320, file: !235, line: 76, baseType: !7, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !320, file: !235, line: 77, baseType: !7, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !320, file: !235, line: 78, baseType: !7, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !234, file: !235, line: 135, baseType: !73, size: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !234, file: !235, line: 137, baseType: !143, size: 32, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !234, file: !235, line: 139, baseType: !40, size: 32, offset: 352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !235, line: 141, baseType: !17, size: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !234, file: !235, line: 143, baseType: !324, size: 32, offset: 416)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !234, file: !235, line: 144, baseType: !336, size: 32, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !234, file: !235, line: 145, baseType: !89, size: 64, offset: 480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !234, file: !235, line: 147, baseType: !89, size: 64, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !234, file: !235, line: 148, baseType: !386, size: 16, offset: 608)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !387, line: 12, baseType: !388)
!387 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 186, baseType: !330)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !234, file: !235, line: 154, baseType: !324, size: 32, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !234, file: !235, line: 155, baseType: !336, size: 32, offset: 672)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !234, file: !235, line: 157, baseType: !66, size: 32, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !234, file: !235, line: 159, baseType: !287, size: 64, offset: 736)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !234, file: !235, line: 161, baseType: !162, size: 32, offset: 800)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !234, file: !235, line: 163, baseType: !35, size: 32, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !234, file: !235, line: 165, baseType: !7, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !234, file: !235, line: 167, baseType: !7, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !234, file: !235, line: 169, baseType: !7, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !234, file: !235, line: 170, baseType: !7, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !234, file: !235, line: 171, baseType: !7, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !234, file: !235, line: 173, baseType: !7, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !234, file: !235, line: 174, baseType: !7, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !234, file: !235, line: 175, baseType: !7, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !234, file: !235, line: 176, baseType: !7, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !234, file: !235, line: 178, baseType: !7, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !234, file: !235, line: 179, baseType: !7, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !234, file: !235, line: 180, baseType: !7, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !234, file: !235, line: 181, baseType: !7, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !234, file: !235, line: 183, baseType: !7, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !219, file: !220, line: 48, baseType: !232, size: 32, offset: 480)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !219, file: !220, line: 49, baseType: !35, size: 32, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !219, file: !220, line: 51, baseType: !412, size: 32, offset: 544)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !20, line: 15, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !416, line: 222, size: 800, elements: !417)
!416 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!417 = !{!418, !419, !420, !421, !422, !423, !424, !427, !428, !442, !443, !447, !451, !452, !453, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !415, file: !416, line: 223, baseType: !35, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !415, file: !416, line: 224, baseType: !35, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !416, line: 226, baseType: !25, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !415, file: !416, line: 228, baseType: !35, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !415, file: !416, line: 229, baseType: !35, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !415, file: !416, line: 231, baseType: !35, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !415, file: !416, line: 232, baseType: !425, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !415, file: !416, line: 234, baseType: !4, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !415, file: !416, line: 235, baseType: !429, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !20, line: 22, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !22, line: 77, size: 224, elements: !432)
!432 = !{!433, !434, !435, !439, !440, !441}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !22, line: 78, baseType: !89, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !22, line: 79, baseType: !35, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !431, file: !22, line: 80, baseType: !436, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DISubroutineType(types: !438)
!438 = !{!25, !18, !429, !4}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !431, file: !22, line: 81, baseType: !35, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !431, file: !22, line: 82, baseType: !35, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !431, file: !22, line: 83, baseType: !4, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !416, line: 236, baseType: !35, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !415, file: !416, line: 238, baseType: !444, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{!14, !143}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !415, file: !416, line: 240, baseType: !448, size: 32, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{!14, !217}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !415, file: !416, line: 242, baseType: !448, size: 32, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !415, file: !416, line: 243, baseType: !448, size: 32, offset: 416)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !415, file: !416, line: 244, baseType: !454, size: 32, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !217}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !415, file: !416, line: 245, baseType: !454, size: 32, offset: 480)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !415, file: !416, line: 247, baseType: !454, size: 32, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !415, file: !416, line: 249, baseType: !5, size: 32, offset: 544)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !415, file: !416, line: 250, baseType: !5, size: 32, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !415, file: !416, line: 251, baseType: !5, size: 32, offset: 608)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !415, file: !416, line: 252, baseType: !5, size: 32, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !415, file: !416, line: 253, baseType: !5, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !415, file: !416, line: 254, baseType: !5, size: 32, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !415, file: !416, line: 255, baseType: !5, size: 32, offset: 736)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !415, file: !416, line: 256, baseType: !5, size: 32, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !219, file: !220, line: 52, baseType: !35, size: 32, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !219, file: !220, line: 53, baseType: !35, size: 32, offset: 608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !219, file: !220, line: 55, baseType: !287, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !219, file: !220, line: 56, baseType: !35, size: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !219, file: !220, line: 58, baseType: !29, size: 160, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !219, file: !220, line: 59, baseType: !29, size: 160, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !219, file: !220, line: 61, baseType: !29, size: 160, offset: 1056)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !219, file: !220, line: 62, baseType: !475, size: 96, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !275, line: 32, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !275, line: 37, size: 96, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !476, file: !275, line: 38, baseType: !281, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !476, file: !275, line: 39, baseType: !281, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !476, file: !275, line: 40, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !275, line: 34, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !281, !281, !281}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !219, file: !220, line: 63, baseType: !274, size: 160, offset: 1312)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !219, file: !220, line: 65, baseType: !487, size: 224, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !488, line: 31, baseType: !489)
!488 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 25, size: 224, elements: !490)
!490 = !{!491, !499, !500, !501, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !489, file: !488, line: 26, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !488, line: 16, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !488, line: 18, size: 96, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !494, file: !488, line: 19, baseType: !4, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !494, file: !488, line: 20, baseType: !35, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !488, line: 21, baseType: !492, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !489, file: !488, line: 27, baseType: !493, size: 96, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !489, file: !488, line: 28, baseType: !37, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !489, file: !488, line: 29, baseType: !35, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !489, file: !488, line: 30, baseType: !40, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !219, file: !220, line: 66, baseType: !487, size: 224, offset: 1696)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !219, file: !220, line: 68, baseType: !35, size: 32, offset: 1920)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !219, file: !220, line: 69, baseType: !35, size: 32, offset: 1952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !219, file: !220, line: 71, baseType: !232, size: 32, offset: 1984)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !219, file: !220, line: 72, baseType: !239, size: 32, offset: 2016)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !219, file: !220, line: 73, baseType: !239, size: 32, offset: 2048)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !219, file: !220, line: 75, baseType: !217, size: 32, offset: 2080)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !219, file: !220, line: 77, baseType: !89, size: 64, offset: 2112)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !219, file: !220, line: 78, baseType: !89, size: 64, offset: 2176)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !219, file: !220, line: 79, baseType: !89, size: 64, offset: 2240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !219, file: !220, line: 80, baseType: !89, size: 64, offset: 2304)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !219, file: !220, line: 81, baseType: !89, size: 64, offset: 2368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !219, file: !220, line: 82, baseType: !89, size: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !21, file: !22, line: 121, baseType: !40, size: 32, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !21, file: !22, line: 122, baseType: !40, size: 32, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !21, file: !22, line: 123, baseType: !519, size: 32, offset: 160)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !22, line: 103, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 98, size: 1344, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !521, file: !22, line: 99, baseType: !81, size: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !521, file: !22, line: 100, baseType: !66, size: 32, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !521, file: !22, line: 101, baseType: !66, size: 32, offset: 1248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !521, file: !22, line: 102, baseType: !35, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !21, file: !22, line: 124, baseType: !143, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !21, file: !22, line: 126, baseType: !4, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !21, file: !22, line: 127, baseType: !35, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !21, file: !22, line: 128, baseType: !35, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !21, file: !22, line: 130, baseType: !532, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !22, line: 112, baseType: !436)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !21, file: !22, line: 131, baseType: !25, size: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !536, line: 77, baseType: !537)
!536 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !536, line: 119, size: 416, elements: !538)
!538 = !{!539, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !537, file: !536, line: 120, baseType: !540, size: 96)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !536, line: 89, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 85, size: 96, elements: !542)
!542 = !{!543, !546, !1762}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !541, file: !536, line: 86, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !536, line: 79, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !541, file: !536, line: 87, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !536, line: 81, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DISubroutineType(types: !550)
!550 = !{!14, !551, !534}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !553, line: 16, baseType: !554)
!553 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !555, line: 364, size: 5376, elements: !556)
!555 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!556 = !{!557, !559, !560, !561, !562, !563, !564, !569, !570, !783, !1314, !1315, !1316, !1317, !1356, !1386, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1431, !1442, !1449, !1450, !1452, !1453, !1466, !1467, !1468, !1469, !1470, !1471, !1658, !1662, !1667, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !554, file: !555, line: 365, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 191, baseType: !7)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !554, file: !555, line: 367, baseType: !232, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !554, file: !555, line: 369, baseType: !225, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !554, file: !555, line: 370, baseType: !225, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !554, file: !555, line: 371, baseType: !225, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !554, file: !555, line: 372, baseType: !225, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !554, file: !555, line: 374, baseType: !565, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !555, line: 361, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !551}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !554, file: !555, line: 375, baseType: !565, size: 32, offset: 224)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !554, file: !555, line: 378, baseType: !571, size: 32, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !553, line: 18, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !574, line: 65, size: 3008, elements: !575)
!574 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!575 = !{!576, !577, !578, !579, !583, !584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !741, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !573, file: !574, line: 66, baseType: !81, size: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !573, file: !574, line: 67, baseType: !29, size: 160, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !573, file: !574, line: 68, baseType: !558, size: 32, offset: 1376)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !573, file: !574, line: 69, baseType: !580, size: 128, offset: 1408)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !573, file: !574, line: 70, baseType: !580, size: 128, offset: 1536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !573, file: !574, line: 72, baseType: !585, size: 32, offset: 1664)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !87, line: 18, baseType: !104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !573, file: !574, line: 73, baseType: !131, size: 32, offset: 1696)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !573, file: !574, line: 74, baseType: !131, size: 32, offset: 1728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !573, file: !574, line: 75, baseType: !131, size: 32, offset: 1760)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !573, file: !574, line: 76, baseType: !131, size: 32, offset: 1792)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !573, file: !574, line: 77, baseType: !131, size: 32, offset: 1824)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !573, file: !574, line: 79, baseType: !89, size: 64, offset: 1856)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !573, file: !574, line: 80, baseType: !89, size: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !573, file: !574, line: 81, baseType: !580, size: 128, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !573, file: !574, line: 83, baseType: !37, size: 32, offset: 2112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !573, file: !574, line: 84, baseType: !37, size: 32, offset: 2144)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !573, file: !574, line: 85, baseType: !73, size: 32, offset: 2176)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !573, file: !574, line: 86, baseType: !73, size: 32, offset: 2208)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !573, file: !574, line: 88, baseType: !35, size: 32, offset: 2240)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !573, file: !574, line: 89, baseType: !35, size: 32, offset: 2272)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !573, file: !574, line: 90, baseType: !35, size: 32, offset: 2304)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !573, file: !574, line: 91, baseType: !35, size: 32, offset: 2336)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !573, file: !574, line: 93, baseType: !66, size: 32, offset: 2368)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !573, file: !574, line: 95, baseType: !604, size: 32, offset: 2400)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !553, line: 19, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !574, line: 157, size: 544, elements: !607)
!607 = !{!608, !623, !684, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !740}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !606, file: !574, line: 158, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !574, line: 154, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 145, size: 480, elements: !612)
!612 = !{!613, !614, !615, !616, !619, !620, !621, !622}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !611, file: !574, line: 146, baseType: !475, size: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !611, file: !574, line: 147, baseType: !274, size: 160, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !611, file: !574, line: 148, baseType: !287, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !611, file: !574, line: 149, baseType: !617, size: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !163, line: 106, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !611, file: !574, line: 150, baseType: !617, size: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !611, file: !574, line: 151, baseType: !73, size: 32, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !611, file: !574, line: 152, baseType: !35, size: 32, offset: 416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !611, file: !574, line: 153, baseType: !35, size: 32, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !606, file: !574, line: 159, baseType: !624, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !626, line: 59, baseType: !627)
!626 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 34, size: 800, elements: !628)
!628 = !{!629, !636, !637, !638, !646, !647, !648, !657, !658, !659, !660, !679, !680, !681, !682, !683}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !627, file: !626, line: 35, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !631, line: 21, baseType: !632)
!631 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 16, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !632, file: !631, line: 17, baseType: !617, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !632, file: !631, line: 19, baseType: !617, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !627, file: !626, line: 37, baseType: !37, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !627, file: !626, line: 38, baseType: !37, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !627, file: !626, line: 40, baseType: !639, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !626, line: 16, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !626, line: 18, size: 96, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !641, file: !626, line: 19, baseType: !5, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !626, line: 20, baseType: !639, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !641, file: !626, line: 21, baseType: !5, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !627, file: !626, line: 41, baseType: !639, size: 32, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !627, file: !626, line: 42, baseType: !640, size: 96, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !627, file: !626, line: 44, baseType: !649, size: 32, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !626, line: 31, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 25, size: 128, elements: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !651, file: !626, line: 26, baseType: !35, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !651, file: !626, line: 27, baseType: !35, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !651, file: !626, line: 29, baseType: !35, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !651, file: !626, line: 30, baseType: !35, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !627, file: !626, line: 45, baseType: !35, size: 32, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !627, file: !626, line: 47, baseType: !50, size: 32, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !627, file: !626, line: 48, baseType: !50, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !627, file: !626, line: 50, baseType: !661, size: 256, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !631, line: 37, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 24, size: 256, elements: !663)
!663 = !{!664, !666, !667, !668, !678}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !662, file: !631, line: 26, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !662, file: !631, line: 28, baseType: !665, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !662, file: !631, line: 29, baseType: !35, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !662, file: !631, line: 30, baseType: !669, size: 128, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !670, line: 19, baseType: !671)
!670 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 17, size: 128, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !671, file: !670, line: 18, baseType: !674, size: 128)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 128, elements: !676)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !662, file: !631, line: 36, baseType: !35, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !627, file: !626, line: 52, baseType: !50, size: 32, offset: 672)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !627, file: !626, line: 53, baseType: !51, size: 8, offset: 704)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !627, file: !626, line: 55, baseType: !7, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !627, file: !626, line: 57, baseType: !4, size: 32, offset: 736)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !627, file: !626, line: 58, baseType: !4, size: 32, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !606, file: !574, line: 161, baseType: !685, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !83, line: 62, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 50, size: 384, elements: !688)
!688 = !{!689, !690, !691, !693, !698, !700, !702, !703, !704}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !687, file: !83, line: 51, baseType: !89, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !687, file: !83, line: 52, baseType: !37, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !687, file: !83, line: 53, baseType: !692, size: 96, offset: 96)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !138)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !687, file: !83, line: 55, baseType: !694, size: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !83, line: 45, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DISubroutineType(types: !697)
!697 = !{!354, !4}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !687, file: !83, line: 56, baseType: !699, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !83, line: 46, baseType: !695)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !687, file: !83, line: 57, baseType: !701, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !83, line: 47, baseType: !210)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !687, file: !83, line: 58, baseType: !4, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !687, file: !83, line: 60, baseType: !50, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !687, file: !83, line: 61, baseType: !35, size: 32, offset: 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !606, file: !574, line: 163, baseType: !73, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !606, file: !574, line: 164, baseType: !37, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !606, file: !574, line: 166, baseType: !131, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !606, file: !574, line: 168, baseType: !131, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !606, file: !574, line: 170, baseType: !35, size: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !606, file: !574, line: 171, baseType: !35, size: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !606, file: !574, line: 172, baseType: !354, size: 32, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !606, file: !574, line: 173, baseType: !354, size: 32, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !606, file: !574, line: 174, baseType: !354, size: 32, offset: 352)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !606, file: !574, line: 176, baseType: !35, size: 32, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !606, file: !574, line: 177, baseType: !354, size: 32, offset: 416)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !606, file: !574, line: 178, baseType: !354, size: 32, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !606, file: !574, line: 180, baseType: !718, size: 32, offset: 480)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !220, line: 25, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !220, line: 29, size: 320, elements: !721)
!721 = !{!722, !723, !733, !738, !739}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !720, file: !220, line: 30, baseType: !4, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !720, file: !220, line: 31, baseType: !724, size: 192, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !725, line: 22, baseType: !726)
!725 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 16, size: 192, elements: !727)
!727 = !{!728, !729, !730, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !726, file: !725, line: 17, baseType: !50, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !726, file: !725, line: 18, baseType: !37, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !725, line: 19, baseType: !89, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !726, file: !725, line: 20, baseType: !143, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !726, file: !725, line: 21, baseType: !35, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !720, file: !220, line: 32, baseType: !734, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !220, line: 27, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!14, !718, !4}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !720, file: !220, line: 33, baseType: !4, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !720, file: !220, line: 34, baseType: !35, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !606, file: !574, line: 182, baseType: !35, size: 32, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !573, file: !574, line: 96, baseType: !742, size: 32, offset: 2432)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !574, line: 62, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 39, size: 576, elements: !745)
!745 = !{!746, !747, !748, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !574, line: 40, baseType: !274, size: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !744, file: !574, line: 41, baseType: !287, size: 64, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !744, file: !574, line: 43, baseType: !749, size: 96, offset: 224)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 12)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !744, file: !574, line: 46, baseType: !7, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !744, file: !574, line: 47, baseType: !7, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !744, file: !574, line: 48, baseType: !7, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !744, file: !574, line: 49, baseType: !7, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !744, file: !574, line: 50, baseType: !7, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !744, file: !574, line: 51, baseType: !7, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !744, file: !574, line: 52, baseType: !7, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !744, file: !574, line: 53, baseType: !7, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !744, file: !574, line: 56, baseType: !585, size: 32, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !744, file: !574, line: 57, baseType: !131, size: 32, offset: 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !744, file: !574, line: 58, baseType: !131, size: 32, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !744, file: !574, line: 59, baseType: !37, size: 32, offset: 480)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !744, file: !574, line: 60, baseType: !73, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !744, file: !574, line: 61, baseType: !354, size: 32, offset: 544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !573, file: !574, line: 102, baseType: !354, size: 32, offset: 2464)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !573, file: !574, line: 103, baseType: !354, size: 32, offset: 2496)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !573, file: !574, line: 104, baseType: !354, size: 32, offset: 2528)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !573, file: !574, line: 105, baseType: !354, size: 32, offset: 2560)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !573, file: !574, line: 107, baseType: !240, size: 384, offset: 2592)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !573, file: !574, line: 109, baseType: !7, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !573, file: !574, line: 110, baseType: !7, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !573, file: !574, line: 112, baseType: !7, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !573, file: !574, line: 113, baseType: !7, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !573, file: !574, line: 114, baseType: !7, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !573, file: !574, line: 115, baseType: !7, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !573, file: !574, line: 116, baseType: !7, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !573, file: !574, line: 117, baseType: !7, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !573, file: !574, line: 118, baseType: !7, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !573, file: !574, line: 119, baseType: !7, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !573, file: !574, line: 121, baseType: !7, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !573, file: !574, line: 122, baseType: !7, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !554, file: !555, line: 381, baseType: !784, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !553, line: 17, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !536, line: 313, size: 4096, elements: !787)
!787 = !{!788, !793, !794, !835, !914, !915, !937, !946, !1041, !1042, !1043, !1081, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1259, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1276, !1280, !1284, !1285, !1297, !1298, !1299, !1300, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !786, file: !536, line: 314, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !536, line: 309, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !551, !784}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !786, file: !536, line: 315, baseType: !789, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !786, file: !536, line: 317, baseType: !795, size: 480, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !796, line: 22, baseType: !797)
!796 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !796, line: 36, size: 480, elements: !798)
!798 = !{!799, !800, !801, !802, !804, !805, !806, !812, !817, !819, !820, !829, !830, !831, !832, !833, !834}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !797, file: !796, line: 37, baseType: !232, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !797, file: !796, line: 39, baseType: !324, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !797, file: !796, line: 40, baseType: !336, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !796, line: 41, baseType: !803, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !797, file: !796, line: 43, baseType: !35, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !797, file: !796, line: 44, baseType: !354, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !797, file: !796, line: 46, baseType: !807, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !796, line: 24, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!14, !811, !4}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !797, file: !796, line: 47, baseType: !813, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !796, line: 26, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !811, !4, !35}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !797, file: !796, line: 48, baseType: !818, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !796, line: 28, baseType: !814)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !796, line: 49, baseType: !4, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !797, file: !796, line: 56, baseType: !821, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !823, line: 78, baseType: !824)
!823 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 74, size: 128, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !824, file: !823, line: 75, baseType: !324, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !824, file: !823, line: 76, baseType: !336, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !823, line: 77, baseType: !89, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !796, line: 58, baseType: !17, size: 32, offset: 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !797, file: !796, line: 59, baseType: !17, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !797, file: !796, line: 61, baseType: !143, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !797, file: !796, line: 63, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !797, file: !796, line: 64, baseType: !7, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !797, file: !796, line: 67, baseType: !7, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !786, file: !536, line: 319, baseType: !836, size: 32, offset: 544)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !838, line: 17, baseType: !839)
!838 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !838, line: 25, size: 1120, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !847, !848, !849, !850, !851, !856, !857, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !913}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !839, file: !838, line: 26, baseType: !232, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !839, file: !838, line: 27, baseType: !232, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !839, file: !838, line: 29, baseType: !60, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !839, file: !838, line: 30, baseType: !60, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !839, file: !838, line: 31, baseType: !846, size: 32, offset: 128)
