; ModuleID = 'src/event/modules/ngx_select_module.c'
source_filename = "src/event/modules/ngx_select_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_event_module_t = type { %struct.ngx_str_t*, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)*, %struct.ngx_event_actions_t }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_select_module_ctx", scope: !2, file: !3, line: 38, type: !558, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !17)
!3 = !DIFile(filename: "src/event/modules/ngx_select_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !16}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !8, line: 16, baseType: !9)
!8 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !10, line: 16, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 125, baseType: !15)
!14 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!17 = !{!18, !0, !533, !535, !545, !547, !549, !552, !554, !556}
!18 = !DIGlobalVariableExpression(var: !19)
!19 = distinct !DIGlobalVariable(name: "ngx_select_module", scope: !2, file: !3, line: 58, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !21, line: 15, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !23, line: 222, size: 800, elements: !24)
!23 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !{!25, !26, !27, !30, !31, !32, !33, !36, !37, !506, !507, !513, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !22, file: !23, line: 223, baseType: !11, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !22, file: !23, line: 224, baseType: !11, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !22, file: !23, line: 226, baseType: !28, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !22, file: !23, line: 228, baseType: !11, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !22, file: !23, line: 229, baseType: !11, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !23, line: 231, baseType: !11, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !22, file: !23, line: 232, baseType: !34, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !22, file: !23, line: 234, baseType: !6, size: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !22, file: !23, line: 235, baseType: !38, size: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !21, line: 22, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !41, line: 77, size: 224, elements: !42)
!41 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !{!43, !55, !56, !503, !504, !505}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 78, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !45, line: 19, baseType: !46)
!45 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 16, size: 64, elements: !47)
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !45, line: 17, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 120, baseType: !15)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !45, line: 18, baseType: !51, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !53, line: 64, baseType: !54)
!53 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !41, line: 79, baseType: !11, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !40, file: !41, line: 80, baseType: !57, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DISubroutineType(types: !59)
!59 = !{!28, !60, !38, !6}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !21, line: 16, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !41, line: 116, size: 384, elements: !63)
!63 = !{!64, !65, !242, !485, !486, !487, !496, !497, !498, !499, !500, !502}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !41, line: 117, baseType: !28, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !62, file: !41, line: 118, baseType: !66, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !68, line: 22, baseType: !69)
!68 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 16, size: 160, elements: !70)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !69, file: !68, line: 17, baseType: !6, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !69, file: !68, line: 18, baseType: !11, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !69, file: !68, line: 19, baseType: !49, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !69, file: !68, line: 20, baseType: !11, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !69, file: !68, line: 21, baseType: !76, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !21, line: 18, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !79, line: 57, size: 320, elements: !80)
!79 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = !{!81, !89, !90, !91, !222, !229, !241}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !78, file: !79, line: 58, baseType: !82, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !79, line: 54, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 49, size: 128, elements: !84)
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !83, file: !79, line: 50, baseType: !51, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !83, file: !79, line: 51, baseType: !51, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !79, line: 52, baseType: !76, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !83, file: !79, line: 53, baseType: !11, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !78, file: !79, line: 59, baseType: !49, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !78, file: !79, line: 60, baseType: !76, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !78, file: !79, line: 61, baseType: !92, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !21, line: 19, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !95, line: 59, size: 64, elements: !96)
!95 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = !{!97, !221}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !94, file: !95, line: 60, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !95, line: 18, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !95, line: 20, size: 352, elements: !101)
!101 = !{!102, !103, !104, !107, !108, !109, !110, !112, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !100, file: !95, line: 21, baseType: !51, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !100, file: !95, line: 22, baseType: !51, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !100, file: !95, line: 23, baseType: !105, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !14, line: 222, baseType: !106)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !100, file: !95, line: 24, baseType: !105, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !100, file: !95, line: 26, baseType: !51, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !100, file: !95, line: 27, baseType: !51, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !100, file: !95, line: 28, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !95, line: 16, baseType: !6)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !100, file: !95, line: 29, baseType: !113, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !21, line: 23, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !116, line: 16, size: 1216, elements: !117)
!116 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = !{!118, !121, !122, !166, !167, !168, !206, !207}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !115, file: !116, line: 17, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !120, line: 16, baseType: !106)
!120 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !116, line: 18, baseType: !44, size: 64, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !115, file: !116, line: 19, baseType: !123, size: 960, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !120, line: 17, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !125, line: 4, size: 960, elements: !126)
!125 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!126 = !{!127, !129, !130, !132, !133, !135, !136, !138, !140, !142, !143, !144, !145, !146, !147, !149, !150, !152, !153, !159, !160, !161}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !124, file: !125, line: 6, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !14, line: 232, baseType: !15)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !124, file: !125, line: 7, baseType: !128, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !124, file: !125, line: 8, baseType: !131, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !14, line: 227, baseType: !15)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !124, file: !125, line: 9, baseType: !131, size: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !124, file: !125, line: 10, baseType: !134, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !14, line: 217, baseType: !15)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !124, file: !125, line: 11, baseType: !134, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !124, file: !125, line: 13, baseType: !137, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !14, line: 212, baseType: !15)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !124, file: !125, line: 14, baseType: !139, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !14, line: 304, baseType: !15)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !124, file: !125, line: 15, baseType: !141, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !14, line: 309, baseType: !15)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !124, file: !125, line: 16, baseType: !15, size: 32, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !124, file: !125, line: 17, baseType: !128, size: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !124, file: !125, line: 18, baseType: !128, size: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !124, file: !125, line: 19, baseType: !105, size: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !124, file: !125, line: 20, baseType: !105, size: 32, offset: 416)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !124, file: !125, line: 21, baseType: !148, size: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !14, line: 237, baseType: !16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !124, file: !125, line: 22, baseType: !148, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !124, file: !125, line: 23, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !14, line: 242, baseType: !106)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !124, file: !125, line: 24, baseType: !151, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !124, file: !125, line: 26, baseType: !154, size: 64, offset: 576)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !14, line: 288, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !154, file: !14, line: 288, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !14, line: 75, baseType: !16)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !154, file: !14, line: 288, baseType: !16, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !124, file: !125, line: 27, baseType: !154, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !124, file: !125, line: 28, baseType: !154, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !124, file: !125, line: 29, baseType: !162, size: 192, offset: 768)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !164)
!163 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !115, file: !116, line: 21, baseType: !105, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !115, file: !116, line: 22, baseType: !105, size: 32, offset: 1120)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !115, file: !116, line: 24, baseType: !169, size: 32, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !21, line: 20, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !172, line: 50, size: 320, elements: !173)
!172 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !187, !191, !192, !197, !198, !203, !204, !205}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !171, file: !172, line: 51, baseType: !11, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !171, file: !172, line: 52, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !21, line: 21, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !41, line: 89, size: 160, elements: !179)
!179 = !{!180, !181, !182, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !178, file: !41, line: 90, baseType: !119, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !41, line: 91, baseType: !44, size: 64, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !178, file: !41, line: 93, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !176, !169}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !41, line: 94, baseType: !6, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !171, file: !172, line: 54, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !189, line: 98, baseType: !190)
!189 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !171, file: !172, line: 56, baseType: !157, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 58, baseType: !193, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !172, line: 45, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{!51, !169, !51, !49}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 59, baseType: !6, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !171, file: !172, line: 61, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !172, line: 46, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !169, !11, !51, !49}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !171, file: !172, line: 62, baseType: !6, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !171, file: !172, line: 70, baseType: !28, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 72, baseType: !169, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !115, file: !116, line: 37, baseType: !15, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !115, file: !116, line: 38, baseType: !15, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !100, file: !95, line: 30, baseType: !98, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !100, file: !95, line: 34, baseType: !15, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !100, file: !95, line: 40, baseType: !15, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !100, file: !95, line: 43, baseType: !15, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !100, file: !95, line: 45, baseType: !15, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !100, file: !95, line: 46, baseType: !15, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !100, file: !95, line: 47, baseType: !15, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !100, file: !95, line: 48, baseType: !15, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !100, file: !95, line: 49, baseType: !15, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !100, file: !95, line: 50, baseType: !15, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !100, file: !95, line: 52, baseType: !15, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !100, file: !95, line: 53, baseType: !15, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !100, file: !95, line: 55, baseType: !106, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !95, line: 61, baseType: !92, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !78, file: !79, line: 62, baseType: !223, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !79, line: 41, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !79, line: 43, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !79, line: 44, baseType: !223, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !225, file: !79, line: 45, baseType: !6, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !78, file: !79, line: 63, baseType: !230, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !79, line: 32, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !79, line: 34, size: 96, elements: !233)
!233 = !{!234, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !232, file: !79, line: 35, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !79, line: 30, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !6}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !79, line: 36, baseType: !6, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !79, line: 37, baseType: !230, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !78, file: !79, line: 64, baseType: !169, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !62, file: !41, line: 120, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !21, line: 17, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !246, line: 38, size: 2496, elements: !247)
!246 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!247 = !{!248, !252, !253, !254, !255, !256, !431, !432, !433, !436, !437, !438, !439, !440, !441, !442, !443, !454, !455, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !245, file: !246, line: 39, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !245, file: !246, line: 40, baseType: !76, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !245, file: !246, line: 42, baseType: !169, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !245, file: !246, line: 43, baseType: !170, size: 320, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !245, file: !246, line: 45, baseType: !11, size: 32, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !245, file: !246, line: 47, baseType: !257, size: 32, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !21, line: 26, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !261, line: 121, size: 896, elements: !262)
!261 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!262 = !{!263, !264, !318, !319, !322, !329, !331, !336, !341, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !261, line: 122, baseType: !6, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !260, file: !261, line: 123, baseType: !265, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !21, line: 24, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !268, line: 30, size: 384, elements: !269)
!268 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !297, !298, !299, !310}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !268, line: 31, baseType: !6, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !267, file: !268, line: 33, baseType: !15, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !267, file: !268, line: 35, baseType: !15, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !267, file: !268, line: 38, baseType: !15, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !267, file: !268, line: 44, baseType: !15, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !267, file: !268, line: 46, baseType: !15, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !267, file: !268, line: 49, baseType: !15, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !267, file: !268, line: 51, baseType: !15, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !267, file: !268, line: 54, baseType: !15, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !267, file: !268, line: 56, baseType: !15, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !267, file: !268, line: 57, baseType: !15, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !267, file: !268, line: 59, baseType: !15, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !267, file: !268, line: 60, baseType: !15, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !267, file: !268, line: 62, baseType: !15, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !267, file: !268, line: 64, baseType: !15, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !267, file: !268, line: 67, baseType: !15, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !267, file: !268, line: 69, baseType: !15, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !267, file: !268, line: 71, baseType: !15, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !267, file: !268, line: 74, baseType: !15, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !267, file: !268, line: 75, baseType: !15, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !267, file: !268, line: 77, baseType: !15, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !267, file: !268, line: 107, baseType: !15, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !267, file: !268, line: 110, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !21, line: 31, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !265}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !267, file: !268, line: 117, baseType: !11, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !267, file: !268, line: 119, baseType: !169, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !267, file: !268, line: 121, baseType: !300, size: 160, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !10, line: 20, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !10, line: 22, size: 160, elements: !302)
!302 = !{!303, !304, !306, !307, !308, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !301, file: !10, line: 23, baseType: !9, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !301, file: !10, line: 24, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !301, file: !10, line: 25, baseType: !305, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !301, file: !10, line: 26, baseType: !305, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !301, file: !10, line: 27, baseType: !52, size: 8, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !10, line: 28, baseType: !52, size: 8, offset: 136)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !267, file: !268, line: 124, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !312, line: 16, baseType: !313)
!312 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !312, line: 18, size: 64, elements: !314)
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !312, line: 19, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !312, line: 20, baseType: !316, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !260, file: !261, line: 124, baseType: !265, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !260, file: !261, line: 126, baseType: !320, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !321, line: 17, baseType: !106)
!321 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !260, file: !261, line: 128, baseType: !323, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !324, line: 19, baseType: !325)
!324 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !258, !51, !49}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 135, baseType: !106)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !260, file: !261, line: 129, baseType: !330, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !324, line: 22, baseType: !325)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !260, file: !261, line: 130, baseType: !332, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !324, line: 20, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{!328, !258, !92, !105}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !260, file: !261, line: 131, baseType: !337, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !324, line: 23, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DISubroutineType(types: !340)
!340 = !{!92, !258, !92, !105}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !260, file: !261, line: 133, baseType: !342, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !261, line: 16, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !261, line: 18, size: 960, elements: !345)
!345 = !{!346, !347, !359, !361, !362, !363, !364, !365, !366, !367, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !344, file: !261, line: 19, baseType: !320, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !344, file: !261, line: 21, baseType: !348, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !350, line: 297, size: 128, elements: !351)
!350 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!351 = !{!352, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !349, file: !350, line: 298, baseType: !353, size: 16)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !14, line: 409, baseType: !354)
!354 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !349, file: !350, line: 299, baseType: !356, size: 112, offset: 16)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 112, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 14)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !344, file: !261, line: 22, baseType: !360, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !14, line: 404, baseType: !15)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !344, file: !261, line: 23, baseType: !49, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !344, file: !261, line: 24, baseType: !44, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !261, line: 26, baseType: !106, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !344, file: !261, line: 28, baseType: !106, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !344, file: !261, line: 29, baseType: !106, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !344, file: !261, line: 30, baseType: !106, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !344, file: !261, line: 38, baseType: !368, size: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !21, line: 32, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !258}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !344, file: !261, line: 40, baseType: !6, size: 32, offset: 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !344, file: !261, line: 42, baseType: !170, size: 320, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !344, file: !261, line: 43, baseType: !169, size: 32, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !344, file: !261, line: 45, baseType: !49, size: 32, offset: 736)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !344, file: !261, line: 47, baseType: !49, size: 32, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !344, file: !261, line: 49, baseType: !7, size: 32, offset: 800)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !344, file: !261, line: 51, baseType: !342, size: 32, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !344, file: !261, line: 52, baseType: !258, size: 32, offset: 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !344, file: !261, line: 54, baseType: !11, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !344, file: !261, line: 56, baseType: !15, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !344, file: !261, line: 57, baseType: !15, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !344, file: !261, line: 58, baseType: !15, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !344, file: !261, line: 60, baseType: !15, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !344, file: !261, line: 61, baseType: !15, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !344, file: !261, line: 62, baseType: !15, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !344, file: !261, line: 63, baseType: !15, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !344, file: !261, line: 64, baseType: !15, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !344, file: !261, line: 65, baseType: !15, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !344, file: !261, line: 66, baseType: !15, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !344, file: !261, line: 67, baseType: !15, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !344, file: !261, line: 70, baseType: !15, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !344, file: !261, line: 72, baseType: !15, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !344, file: !261, line: 73, baseType: !15, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !344, file: !261, line: 74, baseType: !15, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !344, file: !261, line: 76, baseType: !15, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !344, file: !261, line: 77, baseType: !15, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !344, file: !261, line: 78, baseType: !15, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !260, file: !261, line: 135, baseType: !105, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !260, file: !261, line: 137, baseType: !169, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !260, file: !261, line: 139, baseType: !76, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !261, line: 141, baseType: !106, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !260, file: !261, line: 143, baseType: !348, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !260, file: !261, line: 144, baseType: !360, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !260, file: !261, line: 145, baseType: !44, size: 64, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !260, file: !261, line: 147, baseType: !44, size: 64, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !260, file: !261, line: 148, baseType: !408, size: 16, offset: 608)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !409, line: 12, baseType: !410)
!409 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !14, line: 186, baseType: !354)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !260, file: !261, line: 154, baseType: !348, size: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !260, file: !261, line: 155, baseType: !360, size: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !260, file: !261, line: 157, baseType: !98, size: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !260, file: !261, line: 159, baseType: !311, size: 64, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !260, file: !261, line: 161, baseType: !188, size: 32, offset: 800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !260, file: !261, line: 163, baseType: !11, size: 32, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !260, file: !261, line: 165, baseType: !15, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !260, file: !261, line: 167, baseType: !15, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !260, file: !261, line: 169, baseType: !15, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !260, file: !261, line: 170, baseType: !15, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !260, file: !261, line: 171, baseType: !15, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !260, file: !261, line: 173, baseType: !15, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !260, file: !261, line: 174, baseType: !15, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !260, file: !261, line: 175, baseType: !15, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !260, file: !261, line: 176, baseType: !15, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !260, file: !261, line: 178, baseType: !15, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !260, file: !261, line: 179, baseType: !15, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !260, file: !261, line: 180, baseType: !15, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !260, file: !261, line: 181, baseType: !15, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !260, file: !261, line: 183, baseType: !15, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !245, file: !246, line: 48, baseType: !258, size: 32, offset: 480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !245, file: !246, line: 49, baseType: !11, size: 32, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !245, file: !246, line: 51, baseType: !434, size: 32, offset: 544)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !245, file: !246, line: 52, baseType: !11, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !245, file: !246, line: 53, baseType: !11, size: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !245, file: !246, line: 55, baseType: !311, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !245, file: !246, line: 56, baseType: !11, size: 32, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !245, file: !246, line: 58, baseType: !67, size: 160, offset: 736)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !245, file: !246, line: 59, baseType: !67, size: 160, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !245, file: !246, line: 61, baseType: !67, size: 160, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !245, file: !246, line: 62, baseType: !444, size: 96, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !10, line: 32, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !10, line: 37, size: 96, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !445, file: !10, line: 38, baseType: !305, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !445, file: !10, line: 39, baseType: !305, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !445, file: !10, line: 40, baseType: !450, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !10, line: 34, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !305, !305, !305}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !245, file: !246, line: 63, baseType: !300, size: 160, offset: 1312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !245, file: !246, line: 65, baseType: !456, size: 224, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 25, size: 224, elements: !459)
!459 = !{!460, !468, !469, !470, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !458, file: !457, line: 26, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !457, line: 16, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !457, line: 18, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !463, file: !457, line: 19, baseType: !6, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !463, file: !457, line: 20, baseType: !11, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !457, line: 21, baseType: !461, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !458, file: !457, line: 27, baseType: !462, size: 96, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !457, line: 28, baseType: !49, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !458, file: !457, line: 29, baseType: !11, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !458, file: !457, line: 30, baseType: !76, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !245, file: !246, line: 66, baseType: !456, size: 224, offset: 1696)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !245, file: !246, line: 68, baseType: !11, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !245, file: !246, line: 69, baseType: !11, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !245, file: !246, line: 71, baseType: !258, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !245, file: !246, line: 72, baseType: !265, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !245, file: !246, line: 73, baseType: !265, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !245, file: !246, line: 75, baseType: !243, size: 32, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !245, file: !246, line: 77, baseType: !44, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !245, file: !246, line: 78, baseType: !44, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !245, file: !246, line: 79, baseType: !44, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !245, file: !246, line: 80, baseType: !44, size: 64, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !245, file: !246, line: 81, baseType: !44, size: 64, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !245, file: !246, line: 82, baseType: !44, size: 64, offset: 2432)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !62, file: !41, line: 121, baseType: !76, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !62, file: !41, line: 122, baseType: !76, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !62, file: !41, line: 123, baseType: !488, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !41, line: 103, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 98, size: 1344, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !490, file: !41, line: 99, baseType: !114, size: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !490, file: !41, line: 100, baseType: !98, size: 32, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !490, file: !41, line: 101, baseType: !98, size: 32, offset: 1248)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !490, file: !41, line: 102, baseType: !11, size: 32, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !62, file: !41, line: 124, baseType: !169, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !62, file: !41, line: 126, baseType: !6, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !62, file: !41, line: 127, baseType: !11, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !62, file: !41, line: 128, baseType: !11, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !62, file: !41, line: 130, baseType: !501, size: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !41, line: 112, baseType: !57)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !62, file: !41, line: 131, baseType: !28, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !40, file: !41, line: 81, baseType: !11, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !40, file: !41, line: 82, baseType: !11, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !40, file: !41, line: 83, baseType: !6, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !23, line: 236, baseType: !11, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !22, file: !23, line: 238, baseType: !508, size: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !169}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !14, line: 140, baseType: !106)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !22, file: !23, line: 240, baseType: !514, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!511, !243}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !22, file: !23, line: 242, baseType: !514, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !22, file: !23, line: 243, baseType: !514, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !22, file: !23, line: 244, baseType: !520, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !243}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !22, file: !23, line: 245, baseType: !520, size: 32, offset: 480)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !22, file: !23, line: 247, baseType: !520, size: 32, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !22, file: !23, line: 249, baseType: !13, size: 32, offset: 544)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !22, file: !23, line: 250, baseType: !13, size: 32, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !22, file: !23, line: 251, baseType: !13, size: 32, offset: 608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !22, file: !23, line: 252, baseType: !13, size: 32, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !22, file: !23, line: 253, baseType: !13, size: 32, offset: 672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !22, file: !23, line: 254, baseType: !13, size: 32, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !22, file: !23, line: 255, baseType: !13, size: 32, offset: 736)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !22, file: !23, line: 256, baseType: !13, size: 32, offset: 768)
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "select_name", scope: !2, file: !3, line: 36, type: !44, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536)
!536 = distinct !DIGlobalVariable(name: "master_read_fd_set", scope: !2, file: !3, line: 25, type: !537, isLocal: true, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !538, line: 24, baseType: !539)
!538 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/select.h", directory: "/home/sam/Projects/nginx-1.12.2")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 22, size: 1024, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !539, file: !538, line: 23, baseType: !542, size: 1024)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 1024, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 32)
!545 = !DIGlobalVariableExpression(var: !546)
!546 = distinct !DIGlobalVariable(name: "master_write_fd_set", scope: !2, file: !3, line: 26, type: !537, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548)
!548 = distinct !DIGlobalVariable(name: "max_fd", scope: !2, file: !3, line: 30, type: !511, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550)
!550 = distinct !DIGlobalVariable(name: "event_index", scope: !2, file: !3, line: 33, type: !551, isLocal: true, isDefinition: true)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!552 = !DIGlobalVariableExpression(var: !553)
!553 = distinct !DIGlobalVariable(name: "nevents", scope: !2, file: !3, line: 31, type: !11, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555)
!555 = distinct !DIGlobalVariable(name: "work_read_fd_set", scope: !2, file: !3, line: 27, type: !537, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557)
!557 = distinct !DIGlobalVariable(name: "work_write_fd_set", scope: !2, file: !3, line: 28, type: !537, isLocal: true, isDefinition: true)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_module_t", file: !268, line: 464, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 457, size: 416, elements: !560)
!560 = !{!561, !563, !567, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !559, file: !268, line: 458, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !559, file: !268, line: 460, baseType: !564, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{!6, !243}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !559, file: !268, line: 461, baseType: !568, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{!28, !243, !6}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !559, file: !268, line: 463, baseType: !572, size: 320, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_actions_t", file: !268, line: 194, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 177, size: 320, elements: !574)
!574 = !{!575, !579, !580, !581, !582, !586, !590, !594, !598, !602}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !573, file: !268, line: 178, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DISubroutineType(types: !578)
!578 = !{!511, !265, !511, !11}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !573, file: !268, line: 179, baseType: !576, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !573, file: !268, line: 181, baseType: !576, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !573, file: !268, line: 182, baseType: !576, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "add_conn", scope: !573, file: !268, line: 184, baseType: !583, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DISubroutineType(types: !585)
!585 = !{!511, !258}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "del_conn", scope: !573, file: !268, line: 185, baseType: !587, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DISubroutineType(types: !589)
!589 = !{!511, !258, !11}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !573, file: !268, line: 187, baseType: !591, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{!511, !293}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "process_events", scope: !573, file: !268, line: 189, baseType: !595, size: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{!511, !243, !7, !11}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !573, file: !268, line: 192, baseType: !599, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{!511, !243, !7}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !573, file: !268, line: 193, baseType: !520, size: 32, offset: 288)
!603 = !{i32 2, !"Dwarf Version", i32 4}
!604 = !{i32 2, !"Debug Info Version", i32 3}
!605 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!606 = distinct !DISubprogram(name: "ngx_select_init_conf", scope: !3, file: !3, line: 403, type: !569, isLocal: true, isDefinition: true, scopeLine: 404, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !607)
!607 = !{!608, !609, !610}
!608 = !DILocalVariable(name: "cycle", arg: 1, scope: !606, file: !3, line: 403, type: !243)
!609 = !DILocalVariable(name: "conf", arg: 2, scope: !606, file: !3, line: 403, type: !6)
!610 = !DILocalVariable(name: "ecf", scope: !606, file: !3, line: 405, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_conf_t", file: !268, line: 454, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 440, size: 192, elements: !614)
!614 = !{!615, !616, !617, !619, !620, !621}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !613, file: !268, line: 441, baseType: !11, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !613, file: !268, line: 442, baseType: !11, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "multi_accept", scope: !613, file: !268, line: 444, baseType: !618, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !12, line: 80, baseType: !512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex", scope: !613, file: !268, line: 445, baseType: !618, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex_delay", scope: !613, file: !268, line: 447, baseType: !7, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !268, line: 449, baseType: !51, size: 32, offset: 160)
!622 = !{!623, !623, i64 0}
!623 = !{!"any pointer", !624, i64 0}
!624 = !{!"omnipotent char", !625, i64 0}
!625 = !{!"Simple C/C++ TBAA"}
!626 = !DIExpression()
!627 = !DILocation(line: 403, column: 35, scope: !606)
!628 = !DILocation(line: 403, column: 48, scope: !606)
!629 = !DILocation(line: 405, column: 5, scope: !606)
!630 = !DILocation(line: 405, column: 24, scope: !606)
!631 = !DILocation(line: 407, column: 11, scope: !606)
!632 = !{!633, !623, i64 0}
!633 = !{!"ngx_cycle_s", !623, i64 0, !623, i64 4, !623, i64 8, !634, i64 12, !635, i64 52, !623, i64 56, !623, i64 60, !635, i64 64, !623, i64 68, !635, i64 72, !635, i64 76, !637, i64 80, !635, i64 88, !638, i64 92, !638, i64 112, !638, i64 132, !639, i64 152, !640, i64 164, !641, i64 184, !641, i64 212, !635, i64 240, !635, i64 244, !623, i64 248, !623, i64 252, !623, i64 256, !623, i64 260, !643, i64 264, !643, i64 272, !643, i64 280, !643, i64 288, !643, i64 296, !643, i64 304}
!634 = !{!"ngx_log_s", !635, i64 0, !623, i64 4, !636, i64 8, !636, i64 12, !623, i64 16, !623, i64 20, !623, i64 24, !623, i64 28, !623, i64 32, !623, i64 36}
!635 = !{!"int", !624, i64 0}
!636 = !{!"long", !624, i64 0}
!637 = !{!"ngx_queue_s", !623, i64 0, !623, i64 4}
!638 = !{!"", !623, i64 0, !635, i64 4, !635, i64 8, !635, i64 12, !623, i64 16}
!639 = !{!"ngx_rbtree_s", !623, i64 0, !623, i64 4, !623, i64 8}
!640 = !{!"ngx_rbtree_node_s", !635, i64 0, !623, i64 4, !623, i64 8, !623, i64 12, !624, i64 16, !624, i64 17}
!641 = !{!"", !623, i64 0, !642, i64 4, !635, i64 16, !635, i64 20, !623, i64 24}
!642 = !{!"ngx_list_part_s", !623, i64 0, !635, i64 4, !623, i64 8}
!643 = !{!"", !635, i64 0, !623, i64 4}
!644 = !{!645, !635, i64 4}
!645 = !{!"ngx_module_s", !635, i64 0, !635, i64 4, !623, i64 8, !635, i64 12, !635, i64 16, !635, i64 20, !623, i64 24, !623, i64 28, !623, i64 32, !635, i64 36, !623, i64 40, !623, i64 44, !623, i64 48, !623, i64 52, !623, i64 56, !623, i64 60, !623, i64 64, !635, i64 68, !635, i64 72, !635, i64 76, !635, i64 80, !635, i64 84, !635, i64 88, !635, i64 92, !635, i64 96}
!646 = !{!645, !635, i64 0}
!647 = !DILocation(line: 407, column: 9, scope: !606)
!648 = !DILocation(line: 409, column: 9, scope: !649)
!649 = distinct !DILexicalBlock(scope: !606, file: !3, line: 409, column: 9)
!650 = !DILocation(line: 409, column: 14, scope: !649)
!651 = !{!652, !635, i64 4}
!652 = !{!"", !635, i64 0, !635, i64 4, !635, i64 8, !635, i64 12, !635, i64 16, !623, i64 20}
!653 = !DILocation(line: 409, column: 39, scope: !649)
!654 = !DILocation(line: 409, column: 18, scope: !649)
!655 = !DILocation(line: 409, column: 9, scope: !606)
!656 = !DILocation(line: 410, column: 9, scope: !657)
!657 = distinct !DILexicalBlock(scope: !649, file: !3, line: 409, column: 50)
!658 = !DILocation(line: 415, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !606, file: !3, line: 415, column: 9)
!660 = !DILocation(line: 415, column: 16, scope: !659)
!661 = !{!633, !635, i64 240}
!662 = !DILocation(line: 415, column: 29, scope: !659)
!663 = !DILocation(line: 415, column: 9, scope: !606)
!664 = !DILocation(line: 416, column: 9, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 416, column: 9)
!666 = distinct !DILexicalBlock(scope: !659, file: !3, line: 415, column: 43)
!667 = !{!633, !623, i64 8}
!668 = !{!634, !635, i64 0}
!669 = !DILocation(line: 416, column: 9, scope: !666)
!670 = !DILocation(line: 419, column: 9, scope: !666)
!671 = !DILocation(line: 422, column: 5, scope: !606)
!672 = !DILocation(line: 423, column: 1, scope: !606)
!673 = distinct !DISubprogram(name: "ngx_select_add_event", scope: !3, file: !3, line: 125, type: !577, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(name: "ev", arg: 1, scope: !673, file: !3, line: 125, type: !265)
!676 = !DILocalVariable(name: "event", arg: 2, scope: !673, file: !3, line: 125, type: !511)
!677 = !DILocalVariable(name: "flags", arg: 3, scope: !673, file: !3, line: 125, type: !11)
!678 = !DILocalVariable(name: "c", scope: !673, file: !3, line: 127, type: !258)
!679 = !DILocation(line: 125, column: 35, scope: !673)
!680 = !{!635, !635, i64 0}
!681 = !DILocation(line: 125, column: 49, scope: !673)
!682 = !DILocation(line: 125, column: 67, scope: !673)
!683 = !DILocation(line: 127, column: 5, scope: !673)
!684 = !DILocation(line: 127, column: 24, scope: !673)
!685 = !DILocation(line: 129, column: 9, scope: !673)
!686 = !DILocation(line: 129, column: 13, scope: !673)
!687 = !{!688, !623, i64 0}
!688 = !{!"ngx_event_s", !623, i64 0, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 4, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 5, !635, i64 6, !635, i64 6, !635, i64 6, !635, i64 6, !635, i64 6, !623, i64 8, !635, i64 12, !623, i64 16, !640, i64 20, !637, i64 40}
!689 = !DILocation(line: 129, column: 7, scope: !673)
!690 = !DILocation(line: 134, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !673, file: !3, line: 134, column: 9)
!692 = !DILocation(line: 134, column: 13, scope: !691)
!693 = !{!688, !635, i64 12}
!694 = !DILocation(line: 134, column: 19, scope: !691)
!695 = !DILocation(line: 134, column: 9, scope: !673)
!696 = !DILocation(line: 135, column: 9, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !3, line: 135, column: 9)
!698 = distinct !DILexicalBlock(scope: !691, file: !3, line: 134, column: 41)
!699 = !{!688, !623, i64 16}
!700 = !DILocation(line: 135, column: 9, scope: !698)
!701 = !{!702, !635, i64 12}
!702 = !{!"ngx_connection_s", !623, i64 0, !623, i64 4, !623, i64 8, !635, i64 12, !623, i64 16, !623, i64 20, !623, i64 24, !623, i64 28, !623, i64 32, !635, i64 36, !623, i64 40, !623, i64 44, !635, i64 48, !623, i64 52, !635, i64 56, !643, i64 60, !643, i64 68, !703, i64 76, !623, i64 80, !635, i64 84, !623, i64 88, !637, i64 92, !636, i64 100, !635, i64 104, !635, i64 108, !635, i64 109, !635, i64 109, !635, i64 109, !635, i64 109, !635, i64 109, !635, i64 109, !635, i64 110, !635, i64 110, !635, i64 110, !635, i64 110, !635, i64 110, !635, i64 110, !635, i64 111}
!703 = !{!"short", !624, i64 0}
!704 = !DILocation(line: 137, column: 9, scope: !698)
!705 = !DILocation(line: 140, column: 10, scope: !706)
!706 = distinct !DILexicalBlock(scope: !673, file: !3, line: 140, column: 9)
!707 = !DILocation(line: 140, column: 16, scope: !706)
!708 = !DILocation(line: 140, column: 34, scope: !706)
!709 = !DILocation(line: 140, column: 37, scope: !706)
!710 = !DILocation(line: 140, column: 41, scope: !706)
!711 = !DILocation(line: 141, column: 9, scope: !706)
!712 = !DILocation(line: 141, column: 13, scope: !706)
!713 = !DILocation(line: 141, column: 19, scope: !706)
!714 = !DILocation(line: 141, column: 38, scope: !706)
!715 = !DILocation(line: 141, column: 42, scope: !706)
!716 = !DILocation(line: 141, column: 46, scope: !706)
!717 = !DILocation(line: 140, column: 9, scope: !673)
!718 = !DILocation(line: 143, column: 9, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 143, column: 9)
!720 = distinct !DILexicalBlock(scope: !706, file: !3, line: 142, column: 5)
!721 = !DILocation(line: 143, column: 9, scope: !720)
!722 = !DILocation(line: 146, column: 9, scope: !720)
!723 = !DILocation(line: 149, column: 9, scope: !724)
!724 = distinct !DILexicalBlock(scope: !673, file: !3, line: 149, column: 9)
!725 = !DILocation(line: 149, column: 15, scope: !724)
!726 = !DILocation(line: 149, column: 9, scope: !673)
!727 = !DILocation(line: 150, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !3, line: 149, column: 34)
!729 = !{!636, !636, i64 0}
!730 = !DILocation(line: 152, column: 5, scope: !728)
!731 = !DILocation(line: 152, column: 16, scope: !732)
!732 = distinct !DILexicalBlock(scope: !724, file: !3, line: 152, column: 16)
!733 = !DILocation(line: 152, column: 22, scope: !732)
!734 = !DILocation(line: 152, column: 16, scope: !724)
!735 = !DILocation(line: 153, column: 9, scope: !736)
!736 = distinct !DILexicalBlock(scope: !732, file: !3, line: 152, column: 42)
!737 = !DILocation(line: 154, column: 5, scope: !736)
!738 = !DILocation(line: 156, column: 9, scope: !739)
!739 = distinct !DILexicalBlock(scope: !673, file: !3, line: 156, column: 9)
!740 = !DILocation(line: 156, column: 16, scope: !739)
!741 = !DILocation(line: 156, column: 22, scope: !739)
!742 = !DILocation(line: 156, column: 25, scope: !739)
!743 = !DILocation(line: 156, column: 34, scope: !739)
!744 = !DILocation(line: 156, column: 37, scope: !739)
!745 = !DILocation(line: 156, column: 32, scope: !739)
!746 = !DILocation(line: 156, column: 9, scope: !673)
!747 = !DILocation(line: 157, column: 18, scope: !748)
!748 = distinct !DILexicalBlock(scope: !739, file: !3, line: 156, column: 41)
!749 = !DILocation(line: 157, column: 21, scope: !748)
!750 = !DILocation(line: 157, column: 16, scope: !748)
!751 = !DILocation(line: 158, column: 5, scope: !748)
!752 = !DILocation(line: 160, column: 5, scope: !673)
!753 = !DILocation(line: 160, column: 9, scope: !673)
!754 = !DILocation(line: 160, column: 16, scope: !673)
!755 = !DILocation(line: 162, column: 28, scope: !673)
!756 = !DILocation(line: 162, column: 5, scope: !673)
!757 = !DILocation(line: 162, column: 17, scope: !673)
!758 = !DILocation(line: 162, column: 26, scope: !673)
!759 = !DILocation(line: 163, column: 17, scope: !673)
!760 = !DILocation(line: 163, column: 5, scope: !673)
!761 = !DILocation(line: 163, column: 9, scope: !673)
!762 = !DILocation(line: 163, column: 15, scope: !673)
!763 = !DILocation(line: 164, column: 12, scope: !673)
!764 = !DILocation(line: 166, column: 5, scope: !673)
!765 = !DILocation(line: 167, column: 1, scope: !673)
!766 = distinct !DISubprogram(name: "ngx_select_del_event", scope: !3, file: !3, line: 171, type: !577, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !767)
!767 = !{!768, !769, !770, !771, !772}
!768 = !DILocalVariable(name: "ev", arg: 1, scope: !766, file: !3, line: 171, type: !265)
!769 = !DILocalVariable(name: "event", arg: 2, scope: !766, file: !3, line: 171, type: !511)
!770 = !DILocalVariable(name: "flags", arg: 3, scope: !766, file: !3, line: 171, type: !11)
!771 = !DILocalVariable(name: "e", scope: !766, file: !3, line: 173, type: !265)
!772 = !DILocalVariable(name: "c", scope: !766, file: !3, line: 174, type: !258)
!773 = !DILocation(line: 171, column: 35, scope: !766)
!774 = !DILocation(line: 171, column: 49, scope: !766)
!775 = !DILocation(line: 171, column: 67, scope: !766)
!776 = !DILocation(line: 173, column: 5, scope: !766)
!777 = !DILocation(line: 173, column: 24, scope: !766)
!778 = !DILocation(line: 174, column: 5, scope: !766)
!779 = !DILocation(line: 174, column: 24, scope: !766)
!780 = !DILocation(line: 176, column: 9, scope: !766)
!781 = !DILocation(line: 176, column: 13, scope: !766)
!782 = !DILocation(line: 176, column: 7, scope: !766)
!783 = !DILocation(line: 178, column: 5, scope: !766)
!784 = !DILocation(line: 178, column: 9, scope: !766)
!785 = !DILocation(line: 178, column: 16, scope: !766)
!786 = !DILocation(line: 180, column: 9, scope: !787)
!787 = distinct !DILexicalBlock(scope: !766, file: !3, line: 180, column: 9)
!788 = !DILocation(line: 180, column: 13, scope: !787)
!789 = !DILocation(line: 180, column: 19, scope: !787)
!790 = !DILocation(line: 180, column: 9, scope: !766)
!791 = !DILocation(line: 181, column: 9, scope: !792)
!792 = distinct !DILexicalBlock(scope: !787, file: !3, line: 180, column: 41)
!793 = !DILocation(line: 187, column: 9, scope: !794)
!794 = distinct !DILexicalBlock(scope: !766, file: !3, line: 187, column: 9)
!795 = !DILocation(line: 187, column: 15, scope: !794)
!796 = !DILocation(line: 187, column: 9, scope: !766)
!797 = !DILocation(line: 188, column: 9, scope: !798)
!798 = distinct !DILexicalBlock(scope: !794, file: !3, line: 187, column: 34)
!799 = !DILocation(line: 190, column: 5, scope: !798)
!800 = !DILocation(line: 190, column: 16, scope: !801)
!801 = distinct !DILexicalBlock(scope: !794, file: !3, line: 190, column: 16)
!802 = !DILocation(line: 190, column: 22, scope: !801)
!803 = !DILocation(line: 190, column: 16, scope: !794)
!804 = !DILocation(line: 191, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !801, file: !3, line: 190, column: 42)
!806 = !DILocation(line: 192, column: 5, scope: !805)
!807 = !DILocation(line: 194, column: 9, scope: !808)
!808 = distinct !DILexicalBlock(scope: !766, file: !3, line: 194, column: 9)
!809 = !DILocation(line: 194, column: 19, scope: !808)
!810 = !DILocation(line: 194, column: 22, scope: !808)
!811 = !DILocation(line: 194, column: 16, scope: !808)
!812 = !DILocation(line: 194, column: 9, scope: !766)
!813 = !DILocation(line: 195, column: 16, scope: !814)
!814 = distinct !DILexicalBlock(scope: !808, file: !3, line: 194, column: 26)
!815 = !DILocation(line: 196, column: 5, scope: !814)
!816 = !DILocation(line: 198, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !766, file: !3, line: 198, column: 9)
!818 = !DILocation(line: 198, column: 13, scope: !817)
!819 = !DILocation(line: 198, column: 21, scope: !817)
!820 = !DILocation(line: 198, column: 19, scope: !817)
!821 = !DILocation(line: 198, column: 9, scope: !766)
!822 = !DILocation(line: 199, column: 13, scope: !823)
!823 = distinct !DILexicalBlock(scope: !817, file: !3, line: 198, column: 32)
!824 = !DILocation(line: 199, column: 25, scope: !823)
!825 = !DILocation(line: 199, column: 11, scope: !823)
!826 = !DILocation(line: 200, column: 34, scope: !823)
!827 = !DILocation(line: 200, column: 9, scope: !823)
!828 = !DILocation(line: 200, column: 21, scope: !823)
!829 = !DILocation(line: 200, column: 25, scope: !823)
!830 = !DILocation(line: 200, column: 32, scope: !823)
!831 = !DILocation(line: 201, column: 20, scope: !823)
!832 = !DILocation(line: 201, column: 24, scope: !823)
!833 = !DILocation(line: 201, column: 9, scope: !823)
!834 = !DILocation(line: 201, column: 12, scope: !823)
!835 = !DILocation(line: 201, column: 18, scope: !823)
!836 = !DILocation(line: 202, column: 5, scope: !823)
!837 = !DILocation(line: 204, column: 5, scope: !766)
!838 = !DILocation(line: 204, column: 9, scope: !766)
!839 = !DILocation(line: 204, column: 15, scope: !766)
!840 = !DILocation(line: 206, column: 5, scope: !766)
!841 = !DILocation(line: 207, column: 1, scope: !766)
!842 = distinct !DISubprogram(name: "ngx_select_process_events", scope: !3, file: !3, line: 211, type: !596, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !852, !853, !854, !855, !856, !862, !864, !865}
!844 = !DILocalVariable(name: "cycle", arg: 1, scope: !842, file: !3, line: 211, type: !243)
!845 = !DILocalVariable(name: "timer", arg: 2, scope: !842, file: !3, line: 211, type: !7)
!846 = !DILocalVariable(name: "flags", arg: 3, scope: !842, file: !3, line: 212, type: !11)
!847 = !DILocalVariable(name: "ready", scope: !842, file: !3, line: 214, type: !106)
!848 = !DILocalVariable(name: "nready", scope: !842, file: !3, line: 214, type: !106)
!849 = !DILocalVariable(name: "err", scope: !842, file: !3, line: 215, type: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !851, line: 16, baseType: !106)
!851 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!852 = !DILocalVariable(name: "i", scope: !842, file: !3, line: 216, type: !11)
!853 = !DILocalVariable(name: "found", scope: !842, file: !3, line: 216, type: !11)
!854 = !DILocalVariable(name: "ev", scope: !842, file: !3, line: 217, type: !265)
!855 = !DILocalVariable(name: "queue", scope: !842, file: !3, line: 218, type: !316)
!856 = !DILocalVariable(name: "tv", scope: !842, file: !3, line: 219, type: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !14, line: 283, size: 64, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !857, file: !14, line: 283, baseType: !157, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !857, file: !14, line: 283, baseType: !861, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !14, line: 80, baseType: !16)
!862 = !DILocalVariable(name: "tp", scope: !842, file: !3, line: 219, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!864 = !DILocalVariable(name: "c", scope: !842, file: !3, line: 220, type: !258)
!865 = !DILocalVariable(name: "level", scope: !866, file: !3, line: 275, type: !11)
!866 = distinct !DILexicalBlock(scope: !867, file: !3, line: 274, column: 14)
!867 = distinct !DILexicalBlock(scope: !842, file: !3, line: 274, column: 9)
!868 = !DILocation(line: 211, column: 40, scope: !842)
!869 = !DILocation(line: 211, column: 58, scope: !842)
!870 = !DILocation(line: 212, column: 16, scope: !842)
!871 = !DILocation(line: 214, column: 5, scope: !842)
!872 = !DILocation(line: 214, column: 24, scope: !842)
!873 = !DILocation(line: 214, column: 31, scope: !842)
!874 = !DILocation(line: 215, column: 5, scope: !842)
!875 = !DILocation(line: 215, column: 24, scope: !842)
!876 = !DILocation(line: 216, column: 5, scope: !842)
!877 = !DILocation(line: 216, column: 24, scope: !842)
!878 = !DILocation(line: 216, column: 27, scope: !842)
!879 = !DILocation(line: 217, column: 5, scope: !842)
!880 = !DILocation(line: 217, column: 24, scope: !842)
!881 = !DILocation(line: 218, column: 5, scope: !842)
!882 = !DILocation(line: 218, column: 24, scope: !842)
!883 = !DILocation(line: 219, column: 5, scope: !842)
!884 = !DILocation(line: 219, column: 24, scope: !842)
!885 = !DILocation(line: 219, column: 29, scope: !842)
!886 = !DILocation(line: 220, column: 5, scope: !842)
!887 = !DILocation(line: 220, column: 24, scope: !842)
!888 = !DILocation(line: 222, column: 9, scope: !889)
!889 = distinct !DILexicalBlock(scope: !842, file: !3, line: 222, column: 9)
!890 = !DILocation(line: 222, column: 16, scope: !889)
!891 = !DILocation(line: 222, column: 9, scope: !842)
!892 = !DILocation(line: 223, column: 16, scope: !893)
!893 = distinct !DILexicalBlock(scope: !894, file: !3, line: 223, column: 9)
!894 = distinct !DILexicalBlock(scope: !889, file: !3, line: 222, column: 23)
!895 = !DILocation(line: 223, column: 14, scope: !893)
!896 = !DILocation(line: 223, column: 21, scope: !897)
!897 = distinct !DILexicalBlock(scope: !893, file: !3, line: 223, column: 9)
!898 = !DILocation(line: 223, column: 25, scope: !897)
!899 = !DILocation(line: 223, column: 23, scope: !897)
!900 = !DILocation(line: 223, column: 9, scope: !893)
!901 = !DILocation(line: 224, column: 17, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !3, line: 223, column: 39)
!903 = !DILocation(line: 224, column: 29, scope: !902)
!904 = !DILocation(line: 224, column: 33, scope: !902)
!905 = !DILocation(line: 224, column: 15, scope: !902)
!906 = !DILocation(line: 225, column: 17, scope: !907)
!907 = distinct !DILexicalBlock(scope: !902, file: !3, line: 225, column: 17)
!908 = !DILocation(line: 225, column: 26, scope: !907)
!909 = !DILocation(line: 225, column: 29, scope: !907)
!910 = !DILocation(line: 225, column: 24, scope: !907)
!911 = !DILocation(line: 225, column: 17, scope: !902)
!912 = !DILocation(line: 226, column: 26, scope: !913)
!913 = distinct !DILexicalBlock(scope: !907, file: !3, line: 225, column: 33)
!914 = !DILocation(line: 226, column: 29, scope: !913)
!915 = !DILocation(line: 226, column: 24, scope: !913)
!916 = !DILocation(line: 227, column: 13, scope: !913)
!917 = !DILocation(line: 228, column: 9, scope: !902)
!918 = !DILocation(line: 223, column: 35, scope: !897)
!919 = !DILocation(line: 223, column: 9, scope: !897)
!920 = distinct !{!920, !900, !921}
!921 = !DILocation(line: 228, column: 9, scope: !893)
!922 = !DILocation(line: 232, column: 5, scope: !894)
!923 = !DILocation(line: 248, column: 9, scope: !924)
!924 = distinct !DILexicalBlock(scope: !842, file: !3, line: 248, column: 9)
