; ModuleID = 'src/event/modules/ngx_poll_module.c'
source_filename = "src/event/modules/ngx_poll_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_event_module_t = type { %struct.ngx_str_t*, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)*, %struct.ngx_event_actions_t }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_poll_module_ctx", scope: !2, file: !3, line: 30, type: !548, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !20)
!3 = !DIFile(filename: "src/event/modules/ngx_poll_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !8, !11, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !9, line: 66, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !13, line: 16, baseType: !14)
!13 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !15, line: 16, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !17, line: 79, baseType: !18)
!17 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !19, line: 125, baseType: !10)
!19 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !{!21, !0, !535, !537, !546}
!21 = !DIGlobalVariableExpression(var: !22)
!22 = distinct !DIGlobalVariable(name: "ngx_poll_module", scope: !2, file: !3, line: 50, type: !23, isLocal: false, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !24, line: 15, baseType: !25)
!24 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !26, line: 222, size: 800, elements: !27)
!26 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !{!28, !29, !30, !33, !34, !35, !36, !39, !40, !508, !509, !515, !519, !520, !521, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !25, file: !26, line: 223, baseType: !16, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !25, file: !26, line: 224, baseType: !16, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !26, line: 226, baseType: !31, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !25, file: !26, line: 228, baseType: !16, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !25, file: !26, line: 229, baseType: !16, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !25, file: !26, line: 231, baseType: !16, size: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !25, file: !26, line: 232, baseType: !37, size: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !25, file: !26, line: 234, baseType: !6, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !25, file: !26, line: 235, baseType: !41, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !24, line: 22, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !44, line: 77, size: 224, elements: !45)
!44 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !{!46, !57, !58, !505, !506, !507}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !44, line: 78, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !48, line: 19, baseType: !49)
!48 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 16, size: 64, elements: !50)
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !48, line: 17, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 120, baseType: !10)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !48, line: 18, baseType: !54, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !56)
!56 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !44, line: 79, baseType: !16, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !43, file: !44, line: 80, baseType: !59, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DISubroutineType(types: !61)
!61 = !{!31, !62, !41, !6}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !24, line: 16, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !44, line: 116, size: 384, elements: !65)
!65 = !{!66, !67, !244, !487, !488, !489, !498, !499, !500, !501, !502, !504}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !44, line: 117, baseType: !31, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !64, file: !44, line: 118, baseType: !68, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !70, line: 22, baseType: !71)
!70 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 16, size: 160, elements: !72)
!72 = !{!73, !74, !75, !76, !77}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !71, file: !70, line: 17, baseType: !6, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !71, file: !70, line: 18, baseType: !16, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !70, line: 19, baseType: !52, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !71, file: !70, line: 20, baseType: !16, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !71, file: !70, line: 21, baseType: !78, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !24, line: 18, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !81, line: 57, size: 320, elements: !82)
!81 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !{!83, !91, !92, !93, !224, !231, !243}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !80, file: !81, line: 58, baseType: !84, size: 128)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !81, line: 54, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 49, size: 128, elements: !86)
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !85, file: !81, line: 50, baseType: !54, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !85, file: !81, line: 51, baseType: !54, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !81, line: 52, baseType: !78, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !85, file: !81, line: 53, baseType: !16, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !80, file: !81, line: 59, baseType: !52, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !80, file: !81, line: 60, baseType: !78, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !80, file: !81, line: 61, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !24, line: 19, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !97, line: 59, size: 64, elements: !98)
!97 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = !{!99, !223}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !96, file: !97, line: 60, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !97, line: 18, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !97, line: 20, size: 352, elements: !103)
!103 = !{!104, !105, !106, !108, !109, !110, !111, !113, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !102, file: !97, line: 21, baseType: !54, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !102, file: !97, line: 22, baseType: !54, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !102, file: !97, line: 23, baseType: !107, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 222, baseType: !11)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !102, file: !97, line: 24, baseType: !107, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !102, file: !97, line: 26, baseType: !54, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !102, file: !97, line: 27, baseType: !54, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !102, file: !97, line: 28, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !97, line: 16, baseType: !6)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !102, file: !97, line: 29, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !24, line: 23, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !117, line: 16, size: 1216, elements: !118)
!117 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !{!119, !122, !123, !168, !169, !170, !208, !209}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !116, file: !117, line: 17, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !121, line: 16, baseType: !11)
!121 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 18, baseType: !47, size: 64, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !116, file: !117, line: 19, baseType: !124, size: 960, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !121, line: 17, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !126, line: 4, size: 960, elements: !127)
!126 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = !{!128, !130, !131, !133, !134, !136, !137, !139, !141, !143, !144, !145, !146, !147, !148, !151, !152, !154, !155, !161, !162, !163}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !125, file: !126, line: 6, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !19, line: 232, baseType: !10)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !125, file: !126, line: 7, baseType: !129, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !125, file: !126, line: 8, baseType: !132, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !19, line: 227, baseType: !10)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !125, file: !126, line: 9, baseType: !132, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !125, file: !126, line: 10, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !19, line: 217, baseType: !10)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !125, file: !126, line: 11, baseType: !135, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !125, file: !126, line: 13, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !19, line: 212, baseType: !10)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !125, file: !126, line: 14, baseType: !140, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !19, line: 304, baseType: !10)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !125, file: !126, line: 15, baseType: !142, size: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !19, line: 309, baseType: !10)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !125, file: !126, line: 16, baseType: !10, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !125, file: !126, line: 17, baseType: !129, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !125, file: !126, line: 18, baseType: !129, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !125, file: !126, line: 19, baseType: !107, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !125, file: !126, line: 20, baseType: !107, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !125, file: !126, line: 21, baseType: !149, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !19, line: 237, baseType: !150)
!150 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !125, file: !126, line: 22, baseType: !149, size: 32, offset: 480)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !125, file: !126, line: 23, baseType: !153, size: 32, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !19, line: 242, baseType: !11)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !125, file: !126, line: 24, baseType: !153, size: 32, offset: 544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !125, file: !126, line: 26, baseType: !156, size: 64, offset: 576)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !19, line: 288, size: 64, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !156, file: !19, line: 288, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !19, line: 75, baseType: !150)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !156, file: !19, line: 288, baseType: !150, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !125, file: !126, line: 27, baseType: !156, size: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !125, file: !126, line: 28, baseType: !156, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !125, file: !126, line: 29, baseType: !164, size: 192, offset: 768)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !166)
!165 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !116, file: !117, line: 21, baseType: !107, size: 32, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !116, file: !117, line: 22, baseType: !107, size: 32, offset: 1120)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !116, file: !117, line: 24, baseType: !171, size: 32, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !24, line: 20, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !174, line: 50, size: 320, elements: !175)
!174 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!175 = !{!176, !177, !189, !193, !194, !199, !200, !205, !206, !207}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !173, file: !174, line: 51, baseType: !16, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !173, file: !174, line: 52, baseType: !178, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !24, line: 21, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !44, line: 89, size: 160, elements: !181)
!181 = !{!182, !183, !184, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !180, file: !44, line: 90, baseType: !120, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !44, line: 91, baseType: !47, size: 64, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !180, file: !44, line: 93, baseType: !185, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !178, !171}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !44, line: 94, baseType: !6, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !173, file: !174, line: 54, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !191, line: 98, baseType: !192)
!191 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!192 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !173, file: !174, line: 56, baseType: !159, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !173, file: !174, line: 58, baseType: !195, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !174, line: 45, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!54, !171, !54, !52}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !174, line: 59, baseType: !6, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !173, file: !174, line: 61, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !174, line: 46, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !171, !16, !54, !52}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !173, file: !174, line: 62, baseType: !6, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !173, file: !174, line: 70, baseType: !31, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !174, line: 72, baseType: !171, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !116, file: !117, line: 37, baseType: !10, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !116, file: !117, line: 38, baseType: !10, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !102, file: !97, line: 30, baseType: !100, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !102, file: !97, line: 34, baseType: !10, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !102, file: !97, line: 40, baseType: !10, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !102, file: !97, line: 43, baseType: !10, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !102, file: !97, line: 45, baseType: !10, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !102, file: !97, line: 46, baseType: !10, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !102, file: !97, line: 47, baseType: !10, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !102, file: !97, line: 48, baseType: !10, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !102, file: !97, line: 49, baseType: !10, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !102, file: !97, line: 50, baseType: !10, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !102, file: !97, line: 52, baseType: !10, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !102, file: !97, line: 53, baseType: !10, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !102, file: !97, line: 55, baseType: !11, size: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !97, line: 61, baseType: !94, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !80, file: !81, line: 62, baseType: !225, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !81, line: 41, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !81, line: 43, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !81, line: 44, baseType: !225, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !227, file: !81, line: 45, baseType: !6, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !80, file: !81, line: 63, baseType: !232, size: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !81, line: 32, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !81, line: 34, size: 96, elements: !235)
!235 = !{!236, !241, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !234, file: !81, line: 35, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !81, line: 30, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !6}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !81, line: 36, baseType: !6, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !81, line: 37, baseType: !232, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !80, file: !81, line: 64, baseType: !171, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !64, file: !44, line: 120, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !24, line: 17, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !248, line: 38, size: 2496, elements: !249)
!248 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!249 = !{!250, !254, !255, !256, !257, !258, !433, !434, !435, !438, !439, !440, !441, !442, !443, !444, !445, !456, !457, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !247, file: !248, line: 39, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !247, file: !248, line: 40, baseType: !78, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !247, file: !248, line: 42, baseType: !171, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !247, file: !248, line: 43, baseType: !172, size: 320, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !247, file: !248, line: 45, baseType: !16, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !247, file: !248, line: 47, baseType: !259, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !24, line: 26, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !263, line: 121, size: 896, elements: !264)
!263 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!264 = !{!265, !266, !320, !321, !324, !331, !333, !338, !343, !401, !402, !403, !404, !405, !406, !407, !408, !409, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !263, line: 122, baseType: !6, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !262, file: !263, line: 123, baseType: !267, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !24, line: 24, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !270, line: 30, size: 384, elements: !271)
!270 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !299, !300, !301, !312}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 31, baseType: !6, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !269, file: !270, line: 33, baseType: !10, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !269, file: !270, line: 35, baseType: !10, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !269, file: !270, line: 38, baseType: !10, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !269, file: !270, line: 44, baseType: !10, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !269, file: !270, line: 46, baseType: !10, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !269, file: !270, line: 49, baseType: !10, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !269, file: !270, line: 51, baseType: !10, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !269, file: !270, line: 54, baseType: !10, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !269, file: !270, line: 56, baseType: !10, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !269, file: !270, line: 57, baseType: !10, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !269, file: !270, line: 59, baseType: !10, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !269, file: !270, line: 60, baseType: !10, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !269, file: !270, line: 62, baseType: !10, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !269, file: !270, line: 64, baseType: !10, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !269, file: !270, line: 67, baseType: !10, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !269, file: !270, line: 69, baseType: !10, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !269, file: !270, line: 71, baseType: !10, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !269, file: !270, line: 74, baseType: !10, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !269, file: !270, line: 75, baseType: !10, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !269, file: !270, line: 77, baseType: !10, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !269, file: !270, line: 107, baseType: !10, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !269, file: !270, line: 110, baseType: !295, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !24, line: 31, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !267}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !269, file: !270, line: 117, baseType: !16, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !269, file: !270, line: 119, baseType: !171, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !269, file: !270, line: 121, baseType: !302, size: 160, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !15, line: 20, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !15, line: 22, size: 160, elements: !304)
!304 = !{!305, !306, !308, !309, !310, !311}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !303, file: !15, line: 23, baseType: !14, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !303, file: !15, line: 24, baseType: !307, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !303, file: !15, line: 25, baseType: !307, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !303, file: !15, line: 26, baseType: !307, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !303, file: !15, line: 27, baseType: !55, size: 8, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !15, line: 28, baseType: !55, size: 8, offset: 136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !270, line: 124, baseType: !313, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !314, line: 16, baseType: !315)
!314 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !314, line: 18, size: 64, elements: !316)
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !314, line: 19, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !314, line: 20, baseType: !318, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !262, file: !263, line: 124, baseType: !267, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !262, file: !263, line: 126, baseType: !322, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !323, line: 17, baseType: !11)
!323 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !262, file: !263, line: 128, baseType: !325, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !326, line: 19, baseType: !327)
!326 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !260, !54, !52}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 135, baseType: !11)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !262, file: !263, line: 129, baseType: !332, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !326, line: 22, baseType: !327)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !262, file: !263, line: 130, baseType: !334, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !326, line: 20, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{!330, !260, !94, !107}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !262, file: !263, line: 131, baseType: !339, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !326, line: 23, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DISubroutineType(types: !342)
!342 = !{!94, !260, !94, !107}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !262, file: !263, line: 133, baseType: !344, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !263, line: 16, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !263, line: 18, size: 960, elements: !347)
!347 = !{!348, !349, !361, !363, !364, !365, !366, !367, !368, !369, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !346, file: !263, line: 19, baseType: !322, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !346, file: !263, line: 21, baseType: !350, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !352, line: 297, size: 128, elements: !353)
!352 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!353 = !{!354, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !351, file: !352, line: 298, baseType: !355, size: 16)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !19, line: 409, baseType: !356)
!356 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !351, file: !352, line: 299, baseType: !358, size: 112, offset: 16)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 112, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 14)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !346, file: !263, line: 22, baseType: !362, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !19, line: 404, baseType: !10)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !346, file: !263, line: 23, baseType: !52, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !346, file: !263, line: 24, baseType: !47, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !263, line: 26, baseType: !11, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !346, file: !263, line: 28, baseType: !11, size: 32, offset: 224)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !346, file: !263, line: 29, baseType: !11, size: 32, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !346, file: !263, line: 30, baseType: !11, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !346, file: !263, line: 38, baseType: !370, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !24, line: 32, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !260}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !346, file: !263, line: 40, baseType: !6, size: 32, offset: 352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !346, file: !263, line: 42, baseType: !172, size: 320, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !346, file: !263, line: 43, baseType: !171, size: 32, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !346, file: !263, line: 45, baseType: !52, size: 32, offset: 736)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !346, file: !263, line: 47, baseType: !52, size: 32, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !346, file: !263, line: 49, baseType: !12, size: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !346, file: !263, line: 51, baseType: !344, size: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !346, file: !263, line: 52, baseType: !260, size: 32, offset: 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !346, file: !263, line: 54, baseType: !16, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !346, file: !263, line: 56, baseType: !10, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !346, file: !263, line: 57, baseType: !10, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !346, file: !263, line: 58, baseType: !10, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !346, file: !263, line: 60, baseType: !10, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !346, file: !263, line: 61, baseType: !10, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !346, file: !263, line: 62, baseType: !10, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !346, file: !263, line: 63, baseType: !10, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !346, file: !263, line: 64, baseType: !10, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !346, file: !263, line: 65, baseType: !10, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !346, file: !263, line: 66, baseType: !10, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !346, file: !263, line: 67, baseType: !10, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !346, file: !263, line: 70, baseType: !10, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !346, file: !263, line: 72, baseType: !10, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !346, file: !263, line: 73, baseType: !10, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !346, file: !263, line: 74, baseType: !10, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !346, file: !263, line: 76, baseType: !10, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !346, file: !263, line: 77, baseType: !10, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !346, file: !263, line: 78, baseType: !10, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !262, file: !263, line: 135, baseType: !107, size: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !262, file: !263, line: 137, baseType: !171, size: 32, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !262, file: !263, line: 139, baseType: !78, size: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !263, line: 141, baseType: !11, size: 32, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !262, file: !263, line: 143, baseType: !350, size: 32, offset: 416)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !262, file: !263, line: 144, baseType: !362, size: 32, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !262, file: !263, line: 145, baseType: !47, size: 64, offset: 480)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !262, file: !263, line: 147, baseType: !47, size: 64, offset: 544)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !262, file: !263, line: 148, baseType: !410, size: 16, offset: 608)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !411, line: 12, baseType: !412)
!411 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 186, baseType: !356)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !262, file: !263, line: 154, baseType: !350, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !262, file: !263, line: 155, baseType: !362, size: 32, offset: 672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !262, file: !263, line: 157, baseType: !100, size: 32, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !262, file: !263, line: 159, baseType: !313, size: 64, offset: 736)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !262, file: !263, line: 161, baseType: !190, size: 32, offset: 800)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !262, file: !263, line: 163, baseType: !16, size: 32, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !262, file: !263, line: 165, baseType: !10, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !262, file: !263, line: 167, baseType: !10, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !262, file: !263, line: 169, baseType: !10, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !262, file: !263, line: 170, baseType: !10, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !262, file: !263, line: 171, baseType: !10, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !262, file: !263, line: 173, baseType: !10, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !262, file: !263, line: 174, baseType: !10, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !262, file: !263, line: 175, baseType: !10, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !262, file: !263, line: 176, baseType: !10, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !262, file: !263, line: 178, baseType: !10, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !262, file: !263, line: 179, baseType: !10, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !262, file: !263, line: 180, baseType: !10, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !262, file: !263, line: 181, baseType: !10, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !262, file: !263, line: 183, baseType: !10, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !247, file: !248, line: 48, baseType: !260, size: 32, offset: 480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !247, file: !248, line: 49, baseType: !16, size: 32, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !247, file: !248, line: 51, baseType: !436, size: 32, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !247, file: !248, line: 52, baseType: !16, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !247, file: !248, line: 53, baseType: !16, size: 32, offset: 608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !247, file: !248, line: 55, baseType: !313, size: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !247, file: !248, line: 56, baseType: !16, size: 32, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !247, file: !248, line: 58, baseType: !69, size: 160, offset: 736)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !247, file: !248, line: 59, baseType: !69, size: 160, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !247, file: !248, line: 61, baseType: !69, size: 160, offset: 1056)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !247, file: !248, line: 62, baseType: !446, size: 96, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !15, line: 32, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !15, line: 37, size: 96, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !447, file: !15, line: 38, baseType: !307, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !447, file: !15, line: 39, baseType: !307, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !447, file: !15, line: 40, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !15, line: 34, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !307, !307, !307}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !247, file: !248, line: 63, baseType: !302, size: 160, offset: 1312)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !247, file: !248, line: 65, baseType: !458, size: 224, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !459, line: 31, baseType: !460)
!459 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 25, size: 224, elements: !461)
!461 = !{!462, !470, !471, !472, !473}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !460, file: !459, line: 26, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !459, line: 16, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !459, line: 18, size: 96, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !465, file: !459, line: 19, baseType: !6, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !465, file: !459, line: 20, baseType: !16, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !465, file: !459, line: 21, baseType: !463, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !460, file: !459, line: 27, baseType: !464, size: 96, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !459, line: 28, baseType: !52, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !460, file: !459, line: 29, baseType: !16, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !460, file: !459, line: 30, baseType: !78, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !247, file: !248, line: 66, baseType: !458, size: 224, offset: 1696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !247, file: !248, line: 68, baseType: !16, size: 32, offset: 1920)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !247, file: !248, line: 69, baseType: !16, size: 32, offset: 1952)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !247, file: !248, line: 71, baseType: !260, size: 32, offset: 1984)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !247, file: !248, line: 72, baseType: !267, size: 32, offset: 2016)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !247, file: !248, line: 73, baseType: !267, size: 32, offset: 2048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !247, file: !248, line: 75, baseType: !245, size: 32, offset: 2080)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !247, file: !248, line: 77, baseType: !47, size: 64, offset: 2112)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !247, file: !248, line: 78, baseType: !47, size: 64, offset: 2176)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !247, file: !248, line: 79, baseType: !47, size: 64, offset: 2240)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !247, file: !248, line: 80, baseType: !47, size: 64, offset: 2304)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !247, file: !248, line: 81, baseType: !47, size: 64, offset: 2368)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !247, file: !248, line: 82, baseType: !47, size: 64, offset: 2432)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !64, file: !44, line: 121, baseType: !78, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !64, file: !44, line: 122, baseType: !78, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !64, file: !44, line: 123, baseType: !490, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !44, line: 103, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 98, size: 1344, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !492, file: !44, line: 99, baseType: !115, size: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !492, file: !44, line: 100, baseType: !100, size: 32, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !492, file: !44, line: 101, baseType: !100, size: 32, offset: 1248)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !492, file: !44, line: 102, baseType: !16, size: 32, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !64, file: !44, line: 124, baseType: !171, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !64, file: !44, line: 126, baseType: !6, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !64, file: !44, line: 127, baseType: !16, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !64, file: !44, line: 128, baseType: !16, size: 32, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !64, file: !44, line: 130, baseType: !503, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !44, line: 112, baseType: !59)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !64, file: !44, line: 131, baseType: !31, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !43, file: !44, line: 81, baseType: !16, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !43, file: !44, line: 82, baseType: !16, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !43, file: !44, line: 83, baseType: !6, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !26, line: 236, baseType: !16, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !25, file: !26, line: 238, baseType: !510, size: 32, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{!513, !171}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !17, line: 78, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !19, line: 140, baseType: !11)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !25, file: !26, line: 240, baseType: !516, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DISubroutineType(types: !518)
!518 = !{!513, !245}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !25, file: !26, line: 242, baseType: !516, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !25, file: !26, line: 243, baseType: !516, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !25, file: !26, line: 244, baseType: !522, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !245}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !25, file: !26, line: 245, baseType: !522, size: 32, offset: 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !25, file: !26, line: 247, baseType: !522, size: 32, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !25, file: !26, line: 249, baseType: !18, size: 32, offset: 544)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !25, file: !26, line: 250, baseType: !18, size: 32, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !25, file: !26, line: 251, baseType: !18, size: 32, offset: 608)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !25, file: !26, line: 252, baseType: !18, size: 32, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !25, file: !26, line: 253, baseType: !18, size: 32, offset: 672)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !25, file: !26, line: 254, baseType: !18, size: 32, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !25, file: !26, line: 255, baseType: !18, size: 32, offset: 736)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !25, file: !26, line: 256, baseType: !18, size: 32, offset: 768)
!535 = !DIGlobalVariableExpression(var: !536)
!536 = distinct !DIGlobalVariable(name: "poll_name", scope: !2, file: !3, line: 28, type: !47, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538)
!538 = distinct !DIGlobalVariable(name: "event_list", scope: !2, file: !3, line: 24, type: !539, isLocal: true, isDefinition: true)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !541, line: 31, size: 64, elements: !542)
!541 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/poll.h", directory: "/home/sam/Projects/nginx-1.12.2")
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !540, file: !541, line: 32, baseType: !11, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !540, file: !541, line: 33, baseType: !7, size: 16, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !540, file: !541, line: 34, baseType: !7, size: 16, offset: 48)
!546 = !DIGlobalVariableExpression(var: !547)
!547 = distinct !DIGlobalVariable(name: "nevents", scope: !2, file: !3, line: 25, type: !16, isLocal: true, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_module_t", file: !270, line: 464, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 457, size: 416, elements: !550)
!550 = !{!551, !553, !557, !561}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !549, file: !270, line: 458, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !549, file: !270, line: 460, baseType: !554, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!6, !245}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !549, file: !270, line: 461, baseType: !558, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{!31, !245, !6}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !549, file: !270, line: 463, baseType: !562, size: 320, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_actions_t", file: !270, line: 194, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 177, size: 320, elements: !564)
!564 = !{!565, !569, !570, !571, !572, !576, !580, !584, !588, !592}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !563, file: !270, line: 178, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!513, !267, !513, !16}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !563, file: !270, line: 179, baseType: !566, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !563, file: !270, line: 181, baseType: !566, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !563, file: !270, line: 182, baseType: !566, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "add_conn", scope: !563, file: !270, line: 184, baseType: !573, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!513, !260}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "del_conn", scope: !563, file: !270, line: 185, baseType: !577, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!513, !260, !16}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !563, file: !270, line: 187, baseType: !581, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!513, !295}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "process_events", scope: !563, file: !270, line: 189, baseType: !585, size: 32, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!513, !245, !12, !16}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !563, file: !270, line: 192, baseType: !589, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!513, !245, !12}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !563, file: !270, line: 193, baseType: !522, size: 32, offset: 288)
!593 = !{i32 2, !"Dwarf Version", i32 4}
!594 = !{i32 2, !"Debug Info Version", i32 3}
!595 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!596 = distinct !DISubprogram(name: "ngx_poll_init_conf", scope: !3, file: !3, line: 404, type: !559, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !597)
!597 = !{!598, !599, !600}
!598 = !DILocalVariable(name: "cycle", arg: 1, scope: !596, file: !3, line: 404, type: !245)
!599 = !DILocalVariable(name: "conf", arg: 2, scope: !596, file: !3, line: 404, type: !6)
!600 = !DILocalVariable(name: "ecf", scope: !596, file: !3, line: 406, type: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_conf_t", file: !270, line: 454, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 440, size: 192, elements: !604)
!604 = !{!605, !606, !607, !609, !610, !611}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !603, file: !270, line: 441, baseType: !16, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !603, file: !270, line: 442, baseType: !16, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "multi_accept", scope: !603, file: !270, line: 444, baseType: !608, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !17, line: 80, baseType: !514)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex", scope: !603, file: !270, line: 445, baseType: !608, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex_delay", scope: !603, file: !270, line: 447, baseType: !12, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !603, file: !270, line: 449, baseType: !54, size: 32, offset: 160)
!612 = !{!613, !613, i64 0}
!613 = !{!"any pointer", !614, i64 0}
!614 = !{!"omnipotent char", !615, i64 0}
!615 = !{!"Simple C/C++ TBAA"}
!616 = !DIExpression()
!617 = !DILocation(line: 404, column: 33, scope: !596)
!618 = !DILocation(line: 404, column: 46, scope: !596)
!619 = !DILocation(line: 406, column: 5, scope: !596)
!620 = !DILocation(line: 406, column: 24, scope: !596)
!621 = !DILocation(line: 408, column: 11, scope: !596)
!622 = !{!623, !613, i64 0}
!623 = !{!"ngx_cycle_s", !613, i64 0, !613, i64 4, !613, i64 8, !624, i64 12, !625, i64 52, !613, i64 56, !613, i64 60, !625, i64 64, !613, i64 68, !625, i64 72, !625, i64 76, !627, i64 80, !625, i64 88, !628, i64 92, !628, i64 112, !628, i64 132, !629, i64 152, !630, i64 164, !631, i64 184, !631, i64 212, !625, i64 240, !625, i64 244, !613, i64 248, !613, i64 252, !613, i64 256, !613, i64 260, !633, i64 264, !633, i64 272, !633, i64 280, !633, i64 288, !633, i64 296, !633, i64 304}
!624 = !{!"ngx_log_s", !625, i64 0, !613, i64 4, !626, i64 8, !626, i64 12, !613, i64 16, !613, i64 20, !613, i64 24, !613, i64 28, !613, i64 32, !613, i64 36}
!625 = !{!"int", !614, i64 0}
!626 = !{!"long", !614, i64 0}
!627 = !{!"ngx_queue_s", !613, i64 0, !613, i64 4}
!628 = !{!"", !613, i64 0, !625, i64 4, !625, i64 8, !625, i64 12, !613, i64 16}
!629 = !{!"ngx_rbtree_s", !613, i64 0, !613, i64 4, !613, i64 8}
!630 = !{!"ngx_rbtree_node_s", !625, i64 0, !613, i64 4, !613, i64 8, !613, i64 12, !614, i64 16, !614, i64 17}
!631 = !{!"", !613, i64 0, !632, i64 4, !625, i64 16, !625, i64 20, !613, i64 24}
!632 = !{!"ngx_list_part_s", !613, i64 0, !625, i64 4, !613, i64 8}
!633 = !{!"", !625, i64 0, !613, i64 4}
!634 = !{!635, !625, i64 4}
!635 = !{!"ngx_module_s", !625, i64 0, !625, i64 4, !613, i64 8, !625, i64 12, !625, i64 16, !625, i64 20, !613, i64 24, !613, i64 28, !613, i64 32, !625, i64 36, !613, i64 40, !613, i64 44, !613, i64 48, !613, i64 52, !613, i64 56, !613, i64 60, !613, i64 64, !625, i64 68, !625, i64 72, !625, i64 76, !625, i64 80, !625, i64 84, !625, i64 88, !625, i64 92, !625, i64 96}
!636 = !{!635, !625, i64 0}
!637 = !DILocation(line: 408, column: 9, scope: !596)
!638 = !DILocation(line: 410, column: 9, scope: !639)
!639 = distinct !DILexicalBlock(scope: !596, file: !3, line: 410, column: 9)
!640 = !DILocation(line: 410, column: 14, scope: !639)
!641 = !{!642, !625, i64 4}
!642 = !{!"", !625, i64 0, !625, i64 4, !625, i64 8, !625, i64 12, !625, i64 16, !613, i64 20}
!643 = !DILocation(line: 410, column: 37, scope: !639)
!644 = !DILocation(line: 410, column: 18, scope: !639)
!645 = !DILocation(line: 410, column: 9, scope: !596)
!646 = !DILocation(line: 411, column: 9, scope: !647)
!647 = distinct !DILexicalBlock(scope: !639, file: !3, line: 410, column: 48)
!648 = !DILocation(line: 414, column: 5, scope: !596)
!649 = !DILocation(line: 415, column: 1, scope: !596)
!650 = distinct !DISubprogram(name: "ngx_poll_add_event", scope: !3, file: !3, line: 114, type: !567, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DILocalVariable(name: "ev", arg: 1, scope: !650, file: !3, line: 114, type: !267)
!653 = !DILocalVariable(name: "event", arg: 2, scope: !650, file: !3, line: 114, type: !513)
!654 = !DILocalVariable(name: "flags", arg: 3, scope: !650, file: !3, line: 114, type: !16)
!655 = !DILocalVariable(name: "e", scope: !650, file: !3, line: 116, type: !267)
!656 = !DILocalVariable(name: "c", scope: !650, file: !3, line: 117, type: !260)
!657 = !DILocation(line: 114, column: 33, scope: !650)
!658 = !{!625, !625, i64 0}
!659 = !DILocation(line: 114, column: 47, scope: !650)
!660 = !DILocation(line: 114, column: 65, scope: !650)
!661 = !DILocation(line: 116, column: 5, scope: !650)
!662 = !DILocation(line: 116, column: 24, scope: !650)
