; ModuleID = 'src/http/modules/ngx_http_geo_module.c'
source_filename = "src/http/modules/ngx_http_geo_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_geo_module_ctx", scope: !2, file: !3, line: 126, type: !1921, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !351)
!3 = !DIFile(filename: "src/http/modules/ngx_http_geo_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !16, !204, !20, !206, !219, !34, !231, !232, !241, !243, !14, !238, !267, !309, !338, !339, !340}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !9, line: 22, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 16, size: 160, elements: !11)
!11 = !{!12, !13, !19, !21, !22}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !10, file: !9, line: 17, baseType: !6, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !10, file: !9, line: 18, baseType: !14, size: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !15, line: 79, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !17, line: 125, baseType: !18)
!17 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !10, file: !9, line: 19, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 120, baseType: !18)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !10, file: !9, line: 20, baseType: !14, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !10, file: !9, line: 21, baseType: !23, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !25, line: 18, baseType: !26)
!25 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !27, line: 57, size: 320, elements: !28)
!27 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !{!29, !41, !42, !43, !184, !191, !203}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !26, file: !27, line: 58, baseType: !30, size: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !27, line: 54, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 49, size: 128, elements: !32)
!32 = !{!33, !38, !39, !40}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !31, file: !27, line: 50, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !36, line: 64, baseType: !37)
!36 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !31, file: !27, line: 51, baseType: !34, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !27, line: 52, baseType: !23, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !31, file: !27, line: 53, baseType: !14, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !26, file: !27, line: 59, baseType: !20, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !26, file: !27, line: 60, baseType: !23, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !26, file: !27, line: 61, baseType: !44, size: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !25, line: 19, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !47, line: 59, size: 64, elements: !48)
!47 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !{!49, !183}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !47, line: 60, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !47, line: 18, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !47, line: 20, size: 352, elements: !53)
!53 = !{!54, !55, !56, !59, !60, !61, !62, !64, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !52, file: !47, line: 21, baseType: !34, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !52, file: !47, line: 22, baseType: !34, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !52, file: !47, line: 23, baseType: !57, size: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !17, line: 222, baseType: !58)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !52, file: !47, line: 24, baseType: !57, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !52, file: !47, line: 26, baseType: !34, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !52, file: !47, line: 27, baseType: !34, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !52, file: !47, line: 28, baseType: !63, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !47, line: 16, baseType: !6)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !52, file: !47, line: 29, baseType: !65, size: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !25, line: 23, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !68, line: 16, size: 1216, elements: !69)
!68 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!69 = !{!70, !73, !80, !125, !126, !127, !168, !169}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !67, file: !68, line: 17, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !72, line: 16, baseType: !58)
!72 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !68, line: 18, baseType: !74, size: 64, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !75, line: 19, baseType: !76)
!75 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 16, size: 64, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !76, file: !75, line: 17, baseType: !20, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !75, line: 18, baseType: !34, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !67, file: !68, line: 19, baseType: !81, size: 960, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !72, line: 17, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !83, line: 4, size: 960, elements: !84)
!83 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = !{!85, !87, !88, !90, !91, !93, !94, !96, !98, !100, !101, !102, !103, !104, !105, !108, !109, !111, !112, !118, !119, !120}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !82, file: !83, line: 6, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !17, line: 232, baseType: !18)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !82, file: !83, line: 7, baseType: !86, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !82, file: !83, line: 8, baseType: !89, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !17, line: 227, baseType: !18)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !82, file: !83, line: 9, baseType: !89, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !82, file: !83, line: 10, baseType: !92, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !17, line: 217, baseType: !18)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !82, file: !83, line: 11, baseType: !92, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !82, file: !83, line: 13, baseType: !95, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !17, line: 212, baseType: !18)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !82, file: !83, line: 14, baseType: !97, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !17, line: 304, baseType: !18)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !82, file: !83, line: 15, baseType: !99, size: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !17, line: 309, baseType: !18)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !82, file: !83, line: 16, baseType: !18, size: 32, offset: 288)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !82, file: !83, line: 17, baseType: !86, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !82, file: !83, line: 18, baseType: !86, size: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !82, file: !83, line: 19, baseType: !57, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !82, file: !83, line: 20, baseType: !57, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !82, file: !83, line: 21, baseType: !106, size: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !17, line: 237, baseType: !107)
!107 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !82, file: !83, line: 22, baseType: !106, size: 32, offset: 480)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !82, file: !83, line: 23, baseType: !110, size: 32, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !17, line: 242, baseType: !58)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !82, file: !83, line: 24, baseType: !110, size: 32, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !82, file: !83, line: 26, baseType: !113, size: 64, offset: 576)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !17, line: 288, size: 64, elements: !114)
!114 = !{!115, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !113, file: !17, line: 288, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !17, line: 75, baseType: !107)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !113, file: !17, line: 288, baseType: !107, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !82, file: !83, line: 27, baseType: !113, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !82, file: !83, line: 28, baseType: !113, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !82, file: !83, line: 29, baseType: !121, size: 192, offset: 768)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 192, elements: !123)
!122 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!123 = !{!124}
!124 = !DISubrange(count: 3)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !67, file: !68, line: 21, baseType: !57, size: 32, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !67, file: !68, line: 22, baseType: !57, size: 32, offset: 1120)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !67, file: !68, line: 24, baseType: !128, size: 32, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !25, line: 20, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !131, line: 50, size: 320, elements: !132)
!131 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!132 = !{!133, !134, !147, !151, !152, !157, !158, !163, !164, !167}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !130, file: !131, line: 51, baseType: !14, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !130, file: !131, line: 52, baseType: !135, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !25, line: 21, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !138, line: 89, size: 160, elements: !139)
!138 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!139 = !{!140, !141, !142, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !137, file: !138, line: 90, baseType: !71, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !138, line: 91, baseType: !74, size: 64, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !137, file: !138, line: 93, baseType: !143, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !135, !128}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !138, line: 94, baseType: !6, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !130, file: !131, line: 54, baseType: !148, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !149, line: 98, baseType: !150)
!149 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!150 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !130, file: !131, line: 56, baseType: !116, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !130, file: !131, line: 58, baseType: !153, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !131, line: 45, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!34, !128, !34, !20}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !130, file: !131, line: 59, baseType: !6, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !130, file: !131, line: 61, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !131, line: 46, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !128, !14, !34, !20}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !130, file: !131, line: 62, baseType: !6, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !130, file: !131, line: 70, baseType: !165, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !131, line: 72, baseType: !128, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !67, file: !68, line: 37, baseType: !18, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !67, file: !68, line: 38, baseType: !18, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !52, file: !47, line: 30, baseType: !50, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !52, file: !47, line: 34, baseType: !18, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !52, file: !47, line: 40, baseType: !18, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !52, file: !47, line: 43, baseType: !18, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !52, file: !47, line: 45, baseType: !18, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !52, file: !47, line: 46, baseType: !18, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !52, file: !47, line: 47, baseType: !18, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !52, file: !47, line: 48, baseType: !18, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !52, file: !47, line: 49, baseType: !18, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !52, file: !47, line: 50, baseType: !18, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !52, file: !47, line: 52, baseType: !18, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !52, file: !47, line: 53, baseType: !18, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !52, file: !47, line: 55, baseType: !58, size: 32, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !47, line: 61, baseType: !44, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !26, file: !27, line: 62, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !27, line: 41, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !27, line: 43, size: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !27, line: 44, baseType: !185, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !187, file: !27, line: 45, baseType: !6, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !26, file: !27, line: 63, baseType: !192, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !27, line: 32, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !27, line: 34, size: 96, elements: !195)
!195 = !{!196, !201, !202}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !194, file: !27, line: 35, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !27, line: 30, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !6}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !27, line: 36, baseType: !6, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !27, line: 37, baseType: !192, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !26, file: !27, line: 64, baseType: !128, size: 32, offset: 288)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_header_t", file: !3, line: 163, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 157, size: 128, elements: !209)
!209 = !{!210, !214, !215, !216, !218}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "GEORNG", scope: !208, file: !3, line: 158, baseType: !211, size: 48)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 48, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 6)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !208, file: !3, line: 159, baseType: !35, size: 8, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_size", scope: !208, file: !3, line: 160, baseType: !35, size: 8, offset: 56)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "endianness", scope: !208, file: !3, line: 161, baseType: !217, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 191, baseType: !18)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !208, file: !3, line: 162, baseType: !217, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !221, line: 17, baseType: !222)
!221 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !75, line: 37, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 28, size: 64, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !75, line: 29, baseType: !18, size: 28, flags: DIFlagBitField, extraData: i64 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !223, file: !75, line: 31, baseType: !18, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !223, file: !75, line: 32, baseType: !18, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !223, file: !75, line: 33, baseType: !18, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !223, file: !75, line: 34, baseType: !18, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !223, file: !75, line: 36, baseType: !34, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_range_t", file: !3, line: 17, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 64, elements: !235)
!235 = !{!236, !237, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !3, line: 14, baseType: !219, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !3, line: 15, baseType: !238, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !36, line: 65, baseType: !239)
!239 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !234, file: !3, line: 16, baseType: !238, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !242, line: 13, baseType: !217)
!242 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_variable_value_node_t", file: !3, line: 38, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 34, size: 288, elements: !246)
!246 = !{!247, !265, !266}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !245, file: !3, line: 35, baseType: !248, size: 224)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_node_t", file: !75, line: 218, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 215, size: 224, elements: !250)
!250 = !{!251, !264}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !249, file: !75, line: 216, baseType: !252, size: 160)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !253, line: 20, baseType: !254)
!253 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !253, line: 22, size: 160, elements: !255)
!255 = !{!256, !258, !260, !261, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !254, file: !253, line: 23, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !253, line: 16, baseType: !14)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !254, file: !253, line: 24, baseType: !259, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !254, file: !253, line: 25, baseType: !259, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !254, file: !253, line: 26, baseType: !259, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !254, file: !253, line: 27, baseType: !35, size: 8, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !254, file: !253, line: 28, baseType: !35, size: 8, offset: 136)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !249, file: !75, line: 217, baseType: !74, size: 64, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !245, file: !3, line: 36, baseType: !219, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !245, file: !3, line: 37, baseType: !20, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_ctx_t", file: !3, line: 79, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 69, size: 160, elements: !270)
!270 = !{!271, !304, !305, !306}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !269, file: !3, line: 73, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !269, file: !3, line: 70, size: 64, elements: !273)
!273 = !{!274, !298}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "trees", scope: !272, file: !3, line: 71, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_trees_t", file: !3, line: 25, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 64, elements: !277)
!277 = !{!278, !297}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !276, file: !3, line: 21, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_radix_tree_t", file: !281, line: 34, baseType: !282)
!281 = !DIFile(filename: "src/core/ngx_radix_tree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !281, line: 28, size: 160, elements: !283)
!283 = !{!284, !293, !294, !295, !296}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !282, file: !281, line: 29, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_radix_node_t", file: !281, line: 18, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_radix_node_s", file: !281, line: 20, size: 128, elements: !288)
!288 = !{!289, !290, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !287, file: !281, line: 21, baseType: !285, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !287, file: !281, line: 22, baseType: !285, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !287, file: !281, line: 23, baseType: !285, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !281, line: 24, baseType: !16, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !282, file: !281, line: 30, baseType: !23, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !282, file: !281, line: 31, baseType: !285, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !282, file: !281, line: 32, baseType: !165, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !282, file: !281, line: 33, baseType: !20, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tree6", scope: !276, file: !3, line: 23, baseType: !279, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !272, file: !3, line: 72, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_geo_high_ranges_t", file: !3, line: 31, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 28, size: 64, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !300, file: !3, line: 29, baseType: !231, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !300, file: !3, line: 30, baseType: !219, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "proxies", scope: !269, file: !3, line: 75, baseType: !7, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_recursive", scope: !269, file: !3, line: 76, baseType: !18, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !269, file: !3, line: 78, baseType: !307, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !15, line: 78, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !17, line: 140, baseType: !58)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !242, line: 34, size: 224, elements: !311)
!311 = !{!312, !314, !317, !318, !337}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !310, file: !242, line: 35, baseType: !313, size: 16)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !17, line: 409, baseType: !239)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !310, file: !242, line: 36, baseType: !315, size: 16, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !242, line: 12, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 186, baseType: !239)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !310, file: !242, line: 37, baseType: !217, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !310, file: !242, line: 38, baseType: !319, size: 128, offset: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !242, line: 23, size: 128, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !319, file: !242, line: 28, baseType: !322, size: 128)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !319, file: !242, line: 24, size: 128, elements: !323)
!323 = !{!324, !329, !333}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !322, file: !242, line: 25, baseType: !325, size: 128)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 128, elements: !327)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 181, baseType: !37)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !322, file: !242, line: 26, baseType: !330, size: 128)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 128, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !322, file: !242, line: 27, baseType: !334, size: 128)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 128, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 4)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !310, file: !242, line: 39, baseType: !217, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !242, line: 16, size: 128, elements: !342)
!342 = !{!343, !344, !345, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !341, file: !242, line: 17, baseType: !313, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !341, file: !242, line: 18, baseType: !315, size: 16, offset: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !341, file: !242, line: 19, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !242, line: 14, size: 32, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !346, file: !242, line: 14, baseType: !241, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !341, file: !242, line: 20, baseType: !350, size: 64, offset: 64)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 64, elements: !331)
!351 = !{!352, !0, !659, !664, !1919}
!352 = !DIGlobalVariableExpression(var: !353)
!353 = distinct !DIGlobalVariable(name: "ngx_http_geo_module", scope: !2, file: !3, line: 141, type: !354, isLocal: false, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !25, line: 15, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !356, line: 222, size: 800, elements: !357)
!356 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !634, !635, !639, !643, !644, !645, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !355, file: !356, line: 223, baseType: !14, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !355, file: !356, line: 224, baseType: !14, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !356, line: 226, baseType: !165, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !355, file: !356, line: 228, baseType: !14, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !355, file: !356, line: 229, baseType: !14, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !355, file: !356, line: 231, baseType: !14, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !355, file: !356, line: 232, baseType: !204, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !355, file: !356, line: 234, baseType: !6, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !355, file: !356, line: 235, baseType: !367, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !25, line: 22, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !138, line: 77, size: 224, elements: !370)
!370 = !{!371, !372, !373, !631, !632, !633}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !369, file: !138, line: 78, baseType: !74, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !138, line: 79, baseType: !14, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !369, file: !138, line: 80, baseType: !374, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{!165, !377, !367, !6}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !25, line: 16, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !138, line: 116, size: 384, elements: !380)
!380 = !{!381, !382, !383, !613, !614, !615, !624, !625, !626, !627, !628, !630}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !138, line: 117, baseType: !165, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !379, file: !138, line: 118, baseType: !7, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !379, file: !138, line: 120, baseType: !384, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !25, line: 17, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !387, line: 38, size: 2496, elements: !388)
!387 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!388 = !{!389, !393, !394, !395, !396, !397, !559, !560, !561, !564, !565, !566, !567, !568, !569, !570, !571, !582, !583, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !386, file: !387, line: 39, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !386, file: !387, line: 40, baseType: !23, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !386, file: !387, line: 42, baseType: !128, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !386, file: !387, line: 43, baseType: !129, size: 320, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !386, file: !387, line: 45, baseType: !14, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !386, file: !387, line: 47, baseType: !398, size: 32, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !25, line: 26, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !402, line: 121, size: 896, elements: !403)
!402 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!403 = !{!404, !405, !449, !450, !453, !460, !462, !467, !472, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !401, file: !402, line: 122, baseType: !6, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !401, file: !402, line: 123, baseType: !406, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !25, line: 24, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !409, line: 30, size: 384, elements: !410)
!409 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !438, !439, !440, !441}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !409, line: 31, baseType: !6, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !408, file: !409, line: 33, baseType: !18, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !408, file: !409, line: 35, baseType: !18, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !408, file: !409, line: 38, baseType: !18, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !408, file: !409, line: 44, baseType: !18, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !408, file: !409, line: 46, baseType: !18, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !408, file: !409, line: 49, baseType: !18, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !408, file: !409, line: 51, baseType: !18, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !408, file: !409, line: 54, baseType: !18, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !408, file: !409, line: 56, baseType: !18, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !408, file: !409, line: 57, baseType: !18, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !408, file: !409, line: 59, baseType: !18, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !408, file: !409, line: 60, baseType: !18, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !408, file: !409, line: 62, baseType: !18, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !408, file: !409, line: 64, baseType: !18, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !408, file: !409, line: 67, baseType: !18, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !408, file: !409, line: 69, baseType: !18, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !408, file: !409, line: 71, baseType: !18, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !408, file: !409, line: 74, baseType: !18, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !408, file: !409, line: 75, baseType: !18, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !408, file: !409, line: 77, baseType: !18, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !408, file: !409, line: 107, baseType: !18, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !408, file: !409, line: 110, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !25, line: 31, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !406}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !408, file: !409, line: 117, baseType: !14, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !408, file: !409, line: 119, baseType: !128, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !408, file: !409, line: 121, baseType: !252, size: 160, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !408, file: !409, line: 124, baseType: !442, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !443, line: 16, baseType: !444)
!443 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !443, line: 18, size: 64, elements: !445)
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !444, file: !443, line: 19, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !443, line: 20, baseType: !447, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !401, file: !402, line: 124, baseType: !406, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !401, file: !402, line: 126, baseType: !451, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !452, line: 17, baseType: !58)
!452 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!453 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !401, file: !402, line: 128, baseType: !454, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !455, line: 19, baseType: !456)
!455 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DISubroutineType(types: !458)
!458 = !{!459, !399, !34, !20}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 135, baseType: !58)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !401, file: !402, line: 129, baseType: !461, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !455, line: 22, baseType: !456)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !401, file: !402, line: 130, baseType: !463, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !455, line: 20, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = !DISubroutineType(types: !466)
!466 = !{!459, !399, !44, !57}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !401, file: !402, line: 131, baseType: !468, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !455, line: 23, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{!44, !399, !44, !57}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !401, file: !402, line: 133, baseType: !473, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !402, line: 16, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !402, line: 18, size: 960, elements: !476)
!476 = !{!477, !478, !488, !490, !491, !492, !493, !494, !495, !496, !501, !502, !503, !504, !505, !506, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !475, file: !402, line: 19, baseType: !451, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !475, file: !402, line: 21, baseType: !479, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !481, line: 297, size: 128, elements: !482)
!481 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !480, file: !481, line: 298, baseType: !313, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !480, file: !481, line: 299, baseType: !485, size: 112, offset: 16)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 112, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 14)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !475, file: !402, line: 22, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !17, line: 404, baseType: !18)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !475, file: !402, line: 23, baseType: !20, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !475, file: !402, line: 24, baseType: !74, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !402, line: 26, baseType: !58, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !475, file: !402, line: 28, baseType: !58, size: 32, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !475, file: !402, line: 29, baseType: !58, size: 32, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !475, file: !402, line: 30, baseType: !58, size: 32, offset: 288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !475, file: !402, line: 38, baseType: !497, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !25, line: 32, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !399}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !475, file: !402, line: 40, baseType: !6, size: 32, offset: 352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !475, file: !402, line: 42, baseType: !129, size: 320, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !475, file: !402, line: 43, baseType: !128, size: 32, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !475, file: !402, line: 45, baseType: !20, size: 32, offset: 736)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !475, file: !402, line: 47, baseType: !20, size: 32, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !475, file: !402, line: 49, baseType: !507, size: 32, offset: 800)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !508, line: 16, baseType: !257)
!508 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !475, file: !402, line: 51, baseType: !473, size: 32, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !475, file: !402, line: 52, baseType: !399, size: 32, offset: 864)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !475, file: !402, line: 54, baseType: !14, size: 32, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !475, file: !402, line: 56, baseType: !18, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !475, file: !402, line: 57, baseType: !18, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !475, file: !402, line: 58, baseType: !18, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !475, file: !402, line: 60, baseType: !18, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !475, file: !402, line: 61, baseType: !18, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !475, file: !402, line: 62, baseType: !18, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !475, file: !402, line: 63, baseType: !18, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !475, file: !402, line: 64, baseType: !18, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !475, file: !402, line: 65, baseType: !18, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !475, file: !402, line: 66, baseType: !18, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !475, file: !402, line: 67, baseType: !18, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !475, file: !402, line: 70, baseType: !18, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !475, file: !402, line: 72, baseType: !18, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !475, file: !402, line: 73, baseType: !18, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !475, file: !402, line: 74, baseType: !18, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !475, file: !402, line: 76, baseType: !18, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !475, file: !402, line: 77, baseType: !18, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !475, file: !402, line: 78, baseType: !18, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !401, file: !402, line: 135, baseType: !57, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !401, file: !402, line: 137, baseType: !128, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !401, file: !402, line: 139, baseType: !23, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !401, file: !402, line: 141, baseType: !58, size: 32, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !401, file: !402, line: 143, baseType: !479, size: 32, offset: 416)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !401, file: !402, line: 144, baseType: !489, size: 32, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !401, file: !402, line: 145, baseType: !74, size: 64, offset: 480)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !401, file: !402, line: 147, baseType: !74, size: 64, offset: 544)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !401, file: !402, line: 148, baseType: !315, size: 16, offset: 608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !401, file: !402, line: 154, baseType: !479, size: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !401, file: !402, line: 155, baseType: !489, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !401, file: !402, line: 157, baseType: !50, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !401, file: !402, line: 159, baseType: !442, size: 64, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !401, file: !402, line: 161, baseType: !148, size: 32, offset: 800)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !401, file: !402, line: 163, baseType: !14, size: 32, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !401, file: !402, line: 165, baseType: !18, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !401, file: !402, line: 167, baseType: !18, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !401, file: !402, line: 169, baseType: !18, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !401, file: !402, line: 170, baseType: !18, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !401, file: !402, line: 171, baseType: !18, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !401, file: !402, line: 173, baseType: !18, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !401, file: !402, line: 174, baseType: !18, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !401, file: !402, line: 175, baseType: !18, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !401, file: !402, line: 176, baseType: !18, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !401, file: !402, line: 178, baseType: !18, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !401, file: !402, line: 179, baseType: !18, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !401, file: !402, line: 180, baseType: !18, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !401, file: !402, line: 181, baseType: !18, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !401, file: !402, line: 183, baseType: !18, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !386, file: !387, line: 48, baseType: !399, size: 32, offset: 480)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !386, file: !387, line: 49, baseType: !14, size: 32, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !386, file: !387, line: 51, baseType: !562, size: 32, offset: 544)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !386, file: !387, line: 52, baseType: !14, size: 32, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !386, file: !387, line: 53, baseType: !14, size: 32, offset: 608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !386, file: !387, line: 55, baseType: !442, size: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !386, file: !387, line: 56, baseType: !14, size: 32, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !386, file: !387, line: 58, baseType: !8, size: 160, offset: 736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !386, file: !387, line: 59, baseType: !8, size: 160, offset: 896)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !386, file: !387, line: 61, baseType: !8, size: 160, offset: 1056)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !386, file: !387, line: 62, baseType: !572, size: 96, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !253, line: 32, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !253, line: 37, size: 96, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !573, file: !253, line: 38, baseType: !259, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !573, file: !253, line: 39, baseType: !259, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !573, file: !253, line: 40, baseType: !578, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !253, line: 34, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !259, !259, !259}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !386, file: !387, line: 63, baseType: !252, size: 160, offset: 1312)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !386, file: !387, line: 65, baseType: !584, size: 224, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !585, line: 31, baseType: !586)
!585 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 25, size: 224, elements: !587)
!587 = !{!588, !596, !597, !598, !599}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !586, file: !585, line: 26, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !585, line: 16, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !585, line: 18, size: 96, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !591, file: !585, line: 19, baseType: !6, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !591, file: !585, line: 20, baseType: !14, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !585, line: 21, baseType: !589, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !586, file: !585, line: 27, baseType: !590, size: 96, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !585, line: 28, baseType: !20, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !586, file: !585, line: 29, baseType: !14, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !586, file: !585, line: 30, baseType: !23, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !386, file: !387, line: 66, baseType: !584, size: 224, offset: 1696)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !386, file: !387, line: 68, baseType: !14, size: 32, offset: 1920)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !386, file: !387, line: 69, baseType: !14, size: 32, offset: 1952)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !386, file: !387, line: 71, baseType: !399, size: 32, offset: 1984)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !386, file: !387, line: 72, baseType: !406, size: 32, offset: 2016)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !386, file: !387, line: 73, baseType: !406, size: 32, offset: 2048)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !386, file: !387, line: 75, baseType: !384, size: 32, offset: 2080)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !386, file: !387, line: 77, baseType: !74, size: 64, offset: 2112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !386, file: !387, line: 78, baseType: !74, size: 64, offset: 2176)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !386, file: !387, line: 79, baseType: !74, size: 64, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !386, file: !387, line: 80, baseType: !74, size: 64, offset: 2304)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !386, file: !387, line: 81, baseType: !74, size: 64, offset: 2368)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !386, file: !387, line: 82, baseType: !74, size: 64, offset: 2432)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !379, file: !138, line: 121, baseType: !23, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !379, file: !138, line: 122, baseType: !23, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !379, file: !138, line: 123, baseType: !616, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !138, line: 103, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 98, size: 1344, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !618, file: !138, line: 99, baseType: !66, size: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !618, file: !138, line: 100, baseType: !50, size: 32, offset: 1216)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !618, file: !138, line: 101, baseType: !50, size: 32, offset: 1248)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !618, file: !138, line: 102, baseType: !14, size: 32, offset: 1280)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !379, file: !138, line: 124, baseType: !128, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !379, file: !138, line: 126, baseType: !6, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !379, file: !138, line: 127, baseType: !14, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !379, file: !138, line: 128, baseType: !14, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !379, file: !138, line: 130, baseType: !629, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !138, line: 112, baseType: !374)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !379, file: !138, line: 131, baseType: !165, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !369, file: !138, line: 81, baseType: !14, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !369, file: !138, line: 82, baseType: !14, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !369, file: !138, line: 83, baseType: !6, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !356, line: 236, baseType: !14, size: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !355, file: !356, line: 238, baseType: !636, size: 32, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{!307, !128}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !355, file: !356, line: 240, baseType: !640, size: 32, offset: 352)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{!307, !384}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !355, file: !356, line: 242, baseType: !640, size: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !355, file: !356, line: 243, baseType: !640, size: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !355, file: !356, line: 244, baseType: !646, size: 32, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !384}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !355, file: !356, line: 245, baseType: !646, size: 32, offset: 480)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !355, file: !356, line: 247, baseType: !646, size: 32, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !355, file: !356, line: 249, baseType: !16, size: 32, offset: 544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !355, file: !356, line: 250, baseType: !16, size: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !355, file: !356, line: 251, baseType: !16, size: 32, offset: 608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !355, file: !356, line: 252, baseType: !16, size: 32, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !355, file: !356, line: 253, baseType: !16, size: 32, offset: 672)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !355, file: !356, line: 254, baseType: !16, size: 32, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !355, file: !356, line: 255, baseType: !16, size: 32, offset: 736)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !355, file: !356, line: 256, baseType: !16, size: 32, offset: 768)
!659 = !DIGlobalVariableExpression(var: !660)
!660 = distinct !DIGlobalVariable(name: "ngx_http_geo_commands", scope: !2, file: !3, line: 113, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 448, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 2)
!664 = !DIGlobalVariableExpression(var: !665)
!665 = distinct !DIGlobalVariable(name: "zero", scope: !666, file: !3, line: 385, type: !319, isLocal: true, isDefinition: true)
!666 = distinct !DISubprogram(name: "ngx_http_geo_block", scope: !3, file: !3, line: 372, type: !375, isLocal: true, isDefinition: true, scopeLine: 373, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680, !1895, !1896}
!668 = !DILocalVariable(name: "cf", arg: 1, scope: !666, file: !3, line: 372, type: !377)
!669 = !DILocalVariable(name: "cmd", arg: 2, scope: !666, file: !3, line: 372, type: !367)
!670 = !DILocalVariable(name: "conf", arg: 3, scope: !666, file: !3, line: 372, type: !6)
!671 = !DILocalVariable(name: "rv", scope: !666, file: !3, line: 374, type: !165)
!672 = !DILocalVariable(name: "len", scope: !666, file: !3, line: 375, type: !20)
!673 = !DILocalVariable(name: "value", scope: !666, file: !3, line: 376, type: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!675 = !DILocalVariable(name: "name", scope: !666, file: !3, line: 376, type: !74)
!676 = !DILocalVariable(name: "i", scope: !666, file: !3, line: 377, type: !14)
!677 = !DILocalVariable(name: "save", scope: !666, file: !3, line: 378, type: !378)
!678 = !DILocalVariable(name: "pool", scope: !666, file: !3, line: 379, type: !23)
!679 = !DILocalVariable(name: "a", scope: !666, file: !3, line: 380, type: !7)
!680 = !DILocalVariable(name: "var", scope: !666, file: !3, line: 381, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_t", file: !221, line: 21, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_variable_s", file: !221, line: 37, size: 224, elements: !684)
!684 = !{!685, !686, !1887, !1892, !1893, !1894}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !221, line: 38, baseType: !74, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "set_handler", scope: !683, file: !221, line: 39, baseType: !687, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_set_variable_pt", file: !221, line: 23, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !691, !219, !16}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !693, line: 16, baseType: !694)
!693 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !695, line: 364, size: 5376, elements: !696)
!695 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!696 = !{!697, !698, !699, !700, !701, !702, !703, !708, !709, !918, !1451, !1452, !1453, !1454, !1493, !1523, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1568, !1579, !1586, !1587, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1783, !1787, !1792, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !694, file: !695, line: 365, baseType: !217, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !694, file: !695, line: 367, baseType: !399, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !694, file: !695, line: 369, baseType: !392, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !694, file: !695, line: 370, baseType: !392, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !694, file: !695, line: 371, baseType: !392, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !694, file: !695, line: 372, baseType: !392, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !694, file: !695, line: 374, baseType: !704, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !695, line: 361, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !691}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !694, file: !695, line: 375, baseType: !704, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !694, file: !695, line: 378, baseType: !710, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !693, line: 18, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !713, line: 65, size: 3008, elements: !714)
!713 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!714 = !{!715, !716, !717, !718, !720, !721, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !876, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !712, file: !713, line: 66, baseType: !66, size: 1216)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !712, file: !713, line: 67, baseType: !8, size: 160, offset: 1216)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !712, file: !713, line: 68, baseType: !217, size: 32, offset: 1376)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !712, file: !713, line: 69, baseType: !719, size: 128, offset: 1408)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !327)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !712, file: !713, line: 70, baseType: !719, size: 128, offset: 1536)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !712, file: !713, line: 72, baseType: !722, size: 32, offset: 1664)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !72, line: 18, baseType: !89)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !712, file: !713, line: 73, baseType: !116, size: 32, offset: 1696)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !712, file: !713, line: 74, baseType: !116, size: 32, offset: 1728)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !712, file: !713, line: 75, baseType: !116, size: 32, offset: 1760)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !712, file: !713, line: 76, baseType: !116, size: 32, offset: 1792)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !712, file: !713, line: 77, baseType: !116, size: 32, offset: 1824)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !712, file: !713, line: 79, baseType: !74, size: 64, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !712, file: !713, line: 80, baseType: !74, size: 64, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !712, file: !713, line: 81, baseType: !719, size: 128, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !712, file: !713, line: 83, baseType: !20, size: 32, offset: 2112)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !712, file: !713, line: 84, baseType: !20, size: 32, offset: 2144)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !712, file: !713, line: 85, baseType: !57, size: 32, offset: 2176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !712, file: !713, line: 86, baseType: !57, size: 32, offset: 2208)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !712, file: !713, line: 88, baseType: !14, size: 32, offset: 2240)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !712, file: !713, line: 89, baseType: !14, size: 32, offset: 2272)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !712, file: !713, line: 90, baseType: !14, size: 32, offset: 2304)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !712, file: !713, line: 91, baseType: !14, size: 32, offset: 2336)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !712, file: !713, line: 93, baseType: !50, size: 32, offset: 2368)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !712, file: !713, line: 95, baseType: !741, size: 32, offset: 2400)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !693, line: 19, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !713, line: 157, size: 544, elements: !744)
!744 = !{!745, !760, !819, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !875}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !743, file: !713, line: 158, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !713, line: 154, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !713, line: 145, size: 480, elements: !749)
!749 = !{!750, !751, !752, !753, !756, !757, !758, !759}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !748, file: !713, line: 146, baseType: !572, size: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !748, file: !713, line: 147, baseType: !252, size: 160, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !748, file: !713, line: 148, baseType: !442, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !748, file: !713, line: 149, baseType: !754, size: 32, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !149, line: 106, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !748, file: !713, line: 150, baseType: !754, size: 32, offset: 352)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !748, file: !713, line: 151, baseType: !57, size: 32, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !748, file: !713, line: 152, baseType: !14, size: 32, offset: 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !748, file: !713, line: 153, baseType: !14, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !743, file: !713, line: 159, baseType: !761, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !763, line: 59, baseType: !764)
!763 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 34, size: 800, elements: !765)
!765 = !{!766, !773, !774, !775, !783, !784, !785, !794, !795, !796, !797, !814, !815, !816, !817, !818}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !764, file: !763, line: 35, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !768, line: 21, baseType: !769)
!768 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !768, line: 16, size: 64, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !769, file: !768, line: 17, baseType: !754, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !769, file: !768, line: 19, baseType: !754, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !764, file: !763, line: 37, baseType: !20, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !764, file: !763, line: 38, baseType: !20, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !764, file: !763, line: 40, baseType: !776, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !763, line: 16, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !763, line: 18, size: 96, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !778, file: !763, line: 19, baseType: !16, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !763, line: 20, baseType: !776, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !763, line: 21, baseType: !16, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !764, file: !763, line: 41, baseType: !776, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !764, file: !763, line: 42, baseType: !777, size: 96, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !764, file: !763, line: 44, baseType: !786, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !763, line: 31, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 25, size: 128, elements: !789)
!789 = !{!790, !791, !792, !793}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !788, file: !763, line: 26, baseType: !14, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !788, file: !763, line: 27, baseType: !14, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !788, file: !763, line: 29, baseType: !14, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !788, file: !763, line: 30, baseType: !14, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !764, file: !763, line: 45, baseType: !14, size: 32, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !764, file: !763, line: 47, baseType: !34, size: 32, offset: 352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !764, file: !763, line: 48, baseType: !34, size: 32, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !764, file: !763, line: 50, baseType: !798, size: 256, offset: 416)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !768, line: 37, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !768, line: 24, size: 256, elements: !800)
!800 = !{!801, !803, !804, !805, !813}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !768, line: 26, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !799, file: !768, line: 28, baseType: !802, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !799, file: !768, line: 29, baseType: !14, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !799, file: !768, line: 30, baseType: !806, size: 128, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !807, line: 19, baseType: !808)
!807 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 17, size: 128, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !808, file: !807, line: 18, baseType: !811, size: 128)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 128, elements: !335)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !799, file: !768, line: 36, baseType: !14, size: 32, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !764, file: !763, line: 52, baseType: !34, size: 32, offset: 672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !764, file: !763, line: 53, baseType: !35, size: 8, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !764, file: !763, line: 55, baseType: !18, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !764, file: !763, line: 57, baseType: !6, size: 32, offset: 736)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !764, file: !763, line: 58, baseType: !6, size: 32, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !743, file: !713, line: 161, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !68, line: 62, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 50, size: 384, elements: !823)
!823 = !{!824, !825, !826, !828, !833, !835, !837, !838, !839}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !822, file: !68, line: 51, baseType: !74, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !822, file: !68, line: 52, baseType: !20, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !822, file: !68, line: 53, baseType: !827, size: 96, offset: 96)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !123)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !822, file: !68, line: 55, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !68, line: 45, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{!507, !6}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !822, file: !68, line: 56, baseType: !834, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !68, line: 46, baseType: !830)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !822, file: !68, line: 57, baseType: !836, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !68, line: 47, baseType: !198)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !822, file: !68, line: 58, baseType: !6, size: 32, offset: 288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !822, file: !68, line: 60, baseType: !34, size: 32, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !822, file: !68, line: 61, baseType: !14, size: 32, offset: 352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !743, file: !713, line: 163, baseType: !57, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !743, file: !713, line: 164, baseType: !20, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !743, file: !713, line: 166, baseType: !116, size: 32, offset: 160)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !743, file: !713, line: 168, baseType: !116, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !743, file: !713, line: 170, baseType: !14, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !743, file: !713, line: 171, baseType: !14, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !743, file: !713, line: 172, baseType: !507, size: 32, offset: 288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !743, file: !713, line: 173, baseType: !507, size: 32, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !743, file: !713, line: 174, baseType: !507, size: 32, offset: 352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !743, file: !713, line: 176, baseType: !14, size: 32, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !743, file: !713, line: 177, baseType: !507, size: 32, offset: 416)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !743, file: !713, line: 178, baseType: !507, size: 32, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !743, file: !713, line: 180, baseType: !853, size: 32, offset: 480)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !387, line: 25, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !387, line: 29, size: 320, elements: !856)
!856 = !{!857, !858, !868, !873, !874}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !855, file: !387, line: 30, baseType: !6, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !855, file: !387, line: 31, baseType: !859, size: 192, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !860, line: 22, baseType: !861)
!860 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !860, line: 16, size: 192, elements: !862)
!862 = !{!863, !864, !865, !866, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !861, file: !860, line: 17, baseType: !34, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !861, file: !860, line: 18, baseType: !20, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !860, line: 19, baseType: !74, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !861, file: !860, line: 20, baseType: !128, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !861, file: !860, line: 21, baseType: !14, size: 32, offset: 160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !855, file: !387, line: 32, baseType: !869, size: 32, offset: 224)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !387, line: 27, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DISubroutineType(types: !872)
!872 = !{!307, !853, !6}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !855, file: !387, line: 33, baseType: !6, size: 32, offset: 256)
