; ModuleID = 'src/http/modules/ngx_http_log_module.c'
source_filename = "src/http/modules/ngx_http_log_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_log_module_ctx", scope: !2, file: !3, line: 184, type: !1846, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !63)
!3 = !DIFile(filename: "src/http/modules/ngx_http_log_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !33, !36, !40, !55, !46, !37, !59, !60, !61}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !34, line: 125, baseType: !35)
!34 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !38, line: 64, baseType: !39)
!38 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !42, line: 20, baseType: !43)
!42 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 16, size: 96, elements: !44)
!44 = !{!45, !48, !51}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !43, file: !42, line: 17, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !34, line: 75, baseType: !47)
!47 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !43, file: !42, line: 18, baseType: !49, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !50, line: 79, baseType: !33)
!50 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !43, file: !42, line: 19, baseType: !52, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !50, line: 78, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !34, line: 140, baseType: !54)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !56, line: 17, baseType: !57)
!56 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !58, line: 17, baseType: !52)
!58 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 120, baseType: !35)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !34, line: 135, baseType: !54)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !56, line: 16, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !58, line: 16, baseType: !49)
!63 = !{!64, !0, !565, !567, !1825, !1838, !1841, !1843}
!64 = !DIGlobalVariableExpression(var: !65)
!65 = distinct !DIGlobalVariable(name: "ngx_http_log_module", scope: !2, file: !3, line: 199, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !67, line: 15, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !69, line: 222, size: 800, elements: !70)
!69 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = !{!71, !72, !73, !75, !76, !77, !78, !79, !80, !540, !541, !545, !549, !550, !551, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !68, file: !69, line: 223, baseType: !49, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !68, file: !69, line: 224, baseType: !49, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 226, baseType: !74, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !68, file: !69, line: 228, baseType: !49, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !68, file: !69, line: 229, baseType: !49, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !68, file: !69, line: 231, baseType: !49, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !68, file: !69, line: 232, baseType: !30, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !68, file: !69, line: 234, baseType: !27, size: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !68, file: !69, line: 235, baseType: !81, size: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !67, line: 22, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !84, line: 77, size: 224, elements: !85)
!84 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = !{!86, !93, !94, !537, !538, !539}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !83, file: !84, line: 78, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !88, line: 19, baseType: !89)
!88 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 16, size: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !89, file: !88, line: 17, baseType: !59, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !88, line: 18, baseType: !36, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !84, line: 79, baseType: !49, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !83, file: !84, line: 80, baseType: !95, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DISubroutineType(types: !97)
!97 = !{!74, !98, !81, !27}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !67, line: 16, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !84, line: 116, size: 384, elements: !101)
!101 = !{!102, !103, !278, !519, !520, !521, !530, !531, !532, !533, !534, !536}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !84, line: 117, baseType: !74, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !100, file: !84, line: 118, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !106, line: 22, baseType: !107)
!106 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 16, size: 160, elements: !108)
!108 = !{!109, !110, !111, !112, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !107, file: !106, line: 17, baseType: !27, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !107, file: !106, line: 18, baseType: !49, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !106, line: 19, baseType: !59, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !107, file: !106, line: 20, baseType: !49, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !107, file: !106, line: 21, baseType: !114, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !67, line: 18, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !117, line: 57, size: 320, elements: !118)
!117 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !{!119, !127, !128, !129, !258, !265, !277}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !116, file: !117, line: 58, baseType: !120, size: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !117, line: 54, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 49, size: 128, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !117, line: 50, baseType: !36, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !121, file: !117, line: 51, baseType: !36, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !117, line: 52, baseType: !114, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !121, file: !117, line: 53, baseType: !49, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !116, file: !117, line: 59, baseType: !59, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !116, file: !117, line: 60, baseType: !114, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !116, file: !117, line: 61, baseType: !130, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !67, line: 19, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !133, line: 59, size: 64, elements: !134)
!133 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!134 = !{!135, !257}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !132, file: !133, line: 60, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !133, line: 18, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !133, line: 20, size: 352, elements: !139)
!139 = !{!140, !141, !142, !144, !145, !146, !147, !149, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !138, file: !133, line: 21, baseType: !36, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !138, file: !133, line: 22, baseType: !36, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !138, file: !133, line: 23, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !34, line: 222, baseType: !54)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !138, file: !133, line: 24, baseType: !143, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !138, file: !133, line: 26, baseType: !36, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !138, file: !133, line: 27, baseType: !36, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !138, file: !133, line: 28, baseType: !148, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !133, line: 16, baseType: !27)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !138, file: !133, line: 29, baseType: !150, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !67, line: 23, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !153, line: 16, size: 1216, elements: !154)
!153 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!154 = !{!155, !158, !159, !202, !203, !204, !242, !243}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !152, file: !153, line: 17, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !157, line: 16, baseType: !54)
!157 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 18, baseType: !87, size: 64, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !152, file: !153, line: 19, baseType: !160, size: 960, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !157, line: 17, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !162, line: 4, size: 960, elements: !163)
!162 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !{!164, !166, !167, !169, !170, !172, !173, !175, !177, !179, !180, !181, !182, !183, !184, !186, !187, !189, !190, !195, !196, !197}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !161, file: !162, line: 6, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !34, line: 232, baseType: !35)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !161, file: !162, line: 7, baseType: !165, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !161, file: !162, line: 8, baseType: !168, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !34, line: 227, baseType: !35)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !161, file: !162, line: 9, baseType: !168, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !161, file: !162, line: 10, baseType: !171, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !34, line: 217, baseType: !35)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !161, file: !162, line: 11, baseType: !171, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !161, file: !162, line: 13, baseType: !174, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !34, line: 212, baseType: !35)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !161, file: !162, line: 14, baseType: !176, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !34, line: 304, baseType: !35)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !161, file: !162, line: 15, baseType: !178, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !34, line: 309, baseType: !35)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !161, file: !162, line: 16, baseType: !35, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !161, file: !162, line: 17, baseType: !165, size: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !161, file: !162, line: 18, baseType: !165, size: 32, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !161, file: !162, line: 19, baseType: !143, size: 32, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !161, file: !162, line: 20, baseType: !143, size: 32, offset: 416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !161, file: !162, line: 21, baseType: !185, size: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !34, line: 237, baseType: !47)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !161, file: !162, line: 22, baseType: !185, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !161, file: !162, line: 23, baseType: !188, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !34, line: 242, baseType: !54)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !161, file: !162, line: 24, baseType: !188, size: 32, offset: 544)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !161, file: !162, line: 26, baseType: !191, size: 64, offset: 576)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !34, line: 288, size: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !191, file: !34, line: 288, baseType: !46, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !191, file: !34, line: 288, baseType: !47, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !161, file: !162, line: 27, baseType: !191, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !161, file: !162, line: 28, baseType: !191, size: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !161, file: !162, line: 29, baseType: !198, size: 192, offset: 768)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 192, elements: !200)
!199 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!200 = !{!201}
!201 = !DISubrange(count: 3)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !152, file: !153, line: 21, baseType: !143, size: 32, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !152, file: !153, line: 22, baseType: !143, size: 32, offset: 1120)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !152, file: !153, line: 24, baseType: !205, size: 32, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !67, line: 20, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !208, line: 50, size: 320, elements: !209)
!208 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!209 = !{!210, !211, !223, !227, !228, !233, !234, !239, !240, !241}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !207, file: !208, line: 51, baseType: !49, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !207, file: !208, line: 52, baseType: !212, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !67, line: 21, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !84, line: 89, size: 160, elements: !215)
!215 = !{!216, !217, !218, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !214, file: !84, line: 90, baseType: !156, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !84, line: 91, baseType: !87, size: 64, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !214, file: !84, line: 93, baseType: !219, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !212, !205}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !84, line: 94, baseType: !27, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !207, file: !208, line: 54, baseType: !224, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !225, line: 98, baseType: !226)
!225 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!226 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !207, file: !208, line: 56, baseType: !46, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !207, file: !208, line: 58, baseType: !229, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !208, line: 45, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!36, !205, !36, !59}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !208, line: 59, baseType: !27, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !207, file: !208, line: 61, baseType: !235, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !208, line: 46, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !205, !49, !36, !59}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !207, file: !208, line: 62, baseType: !27, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !207, file: !208, line: 70, baseType: !74, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !208, line: 72, baseType: !205, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !152, file: !153, line: 37, baseType: !35, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !152, file: !153, line: 38, baseType: !35, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !138, file: !133, line: 30, baseType: !136, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !138, file: !133, line: 34, baseType: !35, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !138, file: !133, line: 40, baseType: !35, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !138, file: !133, line: 43, baseType: !35, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !138, file: !133, line: 45, baseType: !35, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !138, file: !133, line: 46, baseType: !35, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !138, file: !133, line: 47, baseType: !35, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !138, file: !133, line: 48, baseType: !35, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !138, file: !133, line: 49, baseType: !35, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !138, file: !133, line: 50, baseType: !35, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !138, file: !133, line: 52, baseType: !35, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !138, file: !133, line: 53, baseType: !35, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !138, file: !133, line: 55, baseType: !54, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !133, line: 61, baseType: !130, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !116, file: !117, line: 62, baseType: !259, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !117, line: 41, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !117, line: 43, size: 64, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !117, line: 44, baseType: !259, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !261, file: !117, line: 45, baseType: !27, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !116, file: !117, line: 63, baseType: !266, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !117, line: 32, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !117, line: 34, size: 96, elements: !269)
!269 = !{!270, !275, !276}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !268, file: !117, line: 35, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !117, line: 30, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !27}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !117, line: 36, baseType: !27, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !117, line: 37, baseType: !266, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !116, file: !117, line: 64, baseType: !205, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !100, file: !84, line: 120, baseType: !279, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !67, line: 17, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !282, line: 38, size: 2496, elements: !283)
!282 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!283 = !{!284, !287, !288, !289, !290, !291, !465, !466, !467, !470, !471, !472, !473, !474, !475, !476, !477, !488, !489, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !281, file: !282, line: 39, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !281, file: !282, line: 40, baseType: !114, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !281, file: !282, line: 42, baseType: !205, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !281, file: !282, line: 43, baseType: !206, size: 320, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !281, file: !282, line: 45, baseType: !49, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !281, file: !282, line: 47, baseType: !292, size: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !67, line: 26, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !296, line: 121, size: 896, elements: !297)
!296 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!297 = !{!298, !299, !353, !354, !357, !363, !365, !370, !375, !433, !434, !435, !436, !437, !438, !439, !440, !441, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !296, line: 122, baseType: !27, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !295, file: !296, line: 123, baseType: !300, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !67, line: 24, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !303, line: 30, size: 384, elements: !304)
!303 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !332, !333, !334, !345}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !303, line: 31, baseType: !27, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !302, file: !303, line: 33, baseType: !35, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !302, file: !303, line: 35, baseType: !35, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !302, file: !303, line: 38, baseType: !35, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !302, file: !303, line: 44, baseType: !35, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !302, file: !303, line: 46, baseType: !35, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !302, file: !303, line: 49, baseType: !35, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !302, file: !303, line: 51, baseType: !35, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !302, file: !303, line: 54, baseType: !35, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !302, file: !303, line: 56, baseType: !35, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !302, file: !303, line: 57, baseType: !35, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !302, file: !303, line: 59, baseType: !35, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !302, file: !303, line: 60, baseType: !35, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !302, file: !303, line: 62, baseType: !35, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !302, file: !303, line: 64, baseType: !35, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !302, file: !303, line: 67, baseType: !35, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !302, file: !303, line: 69, baseType: !35, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !302, file: !303, line: 71, baseType: !35, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !302, file: !303, line: 74, baseType: !35, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !302, file: !303, line: 75, baseType: !35, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !302, file: !303, line: 77, baseType: !35, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !302, file: !303, line: 107, baseType: !35, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !302, file: !303, line: 110, baseType: !328, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !67, line: 31, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !300}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !302, file: !303, line: 117, baseType: !49, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !302, file: !303, line: 119, baseType: !205, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !302, file: !303, line: 121, baseType: !335, size: 160, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !58, line: 20, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !58, line: 22, size: 160, elements: !337)
!337 = !{!338, !339, !341, !342, !343, !344}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !336, file: !58, line: 23, baseType: !62, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !336, file: !58, line: 24, baseType: !340, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !336, file: !58, line: 25, baseType: !340, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !336, file: !58, line: 26, baseType: !340, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !336, file: !58, line: 27, baseType: !37, size: 8, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !58, line: 28, baseType: !37, size: 8, offset: 136)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !302, file: !303, line: 124, baseType: !346, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !347, line: 16, baseType: !348)
!347 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !347, line: 18, size: 64, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !347, line: 19, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !347, line: 20, baseType: !351, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !295, file: !296, line: 124, baseType: !300, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !295, file: !296, line: 126, baseType: !355, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !356, line: 17, baseType: !54)
!356 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !295, file: !296, line: 128, baseType: !358, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !359, line: 19, baseType: !360)
!359 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{!60, !293, !36, !59}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !295, file: !296, line: 129, baseType: !364, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !359, line: 22, baseType: !360)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !295, file: !296, line: 130, baseType: !366, size: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !359, line: 20, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{!60, !293, !130, !143}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !295, file: !296, line: 131, baseType: !371, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !359, line: 23, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DISubroutineType(types: !374)
!374 = !{!130, !293, !130, !143}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !295, file: !296, line: 133, baseType: !376, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !296, line: 16, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !296, line: 18, size: 960, elements: !379)
!379 = !{!380, !381, !393, !395, !396, !397, !398, !399, !400, !401, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !378, file: !296, line: 19, baseType: !355, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !378, file: !296, line: 21, baseType: !382, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !384, line: 297, size: 128, elements: !385)
!384 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!385 = !{!386, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !383, file: !384, line: 298, baseType: !387, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !34, line: 409, baseType: !388)
!388 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !383, file: !384, line: 299, baseType: !390, size: 112, offset: 16)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 112, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 14)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !378, file: !296, line: 22, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !34, line: 404, baseType: !35)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !378, file: !296, line: 23, baseType: !59, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !378, file: !296, line: 24, baseType: !87, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !296, line: 26, baseType: !54, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !378, file: !296, line: 28, baseType: !54, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !378, file: !296, line: 29, baseType: !54, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !378, file: !296, line: 30, baseType: !54, size: 32, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !378, file: !296, line: 38, baseType: !402, size: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !67, line: 32, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !293}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !378, file: !296, line: 40, baseType: !27, size: 32, offset: 352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !378, file: !296, line: 42, baseType: !206, size: 320, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !378, file: !296, line: 43, baseType: !205, size: 32, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !378, file: !296, line: 45, baseType: !59, size: 32, offset: 736)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !378, file: !296, line: 47, baseType: !59, size: 32, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !378, file: !296, line: 49, baseType: !61, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !378, file: !296, line: 51, baseType: !376, size: 32, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !378, file: !296, line: 52, baseType: !293, size: 32, offset: 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !378, file: !296, line: 54, baseType: !49, size: 32, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !378, file: !296, line: 56, baseType: !35, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !378, file: !296, line: 57, baseType: !35, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !378, file: !296, line: 58, baseType: !35, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !378, file: !296, line: 60, baseType: !35, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !378, file: !296, line: 61, baseType: !35, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !378, file: !296, line: 62, baseType: !35, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !378, file: !296, line: 63, baseType: !35, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !378, file: !296, line: 64, baseType: !35, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !378, file: !296, line: 65, baseType: !35, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !378, file: !296, line: 66, baseType: !35, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !378, file: !296, line: 67, baseType: !35, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !378, file: !296, line: 70, baseType: !35, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !378, file: !296, line: 72, baseType: !35, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !378, file: !296, line: 73, baseType: !35, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !378, file: !296, line: 74, baseType: !35, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !378, file: !296, line: 76, baseType: !35, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !378, file: !296, line: 77, baseType: !35, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !378, file: !296, line: 78, baseType: !35, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !295, file: !296, line: 135, baseType: !143, size: 32, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !295, file: !296, line: 137, baseType: !205, size: 32, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !295, file: !296, line: 139, baseType: !114, size: 32, offset: 352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !296, line: 141, baseType: !54, size: 32, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !295, file: !296, line: 143, baseType: !382, size: 32, offset: 416)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !295, file: !296, line: 144, baseType: !394, size: 32, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !295, file: !296, line: 145, baseType: !87, size: 64, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !295, file: !296, line: 147, baseType: !87, size: 64, offset: 544)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !295, file: !296, line: 148, baseType: !442, size: 16, offset: 608)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !443, line: 12, baseType: !444)
!443 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !34, line: 186, baseType: !388)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !295, file: !296, line: 154, baseType: !382, size: 32, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !295, file: !296, line: 155, baseType: !394, size: 32, offset: 672)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !295, file: !296, line: 157, baseType: !136, size: 32, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !295, file: !296, line: 159, baseType: !346, size: 64, offset: 736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !295, file: !296, line: 161, baseType: !224, size: 32, offset: 800)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !295, file: !296, line: 163, baseType: !49, size: 32, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !295, file: !296, line: 165, baseType: !35, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !295, file: !296, line: 167, baseType: !35, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !295, file: !296, line: 169, baseType: !35, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !295, file: !296, line: 170, baseType: !35, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !295, file: !296, line: 171, baseType: !35, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !295, file: !296, line: 173, baseType: !35, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !295, file: !296, line: 174, baseType: !35, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !295, file: !296, line: 175, baseType: !35, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !295, file: !296, line: 176, baseType: !35, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !295, file: !296, line: 178, baseType: !35, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !295, file: !296, line: 179, baseType: !35, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !295, file: !296, line: 180, baseType: !35, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !295, file: !296, line: 181, baseType: !35, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !295, file: !296, line: 183, baseType: !35, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !281, file: !282, line: 48, baseType: !293, size: 32, offset: 480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !281, file: !282, line: 49, baseType: !49, size: 32, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !281, file: !282, line: 51, baseType: !468, size: 32, offset: 544)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !281, file: !282, line: 52, baseType: !49, size: 32, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !281, file: !282, line: 53, baseType: !49, size: 32, offset: 608)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !281, file: !282, line: 55, baseType: !346, size: 64, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !281, file: !282, line: 56, baseType: !49, size: 32, offset: 704)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !281, file: !282, line: 58, baseType: !105, size: 160, offset: 736)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !281, file: !282, line: 59, baseType: !105, size: 160, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !281, file: !282, line: 61, baseType: !105, size: 160, offset: 1056)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !281, file: !282, line: 62, baseType: !478, size: 96, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !58, line: 32, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !58, line: 37, size: 96, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !479, file: !58, line: 38, baseType: !340, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !479, file: !58, line: 39, baseType: !340, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !479, file: !58, line: 40, baseType: !484, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !58, line: 34, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !340, !340, !340}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !281, file: !282, line: 63, baseType: !335, size: 160, offset: 1312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !281, file: !282, line: 65, baseType: !490, size: 224, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !491, line: 31, baseType: !492)
!491 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 25, size: 224, elements: !493)
!493 = !{!494, !502, !503, !504, !505}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !492, file: !491, line: 26, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !491, line: 16, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !491, line: 18, size: 96, elements: !498)
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !497, file: !491, line: 19, baseType: !27, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !497, file: !491, line: 20, baseType: !49, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !491, line: 21, baseType: !495, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !492, file: !491, line: 27, baseType: !496, size: 96, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !491, line: 28, baseType: !59, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !492, file: !491, line: 29, baseType: !49, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !492, file: !491, line: 30, baseType: !114, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !281, file: !282, line: 66, baseType: !490, size: 224, offset: 1696)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !281, file: !282, line: 68, baseType: !49, size: 32, offset: 1920)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !281, file: !282, line: 69, baseType: !49, size: 32, offset: 1952)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !281, file: !282, line: 71, baseType: !293, size: 32, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !281, file: !282, line: 72, baseType: !300, size: 32, offset: 2016)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !281, file: !282, line: 73, baseType: !300, size: 32, offset: 2048)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !281, file: !282, line: 75, baseType: !279, size: 32, offset: 2080)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !281, file: !282, line: 77, baseType: !87, size: 64, offset: 2112)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !281, file: !282, line: 78, baseType: !87, size: 64, offset: 2176)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !281, file: !282, line: 79, baseType: !87, size: 64, offset: 2240)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !281, file: !282, line: 80, baseType: !87, size: 64, offset: 2304)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !281, file: !282, line: 81, baseType: !87, size: 64, offset: 2368)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !281, file: !282, line: 82, baseType: !87, size: 64, offset: 2432)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !100, file: !84, line: 121, baseType: !114, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !100, file: !84, line: 122, baseType: !114, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !100, file: !84, line: 123, baseType: !522, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !84, line: 103, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 98, size: 1344, elements: !525)
!525 = !{!526, !527, !528, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !524, file: !84, line: 99, baseType: !151, size: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !524, file: !84, line: 100, baseType: !136, size: 32, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !524, file: !84, line: 101, baseType: !136, size: 32, offset: 1248)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !524, file: !84, line: 102, baseType: !49, size: 32, offset: 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !100, file: !84, line: 124, baseType: !205, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !100, file: !84, line: 126, baseType: !27, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !100, file: !84, line: 127, baseType: !49, size: 32, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !100, file: !84, line: 128, baseType: !49, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !100, file: !84, line: 130, baseType: !535, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !84, line: 112, baseType: !95)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !100, file: !84, line: 131, baseType: !74, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !83, file: !84, line: 81, baseType: !49, size: 32, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !83, file: !84, line: 82, baseType: !49, size: 32, offset: 160)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !83, file: !84, line: 83, baseType: !27, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !69, line: 236, baseType: !49, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !68, file: !69, line: 238, baseType: !542, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DISubroutineType(types: !544)
!544 = !{!52, !205}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !68, file: !69, line: 240, baseType: !546, size: 32, offset: 352)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DISubroutineType(types: !548)
!548 = !{!52, !279}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !68, file: !69, line: 242, baseType: !546, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !68, file: !69, line: 243, baseType: !546, size: 32, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !68, file: !69, line: 244, baseType: !552, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !279}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !68, file: !69, line: 245, baseType: !552, size: 32, offset: 480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !68, file: !69, line: 247, baseType: !552, size: 32, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !68, file: !69, line: 249, baseType: !33, size: 32, offset: 544)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !68, file: !69, line: 250, baseType: !33, size: 32, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !68, file: !69, line: 251, baseType: !33, size: 32, offset: 608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !68, file: !69, line: 252, baseType: !33, size: 32, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !68, file: !69, line: 253, baseType: !33, size: 32, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !68, file: !69, line: 254, baseType: !33, size: 32, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !68, file: !69, line: 255, baseType: !33, size: 32, offset: 736)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !68, file: !69, line: 256, baseType: !33, size: 32, offset: 768)
!565 = !DIGlobalVariableExpression(var: !566)
!566 = distinct !DIGlobalVariable(name: "ngx_http_combined_fmt", scope: !2, file: !3, line: 218, type: !87, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568)
!568 = distinct !DIGlobalVariable(name: "ngx_http_log_vars", scope: !2, file: !3, line: 224, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 1280, elements: !1823)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_var_t", file: !3, line: 90, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 86, size: 128, elements: !572)
!572 = !{!573, !574, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !571, file: !3, line: 87, baseType: !87, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !571, file: !3, line: 88, baseType: !59, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !571, file: !3, line: 89, baseType: !576, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_log_op_run_pt", file: !3, line: 19, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!36, !580, !36, !1811}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !582, line: 16, baseType: !583)
!582 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !584, line: 364, size: 5376, elements: !585)
!584 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!585 = !{!586, !588, !589, !590, !591, !592, !593, !598, !599, !812, !1372, !1373, !1374, !1375, !1414, !1444, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1489, !1500, !1507, !1508, !1510, !1511, !1524, !1525, !1526, !1527, !1528, !1529, !1707, !1711, !1716, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !583, file: !584, line: 365, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 191, baseType: !35)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !583, file: !584, line: 367, baseType: !293, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !583, file: !584, line: 369, baseType: !26, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !583, file: !584, line: 370, baseType: !26, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !583, file: !584, line: 371, baseType: !26, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !583, file: !584, line: 372, baseType: !26, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !583, file: !584, line: 374, baseType: !594, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !584, line: 361, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !580}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !583, file: !584, line: 375, baseType: !594, size: 32, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !583, file: !584, line: 378, baseType: !600, size: 32, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !582, line: 18, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !603, line: 65, size: 3008, elements: !604)
!603 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!604 = !{!605, !606, !607, !608, !612, !613, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !770, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !602, file: !603, line: 66, baseType: !151, size: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !602, file: !603, line: 67, baseType: !105, size: 160, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !602, file: !603, line: 68, baseType: !587, size: 32, offset: 1376)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !602, file: !603, line: 69, baseType: !609, size: 128, offset: 1408)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 16)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !602, file: !603, line: 70, baseType: !609, size: 128, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !602, file: !603, line: 72, baseType: !614, size: 32, offset: 1664)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !157, line: 18, baseType: !168)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !602, file: !603, line: 73, baseType: !46, size: 32, offset: 1696)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !602, file: !603, line: 74, baseType: !46, size: 32, offset: 1728)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !602, file: !603, line: 75, baseType: !46, size: 32, offset: 1760)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !602, file: !603, line: 76, baseType: !46, size: 32, offset: 1792)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !602, file: !603, line: 77, baseType: !46, size: 32, offset: 1824)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !602, file: !603, line: 79, baseType: !87, size: 64, offset: 1856)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !602, file: !603, line: 80, baseType: !87, size: 64, offset: 1920)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !602, file: !603, line: 81, baseType: !609, size: 128, offset: 1984)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !602, file: !603, line: 83, baseType: !59, size: 32, offset: 2112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !602, file: !603, line: 84, baseType: !59, size: 32, offset: 2144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !602, file: !603, line: 85, baseType: !143, size: 32, offset: 2176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !602, file: !603, line: 86, baseType: !143, size: 32, offset: 2208)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !602, file: !603, line: 88, baseType: !49, size: 32, offset: 2240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !602, file: !603, line: 89, baseType: !49, size: 32, offset: 2272)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !602, file: !603, line: 90, baseType: !49, size: 32, offset: 2304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !602, file: !603, line: 91, baseType: !49, size: 32, offset: 2336)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !602, file: !603, line: 93, baseType: !136, size: 32, offset: 2368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !602, file: !603, line: 95, baseType: !633, size: 32, offset: 2400)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !582, line: 19, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !603, line: 157, size: 544, elements: !636)
!636 = !{!637, !652, !713, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !769}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !635, file: !603, line: 158, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !603, line: 154, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 145, size: 480, elements: !641)
!641 = !{!642, !643, !644, !645, !648, !649, !650, !651}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !640, file: !603, line: 146, baseType: !478, size: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !640, file: !603, line: 147, baseType: !335, size: 160, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !640, file: !603, line: 148, baseType: !346, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !640, file: !603, line: 149, baseType: !646, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !225, line: 106, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !640, file: !603, line: 150, baseType: !646, size: 32, offset: 352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !640, file: !603, line: 151, baseType: !143, size: 32, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !640, file: !603, line: 152, baseType: !49, size: 32, offset: 416)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !640, file: !603, line: 153, baseType: !49, size: 32, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !635, file: !603, line: 159, baseType: !653, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !655, line: 59, baseType: !656)
!655 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 34, size: 800, elements: !657)
!657 = !{!658, !665, !666, !667, !675, !676, !677, !686, !687, !688, !689, !708, !709, !710, !711, !712}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !656, file: !655, line: 35, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !660, line: 21, baseType: !661)
!660 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 16, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !661, file: !660, line: 17, baseType: !646, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !661, file: !660, line: 19, baseType: !646, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !656, file: !655, line: 37, baseType: !59, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !656, file: !655, line: 38, baseType: !59, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !656, file: !655, line: 40, baseType: !668, size: 32, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !655, line: 16, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !655, line: 18, size: 96, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !670, file: !655, line: 19, baseType: !33, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !655, line: 20, baseType: !668, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !655, line: 21, baseType: !33, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !656, file: !655, line: 41, baseType: !668, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !656, file: !655, line: 42, baseType: !669, size: 96, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !656, file: !655, line: 44, baseType: !678, size: 32, offset: 288)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !655, line: 31, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 25, size: 128, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !680, file: !655, line: 26, baseType: !49, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !680, file: !655, line: 27, baseType: !49, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !680, file: !655, line: 29, baseType: !49, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !680, file: !655, line: 30, baseType: !49, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !656, file: !655, line: 45, baseType: !49, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !656, file: !655, line: 47, baseType: !36, size: 32, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !656, file: !655, line: 48, baseType: !36, size: 32, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !656, file: !655, line: 50, baseType: !690, size: 256, offset: 416)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !660, line: 37, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 24, size: 256, elements: !692)
!692 = !{!693, !695, !696, !697, !707}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !691, file: !660, line: 26, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !691, file: !660, line: 28, baseType: !694, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !691, file: !660, line: 29, baseType: !49, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !691, file: !660, line: 30, baseType: !698, size: 128, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !699, line: 19, baseType: !700)
!699 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !699, line: 17, size: 128, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !700, file: !699, line: 18, baseType: !703, size: 128)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 128, elements: !705)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!705 = !{!706}
!706 = !DISubrange(count: 4)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !691, file: !660, line: 36, baseType: !49, size: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !656, file: !655, line: 52, baseType: !36, size: 32, offset: 672)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !656, file: !655, line: 53, baseType: !37, size: 8, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !656, file: !655, line: 55, baseType: !35, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !656, file: !655, line: 57, baseType: !27, size: 32, offset: 736)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !656, file: !655, line: 58, baseType: !27, size: 32, offset: 768)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !635, file: !603, line: 161, baseType: !714, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !153, line: 62, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 50, size: 384, elements: !717)
!717 = !{!718, !719, !720, !722, !727, !729, !731, !732, !733}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !153, line: 51, baseType: !87, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !716, file: !153, line: 52, baseType: !59, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !716, file: !153, line: 53, baseType: !721, size: 96, offset: 96)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 96, elements: !200)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !716, file: !153, line: 55, baseType: !723, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !153, line: 45, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!61, !27}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !716, file: !153, line: 56, baseType: !728, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !153, line: 46, baseType: !724)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !716, file: !153, line: 57, baseType: !730, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !153, line: 47, baseType: !272)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !153, line: 58, baseType: !27, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !716, file: !153, line: 60, baseType: !36, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !716, file: !153, line: 61, baseType: !49, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !635, file: !603, line: 163, baseType: !143, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !635, file: !603, line: 164, baseType: !59, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !635, file: !603, line: 166, baseType: !46, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !635, file: !603, line: 168, baseType: !46, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !635, file: !603, line: 170, baseType: !49, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !635, file: !603, line: 171, baseType: !49, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !635, file: !603, line: 172, baseType: !61, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !635, file: !603, line: 173, baseType: !61, size: 32, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !635, file: !603, line: 174, baseType: !61, size: 32, offset: 352)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !635, file: !603, line: 176, baseType: !49, size: 32, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !635, file: !603, line: 177, baseType: !61, size: 32, offset: 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !635, file: !603, line: 178, baseType: !61, size: 32, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !635, file: !603, line: 180, baseType: !747, size: 32, offset: 480)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !282, line: 25, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !282, line: 29, size: 320, elements: !750)
!750 = !{!751, !752, !762, !767, !768}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !282, line: 30, baseType: !27, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !749, file: !282, line: 31, baseType: !753, size: 192, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !754, line: 22, baseType: !755)
!754 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 16, size: 192, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !755, file: !754, line: 17, baseType: !36, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !754, line: 18, baseType: !59, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !754, line: 19, baseType: !87, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !755, file: !754, line: 20, baseType: !205, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !755, file: !754, line: 21, baseType: !49, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !749, file: !282, line: 32, baseType: !763, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !282, line: 27, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!52, !747, !27}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !749, file: !282, line: 33, baseType: !27, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !749, file: !282, line: 34, baseType: !49, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !635, file: !603, line: 182, baseType: !49, size: 32, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !603, line: 96, baseType: !771, size: 32, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !603, line: 62, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 39, size: 576, elements: !774)
!774 = !{!775, !776, !777, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !773, file: !603, line: 40, baseType: !335, size: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !773, file: !603, line: 41, baseType: !346, size: 64, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !773, file: !603, line: 43, baseType: !778, size: 96, offset: 224)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 12)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !603, line: 46, baseType: !35, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !773, file: !603, line: 47, baseType: !35, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !773, file: !603, line: 48, baseType: !35, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !773, file: !603, line: 49, baseType: !35, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !773, file: !603, line: 50, baseType: !35, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !773, file: !603, line: 51, baseType: !35, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !773, file: !603, line: 52, baseType: !35, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !773, file: !603, line: 53, baseType: !35, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !773, file: !603, line: 56, baseType: !614, size: 32, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !773, file: !603, line: 57, baseType: !46, size: 32, offset: 416)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !773, file: !603, line: 58, baseType: !46, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !773, file: !603, line: 59, baseType: !59, size: 32, offset: 480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !773, file: !603, line: 60, baseType: !143, size: 32, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !773, file: !603, line: 61, baseType: !61, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !602, file: !603, line: 102, baseType: !61, size: 32, offset: 2464)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !602, file: !603, line: 103, baseType: !61, size: 32, offset: 2496)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !602, file: !603, line: 104, baseType: !61, size: 32, offset: 2528)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !602, file: !603, line: 105, baseType: !61, size: 32, offset: 2560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !602, file: !603, line: 107, baseType: !301, size: 384, offset: 2592)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !602, file: !603, line: 109, baseType: !35, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !602, file: !603, line: 110, baseType: !35, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !602, file: !603, line: 112, baseType: !35, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !602, file: !603, line: 113, baseType: !35, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !602, file: !603, line: 114, baseType: !35, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !602, file: !603, line: 115, baseType: !35, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !602, file: !603, line: 116, baseType: !35, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !602, file: !603, line: 117, baseType: !35, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !602, file: !603, line: 118, baseType: !35, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !602, file: !603, line: 119, baseType: !35, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !602, file: !603, line: 121, baseType: !35, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !602, file: !603, line: 122, baseType: !35, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !583, file: !584, line: 381, baseType: !813, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !582, line: 17, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !816, line: 313, size: 4096, elements: !817)
!816 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!817 = !{!818, !823, !824, !865, !944, !945, !967, !976, !1099, !1100, !1101, !1139, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1317, !1321, !1322, !1326, !1327, !1328, !1329, !1330, !1334, !1338, !1342, !1343, !1355, !1356, !1357, !1358, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !815, file: !816, line: 314, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !816, line: 309, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !580, !813}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !815, file: !816, line: 315, baseType: !819, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !815, file: !816, line: 317, baseType: !825, size: 480, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !826, line: 22, baseType: !827)
!826 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !826, line: 36, size: 480, elements: !828)
!828 = !{!829, !830, !831, !832, !834, !835, !836, !842, !847, !849, !850, !859, !860, !861, !862, !863, !864}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !827, file: !826, line: 37, baseType: !293, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !827, file: !826, line: 39, baseType: !382, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !827, file: !826, line: 40, baseType: !394, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !826, line: 41, baseType: !833, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !827, file: !826, line: 43, baseType: !49, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !827, file: !826, line: 44, baseType: !61, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !827, file: !826, line: 46, baseType: !837, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !826, line: 24, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!52, !841, !27}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !827, file: !826, line: 47, baseType: !843, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !826, line: 26, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !841, !27, !49}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !827, file: !826, line: 48, baseType: !848, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !826, line: 28, baseType: !844)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !827, file: !826, line: 49, baseType: !27, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !827, file: !826, line: 56, baseType: !851, size: 32, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !853, line: 78, baseType: !854)
!853 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
