; ModuleID = 'src/http/modules/ngx_http_upstream_ip_hash_module.c'
source_filename = "src/http/modules/ngx_http_upstream_ip_hash_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_upstream_ip_hash_module_ctx", scope: !2, file: !3, line: 49, type: !588, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !69)
!3 = !DIFile(filename: "src/http/modules/ngx_http_upstream_ip_hash_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !13, !16, !40, !43, !66, !68}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 17, size: 96, elements: !10)
!10 = !{!11, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !9, file: !8, line: 18, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !9, file: !8, line: 19, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !9, file: !8, line: 20, baseType: !12, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !18, line: 16, size: 128, elements: !19)
!18 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = !{!20, !24, !27, !34}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !17, file: !18, line: 17, baseType: !21, size: 16)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !22, line: 409, baseType: !23)
!22 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !17, file: !18, line: 18, baseType: !25, size: 16, offset: 16)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !18, line: 12, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 186, baseType: !23)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !17, file: !18, line: 19, baseType: !28, size: 32, offset: 32)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !18, line: 14, size: 32, elements: !29)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !28, file: !18, line: 14, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !18, line: 13, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 191, baseType: !33)
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !17, file: !18, line: 20, baseType: !35, size: 64, offset: 64)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !38)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 181, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 8)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !42, line: 64, baseType: !37)
!42 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !18, line: 34, size: 224, elements: !45)
!45 = !{!46, !47, !48, !49, !65}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !44, file: !18, line: 35, baseType: !21, size: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !44, file: !18, line: 36, baseType: !25, size: 16, offset: 16)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !44, file: !18, line: 37, baseType: !32, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !44, file: !18, line: 38, baseType: !50, size: 128, offset: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !18, line: 23, size: 128, elements: !51)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !50, file: !18, line: 28, baseType: !53, size: 128)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !18, line: 24, size: 128, elements: !54)
!54 = !{!55, !59, !61}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !53, file: !18, line: 25, baseType: !56, size: 128)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !53, file: !18, line: 26, baseType: !60, size: 128)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !38)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !53, file: !18, line: 27, baseType: !62, size: 128)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 4)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !44, file: !18, line: 39, baseType: !32, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !67, line: 79, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !22, line: 125, baseType: !33)
!69 = !{!70, !0, !580, !585}
!70 = !DIGlobalVariableExpression(var: !71)
!71 = distinct !DIGlobalVariable(name: "ngx_http_upstream_ip_hash_module", scope: !2, file: !3, line: 64, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !73, line: 15, baseType: !74)
!73 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !75, line: 222, size: 800, elements: !76)
!75 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!76 = !{!77, !78, !79, !82, !83, !84, !85, !88, !89, !553, !554, !560, !564, !565, !566, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !74, file: !75, line: 223, baseType: !66, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !74, file: !75, line: 224, baseType: !66, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 226, baseType: !80, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !74, file: !75, line: 228, baseType: !66, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !74, file: !75, line: 229, baseType: !66, size: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !74, file: !75, line: 231, baseType: !66, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !74, file: !75, line: 232, baseType: !86, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !74, file: !75, line: 234, baseType: !13, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !74, file: !75, line: 235, baseType: !90, size: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !73, line: 22, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !93, line: 77, size: 224, elements: !94)
!93 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!94 = !{!95, !103, !104, !550, !551, !552}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !93, line: 78, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !97, line: 19, baseType: !98)
!97 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 16, size: 64, elements: !99)
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !98, file: !97, line: 17, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 120, baseType: !33)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !97, line: 18, baseType: !40, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !93, line: 79, baseType: !66, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !92, file: !93, line: 80, baseType: !105, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DISubroutineType(types: !107)
!107 = !{!80, !108, !90, !13}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !73, line: 16, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !93, line: 116, size: 384, elements: !111)
!111 = !{!112, !113, !291, !532, !533, !534, !543, !544, !545, !546, !547, !549}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !93, line: 117, baseType: !80, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !110, file: !93, line: 118, baseType: !114, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !116, line: 22, baseType: !117)
!116 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 16, size: 160, elements: !118)
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !117, file: !116, line: 17, baseType: !13, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !117, file: !116, line: 18, baseType: !66, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !117, file: !116, line: 19, baseType: !101, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !117, file: !116, line: 20, baseType: !66, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !117, file: !116, line: 21, baseType: !124, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !73, line: 18, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !127, line: 57, size: 320, elements: !128)
!127 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!128 = !{!129, !137, !138, !139, !271, !278, !290}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !126, file: !127, line: 58, baseType: !130, size: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !127, line: 54, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 49, size: 128, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !131, file: !127, line: 50, baseType: !40, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !131, file: !127, line: 51, baseType: !40, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 52, baseType: !124, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !131, file: !127, line: 53, baseType: !66, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !126, file: !127, line: 59, baseType: !101, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !126, file: !127, line: 60, baseType: !124, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !126, file: !127, line: 61, baseType: !140, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !73, line: 19, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !143, line: 59, size: 64, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !270}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !142, file: !143, line: 60, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !143, line: 18, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !143, line: 20, size: 352, elements: !149)
!149 = !{!150, !151, !152, !155, !156, !157, !158, !160, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !148, file: !143, line: 21, baseType: !40, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !148, file: !143, line: 22, baseType: !40, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !148, file: !143, line: 23, baseType: !153, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !22, line: 222, baseType: !154)
!154 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !148, file: !143, line: 24, baseType: !153, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !148, file: !143, line: 26, baseType: !40, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !148, file: !143, line: 27, baseType: !40, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !148, file: !143, line: 28, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !143, line: 16, baseType: !13)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !148, file: !143, line: 29, baseType: !161, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !73, line: 23, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !164, line: 16, size: 1216, elements: !165)
!164 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!165 = !{!166, !169, !170, !215, !216, !217, !255, !256}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !163, file: !164, line: 17, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !168, line: 16, baseType: !154)
!168 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !164, line: 18, baseType: !96, size: 64, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !163, file: !164, line: 19, baseType: !171, size: 960, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !168, line: 17, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !173, line: 4, size: 960, elements: !174)
!173 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!174 = !{!175, !177, !178, !180, !181, !183, !184, !186, !188, !190, !191, !192, !193, !194, !195, !198, !199, !201, !202, !208, !209, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !172, file: !173, line: 6, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !22, line: 232, baseType: !33)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !172, file: !173, line: 7, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !172, file: !173, line: 8, baseType: !179, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !22, line: 227, baseType: !33)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !172, file: !173, line: 9, baseType: !179, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !172, file: !173, line: 10, baseType: !182, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !22, line: 217, baseType: !33)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !172, file: !173, line: 11, baseType: !182, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !172, file: !173, line: 13, baseType: !185, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !22, line: 212, baseType: !33)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !172, file: !173, line: 14, baseType: !187, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !22, line: 304, baseType: !33)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !172, file: !173, line: 15, baseType: !189, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !22, line: 309, baseType: !33)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !172, file: !173, line: 16, baseType: !33, size: 32, offset: 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !172, file: !173, line: 17, baseType: !176, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !172, file: !173, line: 18, baseType: !176, size: 32, offset: 352)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !172, file: !173, line: 19, baseType: !153, size: 32, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !172, file: !173, line: 20, baseType: !153, size: 32, offset: 416)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !172, file: !173, line: 21, baseType: !196, size: 32, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !22, line: 237, baseType: !197)
!197 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !172, file: !173, line: 22, baseType: !196, size: 32, offset: 480)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !172, file: !173, line: 23, baseType: !200, size: 32, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !22, line: 242, baseType: !154)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !172, file: !173, line: 24, baseType: !200, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !172, file: !173, line: 26, baseType: !203, size: 64, offset: 576)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !22, line: 288, size: 64, elements: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !203, file: !22, line: 288, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !22, line: 75, baseType: !197)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !203, file: !22, line: 288, baseType: !197, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !172, file: !173, line: 27, baseType: !203, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !172, file: !173, line: 28, baseType: !203, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !172, file: !173, line: 29, baseType: !211, size: 192, offset: 768)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 192, elements: !213)
!212 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!213 = !{!214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !163, file: !164, line: 21, baseType: !153, size: 32, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !163, file: !164, line: 22, baseType: !153, size: 32, offset: 1120)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !163, file: !164, line: 24, baseType: !218, size: 32, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !73, line: 20, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !221, line: 50, size: 320, elements: !222)
!221 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!222 = !{!223, !224, !236, !240, !241, !246, !247, !252, !253, !254}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !220, file: !221, line: 51, baseType: !66, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !220, file: !221, line: 52, baseType: !225, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !73, line: 21, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !93, line: 89, size: 160, elements: !228)
!228 = !{!229, !230, !231, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !227, file: !93, line: 90, baseType: !167, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !93, line: 91, baseType: !96, size: 64, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !227, file: !93, line: 93, baseType: !232, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !225, !218}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !93, line: 94, baseType: !13, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !220, file: !221, line: 54, baseType: !237, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !238, line: 98, baseType: !239)
!238 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!239 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !220, file: !221, line: 56, baseType: !206, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !220, file: !221, line: 58, baseType: !242, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !221, line: 45, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{!40, !218, !40, !101}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !220, file: !221, line: 59, baseType: !13, size: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !220, file: !221, line: 61, baseType: !248, size: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !221, line: 46, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !218, !66, !40, !101}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !220, file: !221, line: 62, baseType: !13, size: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !220, file: !221, line: 70, baseType: !80, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !221, line: 72, baseType: !218, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !163, file: !164, line: 37, baseType: !33, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !163, file: !164, line: 38, baseType: !33, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !148, file: !143, line: 30, baseType: !146, size: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !148, file: !143, line: 34, baseType: !33, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !148, file: !143, line: 40, baseType: !33, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !148, file: !143, line: 43, baseType: !33, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !148, file: !143, line: 45, baseType: !33, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !148, file: !143, line: 46, baseType: !33, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !148, file: !143, line: 47, baseType: !33, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !148, file: !143, line: 48, baseType: !33, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !148, file: !143, line: 49, baseType: !33, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !148, file: !143, line: 50, baseType: !33, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !148, file: !143, line: 52, baseType: !33, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !148, file: !143, line: 53, baseType: !33, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !148, file: !143, line: 55, baseType: !154, size: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !143, line: 61, baseType: !140, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !126, file: !127, line: 62, baseType: !272, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !127, line: 41, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !127, line: 43, size: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !127, line: 44, baseType: !272, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !274, file: !127, line: 45, baseType: !13, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !126, file: !127, line: 63, baseType: !279, size: 32, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !127, line: 32, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !127, line: 34, size: 96, elements: !282)
!282 = !{!283, !288, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !281, file: !127, line: 35, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !127, line: 30, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !13}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !281, file: !127, line: 36, baseType: !13, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !127, line: 37, baseType: !279, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !126, file: !127, line: 64, baseType: !218, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !110, file: !93, line: 120, baseType: !292, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !73, line: 17, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !295, line: 38, size: 2496, elements: !296)
!295 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!296 = !{!297, !300, !301, !302, !303, !304, !478, !479, !480, !483, !484, !485, !486, !487, !488, !489, !490, !501, !502, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !294, file: !295, line: 39, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !294, file: !295, line: 40, baseType: !124, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !294, file: !295, line: 42, baseType: !218, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !294, file: !295, line: 43, baseType: !219, size: 320, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !294, file: !295, line: 45, baseType: !66, size: 32, offset: 416)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !294, file: !295, line: 47, baseType: !305, size: 32, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !73, line: 26, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !309, line: 121, size: 896, elements: !310)
!309 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!310 = !{!311, !312, !368, !369, !372, !379, !381, !386, !391, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !308, file: !309, line: 122, baseType: !13, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !308, file: !309, line: 123, baseType: !313, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !73, line: 24, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !316, line: 30, size: 384, elements: !317)
!316 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !345, !346, !347, !360}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !316, line: 31, baseType: !13, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !315, file: !316, line: 33, baseType: !33, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !315, file: !316, line: 35, baseType: !33, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !315, file: !316, line: 38, baseType: !33, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !315, file: !316, line: 44, baseType: !33, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !315, file: !316, line: 46, baseType: !33, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !315, file: !316, line: 49, baseType: !33, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !315, file: !316, line: 51, baseType: !33, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !315, file: !316, line: 54, baseType: !33, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !315, file: !316, line: 56, baseType: !33, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !315, file: !316, line: 57, baseType: !33, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !315, file: !316, line: 59, baseType: !33, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !315, file: !316, line: 60, baseType: !33, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !315, file: !316, line: 62, baseType: !33, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !315, file: !316, line: 64, baseType: !33, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !315, file: !316, line: 67, baseType: !33, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !315, file: !316, line: 69, baseType: !33, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !315, file: !316, line: 71, baseType: !33, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !315, file: !316, line: 74, baseType: !33, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !315, file: !316, line: 75, baseType: !33, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !315, file: !316, line: 77, baseType: !33, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !315, file: !316, line: 107, baseType: !33, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !315, file: !316, line: 110, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !73, line: 31, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !313}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !315, file: !316, line: 117, baseType: !66, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !315, file: !316, line: 119, baseType: !218, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !315, file: !316, line: 121, baseType: !348, size: 160, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !349, line: 20, baseType: !350)
!349 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !349, line: 22, size: 160, elements: !351)
!351 = !{!352, !354, !356, !357, !358, !359}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !350, file: !349, line: 23, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !349, line: 16, baseType: !66)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !350, file: !349, line: 24, baseType: !355, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !350, file: !349, line: 25, baseType: !355, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !350, file: !349, line: 26, baseType: !355, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !350, file: !349, line: 27, baseType: !41, size: 8, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !350, file: !349, line: 28, baseType: !41, size: 8, offset: 136)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !315, file: !316, line: 124, baseType: !361, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !362, line: 16, baseType: !363)
!362 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !362, line: 18, size: 64, elements: !364)
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !363, file: !362, line: 19, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !362, line: 20, baseType: !366, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !308, file: !309, line: 124, baseType: !313, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !308, file: !309, line: 126, baseType: !370, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !371, line: 17, baseType: !154)
!371 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !308, file: !309, line: 128, baseType: !373, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !374, line: 19, baseType: !375)
!374 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !306, !40, !101}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !22, line: 135, baseType: !154)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !308, file: !309, line: 129, baseType: !380, size: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !374, line: 22, baseType: !375)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !308, file: !309, line: 130, baseType: !382, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !374, line: 20, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{!378, !306, !140, !153}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !308, file: !309, line: 131, baseType: !387, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !374, line: 23, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DISubroutineType(types: !390)
!390 = !{!140, !306, !140, !153}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !308, file: !309, line: 133, baseType: !392, size: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !309, line: 16, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !309, line: 18, size: 960, elements: !395)
!395 = !{!396, !397, !407, !409, !410, !411, !412, !413, !414, !415, !420, !421, !422, !423, !424, !425, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !394, file: !309, line: 19, baseType: !370, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !394, file: !309, line: 21, baseType: !398, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !400, line: 297, size: 128, elements: !401)
!400 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !399, file: !400, line: 298, baseType: !21, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !399, file: !400, line: 299, baseType: !404, size: 112, offset: 16)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 112, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 14)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !394, file: !309, line: 22, baseType: !408, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !22, line: 404, baseType: !33)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !394, file: !309, line: 23, baseType: !101, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !394, file: !309, line: 24, baseType: !96, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !394, file: !309, line: 26, baseType: !154, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !394, file: !309, line: 28, baseType: !154, size: 32, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !394, file: !309, line: 29, baseType: !154, size: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !394, file: !309, line: 30, baseType: !154, size: 32, offset: 288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !394, file: !309, line: 38, baseType: !416, size: 32, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !73, line: 32, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !306}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !394, file: !309, line: 40, baseType: !13, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !394, file: !309, line: 42, baseType: !219, size: 320, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !394, file: !309, line: 43, baseType: !218, size: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !394, file: !309, line: 45, baseType: !101, size: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !394, file: !309, line: 47, baseType: !101, size: 32, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !394, file: !309, line: 49, baseType: !426, size: 32, offset: 800)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !427, line: 16, baseType: !353)
!427 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !394, file: !309, line: 51, baseType: !392, size: 32, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !394, file: !309, line: 52, baseType: !306, size: 32, offset: 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !394, file: !309, line: 54, baseType: !66, size: 32, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !394, file: !309, line: 56, baseType: !33, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !394, file: !309, line: 57, baseType: !33, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !394, file: !309, line: 58, baseType: !33, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !394, file: !309, line: 60, baseType: !33, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !394, file: !309, line: 61, baseType: !33, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !394, file: !309, line: 62, baseType: !33, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !394, file: !309, line: 63, baseType: !33, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !394, file: !309, line: 64, baseType: !33, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !394, file: !309, line: 65, baseType: !33, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !394, file: !309, line: 66, baseType: !33, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !394, file: !309, line: 67, baseType: !33, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !394, file: !309, line: 70, baseType: !33, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !394, file: !309, line: 72, baseType: !33, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !394, file: !309, line: 73, baseType: !33, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !394, file: !309, line: 74, baseType: !33, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !394, file: !309, line: 76, baseType: !33, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !394, file: !309, line: 77, baseType: !33, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !394, file: !309, line: 78, baseType: !33, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !308, file: !309, line: 135, baseType: !153, size: 32, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !308, file: !309, line: 137, baseType: !218, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !308, file: !309, line: 139, baseType: !124, size: 32, offset: 352)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 141, baseType: !154, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !308, file: !309, line: 143, baseType: !398, size: 32, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !308, file: !309, line: 144, baseType: !408, size: 32, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !308, file: !309, line: 145, baseType: !96, size: 64, offset: 480)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !308, file: !309, line: 147, baseType: !96, size: 64, offset: 544)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !308, file: !309, line: 148, baseType: !25, size: 16, offset: 608)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !308, file: !309, line: 154, baseType: !398, size: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !308, file: !309, line: 155, baseType: !408, size: 32, offset: 672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !308, file: !309, line: 157, baseType: !146, size: 32, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !308, file: !309, line: 159, baseType: !361, size: 64, offset: 736)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !308, file: !309, line: 161, baseType: !237, size: 32, offset: 800)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !308, file: !309, line: 163, baseType: !66, size: 32, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !308, file: !309, line: 165, baseType: !33, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !308, file: !309, line: 167, baseType: !33, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !308, file: !309, line: 169, baseType: !33, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !308, file: !309, line: 170, baseType: !33, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !308, file: !309, line: 171, baseType: !33, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !308, file: !309, line: 173, baseType: !33, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !308, file: !309, line: 174, baseType: !33, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !308, file: !309, line: 175, baseType: !33, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !308, file: !309, line: 176, baseType: !33, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !308, file: !309, line: 178, baseType: !33, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !308, file: !309, line: 179, baseType: !33, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !308, file: !309, line: 180, baseType: !33, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !308, file: !309, line: 181, baseType: !33, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !308, file: !309, line: 183, baseType: !33, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !294, file: !295, line: 48, baseType: !306, size: 32, offset: 480)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !294, file: !295, line: 49, baseType: !66, size: 32, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !294, file: !295, line: 51, baseType: !481, size: 32, offset: 544)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !294, file: !295, line: 52, baseType: !66, size: 32, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !294, file: !295, line: 53, baseType: !66, size: 32, offset: 608)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !294, file: !295, line: 55, baseType: !361, size: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !294, file: !295, line: 56, baseType: !66, size: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !294, file: !295, line: 58, baseType: !115, size: 160, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !294, file: !295, line: 59, baseType: !115, size: 160, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !294, file: !295, line: 61, baseType: !115, size: 160, offset: 1056)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !294, file: !295, line: 62, baseType: !491, size: 96, offset: 1216)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !349, line: 32, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !349, line: 37, size: 96, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !492, file: !349, line: 38, baseType: !355, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !492, file: !349, line: 39, baseType: !355, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !492, file: !349, line: 40, baseType: !497, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !349, line: 34, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !355, !355, !355}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !294, file: !295, line: 63, baseType: !348, size: 160, offset: 1312)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !294, file: !295, line: 65, baseType: !503, size: 224, offset: 1472)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !504, line: 31, baseType: !505)
!504 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 25, size: 224, elements: !506)
!506 = !{!507, !515, !516, !517, !518}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !505, file: !504, line: 26, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !504, line: 16, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !504, line: 18, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !510, file: !504, line: 19, baseType: !13, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !510, file: !504, line: 20, baseType: !66, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !510, file: !504, line: 21, baseType: !508, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !505, file: !504, line: 27, baseType: !509, size: 96, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !505, file: !504, line: 28, baseType: !101, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !505, file: !504, line: 29, baseType: !66, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !505, file: !504, line: 30, baseType: !124, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !294, file: !295, line: 66, baseType: !503, size: 224, offset: 1696)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !294, file: !295, line: 68, baseType: !66, size: 32, offset: 1920)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !294, file: !295, line: 69, baseType: !66, size: 32, offset: 1952)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !294, file: !295, line: 71, baseType: !306, size: 32, offset: 1984)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !294, file: !295, line: 72, baseType: !313, size: 32, offset: 2016)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !294, file: !295, line: 73, baseType: !313, size: 32, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !294, file: !295, line: 75, baseType: !292, size: 32, offset: 2080)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !294, file: !295, line: 77, baseType: !96, size: 64, offset: 2112)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !294, file: !295, line: 78, baseType: !96, size: 64, offset: 2176)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !294, file: !295, line: 79, baseType: !96, size: 64, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !294, file: !295, line: 80, baseType: !96, size: 64, offset: 2304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !294, file: !295, line: 81, baseType: !96, size: 64, offset: 2368)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !294, file: !295, line: 82, baseType: !96, size: 64, offset: 2432)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !110, file: !93, line: 121, baseType: !124, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !110, file: !93, line: 122, baseType: !124, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !110, file: !93, line: 123, baseType: !535, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !93, line: 103, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 98, size: 1344, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !537, file: !93, line: 99, baseType: !162, size: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !537, file: !93, line: 100, baseType: !146, size: 32, offset: 1216)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !537, file: !93, line: 101, baseType: !146, size: 32, offset: 1248)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !537, file: !93, line: 102, baseType: !66, size: 32, offset: 1280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !110, file: !93, line: 124, baseType: !218, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !110, file: !93, line: 126, baseType: !13, size: 32, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !110, file: !93, line: 127, baseType: !66, size: 32, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !110, file: !93, line: 128, baseType: !66, size: 32, offset: 288)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !110, file: !93, line: 130, baseType: !548, size: 32, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !93, line: 112, baseType: !105)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !110, file: !93, line: 131, baseType: !80, size: 32, offset: 352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !92, file: !93, line: 81, baseType: !66, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !92, file: !93, line: 82, baseType: !66, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !92, file: !93, line: 83, baseType: !13, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 236, baseType: !66, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !74, file: !75, line: 238, baseType: !555, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !218}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !67, line: 78, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !22, line: 140, baseType: !154)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !74, file: !75, line: 240, baseType: !561, size: 32, offset: 352)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!558, !292}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !74, file: !75, line: 242, baseType: !561, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !74, file: !75, line: 243, baseType: !561, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !74, file: !75, line: 244, baseType: !567, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !292}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !74, file: !75, line: 245, baseType: !567, size: 32, offset: 480)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !74, file: !75, line: 247, baseType: !567, size: 32, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !74, file: !75, line: 249, baseType: !68, size: 32, offset: 544)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !74, file: !75, line: 250, baseType: !68, size: 32, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !74, file: !75, line: 251, baseType: !68, size: 32, offset: 608)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !74, file: !75, line: 252, baseType: !68, size: 32, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !74, file: !75, line: 253, baseType: !68, size: 32, offset: 672)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !74, file: !75, line: 254, baseType: !68, size: 32, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !74, file: !75, line: 255, baseType: !68, size: 32, offset: 736)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !74, file: !75, line: 256, baseType: !68, size: 32, offset: 768)
!580 = !DIGlobalVariableExpression(var: !581)
!581 = distinct !DIGlobalVariable(name: "ngx_http_upstream_ip_hash_commands", scope: !2, file: !3, line: 36, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 448, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 2)
!585 = !DIGlobalVariableExpression(var: !586)
!586 = distinct !DIGlobalVariable(name: "ngx_http_upstream_ip_hash_pseudo_addr", scope: !2, file: !3, line: 80, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24, elements: !213)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !8, line: 36, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 24, size: 256, elements: !590)
!590 = !{!591, !595, !596, !600, !604, !605, !609, !610}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !589, file: !8, line: 25, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{!558, !108}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !589, file: !8, line: 26, baseType: !592, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !589, file: !8, line: 28, baseType: !597, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!13, !108}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !589, file: !8, line: 29, baseType: !601, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DISubroutineType(types: !603)
!603 = !{!80, !108, !13}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !589, file: !8, line: 31, baseType: !597, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !589, file: !8, line: 32, baseType: !606, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{!80, !108, !13, !13}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !589, file: !8, line: 34, baseType: !597, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !589, file: !8, line: 35, baseType: !606, size: 32, offset: 224)
!611 = !{i32 2, !"Dwarf Version", i32 4}
!612 = !{i32 2, !"Debug Info Version", i32 3}
!613 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!614 = distinct !DISubprogram(name: "ngx_http_upstream_ip_hash", scope: !3, file: !3, line: 251, type: !106, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DILocalVariable(name: "cf", arg: 1, scope: !614, file: !3, line: 251, type: !108)
!617 = !DILocalVariable(name: "cmd", arg: 2, scope: !614, file: !3, line: 251, type: !90)
!618 = !DILocalVariable(name: "conf", arg: 3, scope: !614, file: !3, line: 251, type: !13)
!619 = !DILocalVariable(name: "uscf", scope: !614, file: !3, line: 253, type: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !622, line: 77, baseType: !623)
!622 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !622, line: 119, size: 416, elements: !624)
!624 = !{!625, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !623, file: !622, line: 120, baseType: !626, size: 96)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !622, line: 89, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 85, size: 96, elements: !628)
!628 = !{!629, !634, !1812}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !627, file: !622, line: 86, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !622, line: 79, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DISubroutineType(types: !633)
!633 = !{!558, !108, !620}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !627, file: !622, line: 87, baseType: !635, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !622, line: 81, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{!558, !639, !620}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !641, line: 16, baseType: !642)
!641 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !643, line: 364, size: 5376, elements: !644)
!643 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!644 = !{!645, !646, !647, !648, !649, !650, !651, !656, !657, !866, !1372, !1373, !1374, !1375, !1414, !1444, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1489, !1500, !1507, !1508, !1510, !1511, !1524, !1525, !1526, !1527, !1528, !1529, !1708, !1712, !1717, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !642, file: !643, line: 365, baseType: !32, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !642, file: !643, line: 367, baseType: !306, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !642, file: !643, line: 369, baseType: !12, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !642, file: !643, line: 370, baseType: !12, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !642, file: !643, line: 371, baseType: !12, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !642, file: !643, line: 372, baseType: !12, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !642, file: !643, line: 374, baseType: !652, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !643, line: 361, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !639}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !642, file: !643, line: 375, baseType: !652, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !642, file: !643, line: 378, baseType: !658, size: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !641, line: 18, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !661, line: 65, size: 3008, elements: !662)
!661 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!662 = !{!663, !664, !665, !666, !668, !669, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !824, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !660, file: !661, line: 66, baseType: !162, size: 1216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !660, file: !661, line: 67, baseType: !115, size: 160, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !660, file: !661, line: 68, baseType: !32, size: 32, offset: 1376)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !660, file: !661, line: 69, baseType: !667, size: 128, offset: 1408)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !57)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !660, file: !661, line: 70, baseType: !667, size: 128, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !660, file: !661, line: 72, baseType: !670, size: 32, offset: 1664)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !168, line: 18, baseType: !179)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !660, file: !661, line: 73, baseType: !206, size: 32, offset: 1696)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !660, file: !661, line: 74, baseType: !206, size: 32, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !660, file: !661, line: 75, baseType: !206, size: 32, offset: 1760)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !660, file: !661, line: 76, baseType: !206, size: 32, offset: 1792)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !660, file: !661, line: 77, baseType: !206, size: 32, offset: 1824)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !660, file: !661, line: 79, baseType: !96, size: 64, offset: 1856)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !660, file: !661, line: 80, baseType: !96, size: 64, offset: 1920)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !660, file: !661, line: 81, baseType: !667, size: 128, offset: 1984)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !660, file: !661, line: 83, baseType: !101, size: 32, offset: 2112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !660, file: !661, line: 84, baseType: !101, size: 32, offset: 2144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !660, file: !661, line: 85, baseType: !153, size: 32, offset: 2176)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !660, file: !661, line: 86, baseType: !153, size: 32, offset: 2208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !660, file: !661, line: 88, baseType: !66, size: 32, offset: 2240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !660, file: !661, line: 89, baseType: !66, size: 32, offset: 2272)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !660, file: !661, line: 90, baseType: !66, size: 32, offset: 2304)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !660, file: !661, line: 91, baseType: !66, size: 32, offset: 2336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !660, file: !661, line: 93, baseType: !146, size: 32, offset: 2368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !660, file: !661, line: 95, baseType: !689, size: 32, offset: 2400)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !641, line: 19, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !661, line: 157, size: 544, elements: !692)
!692 = !{!693, !708, !767, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !823}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !691, file: !661, line: 158, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !661, line: 154, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 145, size: 480, elements: !697)
!697 = !{!698, !699, !700, !701, !704, !705, !706, !707}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !696, file: !661, line: 146, baseType: !491, size: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !696, file: !661, line: 147, baseType: !348, size: 160, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !696, file: !661, line: 148, baseType: !361, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !696, file: !661, line: 149, baseType: !702, size: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !238, line: 106, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !237)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !696, file: !661, line: 150, baseType: !702, size: 32, offset: 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !696, file: !661, line: 151, baseType: !153, size: 32, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !696, file: !661, line: 152, baseType: !66, size: 32, offset: 416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !696, file: !661, line: 153, baseType: !66, size: 32, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !691, file: !661, line: 159, baseType: !709, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !711, line: 59, baseType: !712)
!711 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 34, size: 800, elements: !713)
!713 = !{!714, !721, !722, !723, !731, !732, !733, !742, !743, !744, !745, !762, !763, !764, !765, !766}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !712, file: !711, line: 35, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !716, line: 21, baseType: !717)
!716 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 16, size: 64, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !717, file: !716, line: 17, baseType: !702, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !717, file: !716, line: 19, baseType: !702, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !712, file: !711, line: 37, baseType: !101, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !712, file: !711, line: 38, baseType: !101, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !712, file: !711, line: 40, baseType: !724, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !711, line: 16, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !711, line: 18, size: 96, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !726, file: !711, line: 19, baseType: !68, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !711, line: 20, baseType: !724, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !726, file: !711, line: 21, baseType: !68, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !712, file: !711, line: 41, baseType: !724, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !712, file: !711, line: 42, baseType: !725, size: 96, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !712, file: !711, line: 44, baseType: !734, size: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !711, line: 31, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 25, size: 128, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !736, file: !711, line: 26, baseType: !66, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !736, file: !711, line: 27, baseType: !66, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !736, file: !711, line: 29, baseType: !66, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !736, file: !711, line: 30, baseType: !66, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !712, file: !711, line: 45, baseType: !66, size: 32, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !712, file: !711, line: 47, baseType: !40, size: 32, offset: 352)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !712, file: !711, line: 48, baseType: !40, size: 32, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !712, file: !711, line: 50, baseType: !746, size: 256, offset: 416)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !716, line: 37, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 24, size: 256, elements: !748)
!748 = !{!749, !751, !752, !753, !761}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !747, file: !716, line: 26, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !747, file: !716, line: 28, baseType: !750, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !747, file: !716, line: 29, baseType: !66, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !747, file: !716, line: 30, baseType: !754, size: 128, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !755, line: 19, baseType: !756)
!755 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !755, line: 17, size: 128, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !756, file: !755, line: 18, baseType: !759, size: 128)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 128, elements: !63)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !154)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !747, file: !716, line: 36, baseType: !66, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !712, file: !711, line: 52, baseType: !40, size: 32, offset: 672)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !712, file: !711, line: 53, baseType: !41, size: 8, offset: 704)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !712, file: !711, line: 55, baseType: !33, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !712, file: !711, line: 57, baseType: !13, size: 32, offset: 736)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !712, file: !711, line: 58, baseType: !13, size: 32, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !691, file: !661, line: 161, baseType: !768, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !164, line: 62, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 50, size: 384, elements: !771)
!771 = !{!772, !773, !774, !776, !781, !783, !785, !786, !787}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !164, line: 51, baseType: !96, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !770, file: !164, line: 52, baseType: !101, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !770, file: !164, line: 53, baseType: !775, size: 96, offset: 96)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 96, elements: !213)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !770, file: !164, line: 55, baseType: !777, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !164, line: 45, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!426, !13}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !770, file: !164, line: 56, baseType: !782, size: 32, offset: 224)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !164, line: 46, baseType: !778)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !770, file: !164, line: 57, baseType: !784, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !164, line: 47, baseType: !285)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !770, file: !164, line: 58, baseType: !13, size: 32, offset: 288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !770, file: !164, line: 60, baseType: !40, size: 32, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !770, file: !164, line: 61, baseType: !66, size: 32, offset: 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !691, file: !661, line: 163, baseType: !153, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !691, file: !661, line: 164, baseType: !101, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !691, file: !661, line: 166, baseType: !206, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !691, file: !661, line: 168, baseType: !206, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !691, file: !661, line: 170, baseType: !66, size: 32, offset: 224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !691, file: !661, line: 171, baseType: !66, size: 32, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !691, file: !661, line: 172, baseType: !426, size: 32, offset: 288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !691, file: !661, line: 173, baseType: !426, size: 32, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !691, file: !661, line: 174, baseType: !426, size: 32, offset: 352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !691, file: !661, line: 176, baseType: !66, size: 32, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !691, file: !661, line: 177, baseType: !426, size: 32, offset: 416)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !691, file: !661, line: 178, baseType: !426, size: 32, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !691, file: !661, line: 180, baseType: !801, size: 32, offset: 480)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !295, line: 25, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !295, line: 29, size: 320, elements: !804)
!804 = !{!805, !806, !816, !821, !822}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !295, line: 30, baseType: !13, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !803, file: !295, line: 31, baseType: !807, size: 192, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !808, line: 22, baseType: !809)
!808 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !808, line: 16, size: 192, elements: !810)
!810 = !{!811, !812, !813, !814, !815}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !809, file: !808, line: 17, baseType: !40, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !809, file: !808, line: 18, baseType: !101, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !808, line: 19, baseType: !96, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !809, file: !808, line: 20, baseType: !218, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !809, file: !808, line: 21, baseType: !66, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !803, file: !295, line: 32, baseType: !817, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !295, line: 27, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!558, !801, !13}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !803, file: !295, line: 33, baseType: !13, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !803, file: !295, line: 34, baseType: !66, size: 32, offset: 288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !691, file: !661, line: 182, baseType: !66, size: 32, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !660, file: !661, line: 96, baseType: !825, size: 32, offset: 2432)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !661, line: 62, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 39, size: 576, elements: !828)
!828 = !{!829, !830, !831, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !827, file: !661, line: 40, baseType: !348, size: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !827, file: !661, line: 41, baseType: !361, size: 64, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !827, file: !661, line: 43, baseType: !832, size: 96, offset: 224)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 96, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 12)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !827, file: !661, line: 46, baseType: !33, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !827, file: !661, line: 47, baseType: !33, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !827, file: !661, line: 48, baseType: !33, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !827, file: !661, line: 49, baseType: !33, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !827, file: !661, line: 50, baseType: !33, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !827, file: !661, line: 51, baseType: !33, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !827, file: !661, line: 52, baseType: !33, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !827, file: !661, line: 53, baseType: !33, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !827, file: !661, line: 56, baseType: !670, size: 32, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !827, file: !661, line: 57, baseType: !206, size: 32, offset: 416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !827, file: !661, line: 58, baseType: !206, size: 32, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !827, file: !661, line: 59, baseType: !101, size: 32, offset: 480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !827, file: !661, line: 60, baseType: !153, size: 32, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !827, file: !661, line: 61, baseType: !426, size: 32, offset: 544)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !660, file: !661, line: 102, baseType: !426, size: 32, offset: 2464)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !660, file: !661, line: 103, baseType: !426, size: 32, offset: 2496)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !660, file: !661, line: 104, baseType: !426, size: 32, offset: 2528)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !660, file: !661, line: 105, baseType: !426, size: 32, offset: 2560)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !660, file: !661, line: 107, baseType: !314, size: 384, offset: 2592)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !660, file: !661, line: 109, baseType: !33, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !660, file: !661, line: 110, baseType: !33, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !660, file: !661, line: 112, baseType: !33, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !660, file: !661, line: 113, baseType: !33, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !660, file: !661, line: 114, baseType: !33, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !660, file: !661, line: 115, baseType: !33, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !660, file: !661, line: 116, baseType: !33, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !660, file: !661, line: 117, baseType: !33, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !660, file: !661, line: 118, baseType: !33, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
