; ModuleID = 'src/http/modules/ngx_http_limit_req_module.c'
source_filename = "src/http/modules/ngx_http_limit_req_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_limit_req_module_ctx", scope: !2, file: !3, line: 125, type: !660, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !152)
!3 = !DIFile(filename: "src/http/modules/ngx_http_limit_req_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !66, !67, !55, !40, !72, !73, !83, !71, !86, !87}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_limit_req_node_t", file: !3, line: 23, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 224, elements: !33)
!33 = !{!34, !38, !39, !42, !50, !60, !61, !62}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !32, file: !3, line: 14, baseType: !35, size: 8)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !36, line: 64, baseType: !37)
!36 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !32, file: !3, line: 15, baseType: !35, size: 8, offset: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !3, line: 16, baseType: !40, size: 16, offset: 16)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !36, line: 65, baseType: !41)
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !32, file: !3, line: 17, baseType: !43, size: 64, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !44, line: 16, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !44, line: 18, size: 64, elements: !46)
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !45, file: !44, line: 19, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !44, line: 20, baseType: !48, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !32, file: !3, line: 18, baseType: !51, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !52, line: 16, baseType: !53)
!52 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !54, line: 16, baseType: !55)
!54 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !56, line: 79, baseType: !57)
!56 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !58, line: 125, baseType: !59)
!58 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "excess", scope: !32, file: !3, line: 20, baseType: !55, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !32, file: !3, line: 21, baseType: !55, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !32, file: !3, line: 22, baseType: !63, size: 8, offset: 192)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 120, baseType: !59)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !52, line: 17, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !54, line: 17, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !56, line: 78, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !58, line: 140, baseType: !71)
!71 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !54, line: 20, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !54, line: 22, size: 160, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !75, file: !54, line: 23, baseType: !53, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !75, file: !54, line: 24, baseType: !73, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !75, file: !54, line: 25, baseType: !73, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !75, file: !54, line: 26, baseType: !73, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !75, file: !54, line: 27, baseType: !35, size: 8, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !54, line: 28, baseType: !35, size: 8, offset: 136)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !58, line: 135, baseType: !71)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !89, line: 59, baseType: !90)
!89 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 34, size: 800, elements: !91)
!91 = !{!92, !104, !105, !106, !114, !115, !116, !125, !126, !127, !128, !147, !148, !149, !150, !151}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !90, file: !89, line: 35, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !94, line: 21, baseType: !95)
!94 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 16, size: 64, elements: !96)
!96 = !{!97, !103}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !95, file: !94, line: 17, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !99, line: 106, baseType: !100)
!99 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !99, line: 98, baseType: !102)
!102 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !95, file: !94, line: 19, baseType: !98, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !90, file: !89, line: 37, baseType: !66, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !90, file: !89, line: 38, baseType: !66, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !90, file: !89, line: 40, baseType: !107, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !89, line: 16, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !89, line: 18, size: 96, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !109, file: !89, line: 19, baseType: !57, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !89, line: 20, baseType: !107, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !89, line: 21, baseType: !57, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !90, file: !89, line: 41, baseType: !107, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !90, file: !89, line: 42, baseType: !108, size: 96, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !90, file: !89, line: 44, baseType: !117, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !89, line: 31, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 25, size: 128, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !119, file: !89, line: 26, baseType: !55, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !119, file: !89, line: 27, baseType: !55, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !119, file: !89, line: 29, baseType: !55, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !119, file: !89, line: 30, baseType: !55, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !90, file: !89, line: 45, baseType: !55, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !90, file: !89, line: 47, baseType: !72, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !90, file: !89, line: 48, baseType: !72, size: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !90, file: !89, line: 50, baseType: !129, size: 256, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !94, line: 37, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 24, size: 256, elements: !131)
!131 = !{!132, !134, !135, !136, !146}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !130, file: !94, line: 26, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !130, file: !94, line: 28, baseType: !133, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !130, file: !94, line: 29, baseType: !55, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !130, file: !94, line: 30, baseType: !137, size: 128, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !138, line: 19, baseType: !139)
!138 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 17, size: 128, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !139, file: !138, line: 18, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!144 = !{!145}
!145 = !DISubrange(count: 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !130, file: !94, line: 36, baseType: !55, size: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !90, file: !89, line: 52, baseType: !72, size: 32, offset: 672)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !90, file: !89, line: 53, baseType: !35, size: 8, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !90, file: !89, line: 55, baseType: !59, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !89, line: 57, baseType: !27, size: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !90, file: !89, line: 58, baseType: !27, size: 32, offset: 768)
!152 = !{!153, !0, !635, !640, !648}
!153 = !DIGlobalVariableExpression(var: !154)
!154 = distinct !DIGlobalVariable(name: "ngx_http_limit_req_module", scope: !2, file: !3, line: 140, type: !155, isLocal: false, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !156, line: 15, baseType: !157)
!156 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !158, line: 222, size: 800, elements: !159)
!158 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!159 = !{!160, !161, !162, !164, !165, !166, !167, !168, !169, !610, !611, !615, !619, !620, !621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !157, file: !158, line: 223, baseType: !55, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !157, file: !158, line: 224, baseType: !55, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 226, baseType: !163, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !157, file: !158, line: 228, baseType: !55, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !157, file: !158, line: 229, baseType: !55, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !157, file: !158, line: 231, baseType: !55, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !157, file: !158, line: 232, baseType: !83, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !157, file: !158, line: 234, baseType: !27, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !157, file: !158, line: 235, baseType: !170, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !156, line: 22, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !173, line: 77, size: 224, elements: !174)
!173 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!174 = !{!175, !182, !183, !607, !608, !609}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 78, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !177, line: 19, baseType: !178)
!177 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 16, size: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !178, file: !177, line: 17, baseType: !66, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !177, line: 18, baseType: !72, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !172, file: !173, line: 79, baseType: !55, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !172, file: !173, line: 80, baseType: !184, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{!163, !187, !170, !27}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !156, line: 16, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !173, line: 116, size: 384, elements: !190)
!190 = !{!191, !192, !366, !589, !590, !591, !600, !601, !602, !603, !604, !606}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !173, line: 117, baseType: !163, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !189, file: !173, line: 118, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !195, line: 22, baseType: !196)
!195 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 16, size: 160, elements: !197)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !196, file: !195, line: 17, baseType: !27, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !196, file: !195, line: 18, baseType: !55, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !195, line: 19, baseType: !66, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !196, file: !195, line: 20, baseType: !55, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !196, file: !195, line: 21, baseType: !203, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !156, line: 18, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !206, line: 57, size: 320, elements: !207)
!206 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!207 = !{!208, !216, !217, !218, !346, !353, !365}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !205, file: !206, line: 58, baseType: !209, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !206, line: 54, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !206, line: 49, size: 128, elements: !211)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !210, file: !206, line: 50, baseType: !72, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !210, file: !206, line: 51, baseType: !72, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !206, line: 52, baseType: !203, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !210, file: !206, line: 53, baseType: !55, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !205, file: !206, line: 59, baseType: !66, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !205, file: !206, line: 60, baseType: !203, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !205, file: !206, line: 61, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !156, line: 19, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !222, line: 59, size: 64, elements: !223)
!222 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!223 = !{!224, !345}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !222, line: 60, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !222, line: 18, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !222, line: 20, size: 352, elements: !228)
!228 = !{!229, !230, !231, !233, !234, !235, !236, !238, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !227, file: !222, line: 21, baseType: !72, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !227, file: !222, line: 22, baseType: !72, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !227, file: !222, line: 23, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !58, line: 222, baseType: !71)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !227, file: !222, line: 24, baseType: !232, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !227, file: !222, line: 26, baseType: !72, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !227, file: !222, line: 27, baseType: !72, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !227, file: !222, line: 28, baseType: !237, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !222, line: 16, baseType: !27)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !227, file: !222, line: 29, baseType: !239, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !156, line: 23, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !242, line: 16, size: 1216, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !247, !248, !293, !294, !295, !330, !331}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !241, file: !242, line: 17, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !246, line: 16, baseType: !71)
!246 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !242, line: 18, baseType: !176, size: 64, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !241, file: !242, line: 19, baseType: !249, size: 960, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !246, line: 17, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !251, line: 4, size: 960, elements: !252)
!251 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!252 = !{!253, !255, !256, !258, !259, !261, !262, !264, !266, !268, !269, !270, !271, !272, !273, !276, !277, !279, !280, !286, !287, !288}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !250, file: !251, line: 6, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !58, line: 232, baseType: !59)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !250, file: !251, line: 7, baseType: !254, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !250, file: !251, line: 8, baseType: !257, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !58, line: 227, baseType: !59)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !250, file: !251, line: 9, baseType: !257, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !250, file: !251, line: 10, baseType: !260, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !58, line: 217, baseType: !59)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !250, file: !251, line: 11, baseType: !260, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !250, file: !251, line: 13, baseType: !263, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !58, line: 212, baseType: !59)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !250, file: !251, line: 14, baseType: !265, size: 32, offset: 224)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !58, line: 304, baseType: !59)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !250, file: !251, line: 15, baseType: !267, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !58, line: 309, baseType: !59)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !250, file: !251, line: 16, baseType: !59, size: 32, offset: 288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !250, file: !251, line: 17, baseType: !254, size: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !250, file: !251, line: 18, baseType: !254, size: 32, offset: 352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !250, file: !251, line: 19, baseType: !232, size: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !250, file: !251, line: 20, baseType: !232, size: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !250, file: !251, line: 21, baseType: !274, size: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !58, line: 237, baseType: !275)
!275 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !250, file: !251, line: 22, baseType: !274, size: 32, offset: 480)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !250, file: !251, line: 23, baseType: !278, size: 32, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !58, line: 242, baseType: !71)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !250, file: !251, line: 24, baseType: !278, size: 32, offset: 544)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !250, file: !251, line: 26, baseType: !281, size: 64, offset: 576)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !58, line: 288, size: 64, elements: !282)
!282 = !{!283, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !281, file: !58, line: 288, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !58, line: 75, baseType: !275)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !281, file: !58, line: 288, baseType: !275, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !250, file: !251, line: 27, baseType: !281, size: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !250, file: !251, line: 28, baseType: !281, size: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !250, file: !251, line: 29, baseType: !289, size: 192, offset: 768)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 192, elements: !291)
!290 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!291 = !{!292}
!292 = !DISubrange(count: 3)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !241, file: !242, line: 21, baseType: !232, size: 32, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !241, file: !242, line: 22, baseType: !232, size: 32, offset: 1120)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 24, baseType: !296, size: 32, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !156, line: 20, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !299, line: 50, size: 320, elements: !300)
!299 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!300 = !{!301, !302, !314, !315, !316, !321, !322, !327, !328, !329}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !298, file: !299, line: 51, baseType: !55, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !298, file: !299, line: 52, baseType: !303, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !156, line: 21, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !173, line: 89, size: 160, elements: !306)
!306 = !{!307, !308, !309, !313}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !305, file: !173, line: 90, baseType: !245, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !173, line: 91, baseType: !176, size: 64, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !305, file: !173, line: 93, baseType: !310, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !303, !296}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !173, line: 94, baseType: !27, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !298, file: !299, line: 54, baseType: !101, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !298, file: !299, line: 56, baseType: !284, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !298, file: !299, line: 58, baseType: !317, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !299, line: 45, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DISubroutineType(types: !320)
!320 = !{!72, !296, !72, !66}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !299, line: 59, baseType: !27, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !298, file: !299, line: 61, baseType: !323, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !299, line: 46, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !296, !55, !72, !66}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !298, file: !299, line: 62, baseType: !27, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !298, file: !299, line: 70, baseType: !163, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !299, line: 72, baseType: !296, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !241, file: !242, line: 37, baseType: !59, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !241, file: !242, line: 38, baseType: !59, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !227, file: !222, line: 30, baseType: !225, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !227, file: !222, line: 34, baseType: !59, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !227, file: !222, line: 40, baseType: !59, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !227, file: !222, line: 43, baseType: !59, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !227, file: !222, line: 45, baseType: !59, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !227, file: !222, line: 46, baseType: !59, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !227, file: !222, line: 47, baseType: !59, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !227, file: !222, line: 48, baseType: !59, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !227, file: !222, line: 49, baseType: !59, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !227, file: !222, line: 50, baseType: !59, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !227, file: !222, line: 52, baseType: !59, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !227, file: !222, line: 53, baseType: !59, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !227, file: !222, line: 55, baseType: !71, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !222, line: 61, baseType: !219, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !205, file: !206, line: 62, baseType: !347, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !206, line: 41, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !206, line: 43, size: 64, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !206, line: 44, baseType: !347, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !349, file: !206, line: 45, baseType: !27, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !205, file: !206, line: 63, baseType: !354, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !206, line: 32, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !206, line: 34, size: 96, elements: !357)
!357 = !{!358, !363, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !356, file: !206, line: 35, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !206, line: 30, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !27}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !356, file: !206, line: 36, baseType: !27, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !206, line: 37, baseType: !354, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !205, file: !206, line: 64, baseType: !296, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !189, file: !173, line: 120, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !156, line: 17, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !370, line: 38, size: 2496, elements: !371)
!370 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!371 = !{!372, !375, !376, !377, !378, !379, !535, !536, !537, !540, !541, !542, !543, !544, !545, !546, !547, !558, !559, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !369, file: !370, line: 39, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !369, file: !370, line: 40, baseType: !203, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !369, file: !370, line: 42, baseType: !296, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !369, file: !370, line: 43, baseType: !297, size: 320, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !369, file: !370, line: 45, baseType: !55, size: 32, offset: 416)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !369, file: !370, line: 47, baseType: !380, size: 32, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !156, line: 26, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !384, line: 121, size: 896, elements: !385)
!384 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!385 = !{!386, !387, !424, !425, !428, !434, !436, !441, !446, !503, !504, !505, !506, !507, !508, !509, !510, !511, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !384, line: 122, baseType: !27, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !383, file: !384, line: 123, baseType: !388, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !156, line: 24, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !391, line: 30, size: 384, elements: !392)
!391 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !420, !421, !422, !423}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 31, baseType: !27, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !390, file: !391, line: 33, baseType: !59, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !390, file: !391, line: 35, baseType: !59, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !390, file: !391, line: 38, baseType: !59, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !390, file: !391, line: 44, baseType: !59, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !390, file: !391, line: 46, baseType: !59, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !390, file: !391, line: 49, baseType: !59, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !390, file: !391, line: 51, baseType: !59, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !390, file: !391, line: 54, baseType: !59, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !390, file: !391, line: 56, baseType: !59, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !390, file: !391, line: 57, baseType: !59, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !390, file: !391, line: 59, baseType: !59, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !390, file: !391, line: 60, baseType: !59, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !390, file: !391, line: 62, baseType: !59, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !390, file: !391, line: 64, baseType: !59, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !390, file: !391, line: 67, baseType: !59, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !390, file: !391, line: 69, baseType: !59, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !390, file: !391, line: 71, baseType: !59, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !390, file: !391, line: 74, baseType: !59, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !390, file: !391, line: 75, baseType: !59, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !390, file: !391, line: 77, baseType: !59, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !390, file: !391, line: 107, baseType: !59, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !390, file: !391, line: 110, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !156, line: 31, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !388}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !390, file: !391, line: 117, baseType: !55, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !390, file: !391, line: 119, baseType: !296, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !390, file: !391, line: 121, baseType: !74, size: 160, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !390, file: !391, line: 124, baseType: !43, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !383, file: !384, line: 124, baseType: !388, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !383, file: !384, line: 126, baseType: !426, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !427, line: 17, baseType: !71)
!427 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !383, file: !384, line: 128, baseType: !429, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !430, line: 19, baseType: !431)
!430 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{!86, !381, !72, !66}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !383, file: !384, line: 129, baseType: !435, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !430, line: 22, baseType: !431)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !383, file: !384, line: 130, baseType: !437, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !430, line: 20, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DISubroutineType(types: !440)
!440 = !{!86, !381, !219, !232}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !383, file: !384, line: 131, baseType: !442, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !430, line: 23, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DISubroutineType(types: !445)
!445 = !{!219, !381, !219, !232}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !383, file: !384, line: 133, baseType: !447, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !384, line: 16, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !384, line: 18, size: 960, elements: !450)
!450 = !{!451, !452, !463, !465, !466, !467, !468, !469, !470, !471, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !449, file: !384, line: 19, baseType: !426, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !449, file: !384, line: 21, baseType: !453, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !455, line: 297, size: 128, elements: !456)
!455 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !454, file: !455, line: 298, baseType: !458, size: 16)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !58, line: 409, baseType: !41)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !454, file: !455, line: 299, baseType: !460, size: 112, offset: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 112, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 14)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !449, file: !384, line: 22, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !58, line: 404, baseType: !59)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !449, file: !384, line: 23, baseType: !66, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !449, file: !384, line: 24, baseType: !176, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !384, line: 26, baseType: !71, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !449, file: !384, line: 28, baseType: !71, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !449, file: !384, line: 29, baseType: !71, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !449, file: !384, line: 30, baseType: !71, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !449, file: !384, line: 38, baseType: !472, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !156, line: 32, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !381}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !449, file: !384, line: 40, baseType: !27, size: 32, offset: 352)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !449, file: !384, line: 42, baseType: !297, size: 320, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !449, file: !384, line: 43, baseType: !296, size: 32, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !449, file: !384, line: 45, baseType: !66, size: 32, offset: 736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !449, file: !384, line: 47, baseType: !66, size: 32, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !449, file: !384, line: 49, baseType: !51, size: 32, offset: 800)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !449, file: !384, line: 51, baseType: !447, size: 32, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !449, file: !384, line: 52, baseType: !381, size: 32, offset: 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !449, file: !384, line: 54, baseType: !55, size: 32, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !449, file: !384, line: 56, baseType: !59, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !449, file: !384, line: 57, baseType: !59, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !449, file: !384, line: 58, baseType: !59, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !449, file: !384, line: 60, baseType: !59, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !449, file: !384, line: 61, baseType: !59, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !449, file: !384, line: 62, baseType: !59, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !449, file: !384, line: 63, baseType: !59, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !449, file: !384, line: 64, baseType: !59, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !449, file: !384, line: 65, baseType: !59, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !449, file: !384, line: 66, baseType: !59, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !449, file: !384, line: 67, baseType: !59, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !449, file: !384, line: 70, baseType: !59, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !449, file: !384, line: 72, baseType: !59, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !449, file: !384, line: 73, baseType: !59, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !449, file: !384, line: 74, baseType: !59, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !449, file: !384, line: 76, baseType: !59, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !449, file: !384, line: 77, baseType: !59, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !449, file: !384, line: 78, baseType: !59, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !383, file: !384, line: 135, baseType: !232, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !383, file: !384, line: 137, baseType: !296, size: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !383, file: !384, line: 139, baseType: !203, size: 32, offset: 352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !384, line: 141, baseType: !71, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !383, file: !384, line: 143, baseType: !453, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !383, file: !384, line: 144, baseType: !464, size: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !383, file: !384, line: 145, baseType: !176, size: 64, offset: 480)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !383, file: !384, line: 147, baseType: !176, size: 64, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !383, file: !384, line: 148, baseType: !512, size: 16, offset: 608)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !513, line: 12, baseType: !514)
!513 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !58, line: 186, baseType: !41)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !383, file: !384, line: 154, baseType: !453, size: 32, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !383, file: !384, line: 155, baseType: !464, size: 32, offset: 672)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !383, file: !384, line: 157, baseType: !225, size: 32, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !383, file: !384, line: 159, baseType: !43, size: 64, offset: 736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !383, file: !384, line: 161, baseType: !101, size: 32, offset: 800)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !383, file: !384, line: 163, baseType: !55, size: 32, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !383, file: !384, line: 165, baseType: !59, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !383, file: !384, line: 167, baseType: !59, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !383, file: !384, line: 169, baseType: !59, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !383, file: !384, line: 170, baseType: !59, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !383, file: !384, line: 171, baseType: !59, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !383, file: !384, line: 173, baseType: !59, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !383, file: !384, line: 174, baseType: !59, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !383, file: !384, line: 175, baseType: !59, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !383, file: !384, line: 176, baseType: !59, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !383, file: !384, line: 178, baseType: !59, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !383, file: !384, line: 179, baseType: !59, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !383, file: !384, line: 180, baseType: !59, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !383, file: !384, line: 181, baseType: !59, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !383, file: !384, line: 183, baseType: !59, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !369, file: !370, line: 48, baseType: !381, size: 32, offset: 480)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !369, file: !370, line: 49, baseType: !55, size: 32, offset: 512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !369, file: !370, line: 51, baseType: !538, size: 32, offset: 544)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !369, file: !370, line: 52, baseType: !55, size: 32, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !369, file: !370, line: 53, baseType: !55, size: 32, offset: 608)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !369, file: !370, line: 55, baseType: !43, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !369, file: !370, line: 56, baseType: !55, size: 32, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !369, file: !370, line: 58, baseType: !194, size: 160, offset: 736)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !369, file: !370, line: 59, baseType: !194, size: 160, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !369, file: !370, line: 61, baseType: !194, size: 160, offset: 1056)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !369, file: !370, line: 62, baseType: !548, size: 96, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !54, line: 32, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !54, line: 37, size: 96, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !549, file: !54, line: 38, baseType: !73, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !549, file: !54, line: 39, baseType: !73, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !549, file: !54, line: 40, baseType: !554, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !54, line: 34, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !73, !73, !73}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !369, file: !370, line: 63, baseType: !74, size: 160, offset: 1312)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !369, file: !370, line: 65, baseType: !560, size: 224, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !561, line: 31, baseType: !562)
!561 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 25, size: 224, elements: !563)
!563 = !{!564, !572, !573, !574, !575}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !562, file: !561, line: 26, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !561, line: 16, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !561, line: 18, size: 96, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !567, file: !561, line: 19, baseType: !27, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !567, file: !561, line: 20, baseType: !55, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !561, line: 21, baseType: !565, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !562, file: !561, line: 27, baseType: !566, size: 96, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !561, line: 28, baseType: !66, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !562, file: !561, line: 29, baseType: !55, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !562, file: !561, line: 30, baseType: !203, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !369, file: !370, line: 66, baseType: !560, size: 224, offset: 1696)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !369, file: !370, line: 68, baseType: !55, size: 32, offset: 1920)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !369, file: !370, line: 69, baseType: !55, size: 32, offset: 1952)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !369, file: !370, line: 71, baseType: !381, size: 32, offset: 1984)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !369, file: !370, line: 72, baseType: !388, size: 32, offset: 2016)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !369, file: !370, line: 73, baseType: !388, size: 32, offset: 2048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !369, file: !370, line: 75, baseType: !367, size: 32, offset: 2080)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !369, file: !370, line: 77, baseType: !176, size: 64, offset: 2112)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !369, file: !370, line: 78, baseType: !176, size: 64, offset: 2176)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !369, file: !370, line: 79, baseType: !176, size: 64, offset: 2240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !369, file: !370, line: 80, baseType: !176, size: 64, offset: 2304)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !369, file: !370, line: 81, baseType: !176, size: 64, offset: 2368)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !369, file: !370, line: 82, baseType: !176, size: 64, offset: 2432)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !189, file: !173, line: 121, baseType: !203, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !189, file: !173, line: 122, baseType: !203, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !189, file: !173, line: 123, baseType: !592, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !173, line: 103, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 98, size: 1344, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !594, file: !173, line: 99, baseType: !240, size: 1216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !594, file: !173, line: 100, baseType: !225, size: 32, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !594, file: !173, line: 101, baseType: !225, size: 32, offset: 1248)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !594, file: !173, line: 102, baseType: !55, size: 32, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !189, file: !173, line: 124, baseType: !296, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !189, file: !173, line: 126, baseType: !27, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !189, file: !173, line: 127, baseType: !55, size: 32, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !189, file: !173, line: 128, baseType: !55, size: 32, offset: 288)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !189, file: !173, line: 130, baseType: !605, size: 32, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !173, line: 112, baseType: !184)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !189, file: !173, line: 131, baseType: !163, size: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !172, file: !173, line: 81, baseType: !55, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !172, file: !173, line: 82, baseType: !55, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !172, file: !173, line: 83, baseType: !27, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !158, line: 236, baseType: !55, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !157, file: !158, line: 238, baseType: !612, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!69, !296}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !157, file: !158, line: 240, baseType: !616, size: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{!69, !367}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !157, file: !158, line: 242, baseType: !616, size: 32, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !157, file: !158, line: 243, baseType: !616, size: 32, offset: 416)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !157, file: !158, line: 244, baseType: !622, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !367}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !157, file: !158, line: 245, baseType: !622, size: 32, offset: 480)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !157, file: !158, line: 247, baseType: !622, size: 32, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !157, file: !158, line: 249, baseType: !57, size: 32, offset: 544)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !157, file: !158, line: 250, baseType: !57, size: 32, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !157, file: !158, line: 251, baseType: !57, size: 32, offset: 608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !157, file: !158, line: 252, baseType: !57, size: 32, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !157, file: !158, line: 253, baseType: !57, size: 32, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !157, file: !158, line: 254, baseType: !57, size: 32, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !157, file: !158, line: 255, baseType: !57, size: 32, offset: 736)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !157, file: !158, line: 256, baseType: !57, size: 32, offset: 768)
!635 = !DIGlobalVariableExpression(var: !636)
!636 = distinct !DIGlobalVariable(name: "ngx_http_limit_req_commands", scope: !2, file: !3, line: 91, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 1120, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 5)
!640 = !DIGlobalVariableExpression(var: !641)
!641 = distinct !DIGlobalVariable(name: "ngx_http_limit_req_log_levels", scope: !2, file: !3, line: 77, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 480, elements: !638)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_enum_t", file: !173, line: 160, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 157, size: 96, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !173, line: 158, baseType: !176, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !644, file: !173, line: 159, baseType: !55, size: 32, offset: 64)
!648 = !DIGlobalVariableExpression(var: !649)
!649 = distinct !DIGlobalVariable(name: "ngx_http_limit_req_status_bounds", scope: !2, file: !3, line: 86, type: !650, isLocal: true, isDefinition: true)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_num_bounds_t", file: !173, line: 154, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 150, size: 96, elements: !652)
!652 = !{!653, !658, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "post_handler", scope: !651, file: !173, line: 151, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_post_handler_pt", file: !173, line: 135, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DISubroutineType(types: !657)
!657 = !{!163, !187, !27, !27}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !651, file: !173, line: 152, baseType: !69, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !651, file: !173, line: 153, baseType: !69, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !22, line: 36, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 24, size: 256, elements: !662)
!662 = !{!663, !667, !668, !672, !676, !677, !678, !679}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !661, file: !22, line: 25, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DISubroutineType(types: !666)
!666 = !{!69, !187}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !661, file: !22, line: 26, baseType: !664, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !661, file: !22, line: 28, baseType: !669, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DISubroutineType(types: !671)
!671 = !{!27, !187}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !661, file: !22, line: 29, baseType: !673, size: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{!163, !187, !27}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !661, file: !22, line: 31, baseType: !669, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !661, file: !22, line: 32, baseType: !655, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !661, file: !22, line: 34, baseType: !669, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !661, file: !22, line: 35, baseType: !655, size: 32, offset: 224)
!680 = !{i32 2, !"Dwarf Version", i32 4}
!681 = !{i32 2, !"Debug Info Version", i32 3}
!682 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!683 = distinct !DISubprogram(name: "ngx_http_limit_req_init", scope: !3, file: !3, line: 945, type: !665, isLocal: true, isDefinition: true, scopeLine: 946, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !684)
!684 = !{!685, !686, !1853}
!685 = !DILocalVariable(name: "cf", arg: 1, scope: !683, file: !3, line: 945, type: !187)
!686 = !DILocalVariable(name: "h", scope: !683, file: !3, line: 947, type: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !689, line: 360, baseType: !690)
!689 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{!69, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !695, line: 16, baseType: !696)
!695 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !689, line: 364, size: 5376, elements: !697)
!697 = !{!698, !700, !701, !702, !703, !704, !705, !710, !711, !862, !1415, !1416, !1417, !1418, !1457, !1487, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1532, !1543, !1550, !1551, !1552, !1553, !1566, !1567, !1568, !1569, !1570, !1571, !1749, !1753, !1758, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !696, file: !689, line: 365, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 191, baseType: !59)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !696, file: !689, line: 367, baseType: !381, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !696, file: !689, line: 369, baseType: !26, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !696, file: !689, line: 370, baseType: !26, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !696, file: !689, line: 371, baseType: !26, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !696, file: !689, line: 372, baseType: !26, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !696, file: !689, line: 374, baseType: !706, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !689, line: 361, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !693}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !696, file: !689, line: 375, baseType: !706, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !696, file: !689, line: 378, baseType: !712, size: 32, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !695, line: 18, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !715, line: 65, size: 3008, elements: !716)
!715 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!716 = !{!717, !718, !719, !720, !724, !725, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !820, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !714, file: !715, line: 66, baseType: !240, size: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !714, file: !715, line: 67, baseType: !194, size: 160, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !714, file: !715, line: 68, baseType: !699, size: 32, offset: 1376)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !714, file: !715, line: 69, baseType: !721, size: 128, offset: 1408)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !714, file: !715, line: 70, baseType: !721, size: 128, offset: 1536)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !714, file: !715, line: 72, baseType: !726, size: 32, offset: 1664)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !246, line: 18, baseType: !257)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !714, file: !715, line: 73, baseType: !284, size: 32, offset: 1696)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !714, file: !715, line: 74, baseType: !284, size: 32, offset: 1728)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !714, file: !715, line: 75, baseType: !284, size: 32, offset: 1760)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !714, file: !715, line: 76, baseType: !284, size: 32, offset: 1792)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !714, file: !715, line: 77, baseType: !284, size: 32, offset: 1824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !714, file: !715, line: 79, baseType: !176, size: 64, offset: 1856)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !714, file: !715, line: 80, baseType: !176, size: 64, offset: 1920)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !714, file: !715, line: 81, baseType: !721, size: 128, offset: 1984)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !714, file: !715, line: 83, baseType: !66, size: 32, offset: 2112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !714, file: !715, line: 84, baseType: !66, size: 32, offset: 2144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !714, file: !715, line: 85, baseType: !232, size: 32, offset: 2176)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !714, file: !715, line: 86, baseType: !232, size: 32, offset: 2208)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !714, file: !715, line: 88, baseType: !55, size: 32, offset: 2240)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !714, file: !715, line: 89, baseType: !55, size: 32, offset: 2272)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !714, file: !715, line: 90, baseType: !55, size: 32, offset: 2304)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !714, file: !715, line: 91, baseType: !55, size: 32, offset: 2336)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !714, file: !715, line: 93, baseType: !225, size: 32, offset: 2368)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !714, file: !715, line: 95, baseType: !745, size: 32, offset: 2400)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !695, line: 19, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !715, line: 157, size: 544, elements: !748)
!748 = !{!749, !762, !763, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !819}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !747, file: !715, line: 158, baseType: !750, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !715, line: 154, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 145, size: 480, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !752, file: !715, line: 146, baseType: !548, size: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !752, file: !715, line: 147, baseType: !74, size: 160, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !752, file: !715, line: 148, baseType: !43, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !752, file: !715, line: 149, baseType: !98, size: 32, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !752, file: !715, line: 150, baseType: !98, size: 32, offset: 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !715, line: 151, baseType: !232, size: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !752, file: !715, line: 152, baseType: !55, size: 32, offset: 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !752, file: !715, line: 153, baseType: !55, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !747, file: !715, line: 159, baseType: !87, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !747, file: !715, line: 161, baseType: !764, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !242, line: 62, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 50, size: 384, elements: !767)
!767 = !{!768, !769, !770, !772, !777, !779, !781, !782, !783}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !242, line: 51, baseType: !176, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !766, file: !242, line: 52, baseType: !66, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !766, file: !242, line: 53, baseType: !771, size: 96, offset: 96)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 96, elements: !291)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !766, file: !242, line: 55, baseType: !773, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !242, line: 45, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!51, !27}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !766, file: !242, line: 56, baseType: !778, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !242, line: 46, baseType: !774)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !766, file: !242, line: 57, baseType: !780, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !242, line: 47, baseType: !360)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !242, line: 58, baseType: !27, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !766, file: !242, line: 60, baseType: !72, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !766, file: !242, line: 61, baseType: !55, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !747, file: !715, line: 163, baseType: !232, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !747, file: !715, line: 164, baseType: !66, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !747, file: !715, line: 166, baseType: !284, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !747, file: !715, line: 168, baseType: !284, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !747, file: !715, line: 170, baseType: !55, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !747, file: !715, line: 171, baseType: !55, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !747, file: !715, line: 172, baseType: !51, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !747, file: !715, line: 173, baseType: !51, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !747, file: !715, line: 174, baseType: !51, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !747, file: !715, line: 176, baseType: !55, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !747, file: !715, line: 177, baseType: !51, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !747, file: !715, line: 178, baseType: !51, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !747, file: !715, line: 180, baseType: !797, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !370, line: 25, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !370, line: 29, size: 320, elements: !800)
!800 = !{!801, !802, !812, !817, !818}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !799, file: !370, line: 30, baseType: !27, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !799, file: !370, line: 31, baseType: !803, size: 192, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !804, line: 22, baseType: !805)
!804 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 16, size: 192, elements: !806)
!806 = !{!807, !808, !809, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !805, file: !804, line: 17, baseType: !72, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !805, file: !804, line: 18, baseType: !66, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !805, file: !804, line: 19, baseType: !176, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !805, file: !804, line: 20, baseType: !296, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !805, file: !804, line: 21, baseType: !55, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !799, file: !370, line: 32, baseType: !813, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !370, line: 27, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!69, !797, !27}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !799, file: !370, line: 33, baseType: !27, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !799, file: !370, line: 34, baseType: !55, size: 32, offset: 288)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !747, file: !715, line: 182, baseType: !55, size: 32, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !714, file: !715, line: 96, baseType: !821, size: 32, offset: 2432)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !715, line: 62, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !715, line: 39, size: 576, elements: !824)
!824 = !{!825, !826, !827, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !823, file: !715, line: 40, baseType: !74, size: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !823, file: !715, line: 41, baseType: !43, size: 64, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !823, file: !715, line: 43, baseType: !828, size: 96, offset: 224)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 12)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !823, file: !715, line: 46, baseType: !59, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !823, file: !715, line: 47, baseType: !59, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !823, file: !715, line: 48, baseType: !59, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !823, file: !715, line: 49, baseType: !59, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !823, file: !715, line: 50, baseType: !59, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !823, file: !715, line: 51, baseType: !59, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !823, file: !715, line: 52, baseType: !59, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !823, file: !715, line: 53, baseType: !59, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !823, file: !715, line: 56, baseType: !726, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !823, file: !715, line: 57, baseType: !284, size: 32, offset: 416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !823, file: !715, line: 58, baseType: !284, size: 32, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !823, file: !715, line: 59, baseType: !66, size: 32, offset: 480)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !823, file: !715, line: 60, baseType: !232, size: 32, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !823, file: !715, line: 61, baseType: !51, size: 32, offset: 544)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !714, file: !715, line: 102, baseType: !51, size: 32, offset: 2464)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !714, file: !715, line: 103, baseType: !51, size: 32, offset: 2496)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !714, file: !715, line: 104, baseType: !51, size: 32, offset: 2528)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !714, file: !715, line: 105, baseType: !51, size: 32, offset: 2560)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !714, file: !715, line: 107, baseType: !389, size: 384, offset: 2592)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !714, file: !715, line: 109, baseType: !59, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !714, file: !715, line: 110, baseType: !59, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !714, file: !715, line: 112, baseType: !59, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !714, file: !715, line: 113, baseType: !59, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !714, file: !715, line: 114, baseType: !59, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !714, file: !715, line: 115, baseType: !59, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !714, file: !715, line: 116, baseType: !59, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !714, file: !715, line: 117, baseType: !59, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !714, file: !715, line: 118, baseType: !59, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !714, file: !715, line: 119, baseType: !59, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !714, file: !715, line: 121, baseType: !59, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !714, file: !715, line: 122, baseType: !59, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !696, file: !689, line: 381, baseType: !863, size: 32, offset: 288)
