; ModuleID = 'src/http/modules/ngx_http_split_clients_module.c'
source_filename = "src/http/modules/ngx_http_split_clients_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_split_clients_module_ctx", scope: !2, file: !3, line: 43, type: !556, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !221)
!3 = !DIFile(filename: "src/http/modules/ngx_http_split_clients_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !10, !12, !220}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !8, line: 125, baseType: !9)
!8 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 196, baseType: !11)
!11 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_split_clients_ctx_t", file: !3, line: 22, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 19, size: 320, elements: !15)
!15 = !{!16, !39}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !14, file: !3, line: 20, baseType: !17, size: 160)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_complex_value_t", file: !18, line: 71, baseType: !19)
!18 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 66, size: 160, elements: !20)
!20 = !{!21, !33, !37, !38}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !19, file: !18, line: 67, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !23, line: 19, baseType: !24)
!23 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 16, size: 64, elements: !25)
!25 = !{!26, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !24, file: !23, line: 17, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 120, baseType: !9)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !24, file: !23, line: 18, baseType: !29, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !31, line: 64, baseType: !32)
!31 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flushes", scope: !19, file: !18, line: 68, baseType: !34, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !36, line: 79, baseType: !7)
!36 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !19, file: !18, line: 69, baseType: !6, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !19, file: !18, line: 70, baseType: !6, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "parts", scope: !14, file: !3, line: 21, baseType: !40, size: 160, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !41, line: 22, baseType: !42)
!41 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 16, size: 160, elements: !43)
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !42, file: !41, line: 17, baseType: !6, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !42, file: !41, line: 18, baseType: !35, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !41, line: 19, baseType: !27, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !42, file: !41, line: 20, baseType: !35, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !42, file: !41, line: 21, baseType: !49, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !51, line: 18, baseType: !52)
!51 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !53, line: 57, size: 320, elements: !54)
!53 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !{!55, !63, !64, !65, !200, !207, !219}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !52, file: !53, line: 58, baseType: !56, size: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !53, line: 54, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 49, size: 128, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !57, file: !53, line: 50, baseType: !29, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !57, file: !53, line: 51, baseType: !29, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !53, line: 52, baseType: !49, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !57, file: !53, line: 53, baseType: !35, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !52, file: !53, line: 59, baseType: !27, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !52, file: !53, line: 60, baseType: !49, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !52, file: !53, line: 61, baseType: !66, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !51, line: 19, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !69, line: 59, size: 64, elements: !70)
!69 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = !{!71, !199}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !68, file: !69, line: 60, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !69, line: 18, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !69, line: 20, size: 352, elements: !75)
!75 = !{!76, !77, !78, !81, !82, !83, !84, !86, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !74, file: !69, line: 21, baseType: !29, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !74, file: !69, line: 22, baseType: !29, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !74, file: !69, line: 23, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !8, line: 222, baseType: !80)
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !74, file: !69, line: 24, baseType: !79, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !74, file: !69, line: 26, baseType: !29, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !74, file: !69, line: 27, baseType: !29, size: 32, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !74, file: !69, line: 28, baseType: !85, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !69, line: 16, baseType: !6)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !74, file: !69, line: 29, baseType: !87, size: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !51, line: 23, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !90, line: 16, size: 1216, elements: !91)
!90 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = !{!92, !95, !96, !141, !142, !143, !184, !185}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !89, file: !90, line: 17, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !94, line: 16, baseType: !80)
!94 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !90, line: 18, baseType: !22, size: 64, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !89, file: !90, line: 19, baseType: !97, size: 960, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !94, line: 17, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !99, line: 4, size: 960, elements: !100)
!99 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = !{!101, !103, !104, !106, !107, !109, !110, !112, !114, !116, !117, !118, !119, !120, !121, !124, !125, !127, !128, !134, !135, !136}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !98, file: !99, line: 6, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !8, line: 232, baseType: !9)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !98, file: !99, line: 7, baseType: !102, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !98, file: !99, line: 8, baseType: !105, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !8, line: 227, baseType: !9)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !98, file: !99, line: 9, baseType: !105, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !98, file: !99, line: 10, baseType: !108, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !8, line: 217, baseType: !9)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !98, file: !99, line: 11, baseType: !108, size: 32, offset: 160)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !98, file: !99, line: 13, baseType: !111, size: 32, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !8, line: 212, baseType: !9)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !98, file: !99, line: 14, baseType: !113, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !8, line: 304, baseType: !9)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !98, file: !99, line: 15, baseType: !115, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !8, line: 309, baseType: !9)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !98, file: !99, line: 16, baseType: !9, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !98, file: !99, line: 17, baseType: !102, size: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !98, file: !99, line: 18, baseType: !102, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !98, file: !99, line: 19, baseType: !79, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !98, file: !99, line: 20, baseType: !79, size: 32, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !98, file: !99, line: 21, baseType: !122, size: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !8, line: 237, baseType: !123)
!123 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !98, file: !99, line: 22, baseType: !122, size: 32, offset: 480)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !98, file: !99, line: 23, baseType: !126, size: 32, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !8, line: 242, baseType: !80)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !98, file: !99, line: 24, baseType: !126, size: 32, offset: 544)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !98, file: !99, line: 26, baseType: !129, size: 64, offset: 576)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !8, line: 288, size: 64, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !129, file: !8, line: 288, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !8, line: 75, baseType: !123)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !129, file: !8, line: 288, baseType: !123, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !98, file: !99, line: 27, baseType: !129, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !98, file: !99, line: 28, baseType: !129, size: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !98, file: !99, line: 29, baseType: !137, size: 192, offset: 768)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 192, elements: !139)
!138 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!139 = !{!140}
!140 = !DISubrange(count: 3)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !89, file: !90, line: 21, baseType: !79, size: 32, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !89, file: !90, line: 22, baseType: !79, size: 32, offset: 1120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !89, file: !90, line: 24, baseType: !144, size: 32, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !51, line: 20, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !147, line: 50, size: 320, elements: !148)
!147 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!148 = !{!149, !150, !163, !167, !168, !173, !174, !179, !180, !183}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !146, file: !147, line: 51, baseType: !35, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !146, file: !147, line: 52, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !51, line: 21, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !154, line: 89, size: 160, elements: !155)
!154 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!155 = !{!156, !157, !158, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !153, file: !154, line: 90, baseType: !93, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 91, baseType: !22, size: 64, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !153, file: !154, line: 93, baseType: !159, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !151, !144}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 94, baseType: !6, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !146, file: !147, line: 54, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !165, line: 98, baseType: !166)
!165 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!166 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !146, file: !147, line: 56, baseType: !132, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !146, file: !147, line: 58, baseType: !169, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !147, line: 45, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{!29, !144, !29, !27}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 59, baseType: !6, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !146, file: !147, line: 61, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !147, line: 46, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !144, !35, !29, !27}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !146, file: !147, line: 62, baseType: !6, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !146, file: !147, line: 70, baseType: !181, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 72, baseType: !144, size: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !89, file: !90, line: 37, baseType: !9, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !89, file: !90, line: 38, baseType: !9, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !74, file: !69, line: 30, baseType: !72, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !74, file: !69, line: 34, baseType: !9, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !74, file: !69, line: 40, baseType: !9, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !74, file: !69, line: 43, baseType: !9, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !74, file: !69, line: 45, baseType: !9, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !74, file: !69, line: 46, baseType: !9, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !74, file: !69, line: 47, baseType: !9, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !74, file: !69, line: 48, baseType: !9, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !74, file: !69, line: 49, baseType: !9, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !74, file: !69, line: 50, baseType: !9, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !74, file: !69, line: 52, baseType: !9, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !74, file: !69, line: 53, baseType: !9, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !74, file: !69, line: 55, baseType: !80, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !69, line: 61, baseType: !66, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !52, file: !53, line: 62, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !53, line: 41, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !53, line: 43, size: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !53, line: 44, baseType: !201, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !203, file: !53, line: 45, baseType: !6, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !52, file: !53, line: 63, baseType: !208, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !53, line: 32, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !53, line: 34, size: 96, elements: !211)
!211 = !{!212, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !210, file: !53, line: 35, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !53, line: 30, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !6}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !53, line: 36, baseType: !6, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !53, line: 37, baseType: !208, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !52, file: !53, line: 64, baseType: !144, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 191, baseType: !9)
!221 = !{!222, !0, !551}
!222 = !DIGlobalVariableExpression(var: !223)
!223 = distinct !DIGlobalVariable(name: "ngx_http_split_clients_module", scope: !2, file: !3, line: 58, type: !224, isLocal: false, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !51, line: 15, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !226, line: 222, size: 800, elements: !227)
!226 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !237, !238, !524, !525, !531, !535, !536, !537, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !225, file: !226, line: 223, baseType: !35, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !225, file: !226, line: 224, baseType: !35, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !226, line: 226, baseType: !181, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !225, file: !226, line: 228, baseType: !35, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !225, file: !226, line: 229, baseType: !35, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !226, line: 231, baseType: !35, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !225, file: !226, line: 232, baseType: !235, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !225, file: !226, line: 234, baseType: !6, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !225, file: !226, line: 235, baseType: !239, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !51, line: 22, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !154, line: 77, size: 224, elements: !242)
!242 = !{!243, !244, !245, !521, !522, !523}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !154, line: 78, baseType: !22, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !154, line: 79, baseType: !35, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !241, file: !154, line: 80, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!181, !249, !239, !6}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !51, line: 16, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !154, line: 116, size: 384, elements: !252)
!252 = !{!253, !254, !256, !503, !504, !505, !514, !515, !516, !517, !518, !520}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !154, line: 117, baseType: !181, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !251, file: !154, line: 118, baseType: !255, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !251, file: !154, line: 120, baseType: !257, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !51, line: 17, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !260, line: 38, size: 2496, elements: !261)
!260 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!261 = !{!262, !266, !267, !268, !269, !270, !449, !450, !451, !454, !455, !456, !457, !458, !459, !460, !461, !472, !473, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !259, file: !260, line: 39, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !259, file: !260, line: 40, baseType: !49, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !259, file: !260, line: 42, baseType: !144, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !259, file: !260, line: 43, baseType: !145, size: 320, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !259, file: !260, line: 45, baseType: !35, size: 32, offset: 416)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !259, file: !260, line: 47, baseType: !271, size: 32, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !51, line: 26, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !275, line: 121, size: 896, elements: !276)
!275 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!276 = !{!277, !278, !334, !335, !338, !345, !347, !352, !357, !417, !418, !419, !420, !421, !422, !423, !424, !425, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !275, line: 122, baseType: !6, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !274, file: !275, line: 123, baseType: !279, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !51, line: 24, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !282, line: 30, size: 384, elements: !283)
!282 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !311, !312, !313, !326}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !281, file: !282, line: 31, baseType: !6, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !281, file: !282, line: 33, baseType: !9, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !281, file: !282, line: 35, baseType: !9, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !281, file: !282, line: 38, baseType: !9, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !281, file: !282, line: 44, baseType: !9, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !281, file: !282, line: 46, baseType: !9, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !281, file: !282, line: 49, baseType: !9, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !281, file: !282, line: 51, baseType: !9, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !281, file: !282, line: 54, baseType: !9, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !281, file: !282, line: 56, baseType: !9, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !281, file: !282, line: 57, baseType: !9, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !281, file: !282, line: 59, baseType: !9, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !281, file: !282, line: 60, baseType: !9, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !281, file: !282, line: 62, baseType: !9, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !281, file: !282, line: 64, baseType: !9, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !281, file: !282, line: 67, baseType: !9, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !281, file: !282, line: 69, baseType: !9, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !281, file: !282, line: 71, baseType: !9, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !281, file: !282, line: 74, baseType: !9, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !281, file: !282, line: 75, baseType: !9, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !281, file: !282, line: 77, baseType: !9, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !281, file: !282, line: 107, baseType: !9, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !281, file: !282, line: 110, baseType: !307, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !51, line: 31, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !279}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !281, file: !282, line: 117, baseType: !35, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !281, file: !282, line: 119, baseType: !144, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !281, file: !282, line: 121, baseType: !314, size: 160, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !315, line: 20, baseType: !316)
!315 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !315, line: 22, size: 160, elements: !317)
!317 = !{!318, !320, !322, !323, !324, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !316, file: !315, line: 23, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !315, line: 16, baseType: !35)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !316, file: !315, line: 24, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !316, file: !315, line: 25, baseType: !321, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !316, file: !315, line: 26, baseType: !321, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !316, file: !315, line: 27, baseType: !30, size: 8, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !315, line: 28, baseType: !30, size: 8, offset: 136)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !281, file: !282, line: 124, baseType: !327, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !328, line: 16, baseType: !329)
!328 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !328, line: 18, size: 64, elements: !330)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !328, line: 19, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !328, line: 20, baseType: !332, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !274, file: !275, line: 124, baseType: !279, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !274, file: !275, line: 126, baseType: !336, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !337, line: 17, baseType: !80)
!337 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !274, file: !275, line: 128, baseType: !339, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !340, line: 19, baseType: !341)
!340 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !272, !29, !27}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !8, line: 135, baseType: !80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !274, file: !275, line: 129, baseType: !346, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !340, line: 22, baseType: !341)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !274, file: !275, line: 130, baseType: !348, size: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !340, line: 20, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DISubroutineType(types: !351)
!351 = !{!344, !272, !66, !79}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !274, file: !275, line: 131, baseType: !353, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !340, line: 23, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{!66, !272, !66, !79}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !274, file: !275, line: 133, baseType: !358, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !275, line: 16, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !275, line: 18, size: 960, elements: !361)
!361 = !{!362, !363, !375, !377, !378, !379, !380, !381, !382, !383, !388, !389, !390, !391, !392, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !360, file: !275, line: 19, baseType: !336, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !360, file: !275, line: 21, baseType: !364, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !366, line: 297, size: 128, elements: !367)
!366 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!367 = !{!368, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !365, file: !366, line: 298, baseType: !369, size: 16)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !8, line: 409, baseType: !370)
!370 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !365, file: !366, line: 299, baseType: !372, size: 112, offset: 16)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 112, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 14)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !360, file: !275, line: 22, baseType: !376, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !8, line: 404, baseType: !9)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !360, file: !275, line: 23, baseType: !27, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !360, file: !275, line: 24, baseType: !22, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !360, file: !275, line: 26, baseType: !80, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !360, file: !275, line: 28, baseType: !80, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !360, file: !275, line: 29, baseType: !80, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !360, file: !275, line: 30, baseType: !80, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !360, file: !275, line: 38, baseType: !384, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !51, line: 32, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !272}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !360, file: !275, line: 40, baseType: !6, size: 32, offset: 352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !360, file: !275, line: 42, baseType: !145, size: 320, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !360, file: !275, line: 43, baseType: !144, size: 32, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !360, file: !275, line: 45, baseType: !27, size: 32, offset: 736)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !360, file: !275, line: 47, baseType: !27, size: 32, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !360, file: !275, line: 49, baseType: !394, size: 32, offset: 800)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !395, line: 16, baseType: !319)
!395 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!396 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !360, file: !275, line: 51, baseType: !358, size: 32, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !360, file: !275, line: 52, baseType: !272, size: 32, offset: 864)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !360, file: !275, line: 54, baseType: !35, size: 32, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !360, file: !275, line: 56, baseType: !9, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !360, file: !275, line: 57, baseType: !9, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !360, file: !275, line: 58, baseType: !9, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !360, file: !275, line: 60, baseType: !9, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !360, file: !275, line: 61, baseType: !9, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !360, file: !275, line: 62, baseType: !9, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !360, file: !275, line: 63, baseType: !9, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !360, file: !275, line: 64, baseType: !9, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !360, file: !275, line: 65, baseType: !9, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !360, file: !275, line: 66, baseType: !9, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !360, file: !275, line: 67, baseType: !9, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !360, file: !275, line: 70, baseType: !9, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !360, file: !275, line: 72, baseType: !9, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !360, file: !275, line: 73, baseType: !9, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !360, file: !275, line: 74, baseType: !9, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !360, file: !275, line: 76, baseType: !9, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !360, file: !275, line: 77, baseType: !9, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !360, file: !275, line: 78, baseType: !9, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !274, file: !275, line: 135, baseType: !79, size: 32, offset: 288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !274, file: !275, line: 137, baseType: !144, size: 32, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !274, file: !275, line: 139, baseType: !49, size: 32, offset: 352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !275, line: 141, baseType: !80, size: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !274, file: !275, line: 143, baseType: !364, size: 32, offset: 416)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !274, file: !275, line: 144, baseType: !376, size: 32, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !274, file: !275, line: 145, baseType: !22, size: 64, offset: 480)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !274, file: !275, line: 147, baseType: !22, size: 64, offset: 544)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !274, file: !275, line: 148, baseType: !426, size: 16, offset: 608)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !427, line: 12, baseType: !428)
!427 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 186, baseType: !370)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !274, file: !275, line: 154, baseType: !364, size: 32, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !274, file: !275, line: 155, baseType: !376, size: 32, offset: 672)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !274, file: !275, line: 157, baseType: !72, size: 32, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !274, file: !275, line: 159, baseType: !327, size: 64, offset: 736)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !274, file: !275, line: 161, baseType: !164, size: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !274, file: !275, line: 163, baseType: !35, size: 32, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !274, file: !275, line: 165, baseType: !9, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !274, file: !275, line: 167, baseType: !9, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !274, file: !275, line: 169, baseType: !9, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !274, file: !275, line: 170, baseType: !9, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !274, file: !275, line: 171, baseType: !9, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !274, file: !275, line: 173, baseType: !9, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !274, file: !275, line: 174, baseType: !9, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !274, file: !275, line: 175, baseType: !9, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !274, file: !275, line: 176, baseType: !9, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !274, file: !275, line: 178, baseType: !9, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !274, file: !275, line: 179, baseType: !9, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !274, file: !275, line: 180, baseType: !9, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !274, file: !275, line: 181, baseType: !9, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !274, file: !275, line: 183, baseType: !9, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !259, file: !260, line: 48, baseType: !272, size: 32, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !259, file: !260, line: 49, baseType: !35, size: 32, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !259, file: !260, line: 51, baseType: !452, size: 32, offset: 544)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !259, file: !260, line: 52, baseType: !35, size: 32, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !259, file: !260, line: 53, baseType: !35, size: 32, offset: 608)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !259, file: !260, line: 55, baseType: !327, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !259, file: !260, line: 56, baseType: !35, size: 32, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !259, file: !260, line: 58, baseType: !40, size: 160, offset: 736)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !259, file: !260, line: 59, baseType: !40, size: 160, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !259, file: !260, line: 61, baseType: !40, size: 160, offset: 1056)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !259, file: !260, line: 62, baseType: !462, size: 96, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !315, line: 32, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !315, line: 37, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !463, file: !315, line: 38, baseType: !321, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !463, file: !315, line: 39, baseType: !321, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !463, file: !315, line: 40, baseType: !468, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !315, line: 34, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !321, !321, !321}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !259, file: !260, line: 63, baseType: !314, size: 160, offset: 1312)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !259, file: !260, line: 65, baseType: !474, size: 224, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !475, line: 31, baseType: !476)
!475 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 25, size: 224, elements: !477)
!477 = !{!478, !486, !487, !488, !489}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !476, file: !475, line: 26, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !475, line: 16, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !475, line: 18, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !481, file: !475, line: 19, baseType: !6, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !481, file: !475, line: 20, baseType: !35, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !475, line: 21, baseType: !479, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !476, file: !475, line: 27, baseType: !480, size: 96, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !476, file: !475, line: 28, baseType: !27, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !476, file: !475, line: 29, baseType: !35, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !476, file: !475, line: 30, baseType: !49, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !259, file: !260, line: 66, baseType: !474, size: 224, offset: 1696)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !259, file: !260, line: 68, baseType: !35, size: 32, offset: 1920)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !259, file: !260, line: 69, baseType: !35, size: 32, offset: 1952)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !259, file: !260, line: 71, baseType: !272, size: 32, offset: 1984)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !259, file: !260, line: 72, baseType: !279, size: 32, offset: 2016)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !259, file: !260, line: 73, baseType: !279, size: 32, offset: 2048)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !259, file: !260, line: 75, baseType: !257, size: 32, offset: 2080)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !259, file: !260, line: 77, baseType: !22, size: 64, offset: 2112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !259, file: !260, line: 78, baseType: !22, size: 64, offset: 2176)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !259, file: !260, line: 79, baseType: !22, size: 64, offset: 2240)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !259, file: !260, line: 80, baseType: !22, size: 64, offset: 2304)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !259, file: !260, line: 81, baseType: !22, size: 64, offset: 2368)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !259, file: !260, line: 82, baseType: !22, size: 64, offset: 2432)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !251, file: !154, line: 121, baseType: !49, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !251, file: !154, line: 122, baseType: !49, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !251, file: !154, line: 123, baseType: !506, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !154, line: 103, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 98, size: 1344, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !508, file: !154, line: 99, baseType: !88, size: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !508, file: !154, line: 100, baseType: !72, size: 32, offset: 1216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !508, file: !154, line: 101, baseType: !72, size: 32, offset: 1248)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !508, file: !154, line: 102, baseType: !35, size: 32, offset: 1280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !251, file: !154, line: 124, baseType: !144, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !251, file: !154, line: 126, baseType: !6, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !251, file: !154, line: 127, baseType: !35, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !251, file: !154, line: 128, baseType: !35, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !251, file: !154, line: 130, baseType: !519, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !154, line: 112, baseType: !246)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !251, file: !154, line: 131, baseType: !181, size: 32, offset: 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !241, file: !154, line: 81, baseType: !35, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !241, file: !154, line: 82, baseType: !35, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !241, file: !154, line: 83, baseType: !6, size: 32, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !226, line: 236, baseType: !35, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !225, file: !226, line: 238, baseType: !526, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !144}
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !36, line: 78, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !8, line: 140, baseType: !80)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !225, file: !226, line: 240, baseType: !532, size: 32, offset: 352)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{!529, !257}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !225, file: !226, line: 242, baseType: !532, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !225, file: !226, line: 243, baseType: !532, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !225, file: !226, line: 244, baseType: !538, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !257}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !225, file: !226, line: 245, baseType: !538, size: 32, offset: 480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !225, file: !226, line: 247, baseType: !538, size: 32, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !225, file: !226, line: 249, baseType: !7, size: 32, offset: 544)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !225, file: !226, line: 250, baseType: !7, size: 32, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !225, file: !226, line: 251, baseType: !7, size: 32, offset: 608)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !225, file: !226, line: 252, baseType: !7, size: 32, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !225, file: !226, line: 253, baseType: !7, size: 32, offset: 672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !225, file: !226, line: 254, baseType: !7, size: 32, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !225, file: !226, line: 255, baseType: !7, size: 32, offset: 736)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !225, file: !226, line: 256, baseType: !7, size: 32, offset: 768)
!551 = !DIGlobalVariableExpression(var: !552)
!552 = distinct !DIGlobalVariable(name: "ngx_http_split_clients_commands", scope: !2, file: !3, line: 30, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 448, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 2)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !557, line: 36, baseType: !558)
!557 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !557, line: 24, size: 256, elements: !559)
!559 = !{!560, !564, !565, !569, !573, !574, !578, !579}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !558, file: !557, line: 25, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!529, !249}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !558, file: !557, line: 26, baseType: !561, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !558, file: !557, line: 28, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!6, !249}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !558, file: !557, line: 29, baseType: !570, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DISubroutineType(types: !572)
!572 = !{!181, !249, !6}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !558, file: !557, line: 31, baseType: !566, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !558, file: !557, line: 32, baseType: !575, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DISubroutineType(types: !577)
!577 = !{!181, !249, !6, !6}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !558, file: !557, line: 34, baseType: !566, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !558, file: !557, line: 35, baseType: !575, size: 32, offset: 224)
!580 = !{i32 2, !"Dwarf Version", i32 4}
!581 = !{i32 2, !"Debug Info Version", i32 3}
!582 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!583 = distinct !DISubprogram(name: "ngx_conf_split_clients_block", scope: !3, file: !3, line: 111, type: !247, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !593, !594, !595, !596, !1843, !1844, !1851}
!585 = !DILocalVariable(name: "cf", arg: 1, scope: !583, file: !3, line: 111, type: !249)
!586 = !DILocalVariable(name: "cmd", arg: 2, scope: !583, file: !3, line: 111, type: !239)
!587 = !DILocalVariable(name: "conf", arg: 3, scope: !583, file: !3, line: 111, type: !6)
!588 = !DILocalVariable(name: "rv", scope: !583, file: !3, line: 113, type: !181)
!589 = !DILocalVariable(name: "sum", scope: !583, file: !3, line: 114, type: !220)
!590 = !DILocalVariable(name: "last", scope: !583, file: !3, line: 114, type: !220)
!591 = !DILocalVariable(name: "value", scope: !583, file: !3, line: 115, type: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!593 = !DILocalVariable(name: "name", scope: !583, file: !3, line: 115, type: !22)
!594 = !DILocalVariable(name: "i", scope: !583, file: !3, line: 116, type: !35)
!595 = !DILocalVariable(name: "save", scope: !583, file: !3, line: 117, type: !250)
!596 = !DILocalVariable(name: "var", scope: !583, file: !3, line: 118, type: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_t", file: !599, line: 21, baseType: !600)
!599 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_variable_s", file: !599, line: 37, size: 224, elements: !601)
!601 = !{!602, !603, !1835, !1840, !1841, !1842}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !599, line: 38, baseType: !22, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "set_handler", scope: !600, file: !599, line: 39, baseType: !604, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_set_variable_pt", file: !599, line: 23, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !608, !1529, !7}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !610, line: 16, baseType: !611)
!610 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !612, line: 364, size: 5376, elements: !613)
!612 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!613 = !{!614, !615, !616, !617, !618, !619, !620, !625, !626, !839, !1389, !1390, !1391, !1392, !1431, !1461, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1506, !1517, !1524, !1525, !1527, !1528, !1540, !1541, !1542, !1543, !1544, !1545, !1731, !1735, !1740, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !611, file: !612, line: 365, baseType: !220, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !611, file: !612, line: 367, baseType: !272, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !611, file: !612, line: 369, baseType: !265, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !611, file: !612, line: 370, baseType: !265, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !611, file: !612, line: 371, baseType: !265, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !611, file: !612, line: 372, baseType: !265, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !611, file: !612, line: 374, baseType: !621, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !612, line: 361, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !608}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !611, file: !612, line: 375, baseType: !621, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !611, file: !612, line: 378, baseType: !627, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !610, line: 18, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !630, line: 65, size: 3008, elements: !631)
!630 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!631 = !{!632, !633, !634, !635, !639, !640, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !797, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !629, file: !630, line: 66, baseType: !88, size: 1216)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !629, file: !630, line: 67, baseType: !40, size: 160, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !629, file: !630, line: 68, baseType: !220, size: 32, offset: 1376)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !629, file: !630, line: 69, baseType: !636, size: 128, offset: 1408)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 16)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !629, file: !630, line: 70, baseType: !636, size: 128, offset: 1536)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !629, file: !630, line: 72, baseType: !641, size: 32, offset: 1664)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !94, line: 18, baseType: !105)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !629, file: !630, line: 73, baseType: !132, size: 32, offset: 1696)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !629, file: !630, line: 74, baseType: !132, size: 32, offset: 1728)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !629, file: !630, line: 75, baseType: !132, size: 32, offset: 1760)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !629, file: !630, line: 76, baseType: !132, size: 32, offset: 1792)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !629, file: !630, line: 77, baseType: !132, size: 32, offset: 1824)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !629, file: !630, line: 79, baseType: !22, size: 64, offset: 1856)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !629, file: !630, line: 80, baseType: !22, size: 64, offset: 1920)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !629, file: !630, line: 81, baseType: !636, size: 128, offset: 1984)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !629, file: !630, line: 83, baseType: !27, size: 32, offset: 2112)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !629, file: !630, line: 84, baseType: !27, size: 32, offset: 2144)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !629, file: !630, line: 85, baseType: !79, size: 32, offset: 2176)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !629, file: !630, line: 86, baseType: !79, size: 32, offset: 2208)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !629, file: !630, line: 88, baseType: !35, size: 32, offset: 2240)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !629, file: !630, line: 89, baseType: !35, size: 32, offset: 2272)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !629, file: !630, line: 90, baseType: !35, size: 32, offset: 2304)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !629, file: !630, line: 91, baseType: !35, size: 32, offset: 2336)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !629, file: !630, line: 93, baseType: !72, size: 32, offset: 2368)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !629, file: !630, line: 95, baseType: !660, size: 32, offset: 2400)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !610, line: 19, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !630, line: 157, size: 544, elements: !663)
!663 = !{!664, !679, !740, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !796}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !662, file: !630, line: 158, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !630, line: 154, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 145, size: 480, elements: !668)
!668 = !{!669, !670, !671, !672, !675, !676, !677, !678}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !667, file: !630, line: 146, baseType: !462, size: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !667, file: !630, line: 147, baseType: !314, size: 160, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !667, file: !630, line: 148, baseType: !327, size: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !667, file: !630, line: 149, baseType: !673, size: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !165, line: 106, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !667, file: !630, line: 150, baseType: !673, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !667, file: !630, line: 151, baseType: !79, size: 32, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !667, file: !630, line: 152, baseType: !35, size: 32, offset: 416)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !667, file: !630, line: 153, baseType: !35, size: 32, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !662, file: !630, line: 159, baseType: !680, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !682, line: 59, baseType: !683)
!682 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 34, size: 800, elements: !684)
!684 = !{!685, !692, !693, !694, !702, !703, !704, !713, !714, !715, !716, !735, !736, !737, !738, !739}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !683, file: !682, line: 35, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !687, line: 21, baseType: !688)
!687 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 16, size: 64, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !688, file: !687, line: 17, baseType: !673, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !688, file: !687, line: 19, baseType: !673, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !683, file: !682, line: 37, baseType: !27, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !683, file: !682, line: 38, baseType: !27, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !683, file: !682, line: 40, baseType: !695, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !682, line: 16, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !682, line: 18, size: 96, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !697, file: !682, line: 19, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !682, line: 20, baseType: !695, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !682, line: 21, baseType: !7, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !683, file: !682, line: 41, baseType: !695, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !683, file: !682, line: 42, baseType: !696, size: 96, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !683, file: !682, line: 44, baseType: !705, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !682, line: 31, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 25, size: 128, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !707, file: !682, line: 26, baseType: !35, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !707, file: !682, line: 27, baseType: !35, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !707, file: !682, line: 29, baseType: !35, size: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !707, file: !682, line: 30, baseType: !35, size: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !683, file: !682, line: 45, baseType: !35, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !683, file: !682, line: 47, baseType: !29, size: 32, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !683, file: !682, line: 48, baseType: !29, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !683, file: !682, line: 50, baseType: !717, size: 256, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !687, line: 37, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 24, size: 256, elements: !719)
!719 = !{!720, !722, !723, !724, !734}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !718, file: !687, line: 26, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !718, file: !687, line: 28, baseType: !721, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !718, file: !687, line: 29, baseType: !35, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !718, file: !687, line: 30, baseType: !725, size: 128, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !726, line: 19, baseType: !727)
!726 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !726, line: 17, size: 128, elements: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !727, file: !726, line: 18, baseType: !730, size: 128)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 128, elements: !732)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!732 = !{!733}
!733 = !DISubrange(count: 4)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !718, file: !687, line: 36, baseType: !35, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !683, file: !682, line: 52, baseType: !29, size: 32, offset: 672)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !683, file: !682, line: 53, baseType: !30, size: 8, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !683, file: !682, line: 55, baseType: !9, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !683, file: !682, line: 57, baseType: !6, size: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !683, file: !682, line: 58, baseType: !6, size: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !662, file: !630, line: 161, baseType: !741, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !90, line: 62, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 50, size: 384, elements: !744)
!744 = !{!745, !746, !747, !749, !754, !756, !758, !759, !760}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !90, line: 51, baseType: !22, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !743, file: !90, line: 52, baseType: !27, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !743, file: !90, line: 53, baseType: !748, size: 96, offset: 96)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !139)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !743, file: !90, line: 55, baseType: !750, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !90, line: 45, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{!394, !6}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !743, file: !90, line: 56, baseType: !755, size: 32, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !90, line: 46, baseType: !751)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !743, file: !90, line: 57, baseType: !757, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !90, line: 47, baseType: !214)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !743, file: !90, line: 58, baseType: !6, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !743, file: !90, line: 60, baseType: !29, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !743, file: !90, line: 61, baseType: !35, size: 32, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !662, file: !630, line: 163, baseType: !79, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !662, file: !630, line: 164, baseType: !27, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !662, file: !630, line: 166, baseType: !132, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !662, file: !630, line: 168, baseType: !132, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !662, file: !630, line: 170, baseType: !35, size: 32, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !662, file: !630, line: 171, baseType: !35, size: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !662, file: !630, line: 172, baseType: !394, size: 32, offset: 288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !662, file: !630, line: 173, baseType: !394, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !662, file: !630, line: 174, baseType: !394, size: 32, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !662, file: !630, line: 176, baseType: !35, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !662, file: !630, line: 177, baseType: !394, size: 32, offset: 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !662, file: !630, line: 178, baseType: !394, size: 32, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !662, file: !630, line: 180, baseType: !774, size: 32, offset: 480)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !260, line: 25, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !260, line: 29, size: 320, elements: !777)
!777 = !{!778, !779, !789, !794, !795}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !776, file: !260, line: 30, baseType: !6, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !776, file: !260, line: 31, baseType: !780, size: 192, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !781, line: 22, baseType: !782)
!781 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !781, line: 16, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !782, file: !781, line: 17, baseType: !29, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !781, line: 18, baseType: !27, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !781, line: 19, baseType: !22, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !782, file: !781, line: 20, baseType: !144, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !782, file: !781, line: 21, baseType: !35, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !776, file: !260, line: 32, baseType: !790, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !260, line: 27, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!529, !774, !6}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !776, file: !260, line: 33, baseType: !6, size: 32, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !776, file: !260, line: 34, baseType: !35, size: 32, offset: 288)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !662, file: !630, line: 182, baseType: !35, size: 32, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !629, file: !630, line: 96, baseType: !798, size: 32, offset: 2432)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !630, line: 62, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 39, size: 576, elements: !801)
!801 = !{!802, !803, !804, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !800, file: !630, line: 40, baseType: !314, size: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !800, file: !630, line: 41, baseType: !327, size: 64, offset: 160)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !800, file: !630, line: 43, baseType: !805, size: 96, offset: 224)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 12)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !800, file: !630, line: 46, baseType: !9, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !800, file: !630, line: 47, baseType: !9, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !800, file: !630, line: 48, baseType: !9, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !800, file: !630, line: 49, baseType: !9, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !800, file: !630, line: 50, baseType: !9, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !800, file: !630, line: 51, baseType: !9, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !800, file: !630, line: 52, baseType: !9, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !800, file: !630, line: 53, baseType: !9, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !800, file: !630, line: 56, baseType: !641, size: 32, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !800, file: !630, line: 57, baseType: !132, size: 32, offset: 416)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !800, file: !630, line: 58, baseType: !132, size: 32, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !800, file: !630, line: 59, baseType: !27, size: 32, offset: 480)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !800, file: !630, line: 60, baseType: !79, size: 32, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !800, file: !630, line: 61, baseType: !394, size: 32, offset: 544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !629, file: !630, line: 102, baseType: !394, size: 32, offset: 2464)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !629, file: !630, line: 103, baseType: !394, size: 32, offset: 2496)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !629, file: !630, line: 104, baseType: !394, size: 32, offset: 2528)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !629, file: !630, line: 105, baseType: !394, size: 32, offset: 2560)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !629, file: !630, line: 107, baseType: !280, size: 384, offset: 2592)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !629, file: !630, line: 109, baseType: !9, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !629, file: !630, line: 110, baseType: !9, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !629, file: !630, line: 112, baseType: !9, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !629, file: !630, line: 113, baseType: !9, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !629, file: !630, line: 114, baseType: !9, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !629, file: !630, line: 115, baseType: !9, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !629, file: !630, line: 116, baseType: !9, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !629, file: !630, line: 117, baseType: !9, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !629, file: !630, line: 118, baseType: !9, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !629, file: !630, line: 119, baseType: !9, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !629, file: !630, line: 121, baseType: !9, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !629, file: !630, line: 122, baseType: !9, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !611, file: !612, line: 381, baseType: !840, size: 32, offset: 288)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !610, line: 17, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !843, line: 313, size: 4096, elements: !844)
!843 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!844 = !{!845, !850, !851, !891, !970, !971, !993, !1002, !1116, !1117, !1118, !1156, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1334, !1338, !1339, !1343, !1344, !1345, !1346, !1347, !1351, !1355, !1359, !1360, !1372, !1373, !1374, !1375, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !842, file: !843, line: 314, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !843, line: 309, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !608, !840}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !842, file: !843, line: 315, baseType: !846, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !842, file: !843, line: 317, baseType: !852, size: 480, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !853, line: 22, baseType: !854)
!853 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !853, line: 36, size: 480, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !868, !873, !875, !876, !885, !886, !887, !888, !889, !890}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !854, file: !853, line: 37, baseType: !272, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !854, file: !853, line: 39, baseType: !364, size: 32, offset: 32)
