; ModuleID = 'src/http/modules/ngx_http_access_module.c'
source_filename = "src/http/modules/ngx_http_access_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_access_module_ctx", scope: !2, file: !3, line: 91, type: !599, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !82)
!3 = !DIFile(filename: "src/http/modules/ngx_http_access_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !54, !77, !78, !79}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !32, line: 16, size: 128, elements: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !{!34, !38, !41, !48}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !31, file: !32, line: 17, baseType: !35, size: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !36, line: 409, baseType: !37)
!36 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !31, file: !32, line: 18, baseType: !39, size: 16, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !32, line: 12, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !36, line: 186, baseType: !37)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !31, file: !32, line: 19, baseType: !42, size: 32, offset: 32)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !32, line: 14, size: 32, elements: !43)
!43 = !{!44}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !42, file: !32, line: 14, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !32, line: 13, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 191, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !31, file: !32, line: 20, baseType: !49, size: 64, offset: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !52)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !36, line: 181, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !{!53}
!53 = !DISubrange(count: 8)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !32, line: 34, size: 224, elements: !56)
!56 = !{!57, !58, !59, !60, !76}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !55, file: !32, line: 35, baseType: !35, size: 16)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !55, file: !32, line: 36, baseType: !39, size: 16, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !55, file: !32, line: 37, baseType: !46, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !55, file: !32, line: 38, baseType: !61, size: 128, offset: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !32, line: 23, size: 128, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !61, file: !32, line: 28, baseType: !64, size: 128)
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !32, line: 24, size: 128, elements: !65)
!65 = !{!66, !70, !72}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !64, file: !32, line: 25, baseType: !67, size: 128)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !64, file: !32, line: 26, baseType: !71, size: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !52)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !64, file: !32, line: 27, baseType: !73, size: 128)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !55, file: !32, line: 39, baseType: !46, size: 32, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !{!83, !0, !596}
!83 = !DIGlobalVariableExpression(var: !84)
!84 = distinct !DIGlobalVariable(name: "ngx_http_access_module", scope: !2, file: !3, line: 106, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !86, line: 15, baseType: !87)
!86 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !88, line: 222, size: 800, elements: !89)
!88 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!89 = !{!90, !94, !95, !97, !98, !99, !100, !101, !102, !569, !570, !576, !580, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !87, file: !88, line: 223, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !92, line: 79, baseType: !93)
!92 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !36, line: 125, baseType: !47)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !87, file: !88, line: 224, baseType: !91, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !88, line: 226, baseType: !96, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !87, file: !88, line: 228, baseType: !91, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !87, file: !88, line: 229, baseType: !91, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !87, file: !88, line: 231, baseType: !91, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !87, file: !88, line: 232, baseType: !79, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !87, file: !88, line: 234, baseType: !27, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !87, file: !88, line: 235, baseType: !103, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !86, line: 22, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !106, line: 77, size: 224, elements: !107)
!106 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = !{!108, !119, !120, !566, !567, !568}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !106, line: 78, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !110, line: 19, baseType: !111)
!110 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 16, size: 64, elements: !112)
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !111, file: !110, line: 17, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 120, baseType: !47)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !110, line: 18, baseType: !116, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !118, line: 64, baseType: !51)
!118 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !106, line: 79, baseType: !91, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !105, file: !106, line: 80, baseType: !121, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{!96, !124, !103, !27}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !86, line: 16, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !106, line: 116, size: 384, elements: !127)
!127 = !{!128, !129, !307, !548, !549, !550, !559, !560, !561, !562, !563, !565}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !106, line: 117, baseType: !96, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !126, file: !106, line: 118, baseType: !130, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !132, line: 22, baseType: !133)
!132 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 16, size: 160, elements: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !133, file: !132, line: 17, baseType: !27, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !133, file: !132, line: 18, baseType: !91, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !132, line: 19, baseType: !114, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !133, file: !132, line: 20, baseType: !91, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !133, file: !132, line: 21, baseType: !140, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !86, line: 18, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !143, line: 57, size: 320, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !153, !154, !155, !287, !294, !306}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !142, file: !143, line: 58, baseType: !146, size: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !143, line: 54, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 49, size: 128, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !147, file: !143, line: 50, baseType: !116, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !147, file: !143, line: 51, baseType: !116, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !143, line: 52, baseType: !140, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !147, file: !143, line: 53, baseType: !91, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !142, file: !143, line: 59, baseType: !114, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !142, file: !143, line: 60, baseType: !140, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !142, file: !143, line: 61, baseType: !156, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !86, line: 19, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !159, line: 59, size: 64, elements: !160)
!159 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!160 = !{!161, !286}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !158, file: !159, line: 60, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !159, line: 18, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !159, line: 20, size: 352, elements: !165)
!165 = !{!166, !167, !168, !171, !172, !173, !174, !176, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !164, file: !159, line: 21, baseType: !116, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !164, file: !159, line: 22, baseType: !116, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !164, file: !159, line: 23, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !36, line: 222, baseType: !170)
!170 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !164, file: !159, line: 24, baseType: !169, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !164, file: !159, line: 26, baseType: !116, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !164, file: !159, line: 27, baseType: !116, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !164, file: !159, line: 28, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !159, line: 16, baseType: !27)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !164, file: !159, line: 29, baseType: !177, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !86, line: 23, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !180, line: 16, size: 1216, elements: !181)
!180 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!181 = !{!182, !185, !186, !231, !232, !233, !271, !272}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !179, file: !180, line: 17, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !184, line: 16, baseType: !170)
!184 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 18, baseType: !109, size: 64, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !179, file: !180, line: 19, baseType: !187, size: 960, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !184, line: 17, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !189, line: 4, size: 960, elements: !190)
!189 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !{!191, !193, !194, !196, !197, !199, !200, !202, !204, !206, !207, !208, !209, !210, !211, !214, !215, !217, !218, !224, !225, !226}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !188, file: !189, line: 6, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !36, line: 232, baseType: !47)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !188, file: !189, line: 7, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !188, file: !189, line: 8, baseType: !195, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !36, line: 227, baseType: !47)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !188, file: !189, line: 9, baseType: !195, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !188, file: !189, line: 10, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !36, line: 217, baseType: !47)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !188, file: !189, line: 11, baseType: !198, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !188, file: !189, line: 13, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !36, line: 212, baseType: !47)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !188, file: !189, line: 14, baseType: !203, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !36, line: 304, baseType: !47)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !188, file: !189, line: 15, baseType: !205, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !36, line: 309, baseType: !47)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !188, file: !189, line: 16, baseType: !47, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !188, file: !189, line: 17, baseType: !192, size: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !188, file: !189, line: 18, baseType: !192, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !188, file: !189, line: 19, baseType: !169, size: 32, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !188, file: !189, line: 20, baseType: !169, size: 32, offset: 416)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !188, file: !189, line: 21, baseType: !212, size: 32, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !36, line: 237, baseType: !213)
!213 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !188, file: !189, line: 22, baseType: !212, size: 32, offset: 480)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !188, file: !189, line: 23, baseType: !216, size: 32, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !36, line: 242, baseType: !170)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !188, file: !189, line: 24, baseType: !216, size: 32, offset: 544)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !188, file: !189, line: 26, baseType: !219, size: 64, offset: 576)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !36, line: 288, size: 64, elements: !220)
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !219, file: !36, line: 288, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !36, line: 75, baseType: !213)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !219, file: !36, line: 288, baseType: !213, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !188, file: !189, line: 27, baseType: !219, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !188, file: !189, line: 28, baseType: !219, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !188, file: !189, line: 29, baseType: !227, size: 192, offset: 768)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 192, elements: !229)
!228 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!229 = !{!230}
!230 = !DISubrange(count: 3)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !179, file: !180, line: 21, baseType: !169, size: 32, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !179, file: !180, line: 22, baseType: !169, size: 32, offset: 1120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !179, file: !180, line: 24, baseType: !234, size: 32, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !86, line: 20, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !237, line: 50, size: 320, elements: !238)
!237 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!238 = !{!239, !240, !252, !256, !257, !262, !263, !268, !269, !270}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !236, file: !237, line: 51, baseType: !91, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !236, file: !237, line: 52, baseType: !241, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !86, line: 21, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !106, line: 89, size: 160, elements: !244)
!244 = !{!245, !246, !247, !251}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !243, file: !106, line: 90, baseType: !183, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !106, line: 91, baseType: !109, size: 64, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !243, file: !106, line: 93, baseType: !248, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !241, !234}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !106, line: 94, baseType: !27, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !236, file: !237, line: 54, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !254, line: 98, baseType: !255)
!254 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!255 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !236, file: !237, line: 56, baseType: !222, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !236, file: !237, line: 58, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !237, line: 45, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!116, !234, !116, !114}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !237, line: 59, baseType: !27, size: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !236, file: !237, line: 61, baseType: !264, size: 32, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !237, line: 46, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !234, !91, !116, !114}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !236, file: !237, line: 62, baseType: !27, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !236, file: !237, line: 70, baseType: !96, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !237, line: 72, baseType: !234, size: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !179, file: !180, line: 37, baseType: !47, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !179, file: !180, line: 38, baseType: !47, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !164, file: !159, line: 30, baseType: !162, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !164, file: !159, line: 34, baseType: !47, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !164, file: !159, line: 40, baseType: !47, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !164, file: !159, line: 43, baseType: !47, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !164, file: !159, line: 45, baseType: !47, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !164, file: !159, line: 46, baseType: !47, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !164, file: !159, line: 47, baseType: !47, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !164, file: !159, line: 48, baseType: !47, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !164, file: !159, line: 49, baseType: !47, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !164, file: !159, line: 50, baseType: !47, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !164, file: !159, line: 52, baseType: !47, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !164, file: !159, line: 53, baseType: !47, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !164, file: !159, line: 55, baseType: !170, size: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !159, line: 61, baseType: !156, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !142, file: !143, line: 62, baseType: !288, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !143, line: 41, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !143, line: 43, size: 64, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !143, line: 44, baseType: !288, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !290, file: !143, line: 45, baseType: !27, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !142, file: !143, line: 63, baseType: !295, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !143, line: 32, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !143, line: 34, size: 96, elements: !298)
!298 = !{!299, !304, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !297, file: !143, line: 35, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !143, line: 30, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !27}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !297, file: !143, line: 36, baseType: !27, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !143, line: 37, baseType: !295, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !142, file: !143, line: 64, baseType: !234, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !126, file: !106, line: 120, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !86, line: 17, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !311, line: 38, size: 2496, elements: !312)
!311 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!312 = !{!313, !316, !317, !318, !319, !320, !494, !495, !496, !499, !500, !501, !502, !503, !504, !505, !506, !517, !518, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !310, file: !311, line: 39, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !310, file: !311, line: 40, baseType: !140, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !310, file: !311, line: 42, baseType: !234, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !310, file: !311, line: 43, baseType: !235, size: 320, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !310, file: !311, line: 45, baseType: !91, size: 32, offset: 416)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !310, file: !311, line: 47, baseType: !321, size: 32, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !86, line: 26, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !325, line: 121, size: 896, elements: !326)
!325 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!326 = !{!327, !328, !384, !385, !388, !395, !397, !402, !407, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !325, line: 122, baseType: !27, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !324, file: !325, line: 123, baseType: !329, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !86, line: 24, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !332, line: 30, size: 384, elements: !333)
!332 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !361, !362, !363, !376}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !332, line: 31, baseType: !27, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !331, file: !332, line: 33, baseType: !47, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !331, file: !332, line: 35, baseType: !47, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !331, file: !332, line: 38, baseType: !47, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !331, file: !332, line: 44, baseType: !47, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !331, file: !332, line: 46, baseType: !47, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !331, file: !332, line: 49, baseType: !47, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !331, file: !332, line: 51, baseType: !47, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !331, file: !332, line: 54, baseType: !47, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !331, file: !332, line: 56, baseType: !47, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !331, file: !332, line: 57, baseType: !47, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !331, file: !332, line: 59, baseType: !47, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !331, file: !332, line: 60, baseType: !47, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !331, file: !332, line: 62, baseType: !47, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !331, file: !332, line: 64, baseType: !47, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !331, file: !332, line: 67, baseType: !47, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !331, file: !332, line: 69, baseType: !47, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !331, file: !332, line: 71, baseType: !47, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !331, file: !332, line: 74, baseType: !47, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !331, file: !332, line: 75, baseType: !47, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !331, file: !332, line: 77, baseType: !47, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !331, file: !332, line: 107, baseType: !47, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !331, file: !332, line: 110, baseType: !357, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !86, line: 31, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !329}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !331, file: !332, line: 117, baseType: !91, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !331, file: !332, line: 119, baseType: !234, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !331, file: !332, line: 121, baseType: !364, size: 160, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !365, line: 20, baseType: !366)
!365 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !365, line: 22, size: 160, elements: !367)
!367 = !{!368, !370, !372, !373, !374, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !366, file: !365, line: 23, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !365, line: 16, baseType: !91)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !366, file: !365, line: 24, baseType: !371, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !366, file: !365, line: 25, baseType: !371, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !366, file: !365, line: 26, baseType: !371, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !366, file: !365, line: 27, baseType: !117, size: 8, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !365, line: 28, baseType: !117, size: 8, offset: 136)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !331, file: !332, line: 124, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !378, line: 16, baseType: !379)
!378 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !378, line: 18, size: 64, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !378, line: 19, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !378, line: 20, baseType: !382, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !324, file: !325, line: 124, baseType: !329, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !324, file: !325, line: 126, baseType: !386, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !387, line: 17, baseType: !170)
!387 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !324, file: !325, line: 128, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !390, line: 19, baseType: !391)
!390 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !322, !116, !114}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !36, line: 135, baseType: !170)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !324, file: !325, line: 129, baseType: !396, size: 32, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !390, line: 22, baseType: !391)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !324, file: !325, line: 130, baseType: !398, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !390, line: 20, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DISubroutineType(types: !401)
!401 = !{!394, !322, !156, !169}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !324, file: !325, line: 131, baseType: !403, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !390, line: 23, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DISubroutineType(types: !406)
!406 = !{!156, !322, !156, !169}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !324, file: !325, line: 133, baseType: !408, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !325, line: 16, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !325, line: 18, size: 960, elements: !411)
!411 = !{!412, !413, !423, !425, !426, !427, !428, !429, !430, !431, !436, !437, !438, !439, !440, !441, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !410, file: !325, line: 19, baseType: !386, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !410, file: !325, line: 21, baseType: !414, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !416, line: 297, size: 128, elements: !417)
!416 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !415, file: !416, line: 298, baseType: !35, size: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !415, file: !416, line: 299, baseType: !420, size: 112, offset: 16)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 112, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 14)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !410, file: !325, line: 22, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !36, line: 404, baseType: !47)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !410, file: !325, line: 23, baseType: !114, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !410, file: !325, line: 24, baseType: !109, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !325, line: 26, baseType: !170, size: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !410, file: !325, line: 28, baseType: !170, size: 32, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !410, file: !325, line: 29, baseType: !170, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !410, file: !325, line: 30, baseType: !170, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !410, file: !325, line: 38, baseType: !432, size: 32, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !86, line: 32, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !322}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !410, file: !325, line: 40, baseType: !27, size: 32, offset: 352)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !410, file: !325, line: 42, baseType: !235, size: 320, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !410, file: !325, line: 43, baseType: !234, size: 32, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !410, file: !325, line: 45, baseType: !114, size: 32, offset: 736)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !410, file: !325, line: 47, baseType: !114, size: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !410, file: !325, line: 49, baseType: !442, size: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !443, line: 16, baseType: !369)
!443 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !410, file: !325, line: 51, baseType: !408, size: 32, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !410, file: !325, line: 52, baseType: !322, size: 32, offset: 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !410, file: !325, line: 54, baseType: !91, size: 32, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !410, file: !325, line: 56, baseType: !47, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !410, file: !325, line: 57, baseType: !47, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !410, file: !325, line: 58, baseType: !47, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !410, file: !325, line: 60, baseType: !47, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !410, file: !325, line: 61, baseType: !47, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !410, file: !325, line: 62, baseType: !47, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !410, file: !325, line: 63, baseType: !47, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !410, file: !325, line: 64, baseType: !47, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !410, file: !325, line: 65, baseType: !47, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !410, file: !325, line: 66, baseType: !47, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !410, file: !325, line: 67, baseType: !47, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !410, file: !325, line: 70, baseType: !47, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !410, file: !325, line: 72, baseType: !47, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !410, file: !325, line: 73, baseType: !47, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !410, file: !325, line: 74, baseType: !47, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !410, file: !325, line: 76, baseType: !47, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !410, file: !325, line: 77, baseType: !47, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !410, file: !325, line: 78, baseType: !47, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !324, file: !325, line: 135, baseType: !169, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !324, file: !325, line: 137, baseType: !234, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !324, file: !325, line: 139, baseType: !140, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !325, line: 141, baseType: !170, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !324, file: !325, line: 143, baseType: !414, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !324, file: !325, line: 144, baseType: !424, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !324, file: !325, line: 145, baseType: !109, size: 64, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !324, file: !325, line: 147, baseType: !109, size: 64, offset: 544)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !324, file: !325, line: 148, baseType: !39, size: 16, offset: 608)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !324, file: !325, line: 154, baseType: !414, size: 32, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !324, file: !325, line: 155, baseType: !424, size: 32, offset: 672)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !324, file: !325, line: 157, baseType: !162, size: 32, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !324, file: !325, line: 159, baseType: !377, size: 64, offset: 736)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !324, file: !325, line: 161, baseType: !253, size: 32, offset: 800)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !324, file: !325, line: 163, baseType: !91, size: 32, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !324, file: !325, line: 165, baseType: !47, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !324, file: !325, line: 167, baseType: !47, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !324, file: !325, line: 169, baseType: !47, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !324, file: !325, line: 170, baseType: !47, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !324, file: !325, line: 171, baseType: !47, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !324, file: !325, line: 173, baseType: !47, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !324, file: !325, line: 174, baseType: !47, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !324, file: !325, line: 175, baseType: !47, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !324, file: !325, line: 176, baseType: !47, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !324, file: !325, line: 178, baseType: !47, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !324, file: !325, line: 179, baseType: !47, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !324, file: !325, line: 180, baseType: !47, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !324, file: !325, line: 181, baseType: !47, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !324, file: !325, line: 183, baseType: !47, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !310, file: !311, line: 48, baseType: !322, size: 32, offset: 480)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !310, file: !311, line: 49, baseType: !91, size: 32, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !310, file: !311, line: 51, baseType: !497, size: 32, offset: 544)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !310, file: !311, line: 52, baseType: !91, size: 32, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !310, file: !311, line: 53, baseType: !91, size: 32, offset: 608)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !310, file: !311, line: 55, baseType: !377, size: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !310, file: !311, line: 56, baseType: !91, size: 32, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !310, file: !311, line: 58, baseType: !131, size: 160, offset: 736)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !310, file: !311, line: 59, baseType: !131, size: 160, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !310, file: !311, line: 61, baseType: !131, size: 160, offset: 1056)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !310, file: !311, line: 62, baseType: !507, size: 96, offset: 1216)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !365, line: 32, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !365, line: 37, size: 96, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !508, file: !365, line: 38, baseType: !371, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !508, file: !365, line: 39, baseType: !371, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !508, file: !365, line: 40, baseType: !513, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !365, line: 34, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !371, !371, !371}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !310, file: !311, line: 63, baseType: !364, size: 160, offset: 1312)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !310, file: !311, line: 65, baseType: !519, size: 224, offset: 1472)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !520, line: 31, baseType: !521)
!520 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 25, size: 224, elements: !522)
!522 = !{!523, !531, !532, !533, !534}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !521, file: !520, line: 26, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !520, line: 16, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !520, line: 18, size: 96, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !526, file: !520, line: 19, baseType: !27, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !526, file: !520, line: 20, baseType: !91, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !520, line: 21, baseType: !524, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !521, file: !520, line: 27, baseType: !525, size: 96, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !521, file: !520, line: 28, baseType: !114, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !521, file: !520, line: 29, baseType: !91, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !521, file: !520, line: 30, baseType: !140, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !310, file: !311, line: 66, baseType: !519, size: 224, offset: 1696)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !310, file: !311, line: 68, baseType: !91, size: 32, offset: 1920)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !310, file: !311, line: 69, baseType: !91, size: 32, offset: 1952)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !310, file: !311, line: 71, baseType: !322, size: 32, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !310, file: !311, line: 72, baseType: !329, size: 32, offset: 2016)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !310, file: !311, line: 73, baseType: !329, size: 32, offset: 2048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !310, file: !311, line: 75, baseType: !308, size: 32, offset: 2080)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !310, file: !311, line: 77, baseType: !109, size: 64, offset: 2112)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !310, file: !311, line: 78, baseType: !109, size: 64, offset: 2176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !310, file: !311, line: 79, baseType: !109, size: 64, offset: 2240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !310, file: !311, line: 80, baseType: !109, size: 64, offset: 2304)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !310, file: !311, line: 81, baseType: !109, size: 64, offset: 2368)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !310, file: !311, line: 82, baseType: !109, size: 64, offset: 2432)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !126, file: !106, line: 121, baseType: !140, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !126, file: !106, line: 122, baseType: !140, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !126, file: !106, line: 123, baseType: !551, size: 32, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !106, line: 103, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 98, size: 1344, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !553, file: !106, line: 99, baseType: !178, size: 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !553, file: !106, line: 100, baseType: !162, size: 32, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !553, file: !106, line: 101, baseType: !162, size: 32, offset: 1248)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !553, file: !106, line: 102, baseType: !91, size: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !126, file: !106, line: 124, baseType: !234, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !126, file: !106, line: 126, baseType: !27, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !126, file: !106, line: 127, baseType: !91, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !126, file: !106, line: 128, baseType: !91, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !126, file: !106, line: 130, baseType: !564, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !106, line: 112, baseType: !121)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !126, file: !106, line: 131, baseType: !96, size: 32, offset: 352)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !105, file: !106, line: 81, baseType: !91, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !105, file: !106, line: 82, baseType: !91, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !105, file: !106, line: 83, baseType: !27, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !88, line: 236, baseType: !91, size: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !87, file: !88, line: 238, baseType: !571, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !234}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !92, line: 78, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !36, line: 140, baseType: !170)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !87, file: !88, line: 240, baseType: !577, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!574, !308}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !87, file: !88, line: 242, baseType: !577, size: 32, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !87, file: !88, line: 243, baseType: !577, size: 32, offset: 416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !87, file: !88, line: 244, baseType: !583, size: 32, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !308}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !87, file: !88, line: 245, baseType: !583, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !87, file: !88, line: 247, baseType: !583, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !87, file: !88, line: 249, baseType: !93, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !87, file: !88, line: 250, baseType: !93, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !87, file: !88, line: 251, baseType: !93, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !87, file: !88, line: 252, baseType: !93, size: 32, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !87, file: !88, line: 253, baseType: !93, size: 32, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !87, file: !88, line: 254, baseType: !93, size: 32, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !87, file: !88, line: 255, baseType: !93, size: 32, offset: 736)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !87, file: !88, line: 256, baseType: !93, size: 32, offset: 768)
!596 = !DIGlobalVariableExpression(var: !597)
!597 = distinct !DIGlobalVariable(name: "ngx_http_access_commands", scope: !2, file: !3, line: 68, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 672, elements: !229)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !22, line: 36, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 24, size: 256, elements: !601)
!601 = !{!602, !606, !607, !611, !615, !616, !620, !621}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !600, file: !22, line: 25, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DISubroutineType(types: !605)
!605 = !{!574, !124}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !600, file: !22, line: 26, baseType: !603, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !600, file: !22, line: 28, baseType: !608, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{!27, !124}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !600, file: !22, line: 29, baseType: !612, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{!96, !124, !27}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !600, file: !22, line: 31, baseType: !608, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !600, file: !22, line: 32, baseType: !617, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!96, !124, !27, !27}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !600, file: !22, line: 34, baseType: !608, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !600, file: !22, line: 35, baseType: !617, size: 32, offset: 224)
!622 = !{i32 2, !"Dwarf Version", i32 4}
!623 = !{i32 2, !"Debug Info Version", i32 3}
!624 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!625 = distinct !DISubprogram(name: "ngx_http_access_init", scope: !3, file: !3, line: 454, type: !604, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !626)
!626 = !{!627, !628, !1831}
!627 = !DILocalVariable(name: "cf", arg: 1, scope: !625, file: !3, line: 454, type: !124)
!628 = !DILocalVariable(name: "h", scope: !625, file: !3, line: 456, type: !629)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !631, line: 360, baseType: !632)
!631 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{!574, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !637, line: 16, baseType: !638)
!637 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !631, line: 364, size: 5376, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !651, !652, !861, !1393, !1394, !1395, !1396, !1435, !1465, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1510, !1521, !1528, !1529, !1530, !1531, !1544, !1545, !1546, !1547, !1548, !1549, !1727, !1731, !1736, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !638, file: !631, line: 365, baseType: !46, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !638, file: !631, line: 367, baseType: !322, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !638, file: !631, line: 369, baseType: !26, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !638, file: !631, line: 370, baseType: !26, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !638, file: !631, line: 371, baseType: !26, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !638, file: !631, line: 372, baseType: !26, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !638, file: !631, line: 374, baseType: !647, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !631, line: 361, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !635}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !638, file: !631, line: 375, baseType: !647, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !638, file: !631, line: 378, baseType: !653, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !637, line: 18, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !656, line: 65, size: 3008, elements: !657)
!656 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!657 = !{!658, !659, !660, !661, !663, !664, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !819, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !655, file: !656, line: 66, baseType: !178, size: 1216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !655, file: !656, line: 67, baseType: !131, size: 160, offset: 1216)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !655, file: !656, line: 68, baseType: !46, size: 32, offset: 1376)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !655, file: !656, line: 69, baseType: !662, size: 128, offset: 1408)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, elements: !68)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !655, file: !656, line: 70, baseType: !662, size: 128, offset: 1536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !655, file: !656, line: 72, baseType: !665, size: 32, offset: 1664)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !184, line: 18, baseType: !195)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !655, file: !656, line: 73, baseType: !222, size: 32, offset: 1696)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !655, file: !656, line: 74, baseType: !222, size: 32, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !655, file: !656, line: 75, baseType: !222, size: 32, offset: 1760)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !655, file: !656, line: 76, baseType: !222, size: 32, offset: 1792)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !655, file: !656, line: 77, baseType: !222, size: 32, offset: 1824)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !655, file: !656, line: 79, baseType: !109, size: 64, offset: 1856)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !655, file: !656, line: 80, baseType: !109, size: 64, offset: 1920)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !655, file: !656, line: 81, baseType: !662, size: 128, offset: 1984)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !655, file: !656, line: 83, baseType: !114, size: 32, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !655, file: !656, line: 84, baseType: !114, size: 32, offset: 2144)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !655, file: !656, line: 85, baseType: !169, size: 32, offset: 2176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !655, file: !656, line: 86, baseType: !169, size: 32, offset: 2208)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !655, file: !656, line: 88, baseType: !91, size: 32, offset: 2240)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !655, file: !656, line: 89, baseType: !91, size: 32, offset: 2272)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !655, file: !656, line: 90, baseType: !91, size: 32, offset: 2304)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !655, file: !656, line: 91, baseType: !91, size: 32, offset: 2336)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !655, file: !656, line: 93, baseType: !162, size: 32, offset: 2368)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !655, file: !656, line: 95, baseType: !684, size: 32, offset: 2400)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !637, line: 19, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !656, line: 157, size: 544, elements: !687)
!687 = !{!688, !703, !762, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !818}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !686, file: !656, line: 158, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !656, line: 154, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 145, size: 480, elements: !692)
!692 = !{!693, !694, !695, !696, !699, !700, !701, !702}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !691, file: !656, line: 146, baseType: !507, size: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !691, file: !656, line: 147, baseType: !364, size: 160, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !691, file: !656, line: 148, baseType: !377, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !691, file: !656, line: 149, baseType: !697, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !254, line: 106, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !253)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !691, file: !656, line: 150, baseType: !697, size: 32, offset: 352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !691, file: !656, line: 151, baseType: !169, size: 32, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !691, file: !656, line: 152, baseType: !91, size: 32, offset: 416)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !691, file: !656, line: 153, baseType: !91, size: 32, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !686, file: !656, line: 159, baseType: !704, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !706, line: 59, baseType: !707)
!706 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 34, size: 800, elements: !708)
!708 = !{!709, !716, !717, !718, !726, !727, !728, !737, !738, !739, !740, !757, !758, !759, !760, !761}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !707, file: !706, line: 35, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !711, line: 21, baseType: !712)
!711 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 16, size: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !712, file: !711, line: 17, baseType: !697, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !712, file: !711, line: 19, baseType: !697, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !707, file: !706, line: 37, baseType: !114, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !707, file: !706, line: 38, baseType: !114, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !707, file: !706, line: 40, baseType: !719, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !706, line: 16, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !706, line: 18, size: 96, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !721, file: !706, line: 19, baseType: !93, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !706, line: 20, baseType: !719, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !721, file: !706, line: 21, baseType: !93, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !707, file: !706, line: 41, baseType: !719, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !707, file: !706, line: 42, baseType: !720, size: 96, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !707, file: !706, line: 44, baseType: !729, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !706, line: 31, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 25, size: 128, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !731, file: !706, line: 26, baseType: !91, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !731, file: !706, line: 27, baseType: !91, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !731, file: !706, line: 29, baseType: !91, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !731, file: !706, line: 30, baseType: !91, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !707, file: !706, line: 45, baseType: !91, size: 32, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !707, file: !706, line: 47, baseType: !116, size: 32, offset: 352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !707, file: !706, line: 48, baseType: !116, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !707, file: !706, line: 50, baseType: !741, size: 256, offset: 416)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !711, line: 37, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 24, size: 256, elements: !743)
!743 = !{!744, !746, !747, !748, !756}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !742, file: !711, line: 26, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !742, file: !711, line: 28, baseType: !745, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !742, file: !711, line: 29, baseType: !91, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !742, file: !711, line: 30, baseType: !749, size: 128, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !750, line: 19, baseType: !751)
!750 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !750, line: 17, size: 128, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !751, file: !750, line: 18, baseType: !754, size: 128)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 128, elements: !74)
!755 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !742, file: !711, line: 36, baseType: !91, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !707, file: !706, line: 52, baseType: !116, size: 32, offset: 672)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !707, file: !706, line: 53, baseType: !117, size: 8, offset: 704)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !707, file: !706, line: 55, baseType: !47, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !707, file: !706, line: 57, baseType: !27, size: 32, offset: 736)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !707, file: !706, line: 58, baseType: !27, size: 32, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !686, file: !656, line: 161, baseType: !763, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !180, line: 62, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 50, size: 384, elements: !766)
!766 = !{!767, !768, !769, !771, !776, !778, !780, !781, !782}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !180, line: 51, baseType: !109, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !765, file: !180, line: 52, baseType: !114, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !765, file: !180, line: 53, baseType: !770, size: 96, offset: 96)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 96, elements: !229)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !765, file: !180, line: 55, baseType: !772, size: 32, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !180, line: 45, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!442, !27}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !765, file: !180, line: 56, baseType: !777, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !180, line: 46, baseType: !773)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !765, file: !180, line: 57, baseType: !779, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !180, line: 47, baseType: !301)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !180, line: 58, baseType: !27, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !765, file: !180, line: 60, baseType: !116, size: 32, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !765, file: !180, line: 61, baseType: !91, size: 32, offset: 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !686, file: !656, line: 163, baseType: !169, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !686, file: !656, line: 164, baseType: !114, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !686, file: !656, line: 166, baseType: !222, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !686, file: !656, line: 168, baseType: !222, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !686, file: !656, line: 170, baseType: !91, size: 32, offset: 224)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !686, file: !656, line: 171, baseType: !91, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !686, file: !656, line: 172, baseType: !442, size: 32, offset: 288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !686, file: !656, line: 173, baseType: !442, size: 32, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !686, file: !656, line: 174, baseType: !442, size: 32, offset: 352)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !686, file: !656, line: 176, baseType: !91, size: 32, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !686, file: !656, line: 177, baseType: !442, size: 32, offset: 416)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !686, file: !656, line: 178, baseType: !442, size: 32, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !686, file: !656, line: 180, baseType: !796, size: 32, offset: 480)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !311, line: 25, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !311, line: 29, size: 320, elements: !799)
!799 = !{!800, !801, !811, !816, !817}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !311, line: 30, baseType: !27, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !798, file: !311, line: 31, baseType: !802, size: 192, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !803, line: 22, baseType: !804)
!803 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !803, line: 16, size: 192, elements: !805)
!805 = !{!806, !807, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !804, file: !803, line: 17, baseType: !116, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !803, line: 18, baseType: !114, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !803, line: 19, baseType: !109, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !804, file: !803, line: 20, baseType: !234, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !804, file: !803, line: 21, baseType: !91, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !798, file: !311, line: 32, baseType: !812, size: 32, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !311, line: 27, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!574, !796, !27}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !798, file: !311, line: 33, baseType: !27, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !798, file: !311, line: 34, baseType: !91, size: 32, offset: 288)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !686, file: !656, line: 182, baseType: !91, size: 32, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !656, line: 96, baseType: !820, size: 32, offset: 2432)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !656, line: 62, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 39, size: 576, elements: !823)
!823 = !{!824, !825, !826, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !822, file: !656, line: 40, baseType: !364, size: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !822, file: !656, line: 41, baseType: !377, size: 64, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !822, file: !656, line: 43, baseType: !827, size: 96, offset: 224)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 96, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 12)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !822, file: !656, line: 46, baseType: !47, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !822, file: !656, line: 47, baseType: !47, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !822, file: !656, line: 48, baseType: !47, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !822, file: !656, line: 49, baseType: !47, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !822, file: !656, line: 50, baseType: !47, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !822, file: !656, line: 51, baseType: !47, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !822, file: !656, line: 52, baseType: !47, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !822, file: !656, line: 53, baseType: !47, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !822, file: !656, line: 56, baseType: !665, size: 32, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !822, file: !656, line: 57, baseType: !222, size: 32, offset: 416)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !822, file: !656, line: 58, baseType: !222, size: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !822, file: !656, line: 59, baseType: !114, size: 32, offset: 480)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !822, file: !656, line: 60, baseType: !169, size: 32, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !822, file: !656, line: 61, baseType: !442, size: 32, offset: 544)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !655, file: !656, line: 102, baseType: !442, size: 32, offset: 2464)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !655, file: !656, line: 103, baseType: !442, size: 32, offset: 2496)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !655, file: !656, line: 104, baseType: !442, size: 32, offset: 2528)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !655, file: !656, line: 105, baseType: !442, size: 32, offset: 2560)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !655, file: !656, line: 107, baseType: !330, size: 384, offset: 2592)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !655, file: !656, line: 109, baseType: !47, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !655, file: !656, line: 110, baseType: !47, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !655, file: !656, line: 112, baseType: !47, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !655, file: !656, line: 113, baseType: !47, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !655, file: !656, line: 114, baseType: !47, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !655, file: !656, line: 115, baseType: !47, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !655, file: !656, line: 116, baseType: !47, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !655, file: !656, line: 117, baseType: !47, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !655, file: !656, line: 118, baseType: !47, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !655, file: !656, line: 119, baseType: !47, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !655, file: !656, line: 121, baseType: !47, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !655, file: !656, line: 122, baseType: !47, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !638, file: !631, line: 381, baseType: !862, size: 32, offset: 288)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
