; ModuleID = 'src/http/modules/ngx_http_upstream_hash_module.c'
source_filename = "src/http/modules/ngx_http_upstream_hash_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_upstream_hash_module_ctx", scope: !2, file: !3, line: 79, type: !554, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !41)
!3 = !DIFile(filename: "src/http/modules/ngx_http_upstream_hash_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !16, !19, !22, !26}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 17, size: 96, elements: !11)
!11 = !{!12, !14, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !10, file: !9, line: 18, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !10, file: !9, line: 19, baseType: !13, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !10, file: !9, line: 20, baseType: !13, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !20, line: 125, baseType: !21)
!20 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !24, line: 64, baseType: !25)
!24 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_chash_point_t", file: !3, line: 16, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 64, elements: !29)
!29 = !{!30, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !28, file: !3, line: 14, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 191, baseType: !21)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !28, file: !3, line: 15, baseType: !33, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !35, line: 19, baseType: !36)
!35 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 16, size: 64, elements: !37)
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !35, line: 17, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 120, baseType: !21)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !35, line: 18, baseType: !22, size: 32, offset: 32)
!41 = !{!42, !0, !549}
!42 = !DIGlobalVariableExpression(var: !43)
!43 = distinct !DIGlobalVariable(name: "ngx_http_upstream_hash_module", scope: !2, file: !3, line: 94, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !45, line: 15, baseType: !46)
!45 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !47, line: 222, size: 800, elements: !48)
!47 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !{!49, !52, !53, !55, !56, !57, !58, !59, !60, !522, !523, !529, !533, !534, !535, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !46, file: !47, line: 223, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !51, line: 79, baseType: !19)
!51 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !46, file: !47, line: 224, baseType: !50, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !47, line: 226, baseType: !54, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !46, file: !47, line: 228, baseType: !50, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !46, file: !47, line: 229, baseType: !50, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !46, file: !47, line: 231, baseType: !50, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !46, file: !47, line: 232, baseType: !16, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !46, file: !47, line: 234, baseType: !6, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !46, file: !47, line: 235, baseType: !61, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !45, line: 22, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !64, line: 77, size: 224, elements: !65)
!64 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!65 = !{!66, !67, !68, !519, !520, !521}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !64, line: 78, baseType: !34, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !64, line: 79, baseType: !50, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !63, file: !64, line: 80, baseType: !69, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DISubroutineType(types: !71)
!71 = !{!54, !72, !61, !6}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !45, line: 16, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !64, line: 116, size: 384, elements: !75)
!75 = !{!76, !77, !255, !501, !502, !503, !512, !513, !514, !515, !516, !518}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 117, baseType: !54, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !74, file: !64, line: 118, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !80, line: 22, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 16, size: 160, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !81, file: !80, line: 17, baseType: !6, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !81, file: !80, line: 18, baseType: !50, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !80, line: 19, baseType: !39, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !81, file: !80, line: 20, baseType: !50, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !81, file: !80, line: 21, baseType: !88, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !45, line: 18, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !91, line: 57, size: 320, elements: !92)
!91 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !{!93, !101, !102, !103, !235, !242, !254}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !90, file: !91, line: 58, baseType: !94, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !91, line: 54, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 49, size: 128, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !91, line: 50, baseType: !22, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !95, file: !91, line: 51, baseType: !22, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !91, line: 52, baseType: !88, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !95, file: !91, line: 53, baseType: !50, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !90, file: !91, line: 59, baseType: !39, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !90, file: !91, line: 60, baseType: !88, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !90, file: !91, line: 61, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !45, line: 19, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !107, line: 59, size: 64, elements: !108)
!107 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!108 = !{!109, !234}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !106, file: !107, line: 60, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !107, line: 18, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !107, line: 20, size: 352, elements: !113)
!113 = !{!114, !115, !116, !119, !120, !121, !122, !124, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !112, file: !107, line: 21, baseType: !22, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !112, file: !107, line: 22, baseType: !22, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !112, file: !107, line: 23, baseType: !117, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !20, line: 222, baseType: !118)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !112, file: !107, line: 24, baseType: !117, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !112, file: !107, line: 26, baseType: !22, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !112, file: !107, line: 27, baseType: !22, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !112, file: !107, line: 28, baseType: !123, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !107, line: 16, baseType: !6)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !112, file: !107, line: 29, baseType: !125, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !45, line: 23, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !128, line: 16, size: 1216, elements: !129)
!128 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!129 = !{!130, !133, !134, !179, !180, !181, !219, !220}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !127, file: !128, line: 17, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !132, line: 16, baseType: !118)
!132 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 18, baseType: !34, size: 64, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !127, file: !128, line: 19, baseType: !135, size: 960, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !132, line: 17, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !137, line: 4, size: 960, elements: !138)
!137 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!138 = !{!139, !141, !142, !144, !145, !147, !148, !150, !152, !154, !155, !156, !157, !158, !159, !162, !163, !165, !166, !172, !173, !174}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !136, file: !137, line: 6, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !20, line: 232, baseType: !21)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !136, file: !137, line: 7, baseType: !140, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !136, file: !137, line: 8, baseType: !143, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !20, line: 227, baseType: !21)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !136, file: !137, line: 9, baseType: !143, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !136, file: !137, line: 10, baseType: !146, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !20, line: 217, baseType: !21)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !136, file: !137, line: 11, baseType: !146, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !136, file: !137, line: 13, baseType: !149, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !20, line: 212, baseType: !21)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !136, file: !137, line: 14, baseType: !151, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !20, line: 304, baseType: !21)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !136, file: !137, line: 15, baseType: !153, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !20, line: 309, baseType: !21)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !136, file: !137, line: 16, baseType: !21, size: 32, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !136, file: !137, line: 17, baseType: !140, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !136, file: !137, line: 18, baseType: !140, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !136, file: !137, line: 19, baseType: !117, size: 32, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !136, file: !137, line: 20, baseType: !117, size: 32, offset: 416)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !136, file: !137, line: 21, baseType: !160, size: 32, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !20, line: 237, baseType: !161)
!161 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !136, file: !137, line: 22, baseType: !160, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !136, file: !137, line: 23, baseType: !164, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !20, line: 242, baseType: !118)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !136, file: !137, line: 24, baseType: !164, size: 32, offset: 544)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !136, file: !137, line: 26, baseType: !167, size: 64, offset: 576)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !20, line: 288, size: 64, elements: !168)
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !167, file: !20, line: 288, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !20, line: 75, baseType: !161)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !167, file: !20, line: 288, baseType: !161, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !136, file: !137, line: 27, baseType: !167, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !136, file: !137, line: 28, baseType: !167, size: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !136, file: !137, line: 29, baseType: !175, size: 192, offset: 768)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 192, elements: !177)
!176 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !127, file: !128, line: 21, baseType: !117, size: 32, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !127, file: !128, line: 22, baseType: !117, size: 32, offset: 1120)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !127, file: !128, line: 24, baseType: !182, size: 32, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !45, line: 20, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !185, line: 50, size: 320, elements: !186)
!185 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !{!187, !188, !200, !204, !205, !210, !211, !216, !217, !218}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !184, file: !185, line: 51, baseType: !50, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !184, file: !185, line: 52, baseType: !189, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !45, line: 21, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !64, line: 89, size: 160, elements: !192)
!192 = !{!193, !194, !195, !199}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !191, file: !64, line: 90, baseType: !131, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !64, line: 91, baseType: !34, size: 64, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !191, file: !64, line: 93, baseType: !196, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !189, !182}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !64, line: 94, baseType: !6, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !184, file: !185, line: 54, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !202, line: 98, baseType: !203)
!202 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!203 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !184, file: !185, line: 56, baseType: !170, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !184, file: !185, line: 58, baseType: !206, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !185, line: 45, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{!22, !182, !22, !39}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !185, line: 59, baseType: !6, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !184, file: !185, line: 61, baseType: !212, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !185, line: 46, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !182, !50, !22, !39}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !184, file: !185, line: 62, baseType: !6, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !184, file: !185, line: 70, baseType: !54, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !185, line: 72, baseType: !182, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !127, file: !128, line: 37, baseType: !21, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !127, file: !128, line: 38, baseType: !21, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !112, file: !107, line: 30, baseType: !110, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !112, file: !107, line: 34, baseType: !21, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !112, file: !107, line: 40, baseType: !21, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !112, file: !107, line: 43, baseType: !21, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !112, file: !107, line: 45, baseType: !21, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !112, file: !107, line: 46, baseType: !21, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !112, file: !107, line: 47, baseType: !21, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !112, file: !107, line: 48, baseType: !21, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !112, file: !107, line: 49, baseType: !21, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !112, file: !107, line: 50, baseType: !21, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !112, file: !107, line: 52, baseType: !21, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !112, file: !107, line: 53, baseType: !21, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !112, file: !107, line: 55, baseType: !118, size: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !107, line: 61, baseType: !104, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !90, file: !91, line: 62, baseType: !236, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !91, line: 41, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !91, line: 43, size: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !91, line: 44, baseType: !236, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !238, file: !91, line: 45, baseType: !6, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !90, file: !91, line: 63, baseType: !243, size: 32, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !91, line: 32, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !91, line: 34, size: 96, elements: !246)
!246 = !{!247, !252, !253}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !245, file: !91, line: 35, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !91, line: 30, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !6}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !245, file: !91, line: 36, baseType: !6, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !91, line: 37, baseType: !243, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !90, file: !91, line: 64, baseType: !182, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !74, file: !64, line: 120, baseType: !256, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !45, line: 17, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !259, line: 38, size: 2496, elements: !260)
!259 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!260 = !{!261, !264, !265, !266, !267, !268, !447, !448, !449, !452, !453, !454, !455, !456, !457, !458, !459, !470, !471, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !258, file: !259, line: 39, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !258, file: !259, line: 40, baseType: !88, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !258, file: !259, line: 42, baseType: !182, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !258, file: !259, line: 43, baseType: !183, size: 320, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !258, file: !259, line: 45, baseType: !50, size: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !258, file: !259, line: 47, baseType: !269, size: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !45, line: 26, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !273, line: 121, size: 896, elements: !274)
!273 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!274 = !{!275, !276, !332, !333, !336, !343, !345, !350, !355, !415, !416, !417, !418, !419, !420, !421, !422, !423, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !273, line: 122, baseType: !6, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !272, file: !273, line: 123, baseType: !277, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !45, line: 24, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !280, line: 30, size: 384, elements: !281)
!280 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !309, !310, !311, !324}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !280, line: 31, baseType: !6, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !279, file: !280, line: 33, baseType: !21, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !279, file: !280, line: 35, baseType: !21, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !279, file: !280, line: 38, baseType: !21, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !279, file: !280, line: 44, baseType: !21, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !279, file: !280, line: 46, baseType: !21, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !279, file: !280, line: 49, baseType: !21, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !279, file: !280, line: 51, baseType: !21, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !279, file: !280, line: 54, baseType: !21, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !279, file: !280, line: 56, baseType: !21, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !279, file: !280, line: 57, baseType: !21, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !279, file: !280, line: 59, baseType: !21, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !279, file: !280, line: 60, baseType: !21, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !279, file: !280, line: 62, baseType: !21, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !279, file: !280, line: 64, baseType: !21, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !279, file: !280, line: 67, baseType: !21, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !279, file: !280, line: 69, baseType: !21, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !279, file: !280, line: 71, baseType: !21, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !279, file: !280, line: 74, baseType: !21, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !279, file: !280, line: 75, baseType: !21, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !279, file: !280, line: 77, baseType: !21, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !279, file: !280, line: 107, baseType: !21, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !279, file: !280, line: 110, baseType: !305, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !45, line: 31, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !277}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !279, file: !280, line: 117, baseType: !50, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !279, file: !280, line: 119, baseType: !182, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !279, file: !280, line: 121, baseType: !312, size: 160, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !313, line: 20, baseType: !314)
!313 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !313, line: 22, size: 160, elements: !315)
!315 = !{!316, !318, !320, !321, !322, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !314, file: !313, line: 23, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !313, line: 16, baseType: !50)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !314, file: !313, line: 24, baseType: !319, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !314, file: !313, line: 25, baseType: !319, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !314, file: !313, line: 26, baseType: !319, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !314, file: !313, line: 27, baseType: !23, size: 8, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !313, line: 28, baseType: !23, size: 8, offset: 136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !279, file: !280, line: 124, baseType: !325, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !326, line: 16, baseType: !327)
!326 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !326, line: 18, size: 64, elements: !328)
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !326, line: 19, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !326, line: 20, baseType: !330, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !272, file: !273, line: 124, baseType: !277, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !272, file: !273, line: 126, baseType: !334, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !335, line: 17, baseType: !118)
!335 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!336 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !272, file: !273, line: 128, baseType: !337, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !338, line: 19, baseType: !339)
!338 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !270, !22, !39}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 135, baseType: !118)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !272, file: !273, line: 129, baseType: !344, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !338, line: 22, baseType: !339)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !272, file: !273, line: 130, baseType: !346, size: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !338, line: 20, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DISubroutineType(types: !349)
!349 = !{!342, !270, !104, !117}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !272, file: !273, line: 131, baseType: !351, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !338, line: 23, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DISubroutineType(types: !354)
!354 = !{!104, !270, !104, !117}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !272, file: !273, line: 133, baseType: !356, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !273, line: 16, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !273, line: 18, size: 960, elements: !359)
!359 = !{!360, !361, !373, !375, !376, !377, !378, !379, !380, !381, !386, !387, !388, !389, !390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !358, file: !273, line: 19, baseType: !334, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !358, file: !273, line: 21, baseType: !362, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !364, line: 297, size: 128, elements: !365)
!364 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!365 = !{!366, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !363, file: !364, line: 298, baseType: !367, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !20, line: 409, baseType: !368)
!368 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !363, file: !364, line: 299, baseType: !370, size: 112, offset: 16)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 112, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 14)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !358, file: !273, line: 22, baseType: !374, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !20, line: 404, baseType: !21)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !358, file: !273, line: 23, baseType: !39, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !358, file: !273, line: 24, baseType: !34, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !273, line: 26, baseType: !118, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !358, file: !273, line: 28, baseType: !118, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !358, file: !273, line: 29, baseType: !118, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !358, file: !273, line: 30, baseType: !118, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !358, file: !273, line: 38, baseType: !382, size: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !45, line: 32, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !270}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !358, file: !273, line: 40, baseType: !6, size: 32, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !358, file: !273, line: 42, baseType: !183, size: 320, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !358, file: !273, line: 43, baseType: !182, size: 32, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !358, file: !273, line: 45, baseType: !39, size: 32, offset: 736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !358, file: !273, line: 47, baseType: !39, size: 32, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !358, file: !273, line: 49, baseType: !392, size: 32, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !393, line: 16, baseType: !317)
!393 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !358, file: !273, line: 51, baseType: !356, size: 32, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !358, file: !273, line: 52, baseType: !270, size: 32, offset: 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !358, file: !273, line: 54, baseType: !50, size: 32, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !358, file: !273, line: 56, baseType: !21, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !358, file: !273, line: 57, baseType: !21, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !358, file: !273, line: 58, baseType: !21, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !358, file: !273, line: 60, baseType: !21, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !358, file: !273, line: 61, baseType: !21, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !358, file: !273, line: 62, baseType: !21, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !358, file: !273, line: 63, baseType: !21, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !358, file: !273, line: 64, baseType: !21, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !358, file: !273, line: 65, baseType: !21, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !358, file: !273, line: 66, baseType: !21, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !358, file: !273, line: 67, baseType: !21, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !358, file: !273, line: 70, baseType: !21, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !358, file: !273, line: 72, baseType: !21, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !358, file: !273, line: 73, baseType: !21, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !358, file: !273, line: 74, baseType: !21, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !358, file: !273, line: 76, baseType: !21, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !358, file: !273, line: 77, baseType: !21, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !358, file: !273, line: 78, baseType: !21, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !272, file: !273, line: 135, baseType: !117, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !272, file: !273, line: 137, baseType: !182, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !272, file: !273, line: 139, baseType: !88, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !273, line: 141, baseType: !118, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !272, file: !273, line: 143, baseType: !362, size: 32, offset: 416)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !272, file: !273, line: 144, baseType: !374, size: 32, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !272, file: !273, line: 145, baseType: !34, size: 64, offset: 480)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !272, file: !273, line: 147, baseType: !34, size: 64, offset: 544)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !272, file: !273, line: 148, baseType: !424, size: 16, offset: 608)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !425, line: 12, baseType: !426)
!425 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 186, baseType: !368)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !272, file: !273, line: 154, baseType: !362, size: 32, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !272, file: !273, line: 155, baseType: !374, size: 32, offset: 672)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !272, file: !273, line: 157, baseType: !110, size: 32, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !272, file: !273, line: 159, baseType: !325, size: 64, offset: 736)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !272, file: !273, line: 161, baseType: !201, size: 32, offset: 800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !272, file: !273, line: 163, baseType: !50, size: 32, offset: 832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !272, file: !273, line: 165, baseType: !21, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !272, file: !273, line: 167, baseType: !21, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !272, file: !273, line: 169, baseType: !21, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !272, file: !273, line: 170, baseType: !21, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !272, file: !273, line: 171, baseType: !21, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !272, file: !273, line: 173, baseType: !21, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !272, file: !273, line: 174, baseType: !21, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !272, file: !273, line: 175, baseType: !21, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !272, file: !273, line: 176, baseType: !21, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !272, file: !273, line: 178, baseType: !21, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !272, file: !273, line: 179, baseType: !21, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !272, file: !273, line: 180, baseType: !21, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !272, file: !273, line: 181, baseType: !21, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !272, file: !273, line: 183, baseType: !21, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !258, file: !259, line: 48, baseType: !270, size: 32, offset: 480)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !258, file: !259, line: 49, baseType: !50, size: 32, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !258, file: !259, line: 51, baseType: !450, size: 32, offset: 544)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !258, file: !259, line: 52, baseType: !50, size: 32, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !258, file: !259, line: 53, baseType: !50, size: 32, offset: 608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !258, file: !259, line: 55, baseType: !325, size: 64, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !258, file: !259, line: 56, baseType: !50, size: 32, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !258, file: !259, line: 58, baseType: !79, size: 160, offset: 736)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !258, file: !259, line: 59, baseType: !79, size: 160, offset: 896)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !258, file: !259, line: 61, baseType: !79, size: 160, offset: 1056)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !258, file: !259, line: 62, baseType: !460, size: 96, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !313, line: 32, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !313, line: 37, size: 96, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !461, file: !313, line: 38, baseType: !319, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !461, file: !313, line: 39, baseType: !319, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !461, file: !313, line: 40, baseType: !466, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !313, line: 34, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !319, !319, !319}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !258, file: !259, line: 63, baseType: !312, size: 160, offset: 1312)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !258, file: !259, line: 65, baseType: !472, size: 224, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !473, line: 31, baseType: !474)
!473 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !473, line: 25, size: 224, elements: !475)
!475 = !{!476, !484, !485, !486, !487}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !474, file: !473, line: 26, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !473, line: 16, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !473, line: 18, size: 96, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !479, file: !473, line: 19, baseType: !6, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !479, file: !473, line: 20, baseType: !50, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !473, line: 21, baseType: !477, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !474, file: !473, line: 27, baseType: !478, size: 96, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !473, line: 28, baseType: !39, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !474, file: !473, line: 29, baseType: !50, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !474, file: !473, line: 30, baseType: !88, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !258, file: !259, line: 66, baseType: !472, size: 224, offset: 1696)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !258, file: !259, line: 68, baseType: !50, size: 32, offset: 1920)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !258, file: !259, line: 69, baseType: !50, size: 32, offset: 1952)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !258, file: !259, line: 71, baseType: !270, size: 32, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !258, file: !259, line: 72, baseType: !277, size: 32, offset: 2016)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !258, file: !259, line: 73, baseType: !277, size: 32, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !258, file: !259, line: 75, baseType: !256, size: 32, offset: 2080)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !258, file: !259, line: 77, baseType: !34, size: 64, offset: 2112)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !258, file: !259, line: 78, baseType: !34, size: 64, offset: 2176)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !258, file: !259, line: 79, baseType: !34, size: 64, offset: 2240)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !259, line: 80, baseType: !34, size: 64, offset: 2304)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !258, file: !259, line: 81, baseType: !34, size: 64, offset: 2368)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !258, file: !259, line: 82, baseType: !34, size: 64, offset: 2432)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !74, file: !64, line: 121, baseType: !88, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !74, file: !64, line: 122, baseType: !88, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !74, file: !64, line: 123, baseType: !504, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !64, line: 103, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 98, size: 1344, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !506, file: !64, line: 99, baseType: !126, size: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !506, file: !64, line: 100, baseType: !110, size: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !506, file: !64, line: 101, baseType: !110, size: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !506, file: !64, line: 102, baseType: !50, size: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !74, file: !64, line: 124, baseType: !182, size: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !74, file: !64, line: 126, baseType: !6, size: 32, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !74, file: !64, line: 127, baseType: !50, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !74, file: !64, line: 128, baseType: !50, size: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !74, file: !64, line: 130, baseType: !517, size: 32, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !64, line: 112, baseType: !69)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !74, file: !64, line: 131, baseType: !54, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !63, file: !64, line: 81, baseType: !50, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !63, file: !64, line: 82, baseType: !50, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !63, file: !64, line: 83, baseType: !6, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !47, line: 236, baseType: !50, size: 32, offset: 288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !46, file: !47, line: 238, baseType: !524, size: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !182}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !51, line: 78, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !20, line: 140, baseType: !118)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !46, file: !47, line: 240, baseType: !530, size: 32, offset: 352)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{!527, !256}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !46, file: !47, line: 242, baseType: !530, size: 32, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !46, file: !47, line: 243, baseType: !530, size: 32, offset: 416)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !46, file: !47, line: 244, baseType: !536, size: 32, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !256}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !46, file: !47, line: 245, baseType: !536, size: 32, offset: 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !46, file: !47, line: 247, baseType: !536, size: 32, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !46, file: !47, line: 249, baseType: !19, size: 32, offset: 544)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !46, file: !47, line: 250, baseType: !19, size: 32, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !46, file: !47, line: 251, baseType: !19, size: 32, offset: 608)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !46, file: !47, line: 252, baseType: !19, size: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !46, file: !47, line: 253, baseType: !19, size: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !46, file: !47, line: 254, baseType: !19, size: 32, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !46, file: !47, line: 255, baseType: !19, size: 32, offset: 736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !46, file: !47, line: 256, baseType: !19, size: 32, offset: 768)
!549 = !DIGlobalVariableExpression(var: !550)
!550 = distinct !DIGlobalVariable(name: "ngx_http_upstream_hash_commands", scope: !2, file: !3, line: 66, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 448, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 2)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !9, line: 36, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 24, size: 256, elements: !556)
!556 = !{!557, !561, !562, !566, !570, !571, !575, !576}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !555, file: !9, line: 25, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{!527, !72}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !555, file: !9, line: 26, baseType: !558, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !555, file: !9, line: 28, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DISubroutineType(types: !565)
!565 = !{!6, !72}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !555, file: !9, line: 29, baseType: !567, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!54, !72, !6}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !555, file: !9, line: 31, baseType: !563, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !555, file: !9, line: 32, baseType: !572, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{!54, !72, !6, !6}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !555, file: !9, line: 34, baseType: !563, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !555, file: !9, line: 35, baseType: !572, size: 32, offset: 224)
!577 = !{i32 2, !"Dwarf Version", i32 4}
!578 = !{i32 2, !"Debug Info Version", i32 3}
!579 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!580 = distinct !DISubprogram(name: "ngx_http_upstream_hash_create_conf", scope: !3, file: !3, line: 613, type: !564, isLocal: true, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !581)
!581 = !{!582, !583}
!582 = !DILocalVariable(name: "cf", arg: 1, scope: !580, file: !3, line: 613, type: !72)
!583 = !DILocalVariable(name: "conf", scope: !580, file: !3, line: 615, type: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_hash_srv_conf_t", file: !3, line: 28, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 25, size: 192, elements: !587)
!587 = !{!588, !598}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !586, file: !3, line: 26, baseType: !589, size: 160)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_complex_value_t", file: !590, line: 71, baseType: !591)
!590 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 66, size: 160, elements: !592)
!592 = !{!593, !594, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !591, file: !590, line: 67, baseType: !34, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flushes", scope: !591, file: !590, line: 68, baseType: !595, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !591, file: !590, line: 69, baseType: !6, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !591, file: !590, line: 70, baseType: !6, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !586, file: !3, line: 27, baseType: !599, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_chash_points_t", file: !3, line: 22, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 19, size: 96, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !601, file: !3, line: 20, baseType: !50, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !601, file: !3, line: 21, baseType: !605, size: 64, offset: 32)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 1)
!608 = !{!609, !609, i64 0}
!609 = !{!"any pointer", !610, i64 0}
!610 = !{!"omnipotent char", !611, i64 0}
!611 = !{!"Simple C/C++ TBAA"}
!612 = !DIExpression()
!613 = !DILocation(line: 613, column: 48, scope: !580)
!614 = !DILocation(line: 615, column: 5, scope: !580)
!615 = !DILocation(line: 615, column: 41, scope: !580)
!616 = !DILocation(line: 617, column: 23, scope: !580)
!617 = !DILocation(line: 617, column: 27, scope: !580)
!618 = !{!619, !609, i64 12}
!619 = !{!"ngx_conf_s", !609, i64 0, !609, i64 4, !609, i64 8, !609, i64 12, !609, i64 16, !609, i64 20, !609, i64 24, !609, i64 28, !620, i64 32, !620, i64 36, !609, i64 40, !609, i64 44}
!620 = !{!"int", !610, i64 0}
!621 = !DILocation(line: 617, column: 12, scope: !580)
!622 = !DILocation(line: 617, column: 10, scope: !580)
!623 = !DILocation(line: 618, column: 9, scope: !624)
!624 = distinct !DILexicalBlock(scope: !580, file: !3, line: 618, column: 9)
!625 = !DILocation(line: 618, column: 14, scope: !624)
!626 = !DILocation(line: 618, column: 9, scope: !580)
!627 = !DILocation(line: 619, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !624, file: !3, line: 618, column: 23)
!629 = !DILocation(line: 622, column: 5, scope: !580)
!630 = !DILocation(line: 622, column: 11, scope: !580)
!631 = !DILocation(line: 622, column: 18, scope: !580)
!632 = !{!633, !609, i64 20}
!633 = !{!"", !634, i64 0, !609, i64 20}
!634 = !{!"", !635, i64 0, !609, i64 8, !609, i64 12, !609, i64 16}
!635 = !{!"", !620, i64 0, !609, i64 4}
!636 = !DILocation(line: 624, column: 12, scope: !580)
!637 = !DILocation(line: 624, column: 5, scope: !580)
!638 = !DILocation(line: 625, column: 1, scope: !580)
!639 = distinct !DISubprogram(name: "ngx_http_upstream_hash", scope: !3, file: !3, line: 629, type: !70, isLocal: true, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !1866}
!641 = !DILocalVariable(name: "cf", arg: 1, scope: !639, file: !3, line: 629, type: !72)
!642 = !DILocalVariable(name: "cmd", arg: 2, scope: !639, file: !3, line: 629, type: !61)
!643 = !DILocalVariable(name: "conf", arg: 3, scope: !639, file: !3, line: 629, type: !6)
!644 = !DILocalVariable(name: "hcf", scope: !639, file: !3, line: 631, type: !584)
!645 = !DILocalVariable(name: "value", scope: !639, file: !3, line: 633, type: !33)
!646 = !DILocalVariable(name: "uscf", scope: !639, file: !3, line: 634, type: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !649, line: 77, baseType: !650)
!649 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !649, line: 119, size: 416, elements: !651)
!651 = !{!652, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !650, file: !649, line: 120, baseType: !653, size: 96)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !649, line: 89, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 85, size: 96, elements: !655)
!655 = !{!656, !661, !1856}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !654, file: !649, line: 86, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !649, line: 79, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!527, !72, !647}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !654, file: !649, line: 87, baseType: !662, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !649, line: 81, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{!527, !666, !647}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !668, line: 16, baseType: !669)
!668 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !670, line: 364, size: 5376, elements: !671)
!670 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!671 = !{!672, !673, !674, !675, !676, !677, !678, !683, !684, !897, !1416, !1417, !1418, !1419, !1458, !1488, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1533, !1544, !1551, !1552, !1554, !1555, !1568, !1569, !1570, !1571, !1572, !1573, !1752, !1756, !1761, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !669, file: !670, line: 365, baseType: !31, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !669, file: !670, line: 367, baseType: !270, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !669, file: !670, line: 369, baseType: !13, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !669, file: !670, line: 370, baseType: !13, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !669, file: !670, line: 371, baseType: !13, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !669, file: !670, line: 372, baseType: !13, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !669, file: !670, line: 374, baseType: !679, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !670, line: 361, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !666}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !669, file: !670, line: 375, baseType: !679, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !669, file: !670, line: 378, baseType: !685, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !668, line: 18, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !688, line: 65, size: 3008, elements: !689)
!688 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!689 = !{!690, !691, !692, !693, !697, !698, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !855, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !687, file: !688, line: 66, baseType: !126, size: 1216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !687, file: !688, line: 67, baseType: !79, size: 160, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !687, file: !688, line: 68, baseType: !31, size: 32, offset: 1376)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !687, file: !688, line: 69, baseType: !694, size: 128, offset: 1408)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !687, file: !688, line: 70, baseType: !694, size: 128, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !687, file: !688, line: 72, baseType: !699, size: 32, offset: 1664)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !132, line: 18, baseType: !143)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !687, file: !688, line: 73, baseType: !170, size: 32, offset: 1696)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !687, file: !688, line: 74, baseType: !170, size: 32, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !687, file: !688, line: 75, baseType: !170, size: 32, offset: 1760)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !687, file: !688, line: 76, baseType: !170, size: 32, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !687, file: !688, line: 77, baseType: !170, size: 32, offset: 1824)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !687, file: !688, line: 79, baseType: !34, size: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !687, file: !688, line: 80, baseType: !34, size: 64, offset: 1920)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !687, file: !688, line: 81, baseType: !694, size: 128, offset: 1984)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !687, file: !688, line: 83, baseType: !39, size: 32, offset: 2112)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !687, file: !688, line: 84, baseType: !39, size: 32, offset: 2144)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !687, file: !688, line: 85, baseType: !117, size: 32, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !687, file: !688, line: 86, baseType: !117, size: 32, offset: 2208)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !687, file: !688, line: 88, baseType: !50, size: 32, offset: 2240)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !687, file: !688, line: 89, baseType: !50, size: 32, offset: 2272)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !687, file: !688, line: 90, baseType: !50, size: 32, offset: 2304)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !687, file: !688, line: 91, baseType: !50, size: 32, offset: 2336)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !687, file: !688, line: 93, baseType: !110, size: 32, offset: 2368)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !687, file: !688, line: 95, baseType: !718, size: 32, offset: 2400)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !668, line: 19, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !688, line: 157, size: 544, elements: !721)
!721 = !{!722, !737, !798, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !854}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !720, file: !688, line: 158, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !688, line: 154, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !688, line: 145, size: 480, elements: !726)
!726 = !{!727, !728, !729, !730, !733, !734, !735, !736}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !725, file: !688, line: 146, baseType: !460, size: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !725, file: !688, line: 147, baseType: !312, size: 160, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !725, file: !688, line: 148, baseType: !325, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !725, file: !688, line: 149, baseType: !731, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !202, line: 106, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !201)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !725, file: !688, line: 150, baseType: !731, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !688, line: 151, baseType: !117, size: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !725, file: !688, line: 152, baseType: !50, size: 32, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !725, file: !688, line: 153, baseType: !50, size: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !720, file: !688, line: 159, baseType: !738, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !740, line: 59, baseType: !741)
!740 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 34, size: 800, elements: !742)
!742 = !{!743, !750, !751, !752, !760, !761, !762, !771, !772, !773, !774, !793, !794, !795, !796, !797}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !741, file: !740, line: 35, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !745, line: 21, baseType: !746)
!745 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 16, size: 64, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !746, file: !745, line: 17, baseType: !731, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !746, file: !745, line: 19, baseType: !731, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !741, file: !740, line: 37, baseType: !39, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !741, file: !740, line: 38, baseType: !39, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !741, file: !740, line: 40, baseType: !753, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !740, line: 16, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !740, line: 18, size: 96, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !755, file: !740, line: 19, baseType: !19, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !740, line: 20, baseType: !753, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !755, file: !740, line: 21, baseType: !19, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !741, file: !740, line: 41, baseType: !753, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !741, file: !740, line: 42, baseType: !754, size: 96, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !741, file: !740, line: 44, baseType: !763, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !740, line: 31, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 25, size: 128, elements: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !765, file: !740, line: 26, baseType: !50, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !765, file: !740, line: 27, baseType: !50, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !765, file: !740, line: 29, baseType: !50, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !765, file: !740, line: 30, baseType: !50, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !741, file: !740, line: 45, baseType: !50, size: 32, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !741, file: !740, line: 47, baseType: !22, size: 32, offset: 352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !741, file: !740, line: 48, baseType: !22, size: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !741, file: !740, line: 50, baseType: !775, size: 256, offset: 416)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !745, line: 37, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 24, size: 256, elements: !777)
!777 = !{!778, !780, !781, !782, !792}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !776, file: !745, line: 26, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !776, file: !745, line: 28, baseType: !779, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !776, file: !745, line: 29, baseType: !50, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !776, file: !745, line: 30, baseType: !783, size: 128, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !784, line: 19, baseType: !785)
!784 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !784, line: 17, size: 128, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !785, file: !784, line: 18, baseType: !788, size: 128)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !790)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!790 = !{!791}
!791 = !DISubrange(count: 4)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !776, file: !745, line: 36, baseType: !50, size: 32, offset: 224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !741, file: !740, line: 52, baseType: !22, size: 32, offset: 672)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !741, file: !740, line: 53, baseType: !23, size: 8, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !741, file: !740, line: 55, baseType: !21, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !741, file: !740, line: 57, baseType: !6, size: 32, offset: 736)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !741, file: !740, line: 58, baseType: !6, size: 32, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !720, file: !688, line: 161, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !128, line: 62, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 50, size: 384, elements: !802)
!802 = !{!803, !804, !805, !807, !812, !814, !816, !817, !818}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !128, line: 51, baseType: !34, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !801, file: !128, line: 52, baseType: !39, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !801, file: !128, line: 53, baseType: !806, size: 96, offset: 96)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 96, elements: !177)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !801, file: !128, line: 55, baseType: !808, size: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !128, line: 45, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!392, !6}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !801, file: !128, line: 56, baseType: !813, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !128, line: 46, baseType: !809)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !801, file: !128, line: 57, baseType: !815, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !128, line: 47, baseType: !249)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !128, line: 58, baseType: !6, size: 32, offset: 288)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !801, file: !128, line: 60, baseType: !22, size: 32, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !801, file: !128, line: 61, baseType: !50, size: 32, offset: 352)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !720, file: !688, line: 163, baseType: !117, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !720, file: !688, line: 164, baseType: !39, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !720, file: !688, line: 166, baseType: !170, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !720, file: !688, line: 168, baseType: !170, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !720, file: !688, line: 170, baseType: !50, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !720, file: !688, line: 171, baseType: !50, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !720, file: !688, line: 172, baseType: !392, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !720, file: !688, line: 173, baseType: !392, size: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !720, file: !688, line: 174, baseType: !392, size: 32, offset: 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !720, file: !688, line: 176, baseType: !50, size: 32, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !720, file: !688, line: 177, baseType: !392, size: 32, offset: 416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !720, file: !688, line: 178, baseType: !392, size: 32, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !720, file: !688, line: 180, baseType: !832, size: 32, offset: 480)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !259, line: 25, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !259, line: 29, size: 320, elements: !835)
!835 = !{!836, !837, !847, !852, !853}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !259, line: 30, baseType: !6, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !834, file: !259, line: 31, baseType: !838, size: 192, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !839, line: 22, baseType: !840)
!839 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !839, line: 16, size: 192, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !840, file: !839, line: 17, baseType: !22, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !840, file: !839, line: 18, baseType: !39, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !840, file: !839, line: 19, baseType: !34, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !840, file: !839, line: 20, baseType: !182, size: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !840, file: !839, line: 21, baseType: !50, size: 32, offset: 160)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !834, file: !259, line: 32, baseType: !848, size: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !259, line: 27, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DISubroutineType(types: !851)
!851 = !{!527, !832, !6}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !834, file: !259, line: 33, baseType: !6, size: 32, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !834, file: !259, line: 34, baseType: !50, size: 32, offset: 288)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !720, file: !688, line: 182, baseType: !50, size: 32, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !687, file: !688, line: 96, baseType: !856, size: 32, offset: 2432)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !688, line: 62, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !688, line: 39, size: 576, elements: !859)
!859 = !{!860, !861, !862, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !858, file: !688, line: 40, baseType: !312, size: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !858, file: !688, line: 41, baseType: !325, size: 64, offset: 160)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !858, file: !688, line: 43, baseType: !863, size: 96, offset: 224)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 96, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 12)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !858, file: !688, line: 46, baseType: !21, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !858, file: !688, line: 47, baseType: !21, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !858, file: !688, line: 48, baseType: !21, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !858, file: !688, line: 49, baseType: !21, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !858, file: !688, line: 50, baseType: !21, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !858, file: !688, line: 51, baseType: !21, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !858, file: !688, line: 52, baseType: !21, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !858, file: !688, line: 53, baseType: !21, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !858, file: !688, line: 56, baseType: !699, size: 32, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !858, file: !688, line: 57, baseType: !170, size: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !858, file: !688, line: 58, baseType: !170, size: 32, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !858, file: !688, line: 59, baseType: !39, size: 32, offset: 480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !858, file: !688, line: 60, baseType: !117, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !858, file: !688, line: 61, baseType: !392, size: 32, offset: 544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !687, file: !688, line: 102, baseType: !392, size: 32, offset: 2464)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !687, file: !688, line: 103, baseType: !392, size: 32, offset: 2496)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !687, file: !688, line: 104, baseType: !392, size: 32, offset: 2528)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !687, file: !688, line: 105, baseType: !392, size: 32, offset: 2560)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !687, file: !688, line: 107, baseType: !278, size: 384, offset: 2592)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !687, file: !688, line: 109, baseType: !21, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
