; ModuleID = 'src/http/modules/ngx_http_empty_gif_module.c'
source_filename = "src/http/modules/ngx_http_empty_gif_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_empty_gif_module_ctx", scope: !2, file: !3, line: 78, type: !553, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !16)
!3 = !DIFile(filename: "src/http/modules/ngx_http_empty_gif_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 17, size: 96, elements: !10)
!10 = !{!11, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !9, file: !8, line: 18, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !9, file: !8, line: 19, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !9, file: !8, line: 20, baseType: !12, size: 32, offset: 64)
!16 = !{!17, !0, !541, !546, !551}
!17 = !DIGlobalVariableExpression(var: !18)
!18 = distinct !DIGlobalVariable(name: "ngx_http_empty_gif_module", scope: !2, file: !3, line: 93, type: !19, isLocal: false, isDefinition: true)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !20, line: 15, baseType: !21)
!20 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !22, line: 222, size: 800, elements: !23)
!22 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !{!24, !30, !31, !34, !35, !36, !37, !40, !41, !514, !515, !521, !525, !526, !527, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !21, file: !22, line: 223, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !26, line: 79, baseType: !27)
!26 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !28, line: 125, baseType: !29)
!28 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !21, file: !22, line: 224, baseType: !25, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !22, line: 226, baseType: !32, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !21, file: !22, line: 228, baseType: !25, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !21, file: !22, line: 229, baseType: !25, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !21, file: !22, line: 231, baseType: !25, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !21, file: !22, line: 232, baseType: !38, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !21, file: !22, line: 234, baseType: !13, size: 32, offset: 224)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !21, file: !22, line: 235, baseType: !42, size: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !20, line: 22, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !45, line: 77, size: 224, elements: !46)
!45 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !{!47, !59, !60, !511, !512, !513}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 78, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !49, line: 19, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 16, size: 64, elements: !51)
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !49, line: 17, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 120, baseType: !29)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !49, line: 18, baseType: !55, size: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !57, line: 64, baseType: !58)
!57 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !45, line: 79, baseType: !25, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !44, file: !45, line: 80, baseType: !61, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DISubroutineType(types: !63)
!63 = !{!32, !64, !42, !13}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !20, line: 16, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !45, line: 116, size: 384, elements: !67)
!67 = !{!68, !69, !247, !493, !494, !495, !504, !505, !506, !507, !508, !510}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !45, line: 117, baseType: !32, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !66, file: !45, line: 118, baseType: !70, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !72, line: 22, baseType: !73)
!72 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 16, size: 160, elements: !74)
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !73, file: !72, line: 17, baseType: !13, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !73, file: !72, line: 18, baseType: !25, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !72, line: 19, baseType: !53, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !73, file: !72, line: 20, baseType: !25, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !73, file: !72, line: 21, baseType: !80, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !20, line: 18, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !83, line: 57, size: 320, elements: !84)
!83 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = !{!85, !93, !94, !95, !227, !234, !246}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !82, file: !83, line: 58, baseType: !86, size: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !83, line: 54, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 49, size: 128, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !87, file: !83, line: 50, baseType: !55, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !87, file: !83, line: 51, baseType: !55, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !83, line: 52, baseType: !80, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !87, file: !83, line: 53, baseType: !25, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !82, file: !83, line: 59, baseType: !53, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !82, file: !83, line: 60, baseType: !80, size: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !82, file: !83, line: 61, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !20, line: 19, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !99, line: 59, size: 64, elements: !100)
!99 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!100 = !{!101, !226}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !98, file: !99, line: 60, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !99, line: 18, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !99, line: 20, size: 352, elements: !105)
!105 = !{!106, !107, !108, !111, !112, !113, !114, !116, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !104, file: !99, line: 21, baseType: !55, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !104, file: !99, line: 22, baseType: !55, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !104, file: !99, line: 23, baseType: !109, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !28, line: 222, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !104, file: !99, line: 24, baseType: !109, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !104, file: !99, line: 26, baseType: !55, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !104, file: !99, line: 27, baseType: !55, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !104, file: !99, line: 28, baseType: !115, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !99, line: 16, baseType: !13)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !104, file: !99, line: 29, baseType: !117, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !20, line: 23, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !120, line: 16, size: 1216, elements: !121)
!120 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = !{!122, !125, !126, !171, !172, !173, !211, !212}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !119, file: !120, line: 17, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !124, line: 16, baseType: !110)
!124 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 18, baseType: !48, size: 64, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !119, file: !120, line: 19, baseType: !127, size: 960, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !124, line: 17, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !129, line: 4, size: 960, elements: !130)
!129 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !{!131, !133, !134, !136, !137, !139, !140, !142, !144, !146, !147, !148, !149, !150, !151, !154, !155, !157, !158, !164, !165, !166}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !128, file: !129, line: 6, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !28, line: 232, baseType: !29)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !128, file: !129, line: 7, baseType: !132, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !128, file: !129, line: 8, baseType: !135, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !28, line: 227, baseType: !29)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !128, file: !129, line: 9, baseType: !135, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !128, file: !129, line: 10, baseType: !138, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !28, line: 217, baseType: !29)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !128, file: !129, line: 11, baseType: !138, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !128, file: !129, line: 13, baseType: !141, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !28, line: 212, baseType: !29)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !128, file: !129, line: 14, baseType: !143, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !28, line: 304, baseType: !29)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !128, file: !129, line: 15, baseType: !145, size: 32, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !28, line: 309, baseType: !29)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !128, file: !129, line: 16, baseType: !29, size: 32, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !128, file: !129, line: 17, baseType: !132, size: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !128, file: !129, line: 18, baseType: !132, size: 32, offset: 352)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !128, file: !129, line: 19, baseType: !109, size: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !128, file: !129, line: 20, baseType: !109, size: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !128, file: !129, line: 21, baseType: !152, size: 32, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !28, line: 237, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !128, file: !129, line: 22, baseType: !152, size: 32, offset: 480)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !128, file: !129, line: 23, baseType: !156, size: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !28, line: 242, baseType: !110)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !128, file: !129, line: 24, baseType: !156, size: 32, offset: 544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !128, file: !129, line: 26, baseType: !159, size: 64, offset: 576)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !28, line: 288, size: 64, elements: !160)
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !159, file: !28, line: 288, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !28, line: 75, baseType: !153)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !159, file: !28, line: 288, baseType: !153, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !128, file: !129, line: 27, baseType: !159, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !128, file: !129, line: 28, baseType: !159, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !128, file: !129, line: 29, baseType: !167, size: 192, offset: 768)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 192, elements: !169)
!168 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!169 = !{!170}
!170 = !DISubrange(count: 3)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !119, file: !120, line: 21, baseType: !109, size: 32, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !119, file: !120, line: 22, baseType: !109, size: 32, offset: 1120)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !119, file: !120, line: 24, baseType: !174, size: 32, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !20, line: 20, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !177, line: 50, size: 320, elements: !178)
!177 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!178 = !{!179, !180, !192, !196, !197, !202, !203, !208, !209, !210}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !176, file: !177, line: 51, baseType: !25, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !176, file: !177, line: 52, baseType: !181, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !20, line: 21, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !45, line: 89, size: 160, elements: !184)
!184 = !{!185, !186, !187, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !183, file: !45, line: 90, baseType: !123, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !45, line: 91, baseType: !48, size: 64, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !183, file: !45, line: 93, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !181, !174}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !45, line: 94, baseType: !13, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !176, file: !177, line: 54, baseType: !193, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !194, line: 98, baseType: !195)
!194 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!195 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !176, file: !177, line: 56, baseType: !162, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !176, file: !177, line: 58, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !177, line: 45, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!55, !174, !55, !53}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !177, line: 59, baseType: !13, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !176, file: !177, line: 61, baseType: !204, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !177, line: 46, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !174, !25, !55, !53}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !176, file: !177, line: 62, baseType: !13, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !176, file: !177, line: 70, baseType: !32, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !177, line: 72, baseType: !174, size: 32, offset: 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !119, file: !120, line: 37, baseType: !29, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !119, file: !120, line: 38, baseType: !29, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !104, file: !99, line: 30, baseType: !102, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !104, file: !99, line: 34, baseType: !29, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !104, file: !99, line: 40, baseType: !29, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !104, file: !99, line: 43, baseType: !29, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !104, file: !99, line: 45, baseType: !29, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !104, file: !99, line: 46, baseType: !29, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !104, file: !99, line: 47, baseType: !29, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !104, file: !99, line: 48, baseType: !29, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !104, file: !99, line: 49, baseType: !29, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !104, file: !99, line: 50, baseType: !29, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !104, file: !99, line: 52, baseType: !29, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !104, file: !99, line: 53, baseType: !29, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !104, file: !99, line: 55, baseType: !110, size: 32, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !99, line: 61, baseType: !96, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !82, file: !83, line: 62, baseType: !228, size: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !83, line: 41, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !83, line: 43, size: 64, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !83, line: 44, baseType: !228, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !230, file: !83, line: 45, baseType: !13, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !82, file: !83, line: 63, baseType: !235, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !83, line: 32, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !83, line: 34, size: 96, elements: !238)
!238 = !{!239, !244, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !237, file: !83, line: 35, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !83, line: 30, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !13}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !83, line: 36, baseType: !13, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !83, line: 37, baseType: !235, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !82, file: !83, line: 64, baseType: !174, size: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !66, file: !45, line: 120, baseType: !248, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !20, line: 17, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !251, line: 38, size: 2496, elements: !252)
!251 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!252 = !{!253, !256, !257, !258, !259, !260, !439, !440, !441, !444, !445, !446, !447, !448, !449, !450, !451, !462, !463, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !250, file: !251, line: 39, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !250, file: !251, line: 40, baseType: !80, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !250, file: !251, line: 42, baseType: !174, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !250, file: !251, line: 43, baseType: !175, size: 320, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !250, file: !251, line: 45, baseType: !25, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !250, file: !251, line: 47, baseType: !261, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !20, line: 26, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !265, line: 121, size: 896, elements: !266)
!265 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!266 = !{!267, !268, !324, !325, !328, !335, !337, !342, !347, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !265, line: 122, baseType: !13, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !264, file: !265, line: 123, baseType: !269, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !20, line: 24, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !272, line: 30, size: 384, elements: !273)
!272 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !301, !302, !303, !316}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !272, line: 31, baseType: !13, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !271, file: !272, line: 33, baseType: !29, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !271, file: !272, line: 35, baseType: !29, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !271, file: !272, line: 38, baseType: !29, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !271, file: !272, line: 44, baseType: !29, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !271, file: !272, line: 46, baseType: !29, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !271, file: !272, line: 49, baseType: !29, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !271, file: !272, line: 51, baseType: !29, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !271, file: !272, line: 54, baseType: !29, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !271, file: !272, line: 56, baseType: !29, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !271, file: !272, line: 57, baseType: !29, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !271, file: !272, line: 59, baseType: !29, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !271, file: !272, line: 60, baseType: !29, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !271, file: !272, line: 62, baseType: !29, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !271, file: !272, line: 64, baseType: !29, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !271, file: !272, line: 67, baseType: !29, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !271, file: !272, line: 69, baseType: !29, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !271, file: !272, line: 71, baseType: !29, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !271, file: !272, line: 74, baseType: !29, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !271, file: !272, line: 75, baseType: !29, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !271, file: !272, line: 77, baseType: !29, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !271, file: !272, line: 107, baseType: !29, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !271, file: !272, line: 110, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !20, line: 31, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !269}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !271, file: !272, line: 117, baseType: !25, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !271, file: !272, line: 119, baseType: !174, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !271, file: !272, line: 121, baseType: !304, size: 160, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !305, line: 20, baseType: !306)
!305 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !305, line: 22, size: 160, elements: !307)
!307 = !{!308, !310, !312, !313, !314, !315}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !306, file: !305, line: 23, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !305, line: 16, baseType: !25)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !306, file: !305, line: 24, baseType: !311, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !306, file: !305, line: 25, baseType: !311, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !306, file: !305, line: 26, baseType: !311, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !306, file: !305, line: 27, baseType: !56, size: 8, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !305, line: 28, baseType: !56, size: 8, offset: 136)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !271, file: !272, line: 124, baseType: !317, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !318, line: 16, baseType: !319)
!318 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !318, line: 18, size: 64, elements: !320)
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !318, line: 19, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !318, line: 20, baseType: !322, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !264, file: !265, line: 124, baseType: !269, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !264, file: !265, line: 126, baseType: !326, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !327, line: 17, baseType: !110)
!327 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !264, file: !265, line: 128, baseType: !329, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !330, line: 19, baseType: !331)
!330 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !262, !55, !53}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 135, baseType: !110)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !264, file: !265, line: 129, baseType: !336, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !330, line: 22, baseType: !331)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !264, file: !265, line: 130, baseType: !338, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !330, line: 20, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DISubroutineType(types: !341)
!341 = !{!334, !262, !96, !109}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !264, file: !265, line: 131, baseType: !343, size: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !330, line: 23, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{!96, !262, !96, !109}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !264, file: !265, line: 133, baseType: !348, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !265, line: 16, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !265, line: 18, size: 960, elements: !351)
!351 = !{!352, !353, !365, !367, !368, !369, !370, !371, !372, !373, !378, !379, !380, !381, !382, !383, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !350, file: !265, line: 19, baseType: !326, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !350, file: !265, line: 21, baseType: !354, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !356, line: 297, size: 128, elements: !357)
!356 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!357 = !{!358, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !355, file: !356, line: 298, baseType: !359, size: 16)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !28, line: 409, baseType: !360)
!360 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !355, file: !356, line: 299, baseType: !362, size: 112, offset: 16)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 112, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 14)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !350, file: !265, line: 22, baseType: !366, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !28, line: 404, baseType: !29)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !350, file: !265, line: 23, baseType: !53, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !350, file: !265, line: 24, baseType: !48, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !265, line: 26, baseType: !110, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !350, file: !265, line: 28, baseType: !110, size: 32, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !350, file: !265, line: 29, baseType: !110, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !350, file: !265, line: 30, baseType: !110, size: 32, offset: 288)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !350, file: !265, line: 38, baseType: !374, size: 32, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !20, line: 32, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !262}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !350, file: !265, line: 40, baseType: !13, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !350, file: !265, line: 42, baseType: !175, size: 320, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !350, file: !265, line: 43, baseType: !174, size: 32, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !350, file: !265, line: 45, baseType: !53, size: 32, offset: 736)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !350, file: !265, line: 47, baseType: !53, size: 32, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !350, file: !265, line: 49, baseType: !384, size: 32, offset: 800)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !385, line: 16, baseType: !309)
!385 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!386 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !350, file: !265, line: 51, baseType: !348, size: 32, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !350, file: !265, line: 52, baseType: !262, size: 32, offset: 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !350, file: !265, line: 54, baseType: !25, size: 32, offset: 896)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !350, file: !265, line: 56, baseType: !29, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !350, file: !265, line: 57, baseType: !29, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !350, file: !265, line: 58, baseType: !29, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !350, file: !265, line: 60, baseType: !29, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !350, file: !265, line: 61, baseType: !29, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !350, file: !265, line: 62, baseType: !29, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !350, file: !265, line: 63, baseType: !29, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !350, file: !265, line: 64, baseType: !29, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !350, file: !265, line: 65, baseType: !29, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !350, file: !265, line: 66, baseType: !29, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !350, file: !265, line: 67, baseType: !29, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !350, file: !265, line: 70, baseType: !29, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !350, file: !265, line: 72, baseType: !29, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !350, file: !265, line: 73, baseType: !29, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !350, file: !265, line: 74, baseType: !29, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !350, file: !265, line: 76, baseType: !29, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !350, file: !265, line: 77, baseType: !29, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !350, file: !265, line: 78, baseType: !29, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !264, file: !265, line: 135, baseType: !109, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !264, file: !265, line: 137, baseType: !174, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !264, file: !265, line: 139, baseType: !80, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !265, line: 141, baseType: !110, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !264, file: !265, line: 143, baseType: !354, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !264, file: !265, line: 144, baseType: !366, size: 32, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !264, file: !265, line: 145, baseType: !48, size: 64, offset: 480)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !264, file: !265, line: 147, baseType: !48, size: 64, offset: 544)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !264, file: !265, line: 148, baseType: !416, size: 16, offset: 608)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !417, line: 12, baseType: !418)
!417 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 186, baseType: !360)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !264, file: !265, line: 154, baseType: !354, size: 32, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !264, file: !265, line: 155, baseType: !366, size: 32, offset: 672)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !264, file: !265, line: 157, baseType: !102, size: 32, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !264, file: !265, line: 159, baseType: !317, size: 64, offset: 736)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !264, file: !265, line: 161, baseType: !193, size: 32, offset: 800)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !264, file: !265, line: 163, baseType: !25, size: 32, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !264, file: !265, line: 165, baseType: !29, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !264, file: !265, line: 167, baseType: !29, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !264, file: !265, line: 169, baseType: !29, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !264, file: !265, line: 170, baseType: !29, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !264, file: !265, line: 171, baseType: !29, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !264, file: !265, line: 173, baseType: !29, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !264, file: !265, line: 174, baseType: !29, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !264, file: !265, line: 175, baseType: !29, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !264, file: !265, line: 176, baseType: !29, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !264, file: !265, line: 178, baseType: !29, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !264, file: !265, line: 179, baseType: !29, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !264, file: !265, line: 180, baseType: !29, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !264, file: !265, line: 181, baseType: !29, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !264, file: !265, line: 183, baseType: !29, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !250, file: !251, line: 48, baseType: !262, size: 32, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !250, file: !251, line: 49, baseType: !25, size: 32, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !250, file: !251, line: 51, baseType: !442, size: 32, offset: 544)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !250, file: !251, line: 52, baseType: !25, size: 32, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !250, file: !251, line: 53, baseType: !25, size: 32, offset: 608)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !250, file: !251, line: 55, baseType: !317, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !250, file: !251, line: 56, baseType: !25, size: 32, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !250, file: !251, line: 58, baseType: !71, size: 160, offset: 736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !250, file: !251, line: 59, baseType: !71, size: 160, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !250, file: !251, line: 61, baseType: !71, size: 160, offset: 1056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !250, file: !251, line: 62, baseType: !452, size: 96, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !305, line: 32, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !305, line: 37, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !453, file: !305, line: 38, baseType: !311, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !453, file: !305, line: 39, baseType: !311, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !453, file: !305, line: 40, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !305, line: 34, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !311, !311, !311}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !250, file: !251, line: 63, baseType: !304, size: 160, offset: 1312)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !250, file: !251, line: 65, baseType: !464, size: 224, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !465, line: 31, baseType: !466)
!465 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 25, size: 224, elements: !467)
!467 = !{!468, !476, !477, !478, !479}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !466, file: !465, line: 26, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !465, line: 16, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !465, line: 18, size: 96, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !471, file: !465, line: 19, baseType: !13, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !471, file: !465, line: 20, baseType: !25, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !465, line: 21, baseType: !469, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !466, file: !465, line: 27, baseType: !470, size: 96, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !465, line: 28, baseType: !53, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !466, file: !465, line: 29, baseType: !25, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !466, file: !465, line: 30, baseType: !80, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !250, file: !251, line: 66, baseType: !464, size: 224, offset: 1696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !250, file: !251, line: 68, baseType: !25, size: 32, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !250, file: !251, line: 69, baseType: !25, size: 32, offset: 1952)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !250, file: !251, line: 71, baseType: !262, size: 32, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !250, file: !251, line: 72, baseType: !269, size: 32, offset: 2016)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !250, file: !251, line: 73, baseType: !269, size: 32, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !250, file: !251, line: 75, baseType: !248, size: 32, offset: 2080)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !250, file: !251, line: 77, baseType: !48, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !250, file: !251, line: 78, baseType: !48, size: 64, offset: 2176)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !250, file: !251, line: 79, baseType: !48, size: 64, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !250, file: !251, line: 80, baseType: !48, size: 64, offset: 2304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !250, file: !251, line: 81, baseType: !48, size: 64, offset: 2368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !250, file: !251, line: 82, baseType: !48, size: 64, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !66, file: !45, line: 121, baseType: !80, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !66, file: !45, line: 122, baseType: !80, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !66, file: !45, line: 123, baseType: !496, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !45, line: 103, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 98, size: 1344, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !498, file: !45, line: 99, baseType: !118, size: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !498, file: !45, line: 100, baseType: !102, size: 32, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !498, file: !45, line: 101, baseType: !102, size: 32, offset: 1248)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !498, file: !45, line: 102, baseType: !25, size: 32, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !66, file: !45, line: 124, baseType: !174, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !66, file: !45, line: 126, baseType: !13, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !66, file: !45, line: 127, baseType: !25, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !66, file: !45, line: 128, baseType: !25, size: 32, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !66, file: !45, line: 130, baseType: !509, size: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !45, line: 112, baseType: !61)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !66, file: !45, line: 131, baseType: !32, size: 32, offset: 352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !44, file: !45, line: 81, baseType: !25, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !44, file: !45, line: 82, baseType: !25, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !44, file: !45, line: 83, baseType: !13, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !21, file: !22, line: 236, baseType: !25, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !21, file: !22, line: 238, baseType: !516, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !174}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !26, line: 78, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !28, line: 140, baseType: !110)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !21, file: !22, line: 240, baseType: !522, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{!519, !248}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !21, file: !22, line: 242, baseType: !522, size: 32, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !21, file: !22, line: 243, baseType: !522, size: 32, offset: 416)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !21, file: !22, line: 244, baseType: !528, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !248}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !21, file: !22, line: 245, baseType: !528, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !21, file: !22, line: 247, baseType: !528, size: 32, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !21, file: !22, line: 249, baseType: !27, size: 32, offset: 544)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !21, file: !22, line: 250, baseType: !27, size: 32, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !21, file: !22, line: 251, baseType: !27, size: 32, offset: 608)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !21, file: !22, line: 252, baseType: !27, size: 32, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !21, file: !22, line: 253, baseType: !27, size: 32, offset: 672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !21, file: !22, line: 254, baseType: !27, size: 32, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !21, file: !22, line: 255, baseType: !27, size: 32, offset: 736)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !21, file: !22, line: 256, baseType: !27, size: 32, offset: 768)
!541 = !DIGlobalVariableExpression(var: !542)
!542 = distinct !DIGlobalVariable(name: "ngx_http_empty_gif_commands", scope: !2, file: !3, line: 15, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 448, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 2)
!546 = !DIGlobalVariableExpression(var: !547)
!547 = distinct !DIGlobalVariable(name: "ngx_empty_gif", scope: !2, file: !3, line: 30, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 344, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 43)
!551 = !DIGlobalVariableExpression(var: !552)
!552 = distinct !DIGlobalVariable(name: "ngx_http_gif_type", scope: !2, file: !3, line: 109, type: !48, isLocal: true, isDefinition: true)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !8, line: 36, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 24, size: 256, elements: !555)
!555 = !{!556, !560, !561, !565, !569, !570, !574, !575}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !554, file: !8, line: 25, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DISubroutineType(types: !559)
!559 = !{!519, !64}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !554, file: !8, line: 26, baseType: !557, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !554, file: !8, line: 28, baseType: !562, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{!13, !64}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !554, file: !8, line: 29, baseType: !566, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DISubroutineType(types: !568)
!568 = !{!32, !64, !13}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !554, file: !8, line: 31, baseType: !562, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !554, file: !8, line: 32, baseType: !571, size: 32, offset: 160)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!32, !64, !13, !13}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !554, file: !8, line: 34, baseType: !562, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !554, file: !8, line: 35, baseType: !571, size: 32, offset: 224)
!576 = !{i32 2, !"Dwarf Version", i32 4}
!577 = !{i32 2, !"Debug Info Version", i32 3}
!578 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!579 = distinct !DISubprogram(name: "ngx_http_empty_gif", scope: !3, file: !3, line: 132, type: !62, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DILocalVariable(name: "cf", arg: 1, scope: !579, file: !3, line: 132, type: !64)
!582 = !DILocalVariable(name: "cmd", arg: 2, scope: !579, file: !3, line: 132, type: !42)
!583 = !DILocalVariable(name: "conf", arg: 3, scope: !579, file: !3, line: 132, type: !13)
!584 = !DILocalVariable(name: "clcf", scope: !579, file: !3, line: 134, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_core_loc_conf_t", file: !587, line: 64, baseType: !588)
!587 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_core_loc_conf_s", file: !587, line: 309, size: 2496, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !613, !614, !616, !617, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1796, !1797, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !587, line: 310, baseType: !48, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "noname", scope: !588, file: !587, line: 316, baseType: !29, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lmt_excpt", scope: !588, file: !587, line: 317, baseType: !29, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !588, file: !587, line: 318, baseType: !29, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !588, file: !587, line: 320, baseType: !29, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "noregex", scope: !588, file: !587, line: 321, baseType: !29, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !588, file: !587, line: 323, baseType: !29, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "static_locations", scope: !588, file: !587, line: 329, baseType: !598, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_location_tree_node_t", file: !587, line: 63, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_location_tree_node_s", file: !587, line: 462, size: 192, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !600, file: !587, line: 463, baseType: !598, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !600, file: !587, line: 464, baseType: !598, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !600, file: !587, line: 465, baseType: !598, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !600, file: !587, line: 467, baseType: !585, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !600, file: !587, line: 468, baseType: !585, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !600, file: !587, line: 470, baseType: !56, size: 8, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !600, file: !587, line: 471, baseType: !56, size: 8, offset: 168)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !587, line: 472, baseType: !610, size: 8, offset: 176)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !588, file: !587, line: 335, baseType: !12, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except", scope: !588, file: !587, line: 337, baseType: !615, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 191, baseType: !29)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except_loc_conf", scope: !588, file: !587, line: 338, baseType: !12, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !588, file: !587, line: 340, baseType: !618, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !619, line: 360, baseType: !620)
!619 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DISubroutineType(types: !622)
!622 = !{!519, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !625, line: 16, baseType: !626)
!625 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !619, line: 364, size: 5376, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !639, !640, !853, !1407, !1408, !1409, !1410, !1449, !1479, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1524, !1535, !1542, !1543, !1544, !1545, !1558, !1559, !1560, !1561, !1562, !1563, !1627, !1631, !1636, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !619, line: 365, baseType: !615, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !626, file: !619, line: 367, baseType: !262, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !626, file: !619, line: 369, baseType: !12, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !626, file: !619, line: 370, baseType: !12, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !626, file: !619, line: 371, baseType: !12, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !626, file: !619, line: 372, baseType: !12, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !626, file: !619, line: 374, baseType: !635, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !619, line: 361, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !623}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !626, file: !619, line: 375, baseType: !635, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !626, file: !619, line: 378, baseType: !641, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !625, line: 18, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !644, line: 65, size: 3008, elements: !645)
!644 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!645 = !{!646, !647, !648, !649, !653, !654, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !811, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !643, file: !644, line: 66, baseType: !118, size: 1216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !643, file: !644, line: 67, baseType: !71, size: 160, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !643, file: !644, line: 68, baseType: !615, size: 32, offset: 1376)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !643, file: !644, line: 69, baseType: !650, size: 128, offset: 1408)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !643, file: !644, line: 70, baseType: !650, size: 128, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !643, file: !644, line: 72, baseType: !655, size: 32, offset: 1664)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !124, line: 18, baseType: !135)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !643, file: !644, line: 73, baseType: !162, size: 32, offset: 1696)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !643, file: !644, line: 74, baseType: !162, size: 32, offset: 1728)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !643, file: !644, line: 75, baseType: !162, size: 32, offset: 1760)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !643, file: !644, line: 76, baseType: !162, size: 32, offset: 1792)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !643, file: !644, line: 77, baseType: !162, size: 32, offset: 1824)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !643, file: !644, line: 79, baseType: !48, size: 64, offset: 1856)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !643, file: !644, line: 80, baseType: !48, size: 64, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !643, file: !644, line: 81, baseType: !650, size: 128, offset: 1984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !643, file: !644, line: 83, baseType: !53, size: 32, offset: 2112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !643, file: !644, line: 84, baseType: !53, size: 32, offset: 2144)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !643, file: !644, line: 85, baseType: !109, size: 32, offset: 2176)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !643, file: !644, line: 86, baseType: !109, size: 32, offset: 2208)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !643, file: !644, line: 88, baseType: !25, size: 32, offset: 2240)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !643, file: !644, line: 89, baseType: !25, size: 32, offset: 2272)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !643, file: !644, line: 90, baseType: !25, size: 32, offset: 2304)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !643, file: !644, line: 91, baseType: !25, size: 32, offset: 2336)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !643, file: !644, line: 93, baseType: !102, size: 32, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !643, file: !644, line: 95, baseType: !674, size: 32, offset: 2400)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !625, line: 19, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !644, line: 157, size: 544, elements: !677)
!677 = !{!678, !693, !754, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !810}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !676, file: !644, line: 158, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !644, line: 154, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 145, size: 480, elements: !682)
!682 = !{!683, !684, !685, !686, !689, !690, !691, !692}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !681, file: !644, line: 146, baseType: !452, size: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !681, file: !644, line: 147, baseType: !304, size: 160, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !681, file: !644, line: 148, baseType: !317, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !681, file: !644, line: 149, baseType: !687, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !194, line: 106, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !193)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !681, file: !644, line: 150, baseType: !687, size: 32, offset: 352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !681, file: !644, line: 151, baseType: !109, size: 32, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !681, file: !644, line: 152, baseType: !25, size: 32, offset: 416)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !681, file: !644, line: 153, baseType: !25, size: 32, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !676, file: !644, line: 159, baseType: !694, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !696, line: 59, baseType: !697)
!696 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 34, size: 800, elements: !698)
!698 = !{!699, !706, !707, !708, !716, !717, !718, !727, !728, !729, !730, !749, !750, !751, !752, !753}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !697, file: !696, line: 35, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !701, line: 21, baseType: !702)
!701 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 16, size: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !702, file: !701, line: 17, baseType: !687, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !702, file: !701, line: 19, baseType: !687, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !697, file: !696, line: 37, baseType: !53, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !697, file: !696, line: 38, baseType: !53, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !697, file: !696, line: 40, baseType: !709, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !696, line: 16, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !696, line: 18, size: 96, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !711, file: !696, line: 19, baseType: !27, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !696, line: 20, baseType: !709, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !711, file: !696, line: 21, baseType: !27, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !697, file: !696, line: 41, baseType: !709, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !697, file: !696, line: 42, baseType: !710, size: 96, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !697, file: !696, line: 44, baseType: !719, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !696, line: 31, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 25, size: 128, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !721, file: !696, line: 26, baseType: !25, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !721, file: !696, line: 27, baseType: !25, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !721, file: !696, line: 29, baseType: !25, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !721, file: !696, line: 30, baseType: !25, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !697, file: !696, line: 45, baseType: !25, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !697, file: !696, line: 47, baseType: !55, size: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !697, file: !696, line: 48, baseType: !55, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !697, file: !696, line: 50, baseType: !731, size: 256, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !701, line: 37, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 24, size: 256, elements: !733)
!733 = !{!734, !736, !737, !738, !748}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !732, file: !701, line: 26, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !732, file: !701, line: 28, baseType: !735, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !732, file: !701, line: 29, baseType: !25, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !732, file: !701, line: 30, baseType: !739, size: 128, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !740, line: 19, baseType: !741)
!740 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 17, size: 128, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !741, file: !740, line: 18, baseType: !744, size: 128)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 128, elements: !746)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!746 = !{!747}
!747 = !DISubrange(count: 4)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !732, file: !701, line: 36, baseType: !25, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !697, file: !696, line: 52, baseType: !55, size: 32, offset: 672)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !697, file: !696, line: 53, baseType: !56, size: 8, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !697, file: !696, line: 55, baseType: !29, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !696, line: 57, baseType: !13, size: 32, offset: 736)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !697, file: !696, line: 58, baseType: !13, size: 32, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !676, file: !644, line: 161, baseType: !755, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !120, line: 62, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 50, size: 384, elements: !758)
!758 = !{!759, !760, !761, !763, !768, !770, !772, !773, !774}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !120, line: 51, baseType: !48, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !757, file: !120, line: 52, baseType: !53, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !757, file: !120, line: 53, baseType: !762, size: 96, offset: 96)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !169)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !757, file: !120, line: 55, baseType: !764, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !120, line: 45, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!384, !13}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !757, file: !120, line: 56, baseType: !769, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !120, line: 46, baseType: !765)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !757, file: !120, line: 57, baseType: !771, size: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !120, line: 47, baseType: !241)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !120, line: 58, baseType: !13, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !757, file: !120, line: 60, baseType: !55, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !757, file: !120, line: 61, baseType: !25, size: 32, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !676, file: !644, line: 163, baseType: !109, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !676, file: !644, line: 164, baseType: !53, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !676, file: !644, line: 166, baseType: !162, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !676, file: !644, line: 168, baseType: !162, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !676, file: !644, line: 170, baseType: !25, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !676, file: !644, line: 171, baseType: !25, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !676, file: !644, line: 172, baseType: !384, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !676, file: !644, line: 173, baseType: !384, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !676, file: !644, line: 174, baseType: !384, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !676, file: !644, line: 176, baseType: !25, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !676, file: !644, line: 177, baseType: !384, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !676, file: !644, line: 178, baseType: !384, size: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !676, file: !644, line: 180, baseType: !788, size: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !251, line: 25, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !251, line: 29, size: 320, elements: !791)
!791 = !{!792, !793, !803, !808, !809}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !790, file: !251, line: 30, baseType: !13, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !790, file: !251, line: 31, baseType: !794, size: 192, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !795, line: 22, baseType: !796)
!795 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 16, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !796, file: !795, line: 17, baseType: !55, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !795, line: 18, baseType: !53, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !795, line: 19, baseType: !48, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !796, file: !795, line: 20, baseType: !174, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !796, file: !795, line: 21, baseType: !25, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !790, file: !251, line: 32, baseType: !804, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !251, line: 27, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!519, !788, !13}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !790, file: !251, line: 33, baseType: !13, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !790, file: !251, line: 34, baseType: !25, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !676, file: !644, line: 182, baseType: !25, size: 32, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !644, line: 96, baseType: !812, size: 32, offset: 2432)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !644, line: 62, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 39, size: 576, elements: !815)
!815 = !{!816, !817, !818, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !814, file: !644, line: 40, baseType: !304, size: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !814, file: !644, line: 41, baseType: !317, size: 64, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !814, file: !644, line: 43, baseType: !819, size: 96, offset: 224)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 12)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !814, file: !644, line: 46, baseType: !29, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !814, file: !644, line: 47, baseType: !29, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !814, file: !644, line: 48, baseType: !29, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !814, file: !644, line: 49, baseType: !29, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !814, file: !644, line: 50, baseType: !29, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !814, file: !644, line: 51, baseType: !29, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !814, file: !644, line: 52, baseType: !29, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !814, file: !644, line: 53, baseType: !29, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !814, file: !644, line: 56, baseType: !655, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !814, file: !644, line: 57, baseType: !162, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !814, file: !644, line: 58, baseType: !162, size: 32, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !814, file: !644, line: 59, baseType: !53, size: 32, offset: 480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !814, file: !644, line: 60, baseType: !109, size: 32, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !814, file: !644, line: 61, baseType: !384, size: 32, offset: 544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !643, file: !644, line: 102, baseType: !384, size: 32, offset: 2464)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !643, file: !644, line: 103, baseType: !384, size: 32, offset: 2496)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !643, file: !644, line: 104, baseType: !384, size: 32, offset: 2528)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !643, file: !644, line: 105, baseType: !384, size: 32, offset: 2560)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !643, file: !644, line: 107, baseType: !270, size: 384, offset: 2592)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !643, file: !644, line: 109, baseType: !29, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !643, file: !644, line: 110, baseType: !29, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !643, file: !644, line: 112, baseType: !29, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !643, file: !644, line: 113, baseType: !29, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !643, file: !644, line: 114, baseType: !29, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !643, file: !644, line: 115, baseType: !29, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !643, file: !644, line: 116, baseType: !29, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !643, file: !644, line: 117, baseType: !29, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !643, file: !644, line: 118, baseType: !29, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !643, file: !644, line: 119, baseType: !29, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
