; ModuleID = 'src/http/modules/ngx_http_charset_filter_module.c'
source_filename = "src/http/modules/ngx_http_charset_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_charset_filter_module_ctx", scope: !2, file: !3, line: 181, type: !1794, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !35)
!3 = !DIFile(filename: "src/http/modules/ngx_http_charset_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !13, !16, !19, !21, !23, !28, !32, !24, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 17, size: 96, elements: !10)
!10 = !{!11, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !9, file: !8, line: 18, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !9, file: !8, line: 19, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !9, file: !8, line: 20, baseType: !12, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !17, line: 222, baseType: !18)
!17 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !20, line: 16, baseType: !13)
!20 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 120, baseType: !22)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !26, line: 64, baseType: !27)
!26 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !30, line: 78, baseType: !31)
!30 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !17, line: 140, baseType: !18)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !{!36, !0, !543, !1778, !1784, !1789}
!36 = !DIGlobalVariableExpression(var: !37)
!37 = distinct !DIGlobalVariable(name: "ngx_http_charset_filter_module", scope: !2, file: !3, line: 196, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !39, line: 15, baseType: !40)
!39 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !41, line: 222, size: 800, elements: !42)
!41 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !{!43, !46, !47, !49, !50, !51, !52, !53, !54, !518, !519, !523, !527, !528, !529, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !40, file: !41, line: 223, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !30, line: 79, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !17, line: 125, baseType: !22)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !40, file: !41, line: 224, baseType: !44, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 226, baseType: !48, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !40, file: !41, line: 228, baseType: !44, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !40, file: !41, line: 229, baseType: !44, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !40, file: !41, line: 231, baseType: !44, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !40, file: !41, line: 232, baseType: !32, size: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !40, file: !41, line: 234, baseType: !13, size: 32, offset: 224)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !40, file: !41, line: 235, baseType: !55, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !39, line: 22, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !58, line: 77, size: 224, elements: !59)
!58 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !{!60, !67, !68, !515, !516, !517}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 78, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !62, line: 19, baseType: !63)
!62 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 16, size: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !62, line: 17, baseType: !21, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !62, line: 18, baseType: !24, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !58, line: 79, baseType: !44, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !57, file: !58, line: 80, baseType: !69, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DISubroutineType(types: !71)
!71 = !{!48, !72, !55, !13}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !39, line: 16, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !58, line: 116, size: 384, elements: !75)
!75 = !{!76, !77, !251, !497, !498, !499, !508, !509, !510, !511, !512, !514}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !58, line: 117, baseType: !48, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !74, file: !58, line: 118, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !80, line: 22, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 16, size: 160, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !81, file: !80, line: 17, baseType: !13, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !81, file: !80, line: 18, baseType: !44, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !80, line: 19, baseType: !21, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !81, file: !80, line: 20, baseType: !44, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !81, file: !80, line: 21, baseType: !88, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !39, line: 18, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !91, line: 57, size: 320, elements: !92)
!91 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !{!93, !101, !102, !103, !231, !238, !250}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !90, file: !91, line: 58, baseType: !94, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !91, line: 54, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 49, size: 128, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !91, line: 50, baseType: !24, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !95, file: !91, line: 51, baseType: !24, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !91, line: 52, baseType: !88, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !95, file: !91, line: 53, baseType: !44, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !90, file: !91, line: 59, baseType: !21, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !90, file: !91, line: 60, baseType: !88, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !90, file: !91, line: 61, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !39, line: 19, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !20, line: 59, size: 64, elements: !107)
!107 = !{!108, !230}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !106, file: !20, line: 60, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !20, line: 18, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !20, line: 20, size: 352, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !111, file: !20, line: 21, baseType: !24, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !111, file: !20, line: 22, baseType: !24, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !111, file: !20, line: 23, baseType: !16, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !111, file: !20, line: 24, baseType: !16, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !111, file: !20, line: 26, baseType: !24, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !111, file: !20, line: 27, baseType: !24, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !20, line: 28, baseType: !19, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !111, file: !20, line: 29, baseType: !121, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !39, line: 23, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !124, line: 16, size: 1216, elements: !125)
!124 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!125 = !{!126, !129, !130, !175, !176, !177, !215, !216}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !123, file: !124, line: 17, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !128, line: 16, baseType: !18)
!128 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 18, baseType: !61, size: 64, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !123, file: !124, line: 19, baseType: !131, size: 960, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !128, line: 17, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !133, line: 4, size: 960, elements: !134)
!133 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!134 = !{!135, !137, !138, !140, !141, !143, !144, !146, !148, !150, !151, !152, !153, !154, !155, !158, !159, !161, !162, !168, !169, !170}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !132, file: !133, line: 6, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !17, line: 232, baseType: !22)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !132, file: !133, line: 7, baseType: !136, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !132, file: !133, line: 8, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !17, line: 227, baseType: !22)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !132, file: !133, line: 9, baseType: !139, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !132, file: !133, line: 10, baseType: !142, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !17, line: 217, baseType: !22)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !132, file: !133, line: 11, baseType: !142, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !132, file: !133, line: 13, baseType: !145, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !17, line: 212, baseType: !22)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !132, file: !133, line: 14, baseType: !147, size: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !17, line: 304, baseType: !22)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !132, file: !133, line: 15, baseType: !149, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !17, line: 309, baseType: !22)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !132, file: !133, line: 16, baseType: !22, size: 32, offset: 288)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !132, file: !133, line: 17, baseType: !136, size: 32, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !132, file: !133, line: 18, baseType: !136, size: 32, offset: 352)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !132, file: !133, line: 19, baseType: !16, size: 32, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !132, file: !133, line: 20, baseType: !16, size: 32, offset: 416)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !132, file: !133, line: 21, baseType: !156, size: 32, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !17, line: 237, baseType: !157)
!157 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !132, file: !133, line: 22, baseType: !156, size: 32, offset: 480)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !132, file: !133, line: 23, baseType: !160, size: 32, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !17, line: 242, baseType: !18)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !132, file: !133, line: 24, baseType: !160, size: 32, offset: 544)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !132, file: !133, line: 26, baseType: !163, size: 64, offset: 576)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !17, line: 288, size: 64, elements: !164)
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !163, file: !17, line: 288, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !17, line: 75, baseType: !157)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !163, file: !17, line: 288, baseType: !157, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !132, file: !133, line: 27, baseType: !163, size: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !132, file: !133, line: 28, baseType: !163, size: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !132, file: !133, line: 29, baseType: !171, size: 192, offset: 768)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !173)
!172 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!173 = !{!174}
!174 = !DISubrange(count: 3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !123, file: !124, line: 21, baseType: !16, size: 32, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !123, file: !124, line: 22, baseType: !16, size: 32, offset: 1120)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !123, file: !124, line: 24, baseType: !178, size: 32, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !39, line: 20, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !181, line: 50, size: 320, elements: !182)
!181 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!182 = !{!183, !184, !196, !200, !201, !206, !207, !212, !213, !214}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !180, file: !181, line: 51, baseType: !44, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !180, file: !181, line: 52, baseType: !185, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !39, line: 21, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !58, line: 89, size: 160, elements: !188)
!188 = !{!189, !190, !191, !195}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !187, file: !58, line: 90, baseType: !127, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !58, line: 91, baseType: !61, size: 64, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !187, file: !58, line: 93, baseType: !192, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !185, !178}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !58, line: 94, baseType: !13, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !180, file: !181, line: 54, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !198, line: 98, baseType: !199)
!198 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!199 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !180, file: !181, line: 56, baseType: !166, size: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !180, file: !181, line: 58, baseType: !202, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !181, line: 45, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{!24, !178, !24, !21}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !181, line: 59, baseType: !13, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !180, file: !181, line: 61, baseType: !208, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !181, line: 46, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !178, !44, !24, !21}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !180, file: !181, line: 62, baseType: !13, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !180, file: !181, line: 70, baseType: !48, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !181, line: 72, baseType: !178, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !123, file: !124, line: 37, baseType: !22, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !123, file: !124, line: 38, baseType: !22, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !111, file: !20, line: 30, baseType: !109, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !111, file: !20, line: 34, baseType: !22, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !111, file: !20, line: 40, baseType: !22, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !111, file: !20, line: 43, baseType: !22, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !111, file: !20, line: 45, baseType: !22, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !111, file: !20, line: 46, baseType: !22, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !111, file: !20, line: 47, baseType: !22, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !111, file: !20, line: 48, baseType: !22, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !111, file: !20, line: 49, baseType: !22, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !111, file: !20, line: 50, baseType: !22, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !111, file: !20, line: 52, baseType: !22, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !111, file: !20, line: 53, baseType: !22, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !111, file: !20, line: 55, baseType: !18, size: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !20, line: 61, baseType: !104, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !90, file: !91, line: 62, baseType: !232, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !91, line: 41, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !91, line: 43, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !91, line: 44, baseType: !232, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !234, file: !91, line: 45, baseType: !13, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !90, file: !91, line: 63, baseType: !239, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !91, line: 32, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !91, line: 34, size: 96, elements: !242)
!242 = !{!243, !248, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !241, file: !91, line: 35, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !91, line: 30, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !13}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !91, line: 36, baseType: !13, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !91, line: 37, baseType: !239, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !90, file: !91, line: 64, baseType: !178, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !74, file: !58, line: 120, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !39, line: 17, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !255, line: 38, size: 2496, elements: !256)
!255 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!256 = !{!257, !260, !261, !262, !263, !264, !443, !444, !445, !448, !449, !450, !451, !452, !453, !454, !455, !466, !467, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !254, file: !255, line: 39, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !254, file: !255, line: 40, baseType: !88, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !254, file: !255, line: 42, baseType: !178, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !254, file: !255, line: 43, baseType: !179, size: 320, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !254, file: !255, line: 45, baseType: !44, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !254, file: !255, line: 47, baseType: !265, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !39, line: 26, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !269, line: 121, size: 896, elements: !270)
!269 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!270 = !{!271, !272, !328, !329, !332, !339, !341, !346, !351, !411, !412, !413, !414, !415, !416, !417, !418, !419, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !269, line: 122, baseType: !13, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !268, file: !269, line: 123, baseType: !273, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !39, line: 24, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !276, line: 30, size: 384, elements: !277)
!276 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !305, !306, !307, !320}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 31, baseType: !13, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !275, file: !276, line: 33, baseType: !22, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !275, file: !276, line: 35, baseType: !22, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !275, file: !276, line: 38, baseType: !22, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !275, file: !276, line: 44, baseType: !22, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !275, file: !276, line: 46, baseType: !22, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !275, file: !276, line: 49, baseType: !22, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !275, file: !276, line: 51, baseType: !22, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !275, file: !276, line: 54, baseType: !22, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !275, file: !276, line: 56, baseType: !22, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !275, file: !276, line: 57, baseType: !22, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !275, file: !276, line: 59, baseType: !22, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !275, file: !276, line: 60, baseType: !22, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !275, file: !276, line: 62, baseType: !22, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !275, file: !276, line: 64, baseType: !22, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !275, file: !276, line: 67, baseType: !22, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !275, file: !276, line: 69, baseType: !22, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !275, file: !276, line: 71, baseType: !22, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !275, file: !276, line: 74, baseType: !22, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !275, file: !276, line: 75, baseType: !22, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !275, file: !276, line: 77, baseType: !22, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !275, file: !276, line: 107, baseType: !22, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !275, file: !276, line: 110, baseType: !301, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !39, line: 31, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !273}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !275, file: !276, line: 117, baseType: !44, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !275, file: !276, line: 119, baseType: !178, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !275, file: !276, line: 121, baseType: !308, size: 160, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !309, line: 20, baseType: !310)
!309 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !309, line: 22, size: 160, elements: !311)
!311 = !{!312, !314, !316, !317, !318, !319}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !310, file: !309, line: 23, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !309, line: 16, baseType: !44)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !310, file: !309, line: 24, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !310, file: !309, line: 25, baseType: !315, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !310, file: !309, line: 26, baseType: !315, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !310, file: !309, line: 27, baseType: !25, size: 8, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !309, line: 28, baseType: !25, size: 8, offset: 136)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !275, file: !276, line: 124, baseType: !321, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !322, line: 16, baseType: !323)
!322 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !322, line: 18, size: 64, elements: !324)
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !323, file: !322, line: 19, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !322, line: 20, baseType: !326, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !268, file: !269, line: 124, baseType: !273, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !268, file: !269, line: 126, baseType: !330, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !331, line: 17, baseType: !18)
!331 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !268, file: !269, line: 128, baseType: !333, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !334, line: 19, baseType: !335)
!334 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !266, !24, !21}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 135, baseType: !18)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !268, file: !269, line: 129, baseType: !340, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !334, line: 22, baseType: !335)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !268, file: !269, line: 130, baseType: !342, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !334, line: 20, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DISubroutineType(types: !345)
!345 = !{!338, !266, !104, !16}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !268, file: !269, line: 131, baseType: !347, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !334, line: 23, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{!104, !266, !104, !16}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !268, file: !269, line: 133, baseType: !352, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !269, line: 16, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !269, line: 18, size: 960, elements: !355)
!355 = !{!356, !357, !369, !371, !372, !373, !374, !375, !376, !377, !382, !383, !384, !385, !386, !387, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !354, file: !269, line: 19, baseType: !330, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !354, file: !269, line: 21, baseType: !358, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !360, line: 297, size: 128, elements: !361)
!360 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!361 = !{!362, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !359, file: !360, line: 298, baseType: !363, size: 16)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !17, line: 409, baseType: !364)
!364 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !359, file: !360, line: 299, baseType: !366, size: 112, offset: 16)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 112, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 14)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !354, file: !269, line: 22, baseType: !370, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !17, line: 404, baseType: !22)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !354, file: !269, line: 23, baseType: !21, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !354, file: !269, line: 24, baseType: !61, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !269, line: 26, baseType: !18, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !354, file: !269, line: 28, baseType: !18, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !354, file: !269, line: 29, baseType: !18, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !354, file: !269, line: 30, baseType: !18, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !354, file: !269, line: 38, baseType: !378, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !39, line: 32, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !266}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !354, file: !269, line: 40, baseType: !13, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !354, file: !269, line: 42, baseType: !179, size: 320, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !354, file: !269, line: 43, baseType: !178, size: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !354, file: !269, line: 45, baseType: !21, size: 32, offset: 736)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !354, file: !269, line: 47, baseType: !21, size: 32, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !354, file: !269, line: 49, baseType: !388, size: 32, offset: 800)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !389, line: 16, baseType: !313)
!389 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !354, file: !269, line: 51, baseType: !352, size: 32, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !354, file: !269, line: 52, baseType: !266, size: 32, offset: 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !354, file: !269, line: 54, baseType: !44, size: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !354, file: !269, line: 56, baseType: !22, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !354, file: !269, line: 57, baseType: !22, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !354, file: !269, line: 58, baseType: !22, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !354, file: !269, line: 60, baseType: !22, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !354, file: !269, line: 61, baseType: !22, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !354, file: !269, line: 62, baseType: !22, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !354, file: !269, line: 63, baseType: !22, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !354, file: !269, line: 64, baseType: !22, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !354, file: !269, line: 65, baseType: !22, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !354, file: !269, line: 66, baseType: !22, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !354, file: !269, line: 67, baseType: !22, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !354, file: !269, line: 70, baseType: !22, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !354, file: !269, line: 72, baseType: !22, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !354, file: !269, line: 73, baseType: !22, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !354, file: !269, line: 74, baseType: !22, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !354, file: !269, line: 76, baseType: !22, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !354, file: !269, line: 77, baseType: !22, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !354, file: !269, line: 78, baseType: !22, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !268, file: !269, line: 135, baseType: !16, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !268, file: !269, line: 137, baseType: !178, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !268, file: !269, line: 139, baseType: !88, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !269, line: 141, baseType: !18, size: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !268, file: !269, line: 143, baseType: !358, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !268, file: !269, line: 144, baseType: !370, size: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !268, file: !269, line: 145, baseType: !61, size: 64, offset: 480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !268, file: !269, line: 147, baseType: !61, size: 64, offset: 544)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !268, file: !269, line: 148, baseType: !420, size: 16, offset: 608)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !421, line: 12, baseType: !422)
!421 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 186, baseType: !364)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !268, file: !269, line: 154, baseType: !358, size: 32, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !268, file: !269, line: 155, baseType: !370, size: 32, offset: 672)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !268, file: !269, line: 157, baseType: !109, size: 32, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !268, file: !269, line: 159, baseType: !321, size: 64, offset: 736)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !268, file: !269, line: 161, baseType: !197, size: 32, offset: 800)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !268, file: !269, line: 163, baseType: !44, size: 32, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !268, file: !269, line: 165, baseType: !22, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !268, file: !269, line: 167, baseType: !22, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !268, file: !269, line: 169, baseType: !22, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !269, line: 170, baseType: !22, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !268, file: !269, line: 171, baseType: !22, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !268, file: !269, line: 173, baseType: !22, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !268, file: !269, line: 174, baseType: !22, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !268, file: !269, line: 175, baseType: !22, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !268, file: !269, line: 176, baseType: !22, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !268, file: !269, line: 178, baseType: !22, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !268, file: !269, line: 179, baseType: !22, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !268, file: !269, line: 180, baseType: !22, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !268, file: !269, line: 181, baseType: !22, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !268, file: !269, line: 183, baseType: !22, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !254, file: !255, line: 48, baseType: !266, size: 32, offset: 480)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !254, file: !255, line: 49, baseType: !44, size: 32, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !254, file: !255, line: 51, baseType: !446, size: 32, offset: 544)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !254, file: !255, line: 52, baseType: !44, size: 32, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !254, file: !255, line: 53, baseType: !44, size: 32, offset: 608)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !254, file: !255, line: 55, baseType: !321, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !254, file: !255, line: 56, baseType: !44, size: 32, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !254, file: !255, line: 58, baseType: !79, size: 160, offset: 736)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !254, file: !255, line: 59, baseType: !79, size: 160, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !254, file: !255, line: 61, baseType: !79, size: 160, offset: 1056)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !254, file: !255, line: 62, baseType: !456, size: 96, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !309, line: 32, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !309, line: 37, size: 96, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !457, file: !309, line: 38, baseType: !315, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !457, file: !309, line: 39, baseType: !315, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !457, file: !309, line: 40, baseType: !462, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !309, line: 34, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !315, !315, !315}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !254, file: !255, line: 63, baseType: !308, size: 160, offset: 1312)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !254, file: !255, line: 65, baseType: !468, size: 224, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !469, line: 31, baseType: !470)
!469 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !469, line: 25, size: 224, elements: !471)
!471 = !{!472, !480, !481, !482, !483}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !470, file: !469, line: 26, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !469, line: 16, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !469, line: 18, size: 96, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !475, file: !469, line: 19, baseType: !13, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !475, file: !469, line: 20, baseType: !44, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !475, file: !469, line: 21, baseType: !473, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !470, file: !469, line: 27, baseType: !474, size: 96, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !470, file: !469, line: 28, baseType: !21, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !470, file: !469, line: 29, baseType: !44, size: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !470, file: !469, line: 30, baseType: !88, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !254, file: !255, line: 66, baseType: !468, size: 224, offset: 1696)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !254, file: !255, line: 68, baseType: !44, size: 32, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !254, file: !255, line: 69, baseType: !44, size: 32, offset: 1952)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !254, file: !255, line: 71, baseType: !266, size: 32, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !254, file: !255, line: 72, baseType: !273, size: 32, offset: 2016)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !254, file: !255, line: 73, baseType: !273, size: 32, offset: 2048)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !254, file: !255, line: 75, baseType: !252, size: 32, offset: 2080)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !254, file: !255, line: 77, baseType: !61, size: 64, offset: 2112)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !254, file: !255, line: 78, baseType: !61, size: 64, offset: 2176)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !254, file: !255, line: 79, baseType: !61, size: 64, offset: 2240)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !254, file: !255, line: 80, baseType: !61, size: 64, offset: 2304)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !254, file: !255, line: 81, baseType: !61, size: 64, offset: 2368)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !254, file: !255, line: 82, baseType: !61, size: 64, offset: 2432)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !74, file: !58, line: 121, baseType: !88, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !74, file: !58, line: 122, baseType: !88, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !74, file: !58, line: 123, baseType: !500, size: 32, offset: 160)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !58, line: 103, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 98, size: 1344, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !502, file: !58, line: 99, baseType: !122, size: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !502, file: !58, line: 100, baseType: !109, size: 32, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !502, file: !58, line: 101, baseType: !109, size: 32, offset: 1248)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !502, file: !58, line: 102, baseType: !44, size: 32, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !74, file: !58, line: 124, baseType: !178, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !74, file: !58, line: 126, baseType: !13, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !74, file: !58, line: 127, baseType: !44, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !74, file: !58, line: 128, baseType: !44, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !74, file: !58, line: 130, baseType: !513, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !58, line: 112, baseType: !69)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !74, file: !58, line: 131, baseType: !48, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !57, file: !58, line: 81, baseType: !44, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !57, file: !58, line: 82, baseType: !44, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !57, file: !58, line: 83, baseType: !13, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !41, line: 236, baseType: !44, size: 32, offset: 288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !40, file: !41, line: 238, baseType: !520, size: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DISubroutineType(types: !522)
!522 = !{!29, !178}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !40, file: !41, line: 240, baseType: !524, size: 32, offset: 352)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{!29, !252}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !40, file: !41, line: 242, baseType: !524, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !40, file: !41, line: 243, baseType: !524, size: 32, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !40, file: !41, line: 244, baseType: !530, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !252}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !40, file: !41, line: 245, baseType: !530, size: 32, offset: 480)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !40, file: !41, line: 247, baseType: !530, size: 32, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !40, file: !41, line: 249, baseType: !45, size: 32, offset: 544)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !40, file: !41, line: 250, baseType: !45, size: 32, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !40, file: !41, line: 251, baseType: !45, size: 32, offset: 608)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !40, file: !41, line: 252, baseType: !45, size: 32, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !40, file: !41, line: 253, baseType: !45, size: 32, offset: 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !40, file: !41, line: 254, baseType: !45, size: 32, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !40, file: !41, line: 255, baseType: !45, size: 32, offset: 736)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !40, file: !41, line: 256, baseType: !45, size: 32, offset: 768)
!543 = !DIGlobalVariableExpression(var: !544)
!544 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !2, file: !3, line: 212, type: !545, isLocal: true, isDefinition: true)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !546, line: 521, baseType: !547)
!546 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!29, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !552, line: 16, baseType: !553)
!552 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !554, line: 364, size: 5376, elements: !555)
!554 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!555 = !{!556, !558, !559, !560, !561, !562, !563, !568, !569, !782, !1339, !1340, !1341, !1342, !1381, !1411, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1456, !1467, !1474, !1475, !1477, !1478, !1491, !1492, !1493, !1494, !1495, !1496, !1674, !1678, !1683, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !553, file: !554, line: 365, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 191, baseType: !22)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !553, file: !554, line: 367, baseType: !266, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !553, file: !554, line: 369, baseType: !12, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !553, file: !554, line: 370, baseType: !12, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !553, file: !554, line: 371, baseType: !12, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !553, file: !554, line: 372, baseType: !12, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !553, file: !554, line: 374, baseType: !564, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !554, line: 361, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !550}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !553, file: !554, line: 375, baseType: !564, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !553, file: !554, line: 378, baseType: !570, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !552, line: 18, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !573, line: 65, size: 3008, elements: !574)
!573 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!574 = !{!575, !576, !577, !578, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !740, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !572, file: !573, line: 66, baseType: !122, size: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !572, file: !573, line: 67, baseType: !79, size: 160, offset: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !572, file: !573, line: 68, baseType: !557, size: 32, offset: 1376)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !572, file: !573, line: 69, baseType: !579, size: 128, offset: 1408)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 16)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !572, file: !573, line: 70, baseType: !579, size: 128, offset: 1536)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !572, file: !573, line: 72, baseType: !584, size: 32, offset: 1664)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !128, line: 18, baseType: !139)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !572, file: !573, line: 73, baseType: !166, size: 32, offset: 1696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !572, file: !573, line: 74, baseType: !166, size: 32, offset: 1728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !572, file: !573, line: 75, baseType: !166, size: 32, offset: 1760)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !572, file: !573, line: 76, baseType: !166, size: 32, offset: 1792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !572, file: !573, line: 77, baseType: !166, size: 32, offset: 1824)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !572, file: !573, line: 79, baseType: !61, size: 64, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !572, file: !573, line: 80, baseType: !61, size: 64, offset: 1920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !572, file: !573, line: 81, baseType: !579, size: 128, offset: 1984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !572, file: !573, line: 83, baseType: !21, size: 32, offset: 2112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !572, file: !573, line: 84, baseType: !21, size: 32, offset: 2144)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !572, file: !573, line: 85, baseType: !16, size: 32, offset: 2176)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !572, file: !573, line: 86, baseType: !16, size: 32, offset: 2208)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !572, file: !573, line: 88, baseType: !44, size: 32, offset: 2240)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !572, file: !573, line: 89, baseType: !44, size: 32, offset: 2272)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !572, file: !573, line: 90, baseType: !44, size: 32, offset: 2304)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !572, file: !573, line: 91, baseType: !44, size: 32, offset: 2336)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !572, file: !573, line: 93, baseType: !109, size: 32, offset: 2368)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !572, file: !573, line: 95, baseType: !603, size: 32, offset: 2400)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !552, line: 19, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !573, line: 157, size: 544, elements: !606)
!606 = !{!607, !622, !683, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !739}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !605, file: !573, line: 158, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !573, line: 154, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 145, size: 480, elements: !611)
!611 = !{!612, !613, !614, !615, !618, !619, !620, !621}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !610, file: !573, line: 146, baseType: !456, size: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !610, file: !573, line: 147, baseType: !308, size: 160, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !610, file: !573, line: 148, baseType: !321, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !610, file: !573, line: 149, baseType: !616, size: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !198, line: 106, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !197)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !610, file: !573, line: 150, baseType: !616, size: 32, offset: 352)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !573, line: 151, baseType: !16, size: 32, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !610, file: !573, line: 152, baseType: !44, size: 32, offset: 416)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !610, file: !573, line: 153, baseType: !44, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !605, file: !573, line: 159, baseType: !623, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !625, line: 59, baseType: !626)
!625 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 34, size: 800, elements: !627)
!627 = !{!628, !635, !636, !637, !645, !646, !647, !656, !657, !658, !659, !678, !679, !680, !681, !682}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !626, file: !625, line: 35, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !630, line: 21, baseType: !631)
!630 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 16, size: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !631, file: !630, line: 17, baseType: !616, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !631, file: !630, line: 19, baseType: !616, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !626, file: !625, line: 37, baseType: !21, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !626, file: !625, line: 38, baseType: !21, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !626, file: !625, line: 40, baseType: !638, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !625, line: 16, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !625, line: 18, size: 96, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !640, file: !625, line: 19, baseType: !45, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !625, line: 20, baseType: !638, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !625, line: 21, baseType: !45, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !626, file: !625, line: 41, baseType: !638, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !626, file: !625, line: 42, baseType: !639, size: 96, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !626, file: !625, line: 44, baseType: !648, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !625, line: 31, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 25, size: 128, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !650, file: !625, line: 26, baseType: !44, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !650, file: !625, line: 27, baseType: !44, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !650, file: !625, line: 29, baseType: !44, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !650, file: !625, line: 30, baseType: !44, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !626, file: !625, line: 45, baseType: !44, size: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !626, file: !625, line: 47, baseType: !24, size: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !626, file: !625, line: 48, baseType: !24, size: 32, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !626, file: !625, line: 50, baseType: !660, size: 256, offset: 416)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !630, line: 37, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 24, size: 256, elements: !662)
!662 = !{!663, !665, !666, !667, !677}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !661, file: !630, line: 26, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !661, file: !630, line: 28, baseType: !664, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !661, file: !630, line: 29, baseType: !44, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !661, file: !630, line: 30, baseType: !668, size: 128, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !669, line: 19, baseType: !670)
!669 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 17, size: 128, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !670, file: !669, line: 18, baseType: !673, size: 128)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 128, elements: !675)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!675 = !{!676}
!676 = !DISubrange(count: 4)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !661, file: !630, line: 36, baseType: !44, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !626, file: !625, line: 52, baseType: !24, size: 32, offset: 672)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !626, file: !625, line: 53, baseType: !25, size: 8, offset: 704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !626, file: !625, line: 55, baseType: !22, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !626, file: !625, line: 57, baseType: !13, size: 32, offset: 736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !626, file: !625, line: 58, baseType: !13, size: 32, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !605, file: !573, line: 161, baseType: !684, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !124, line: 62, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 50, size: 384, elements: !687)
!687 = !{!688, !689, !690, !692, !697, !699, !701, !702, !703}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !124, line: 51, baseType: !61, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !686, file: !124, line: 52, baseType: !21, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !686, file: !124, line: 53, baseType: !691, size: 96, offset: 96)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, elements: !173)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !686, file: !124, line: 55, baseType: !693, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !124, line: 45, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{!388, !13}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !686, file: !124, line: 56, baseType: !698, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !124, line: 46, baseType: !694)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !686, file: !124, line: 57, baseType: !700, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !124, line: 47, baseType: !245)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !686, file: !124, line: 58, baseType: !13, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !686, file: !124, line: 60, baseType: !24, size: 32, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !686, file: !124, line: 61, baseType: !44, size: 32, offset: 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !605, file: !573, line: 163, baseType: !16, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !605, file: !573, line: 164, baseType: !21, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !605, file: !573, line: 166, baseType: !166, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !605, file: !573, line: 168, baseType: !166, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !605, file: !573, line: 170, baseType: !44, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !605, file: !573, line: 171, baseType: !44, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !605, file: !573, line: 172, baseType: !388, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !605, file: !573, line: 173, baseType: !388, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !605, file: !573, line: 174, baseType: !388, size: 32, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !605, file: !573, line: 176, baseType: !44, size: 32, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !605, file: !573, line: 177, baseType: !388, size: 32, offset: 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !605, file: !573, line: 178, baseType: !388, size: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !605, file: !573, line: 180, baseType: !717, size: 32, offset: 480)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !255, line: 25, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !255, line: 29, size: 320, elements: !720)
!720 = !{!721, !722, !732, !737, !738}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !719, file: !255, line: 30, baseType: !13, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !719, file: !255, line: 31, baseType: !723, size: 192, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !724, line: 22, baseType: !725)
!724 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !724, line: 16, size: 192, elements: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !725, file: !724, line: 17, baseType: !24, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !724, line: 18, baseType: !21, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !724, line: 19, baseType: !61, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !725, file: !724, line: 20, baseType: !178, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !725, file: !724, line: 21, baseType: !44, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !719, file: !255, line: 32, baseType: !733, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !255, line: 27, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!29, !717, !13}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !719, file: !255, line: 33, baseType: !13, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !719, file: !255, line: 34, baseType: !44, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !605, file: !573, line: 182, baseType: !44, size: 32, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !572, file: !573, line: 96, baseType: !741, size: 32, offset: 2432)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !573, line: 62, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 39, size: 576, elements: !744)
!744 = !{!745, !746, !747, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !743, file: !573, line: 40, baseType: !308, size: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !743, file: !573, line: 41, baseType: !321, size: 64, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !743, file: !573, line: 43, baseType: !748, size: 96, offset: 224)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 96, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 12)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !743, file: !573, line: 46, baseType: !22, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !743, file: !573, line: 47, baseType: !22, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !743, file: !573, line: 48, baseType: !22, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !743, file: !573, line: 49, baseType: !22, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !743, file: !573, line: 50, baseType: !22, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !743, file: !573, line: 51, baseType: !22, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !743, file: !573, line: 52, baseType: !22, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !743, file: !573, line: 53, baseType: !22, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !743, file: !573, line: 56, baseType: !584, size: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !743, file: !573, line: 57, baseType: !166, size: 32, offset: 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !743, file: !573, line: 58, baseType: !166, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !743, file: !573, line: 59, baseType: !21, size: 32, offset: 480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !743, file: !573, line: 60, baseType: !16, size: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !743, file: !573, line: 61, baseType: !388, size: 32, offset: 544)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !572, file: !573, line: 102, baseType: !388, size: 32, offset: 2464)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !572, file: !573, line: 103, baseType: !388, size: 32, offset: 2496)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !572, file: !573, line: 104, baseType: !388, size: 32, offset: 2528)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !572, file: !573, line: 105, baseType: !388, size: 32, offset: 2560)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !572, file: !573, line: 107, baseType: !274, size: 384, offset: 2592)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !572, file: !573, line: 109, baseType: !22, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !572, file: !573, line: 110, baseType: !22, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !572, file: !573, line: 112, baseType: !22, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !572, file: !573, line: 113, baseType: !22, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !572, file: !573, line: 114, baseType: !22, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !572, file: !573, line: 115, baseType: !22, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !572, file: !573, line: 116, baseType: !22, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !572, file: !573, line: 117, baseType: !22, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !572, file: !573, line: 118, baseType: !22, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !572, file: !573, line: 119, baseType: !22, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !572, file: !573, line: 121, baseType: !22, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !572, file: !573, line: 122, baseType: !22, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !553, file: !554, line: 381, baseType: !783, size: 32, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !552, line: 17, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !786, line: 313, size: 4096, elements: !787)
!786 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!787 = !{!788, !793, !794, !835, !914, !915, !937, !946, !1069, !1070, !1071, !1109, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1305, !1309, !1310, !1322, !1323, !1324, !1325, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !785, file: !786, line: 314, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !786, line: 309, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !550, !783}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !785, file: !786, line: 315, baseType: !789, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !785, file: !786, line: 317, baseType: !795, size: 480, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !796, line: 22, baseType: !797)
!796 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !796, line: 36, size: 480, elements: !798)
!798 = !{!799, !800, !801, !802, !804, !805, !806, !812, !817, !819, !820, !829, !830, !831, !832, !833, !834}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !797, file: !796, line: 37, baseType: !266, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !797, file: !796, line: 39, baseType: !358, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !797, file: !796, line: 40, baseType: !370, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !796, line: 41, baseType: !803, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !797, file: !796, line: 43, baseType: !44, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !797, file: !796, line: 44, baseType: !388, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !797, file: !796, line: 46, baseType: !807, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !796, line: 24, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!29, !811, !13}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !797, file: !796, line: 47, baseType: !813, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !796, line: 26, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !811, !13, !44}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !797, file: !796, line: 48, baseType: !818, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !796, line: 28, baseType: !814)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !796, line: 49, baseType: !13, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !797, file: !796, line: 56, baseType: !821, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !823, line: 78, baseType: !824)
!823 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 74, size: 128, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !824, file: !823, line: 75, baseType: !358, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !824, file: !823, line: 76, baseType: !370, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !823, line: 77, baseType: !61, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !796, line: 58, baseType: !18, size: 32, offset: 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !797, file: !796, line: 59, baseType: !18, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !797, file: !796, line: 61, baseType: !178, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !797, file: !796, line: 63, baseType: !22, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !797, file: !796, line: 64, baseType: !22, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !797, file: !796, line: 67, baseType: !22, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !785, file: !786, line: 319, baseType: !836, size: 32, offset: 544)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !838, line: 17, baseType: !839)
!838 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !838, line: 25, size: 1120, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !847, !848, !849, !850, !851, !856, !857, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !913}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !839, file: !838, line: 26, baseType: !266, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !839, file: !838, line: 27, baseType: !266, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !839, file: !838, line: 29, baseType: !104, size: 32, offset: 64)
