; ModuleID = 'src/http/modules/ngx_http_upstream_zone_module.c'
source_filename = "src/http/modules/ngx_http_upstream_zone_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_module_ctx", scope: !2, file: !3, line: 34, type: !648, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !160)
!3 = !DIFile(filename: "src/http/modules/ngx_http_upstream_zone_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !13, !16, !19, !93}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 17, size: 96, elements: !10)
!10 = !{!11, !14, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !9, file: !8, line: 18, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !9, file: !8, line: 19, baseType: !12, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !9, file: !8, line: 20, baseType: !12, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 135, baseType: !18)
!17 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !21, line: 59, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 34, size: 800, elements: !23)
!23 = !{!24, !36, !39, !40, !49, !50, !51, !62, !63, !68, !69, !88, !89, !90, !91, !92}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !22, file: !21, line: 35, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !26, line: 21, baseType: !27)
!26 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 16, size: 64, elements: !28)
!28 = !{!29, !35}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !27, file: !26, line: 17, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !31, line: 106, baseType: !32)
!31 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !31, line: 98, baseType: !34)
!34 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !27, file: !26, line: 19, baseType: !30, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !22, file: !21, line: 37, baseType: !37, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 120, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !22, file: !21, line: 38, baseType: !37, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !22, file: !21, line: 40, baseType: !41, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !21, line: 16, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !21, line: 18, size: 96, elements: !44)
!44 = !{!45, !47, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !43, file: !21, line: 19, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !17, line: 125, baseType: !38)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !21, line: 20, baseType: !41, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !43, file: !21, line: 21, baseType: !46, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !22, file: !21, line: 41, baseType: !41, size: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !22, file: !21, line: 42, baseType: !42, size: 96, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !22, file: !21, line: 44, baseType: !52, size: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !21, line: 31, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 25, size: 128, elements: !55)
!55 = !{!56, !59, !60, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !54, file: !21, line: 26, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !58, line: 79, baseType: !46)
!58 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !54, file: !21, line: 27, baseType: !57, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !54, file: !21, line: 29, baseType: !57, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !54, file: !21, line: 30, baseType: !57, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !22, file: !21, line: 45, baseType: !57, size: 32, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !22, file: !21, line: 47, baseType: !64, size: 32, offset: 352)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !66, line: 64, baseType: !67)
!66 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !22, file: !21, line: 48, baseType: !64, size: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !22, file: !21, line: 50, baseType: !70, size: 256, offset: 416)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !26, line: 37, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 24, size: 256, elements: !72)
!72 = !{!73, !75, !76, !77, !87}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !71, file: !26, line: 26, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !71, file: !26, line: 28, baseType: !74, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !71, file: !26, line: 29, baseType: !57, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !71, file: !26, line: 30, baseType: !78, size: 128, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !79, line: 19, baseType: !80)
!79 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 17, size: 128, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !80, file: !79, line: 18, baseType: !83, size: 128)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !85)
!84 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!85 = !{!86}
!86 = !DISubrange(count: 4)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !71, file: !26, line: 36, baseType: !57, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !22, file: !21, line: 52, baseType: !64, size: 32, offset: 672)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !22, file: !21, line: 53, baseType: !65, size: 8, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !22, file: !21, line: 55, baseType: !38, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !21, line: 57, baseType: !13, size: 32, offset: 736)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !22, file: !21, line: 58, baseType: !13, size: 32, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_rr_peers_t", file: !96, line: 59, baseType: !97)
!96 = !DIFile(filename: "src/http/ngx_http_upstream_round_robin.h", directory: "/home/sam/Projects/nginx-1.12.2")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_rr_peers_s", file: !96, line: 61, size: 288, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !114, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !97, file: !96, line: 62, baseType: !57, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !97, file: !96, line: 65, baseType: !19, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !97, file: !96, line: 66, baseType: !30, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "zone_next", scope: !97, file: !96, line: 67, baseType: !94, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "total_weight", scope: !97, file: !96, line: 70, baseType: !57, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "single", scope: !97, file: !96, line: 72, baseType: !38, size: 1, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !97, file: !96, line: 73, baseType: !38, size: 1, offset: 161, flags: DIFlagBitField, extraData: i64 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !96, line: 75, baseType: !107, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !109, line: 19, baseType: !110)
!109 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 16, size: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !110, file: !109, line: 17, baseType: !37, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !109, line: 18, baseType: !64, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !96, line: 77, baseType: !94, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !97, file: !96, line: 79, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_rr_peer_t", file: !96, line: 17, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_rr_peer_s", file: !96, line: 19, size: 672, elements: !119)
!119 = !{!120, !133, !135, !136, !137, !140, !141, !142, !143, !144, !145, !148, !149, !150, !151, !156, !157, !158, !159}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !118, file: !96, line: 20, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !123, line: 297, size: 128, elements: !124)
!123 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !122, file: !123, line: 298, baseType: !126, size: 16)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !17, line: 409, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !122, file: !123, line: 299, baseType: !129, size: 112, offset: 16)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 112, elements: !131)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !{!132}
!132 = !DISubrange(count: 14)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !118, file: !96, line: 21, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !17, line: 404, baseType: !38)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !96, line: 22, baseType: !108, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !118, file: !96, line: 23, baseType: !108, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "current_weight", scope: !118, file: !96, line: 25, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !58, line: 78, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !17, line: 140, baseType: !18)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "effective_weight", scope: !118, file: !96, line: 26, baseType: !138, size: 32, offset: 224)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !118, file: !96, line: 27, baseType: !138, size: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !118, file: !96, line: 29, baseType: !57, size: 32, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "max_conns", scope: !118, file: !96, line: 30, baseType: !57, size: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !118, file: !96, line: 32, baseType: !57, size: 32, offset: 352)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "accessed", scope: !118, file: !96, line: 33, baseType: !146, size: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !17, line: 75, baseType: !147)
!147 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "checked", scope: !118, file: !96, line: 34, baseType: !146, size: 32, offset: 416)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "max_fails", scope: !118, file: !96, line: 36, baseType: !57, size: 32, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fail_timeout", scope: !118, file: !96, line: 37, baseType: !146, size: 32, offset: 480)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "slow_start", scope: !118, file: !96, line: 38, baseType: !152, size: 32, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !153, line: 16, baseType: !154)
!153 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !155, line: 16, baseType: !57)
!155 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !118, file: !96, line: 39, baseType: !152, size: 32, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !118, file: !96, line: 41, baseType: !57, size: 32, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !118, file: !96, line: 49, baseType: !30, size: 32, offset: 608)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !96, line: 52, baseType: !116, size: 32, offset: 640)
!160 = !{!161, !0, !643}
!161 = !DIGlobalVariableExpression(var: !162)
!162 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_module", scope: !2, file: !3, line: 49, type: !163, isLocal: false, isDefinition: true)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !164, line: 15, baseType: !165)
!164 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !166, line: 222, size: 800, elements: !167)
!166 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = !{!168, !169, !170, !172, !173, !174, !175, !178, !179, !618, !619, !623, !627, !628, !629, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !165, file: !166, line: 223, baseType: !57, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !165, file: !166, line: 224, baseType: !57, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !166, line: 226, baseType: !171, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !165, file: !166, line: 228, baseType: !57, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !165, file: !166, line: 229, baseType: !57, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !165, file: !166, line: 231, baseType: !57, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !165, file: !166, line: 232, baseType: !176, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !165, file: !166, line: 234, baseType: !13, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !165, file: !166, line: 235, baseType: !180, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !164, line: 22, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !183, line: 77, size: 224, elements: !184)
!183 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!184 = !{!185, !186, !187, !615, !616, !617}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 78, baseType: !108, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !183, line: 79, baseType: !57, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !182, file: !183, line: 80, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!171, !191, !180, !13}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !164, line: 16, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !183, line: 116, size: 384, elements: !194)
!194 = !{!195, !196, !368, !597, !598, !599, !608, !609, !610, !611, !612, !614}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !183, line: 117, baseType: !171, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !193, file: !183, line: 118, baseType: !197, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !199, line: 22, baseType: !200)
!199 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 16, size: 160, elements: !201)
!201 = !{!202, !203, !204, !205, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !200, file: !199, line: 17, baseType: !13, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !200, file: !199, line: 18, baseType: !57, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !199, line: 19, baseType: !37, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !200, file: !199, line: 20, baseType: !57, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !200, file: !199, line: 21, baseType: !207, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !164, line: 18, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !210, line: 57, size: 320, elements: !211)
!210 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!211 = !{!212, !220, !221, !222, !348, !355, !367}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !209, file: !210, line: 58, baseType: !213, size: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !210, line: 54, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 49, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !214, file: !210, line: 50, baseType: !64, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !214, file: !210, line: 51, baseType: !64, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !210, line: 52, baseType: !207, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !214, file: !210, line: 53, baseType: !57, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !209, file: !210, line: 59, baseType: !37, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !209, file: !210, line: 60, baseType: !207, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !209, file: !210, line: 61, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !164, line: 19, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !226, line: 59, size: 64, elements: !227)
!226 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!227 = !{!228, !347}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !225, file: !226, line: 60, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !226, line: 18, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !226, line: 20, size: 352, elements: !232)
!232 = !{!233, !234, !235, !237, !238, !239, !240, !242, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !231, file: !226, line: 21, baseType: !64, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !231, file: !226, line: 22, baseType: !64, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !231, file: !226, line: 23, baseType: !236, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !17, line: 222, baseType: !18)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !231, file: !226, line: 24, baseType: !236, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !231, file: !226, line: 26, baseType: !64, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !231, file: !226, line: 27, baseType: !64, size: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !231, file: !226, line: 28, baseType: !241, size: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !226, line: 16, baseType: !13)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !231, file: !226, line: 29, baseType: !243, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !164, line: 23, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !246, line: 16, size: 1216, elements: !247)
!246 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!247 = !{!248, !251, !252, !295, !296, !297, !332, !333}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !245, file: !246, line: 17, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !250, line: 16, baseType: !18)
!250 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !246, line: 18, baseType: !108, size: 64, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !245, file: !246, line: 19, baseType: !253, size: 960, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !250, line: 17, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !255, line: 4, size: 960, elements: !256)
!255 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!256 = !{!257, !259, !260, !262, !263, !265, !266, !268, !270, !272, !273, !274, !275, !276, !277, !279, !280, !282, !283, !288, !289, !290}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !254, file: !255, line: 6, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !17, line: 232, baseType: !38)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !254, file: !255, line: 7, baseType: !258, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !254, file: !255, line: 8, baseType: !261, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !17, line: 227, baseType: !38)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !254, file: !255, line: 9, baseType: !261, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !254, file: !255, line: 10, baseType: !264, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !17, line: 217, baseType: !38)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !254, file: !255, line: 11, baseType: !264, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !254, file: !255, line: 13, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !17, line: 212, baseType: !38)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !254, file: !255, line: 14, baseType: !269, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !17, line: 304, baseType: !38)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !254, file: !255, line: 15, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !17, line: 309, baseType: !38)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !254, file: !255, line: 16, baseType: !38, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !254, file: !255, line: 17, baseType: !258, size: 32, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !254, file: !255, line: 18, baseType: !258, size: 32, offset: 352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !254, file: !255, line: 19, baseType: !236, size: 32, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !254, file: !255, line: 20, baseType: !236, size: 32, offset: 416)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !254, file: !255, line: 21, baseType: !278, size: 32, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !17, line: 237, baseType: !147)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !254, file: !255, line: 22, baseType: !278, size: 32, offset: 480)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !254, file: !255, line: 23, baseType: !281, size: 32, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !17, line: 242, baseType: !18)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !254, file: !255, line: 24, baseType: !281, size: 32, offset: 544)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !254, file: !255, line: 26, baseType: !284, size: 64, offset: 576)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !17, line: 288, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !284, file: !17, line: 288, baseType: !146, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !284, file: !17, line: 288, baseType: !147, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !254, file: !255, line: 27, baseType: !284, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !254, file: !255, line: 28, baseType: !284, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !254, file: !255, line: 29, baseType: !291, size: 192, offset: 768)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 192, elements: !293)
!292 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!293 = !{!294}
!294 = !DISubrange(count: 3)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !245, file: !246, line: 21, baseType: !236, size: 32, offset: 1088)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !245, file: !246, line: 22, baseType: !236, size: 32, offset: 1120)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !245, file: !246, line: 24, baseType: !298, size: 32, offset: 1152)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !164, line: 20, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !301, line: 50, size: 320, elements: !302)
!301 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!302 = !{!303, !304, !316, !317, !318, !323, !324, !329, !330, !331}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !300, file: !301, line: 51, baseType: !57, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !300, file: !301, line: 52, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !164, line: 21, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !183, line: 89, size: 160, elements: !308)
!308 = !{!309, !310, !311, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !307, file: !183, line: 90, baseType: !249, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !183, line: 91, baseType: !108, size: 64, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !307, file: !183, line: 93, baseType: !312, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !305, !298}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !183, line: 94, baseType: !13, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !300, file: !301, line: 54, baseType: !33, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !300, file: !301, line: 56, baseType: !146, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !300, file: !301, line: 58, baseType: !319, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !301, line: 45, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DISubroutineType(types: !322)
!322 = !{!64, !298, !64, !37}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !301, line: 59, baseType: !13, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !300, file: !301, line: 61, baseType: !325, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !301, line: 46, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !298, !57, !64, !37}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !300, file: !301, line: 62, baseType: !13, size: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !300, file: !301, line: 70, baseType: !171, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !301, line: 72, baseType: !298, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !245, file: !246, line: 37, baseType: !38, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !245, file: !246, line: 38, baseType: !38, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !231, file: !226, line: 30, baseType: !229, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !231, file: !226, line: 34, baseType: !38, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !231, file: !226, line: 40, baseType: !38, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !231, file: !226, line: 43, baseType: !38, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !231, file: !226, line: 45, baseType: !38, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !231, file: !226, line: 46, baseType: !38, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !231, file: !226, line: 47, baseType: !38, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !231, file: !226, line: 48, baseType: !38, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !231, file: !226, line: 49, baseType: !38, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !231, file: !226, line: 50, baseType: !38, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !231, file: !226, line: 52, baseType: !38, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !231, file: !226, line: 53, baseType: !38, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !231, file: !226, line: 55, baseType: !18, size: 32, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !226, line: 61, baseType: !223, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !209, file: !210, line: 62, baseType: !349, size: 32, offset: 224)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !210, line: 41, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !210, line: 43, size: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !210, line: 44, baseType: !349, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !351, file: !210, line: 45, baseType: !13, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !209, file: !210, line: 63, baseType: !356, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !210, line: 32, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !210, line: 34, size: 96, elements: !359)
!359 = !{!360, !365, !366}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !358, file: !210, line: 35, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !210, line: 30, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !13}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !210, line: 36, baseType: !13, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !210, line: 37, baseType: !356, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !209, file: !210, line: 64, baseType: !298, size: 32, offset: 288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !193, file: !183, line: 120, baseType: !369, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !164, line: 17, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !372, line: 38, size: 2496, elements: !373)
!372 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!373 = !{!374, !377, !378, !379, !380, !381, !543, !544, !545, !548, !549, !550, !551, !552, !553, !554, !555, !566, !567, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !371, file: !372, line: 39, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !371, file: !372, line: 40, baseType: !207, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !371, file: !372, line: 42, baseType: !298, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !371, file: !372, line: 43, baseType: !299, size: 320, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !371, file: !372, line: 45, baseType: !57, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !371, file: !372, line: 47, baseType: !382, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !164, line: 26, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !386, line: 121, size: 896, elements: !387)
!386 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!387 = !{!388, !389, !443, !444, !447, !453, !455, !460, !465, !511, !512, !513, !514, !515, !516, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !386, line: 122, baseType: !13, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !385, file: !386, line: 123, baseType: !390, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !164, line: 24, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !393, line: 30, size: 384, elements: !394)
!393 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !422, !423, !424, !435}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !393, line: 31, baseType: !13, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !392, file: !393, line: 33, baseType: !38, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !392, file: !393, line: 35, baseType: !38, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !392, file: !393, line: 38, baseType: !38, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !392, file: !393, line: 44, baseType: !38, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !392, file: !393, line: 46, baseType: !38, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !392, file: !393, line: 49, baseType: !38, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !392, file: !393, line: 51, baseType: !38, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !392, file: !393, line: 54, baseType: !38, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !392, file: !393, line: 56, baseType: !38, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !392, file: !393, line: 57, baseType: !38, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !392, file: !393, line: 59, baseType: !38, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !392, file: !393, line: 60, baseType: !38, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !392, file: !393, line: 62, baseType: !38, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !392, file: !393, line: 64, baseType: !38, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !392, file: !393, line: 67, baseType: !38, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !392, file: !393, line: 69, baseType: !38, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !392, file: !393, line: 71, baseType: !38, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !392, file: !393, line: 74, baseType: !38, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !392, file: !393, line: 75, baseType: !38, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !392, file: !393, line: 77, baseType: !38, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !392, file: !393, line: 107, baseType: !38, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !392, file: !393, line: 110, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !164, line: 31, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !390}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !392, file: !393, line: 117, baseType: !57, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !392, file: !393, line: 119, baseType: !298, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !392, file: !393, line: 121, baseType: !425, size: 160, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !155, line: 20, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !155, line: 22, size: 160, elements: !427)
!427 = !{!428, !429, !431, !432, !433, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !426, file: !155, line: 23, baseType: !154, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !426, file: !155, line: 24, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !426, file: !155, line: 25, baseType: !430, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !426, file: !155, line: 26, baseType: !430, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !426, file: !155, line: 27, baseType: !65, size: 8, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !426, file: !155, line: 28, baseType: !65, size: 8, offset: 136)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !392, file: !393, line: 124, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !437, line: 16, baseType: !438)
!437 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !437, line: 18, size: 64, elements: !439)
!439 = !{!440, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !437, line: 19, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !437, line: 20, baseType: !441, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !385, file: !386, line: 124, baseType: !390, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !385, file: !386, line: 126, baseType: !445, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !446, line: 17, baseType: !18)
!446 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !385, file: !386, line: 128, baseType: !448, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !449, line: 19, baseType: !450)
!449 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DISubroutineType(types: !452)
!452 = !{!16, !383, !64, !37}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !385, file: !386, line: 129, baseType: !454, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !449, line: 22, baseType: !450)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !385, file: !386, line: 130, baseType: !456, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !449, line: 20, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{!16, !383, !223, !236}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !385, file: !386, line: 131, baseType: !461, size: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !449, line: 23, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DISubroutineType(types: !464)
!464 = !{!223, !383, !223, !236}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !385, file: !386, line: 133, baseType: !466, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !386, line: 16, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !386, line: 18, size: 960, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !468, file: !386, line: 19, baseType: !445, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !468, file: !386, line: 21, baseType: !121, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !468, file: !386, line: 22, baseType: !134, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !468, file: !386, line: 23, baseType: !37, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !468, file: !386, line: 24, baseType: !108, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !386, line: 26, baseType: !18, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !468, file: !386, line: 28, baseType: !18, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !468, file: !386, line: 29, baseType: !18, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !468, file: !386, line: 30, baseType: !18, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !468, file: !386, line: 38, baseType: !480, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !164, line: 32, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !383}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !468, file: !386, line: 40, baseType: !13, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !468, file: !386, line: 42, baseType: !299, size: 320, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !468, file: !386, line: 43, baseType: !298, size: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !468, file: !386, line: 45, baseType: !37, size: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !468, file: !386, line: 47, baseType: !37, size: 32, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !468, file: !386, line: 49, baseType: !152, size: 32, offset: 800)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !468, file: !386, line: 51, baseType: !466, size: 32, offset: 832)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !468, file: !386, line: 52, baseType: !383, size: 32, offset: 864)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !468, file: !386, line: 54, baseType: !57, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !468, file: !386, line: 56, baseType: !38, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !468, file: !386, line: 57, baseType: !38, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !468, file: !386, line: 58, baseType: !38, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !468, file: !386, line: 60, baseType: !38, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !468, file: !386, line: 61, baseType: !38, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !468, file: !386, line: 62, baseType: !38, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !468, file: !386, line: 63, baseType: !38, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !468, file: !386, line: 64, baseType: !38, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !468, file: !386, line: 65, baseType: !38, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !468, file: !386, line: 66, baseType: !38, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !468, file: !386, line: 67, baseType: !38, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !468, file: !386, line: 70, baseType: !38, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !468, file: !386, line: 72, baseType: !38, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !468, file: !386, line: 73, baseType: !38, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !468, file: !386, line: 74, baseType: !38, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !468, file: !386, line: 76, baseType: !38, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !468, file: !386, line: 77, baseType: !38, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !468, file: !386, line: 78, baseType: !38, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !385, file: !386, line: 135, baseType: !236, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !385, file: !386, line: 137, baseType: !298, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !385, file: !386, line: 139, baseType: !207, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !386, line: 141, baseType: !18, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !385, file: !386, line: 143, baseType: !121, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !385, file: !386, line: 144, baseType: !134, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !385, file: !386, line: 145, baseType: !108, size: 64, offset: 480)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !385, file: !386, line: 147, baseType: !108, size: 64, offset: 544)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !385, file: !386, line: 148, baseType: !520, size: 16, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !521, line: 12, baseType: !522)
!521 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 186, baseType: !127)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !385, file: !386, line: 154, baseType: !121, size: 32, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !385, file: !386, line: 155, baseType: !134, size: 32, offset: 672)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !385, file: !386, line: 157, baseType: !229, size: 32, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !385, file: !386, line: 159, baseType: !436, size: 64, offset: 736)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !385, file: !386, line: 161, baseType: !33, size: 32, offset: 800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !385, file: !386, line: 163, baseType: !57, size: 32, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !385, file: !386, line: 165, baseType: !38, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !385, file: !386, line: 167, baseType: !38, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !385, file: !386, line: 169, baseType: !38, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !385, file: !386, line: 170, baseType: !38, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !385, file: !386, line: 171, baseType: !38, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !385, file: !386, line: 173, baseType: !38, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !385, file: !386, line: 174, baseType: !38, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !385, file: !386, line: 175, baseType: !38, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !385, file: !386, line: 176, baseType: !38, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !385, file: !386, line: 178, baseType: !38, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !385, file: !386, line: 179, baseType: !38, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !385, file: !386, line: 180, baseType: !38, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !385, file: !386, line: 181, baseType: !38, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !385, file: !386, line: 183, baseType: !38, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !371, file: !372, line: 48, baseType: !383, size: 32, offset: 480)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !371, file: !372, line: 49, baseType: !57, size: 32, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !371, file: !372, line: 51, baseType: !546, size: 32, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !371, file: !372, line: 52, baseType: !57, size: 32, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !371, file: !372, line: 53, baseType: !57, size: 32, offset: 608)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !371, file: !372, line: 55, baseType: !436, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !371, file: !372, line: 56, baseType: !57, size: 32, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !371, file: !372, line: 58, baseType: !198, size: 160, offset: 736)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !371, file: !372, line: 59, baseType: !198, size: 160, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !371, file: !372, line: 61, baseType: !198, size: 160, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !371, file: !372, line: 62, baseType: !556, size: 96, offset: 1216)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !155, line: 32, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !155, line: 37, size: 96, elements: !558)
!558 = !{!559, !560, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !557, file: !155, line: 38, baseType: !430, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !557, file: !155, line: 39, baseType: !430, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !557, file: !155, line: 40, baseType: !562, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !155, line: 34, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !430, !430, !430}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !371, file: !372, line: 63, baseType: !425, size: 160, offset: 1312)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !371, file: !372, line: 65, baseType: !568, size: 224, offset: 1472)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !569, line: 31, baseType: !570)
!569 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 25, size: 224, elements: !571)
!571 = !{!572, !580, !581, !582, !583}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !570, file: !569, line: 26, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !569, line: 16, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !569, line: 18, size: 96, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !575, file: !569, line: 19, baseType: !13, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !575, file: !569, line: 20, baseType: !57, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !569, line: 21, baseType: !573, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !570, file: !569, line: 27, baseType: !574, size: 96, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !570, file: !569, line: 28, baseType: !37, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !570, file: !569, line: 29, baseType: !57, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !570, file: !569, line: 30, baseType: !207, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !371, file: !372, line: 66, baseType: !568, size: 224, offset: 1696)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !371, file: !372, line: 68, baseType: !57, size: 32, offset: 1920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !371, file: !372, line: 69, baseType: !57, size: 32, offset: 1952)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !371, file: !372, line: 71, baseType: !383, size: 32, offset: 1984)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !371, file: !372, line: 72, baseType: !390, size: 32, offset: 2016)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !371, file: !372, line: 73, baseType: !390, size: 32, offset: 2048)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !371, file: !372, line: 75, baseType: !369, size: 32, offset: 2080)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !371, file: !372, line: 77, baseType: !108, size: 64, offset: 2112)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !371, file: !372, line: 78, baseType: !108, size: 64, offset: 2176)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !371, file: !372, line: 79, baseType: !108, size: 64, offset: 2240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !371, file: !372, line: 80, baseType: !108, size: 64, offset: 2304)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !371, file: !372, line: 81, baseType: !108, size: 64, offset: 2368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !371, file: !372, line: 82, baseType: !108, size: 64, offset: 2432)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !193, file: !183, line: 121, baseType: !207, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !193, file: !183, line: 122, baseType: !207, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !193, file: !183, line: 123, baseType: !600, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !183, line: 103, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 98, size: 1344, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !602, file: !183, line: 99, baseType: !244, size: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !602, file: !183, line: 100, baseType: !229, size: 32, offset: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !602, file: !183, line: 101, baseType: !229, size: 32, offset: 1248)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !602, file: !183, line: 102, baseType: !57, size: 32, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !193, file: !183, line: 124, baseType: !298, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !193, file: !183, line: 126, baseType: !13, size: 32, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !193, file: !183, line: 127, baseType: !57, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !193, file: !183, line: 128, baseType: !57, size: 32, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !193, file: !183, line: 130, baseType: !613, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !183, line: 112, baseType: !188)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !193, file: !183, line: 131, baseType: !171, size: 32, offset: 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !182, file: !183, line: 81, baseType: !57, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !182, file: !183, line: 82, baseType: !57, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !182, file: !183, line: 83, baseType: !13, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !166, line: 236, baseType: !57, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !165, file: !166, line: 238, baseType: !620, size: 32, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DISubroutineType(types: !622)
!622 = !{!138, !298}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !165, file: !166, line: 240, baseType: !624, size: 32, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DISubroutineType(types: !626)
!626 = !{!138, !369}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !165, file: !166, line: 242, baseType: !624, size: 32, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !165, file: !166, line: 243, baseType: !624, size: 32, offset: 416)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !165, file: !166, line: 244, baseType: !630, size: 32, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !369}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !165, file: !166, line: 245, baseType: !630, size: 32, offset: 480)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !165, file: !166, line: 247, baseType: !630, size: 32, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !165, file: !166, line: 249, baseType: !46, size: 32, offset: 544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !165, file: !166, line: 250, baseType: !46, size: 32, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !165, file: !166, line: 251, baseType: !46, size: 32, offset: 608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !165, file: !166, line: 252, baseType: !46, size: 32, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !165, file: !166, line: 253, baseType: !46, size: 32, offset: 672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !165, file: !166, line: 254, baseType: !46, size: 32, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !165, file: !166, line: 255, baseType: !46, size: 32, offset: 736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !165, file: !166, line: 256, baseType: !46, size: 32, offset: 768)
!643 = !DIGlobalVariableExpression(var: !644)
!644 = distinct !DIGlobalVariable(name: "ngx_http_upstream_zone_commands", scope: !2, file: !3, line: 21, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 448, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 2)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !8, line: 36, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 24, size: 256, elements: !650)
!650 = !{!651, !655, !656, !660, !664, !665, !669, !670}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !649, file: !8, line: 25, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!138, !191}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !649, file: !8, line: 26, baseType: !652, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !649, file: !8, line: 28, baseType: !657, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{!13, !191}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !649, file: !8, line: 29, baseType: !661, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{!171, !191, !13}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !649, file: !8, line: 31, baseType: !657, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !649, file: !8, line: 32, baseType: !666, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{!171, !191, !13, !13}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !649, file: !8, line: 34, baseType: !657, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !649, file: !8, line: 35, baseType: !666, size: 32, offset: 224)
!671 = !{i32 2, !"Dwarf Version", i32 4}
!672 = !{i32 2, !"Debug Info Version", i32 3}
!673 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!674 = distinct !DISubprogram(name: "ngx_http_upstream_zone", scope: !3, file: !3, line: 66, type: !189, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !1851}
!676 = !DILocalVariable(name: "cf", arg: 1, scope: !674, file: !3, line: 66, type: !191)
!677 = !DILocalVariable(name: "cmd", arg: 2, scope: !674, file: !3, line: 66, type: !180)
!678 = !DILocalVariable(name: "conf", arg: 3, scope: !674, file: !3, line: 66, type: !13)
!679 = !DILocalVariable(name: "size", scope: !674, file: !3, line: 68, type: !16)
!680 = !DILocalVariable(name: "value", scope: !674, file: !3, line: 69, type: !107)
!681 = !DILocalVariable(name: "uscf", scope: !674, file: !3, line: 70, type: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !684, line: 77, baseType: !685)
!684 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !684, line: 119, size: 416, elements: !686)
!686 = !{!687, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !685, file: !684, line: 120, baseType: !688, size: 96)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !684, line: 89, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 85, size: 96, elements: !690)
!690 = !{!691, !696, !1841}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !689, file: !684, line: 86, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !684, line: 79, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DISubroutineType(types: !695)
!695 = !{!138, !191, !682}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !689, file: !684, line: 87, baseType: !697, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !684, line: 81, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DISubroutineType(types: !700)
!700 = !{!138, !701, !682}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !703, line: 16, baseType: !704)
!703 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !705, line: 364, size: 5376, elements: !706)
!705 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!706 = !{!707, !709, !710, !711, !712, !713, !714, !719, !720, !871, !1401, !1402, !1403, !1404, !1443, !1473, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1518, !1529, !1536, !1537, !1539, !1540, !1553, !1554, !1555, !1556, !1557, !1558, !1737, !1741, !1746, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !704, file: !705, line: 365, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 191, baseType: !38)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !704, file: !705, line: 367, baseType: !383, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !704, file: !705, line: 369, baseType: !12, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !704, file: !705, line: 370, baseType: !12, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !704, file: !705, line: 371, baseType: !12, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !704, file: !705, line: 372, baseType: !12, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !704, file: !705, line: 374, baseType: !715, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !705, line: 361, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !701}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !704, file: !705, line: 375, baseType: !715, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !704, file: !705, line: 378, baseType: !721, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !703, line: 18, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !724, line: 65, size: 3008, elements: !725)
!724 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!725 = !{!726, !727, !728, !729, !733, !734, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !829, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !723, file: !724, line: 66, baseType: !244, size: 1216)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !723, file: !724, line: 67, baseType: !198, size: 160, offset: 1216)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !723, file: !724, line: 68, baseType: !708, size: 32, offset: 1376)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !723, file: !724, line: 69, baseType: !730, size: 128, offset: 1408)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 16)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !723, file: !724, line: 70, baseType: !730, size: 128, offset: 1536)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !723, file: !724, line: 72, baseType: !735, size: 32, offset: 1664)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !250, line: 18, baseType: !261)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !723, file: !724, line: 73, baseType: !146, size: 32, offset: 1696)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !723, file: !724, line: 74, baseType: !146, size: 32, offset: 1728)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !723, file: !724, line: 75, baseType: !146, size: 32, offset: 1760)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !723, file: !724, line: 76, baseType: !146, size: 32, offset: 1792)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !723, file: !724, line: 77, baseType: !146, size: 32, offset: 1824)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !723, file: !724, line: 79, baseType: !108, size: 64, offset: 1856)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !723, file: !724, line: 80, baseType: !108, size: 64, offset: 1920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !723, file: !724, line: 81, baseType: !730, size: 128, offset: 1984)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !723, file: !724, line: 83, baseType: !37, size: 32, offset: 2112)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !723, file: !724, line: 84, baseType: !37, size: 32, offset: 2144)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !723, file: !724, line: 85, baseType: !236, size: 32, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !723, file: !724, line: 86, baseType: !236, size: 32, offset: 2208)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !723, file: !724, line: 88, baseType: !57, size: 32, offset: 2240)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !723, file: !724, line: 89, baseType: !57, size: 32, offset: 2272)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !723, file: !724, line: 90, baseType: !57, size: 32, offset: 2304)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !723, file: !724, line: 91, baseType: !57, size: 32, offset: 2336)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !723, file: !724, line: 93, baseType: !229, size: 32, offset: 2368)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !723, file: !724, line: 95, baseType: !754, size: 32, offset: 2400)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !703, line: 19, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !724, line: 157, size: 544, elements: !757)
!757 = !{!758, !771, !772, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !828}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !756, file: !724, line: 158, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !724, line: 154, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !724, line: 145, size: 480, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !761, file: !724, line: 146, baseType: !556, size: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !761, file: !724, line: 147, baseType: !425, size: 160, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !761, file: !724, line: 148, baseType: !436, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !761, file: !724, line: 149, baseType: !30, size: 32, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !761, file: !724, line: 150, baseType: !30, size: 32, offset: 352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !761, file: !724, line: 151, baseType: !236, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !761, file: !724, line: 152, baseType: !57, size: 32, offset: 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !761, file: !724, line: 153, baseType: !57, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !756, file: !724, line: 159, baseType: !19, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !756, file: !724, line: 161, baseType: !773, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !246, line: 62, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 50, size: 384, elements: !776)
!776 = !{!777, !778, !779, !781, !786, !788, !790, !791, !792}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !246, line: 51, baseType: !108, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !775, file: !246, line: 52, baseType: !37, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !775, file: !246, line: 53, baseType: !780, size: 96, offset: 96)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !293)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !775, file: !246, line: 55, baseType: !782, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !246, line: 45, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DISubroutineType(types: !785)
!785 = !{!152, !13}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !775, file: !246, line: 56, baseType: !787, size: 32, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !246, line: 46, baseType: !783)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !775, file: !246, line: 57, baseType: !789, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !246, line: 47, baseType: !362)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !246, line: 58, baseType: !13, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !775, file: !246, line: 60, baseType: !64, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !775, file: !246, line: 61, baseType: !57, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !756, file: !724, line: 163, baseType: !236, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !756, file: !724, line: 164, baseType: !37, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !756, file: !724, line: 166, baseType: !146, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !756, file: !724, line: 168, baseType: !146, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !756, file: !724, line: 170, baseType: !57, size: 32, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !756, file: !724, line: 171, baseType: !57, size: 32, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !756, file: !724, line: 172, baseType: !152, size: 32, offset: 288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !756, file: !724, line: 173, baseType: !152, size: 32, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !756, file: !724, line: 174, baseType: !152, size: 32, offset: 352)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !756, file: !724, line: 176, baseType: !57, size: 32, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !756, file: !724, line: 177, baseType: !152, size: 32, offset: 416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !756, file: !724, line: 178, baseType: !152, size: 32, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !756, file: !724, line: 180, baseType: !806, size: 32, offset: 480)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !372, line: 25, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !372, line: 29, size: 320, elements: !809)
!809 = !{!810, !811, !821, !826, !827}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !372, line: 30, baseType: !13, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !808, file: !372, line: 31, baseType: !812, size: 192, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !813, line: 22, baseType: !814)
!813 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 16, size: 192, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !814, file: !813, line: 17, baseType: !64, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !814, file: !813, line: 18, baseType: !37, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !813, line: 19, baseType: !108, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !814, file: !813, line: 20, baseType: !298, size: 32, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !814, file: !813, line: 21, baseType: !57, size: 32, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !808, file: !372, line: 32, baseType: !822, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !372, line: 27, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!138, !806, !13}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !808, file: !372, line: 33, baseType: !13, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !808, file: !372, line: 34, baseType: !57, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !756, file: !724, line: 182, baseType: !57, size: 32, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !723, file: !724, line: 96, baseType: !830, size: 32, offset: 2432)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !724, line: 62, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !724, line: 39, size: 576, elements: !833)
!833 = !{!834, !835, !836, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !832, file: !724, line: 40, baseType: !425, size: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !832, file: !724, line: 41, baseType: !436, size: 64, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !832, file: !724, line: 43, baseType: !837, size: 96, offset: 224)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 96, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 12)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !832, file: !724, line: 46, baseType: !38, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !832, file: !724, line: 47, baseType: !38, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !832, file: !724, line: 48, baseType: !38, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !832, file: !724, line: 49, baseType: !38, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !832, file: !724, line: 50, baseType: !38, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !832, file: !724, line: 51, baseType: !38, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !832, file: !724, line: 52, baseType: !38, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !832, file: !724, line: 53, baseType: !38, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !832, file: !724, line: 56, baseType: !735, size: 32, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !832, file: !724, line: 57, baseType: !146, size: 32, offset: 416)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !832, file: !724, line: 58, baseType: !146, size: 32, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !832, file: !724, line: 59, baseType: !37, size: 32, offset: 480)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !832, file: !724, line: 60, baseType: !236, size: 32, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !832, file: !724, line: 61, baseType: !152, size: 32, offset: 544)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !723, file: !724, line: 102, baseType: !152, size: 32, offset: 2464)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !723, file: !724, line: 103, baseType: !152, size: 32, offset: 2496)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !723, file: !724, line: 104, baseType: !152, size: 32, offset: 2528)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !723, file: !724, line: 105, baseType: !152, size: 32, offset: 2560)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !723, file: !724, line: 107, baseType: !391, size: 384, offset: 2592)
