; ModuleID = 'src/http/modules/ngx_http_range_filter_module.c'
source_filename = "src/http/modules/ngx_http_range_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_range_header_filter_module_ctx", scope: !2, file: !3, line: 80, type: !1780, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !21)
!3 = !DIFile(filename: "src/http/modules/ngx_http_range_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !11, !14, !17, !19, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !16)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !15, line: 222, baseType: !18)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 120, baseType: !20)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !533, !0, !535, !1778, !1803}
!22 = !DIGlobalVariableExpression(var: !23)
!23 = distinct !DIGlobalVariable(name: "ngx_http_range_header_filter_module", scope: !2, file: !3, line: 95, type: !24, isLocal: false, isDefinition: true)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !25, line: 15, baseType: !26)
!25 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !27, line: 222, size: 800, elements: !28)
!27 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !{!29, !33, !34, !36, !37, !38, !39, !40, !41, !506, !507, !513, !517, !518, !519, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !26, file: !27, line: 223, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !31, line: 79, baseType: !32)
!31 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !15, line: 125, baseType: !20)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !26, file: !27, line: 224, baseType: !30, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !27, line: 226, baseType: !35, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !26, file: !27, line: 228, baseType: !30, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !26, file: !27, line: 229, baseType: !30, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !26, file: !27, line: 231, baseType: !30, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !26, file: !27, line: 232, baseType: !11, size: 32, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !26, file: !27, line: 234, baseType: !6, size: 32, offset: 224)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !26, file: !27, line: 235, baseType: !42, size: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !25, line: 22, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !45, line: 77, size: 224, elements: !46)
!45 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !{!47, !54, !55, !503, !504, !505}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 78, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !49, line: 19, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 16, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !49, line: 17, baseType: !19, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !49, line: 18, baseType: !7, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !45, line: 79, baseType: !30, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !44, file: !45, line: 80, baseType: !56, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DISubroutineType(types: !58)
!58 = !{!35, !59, !42, !6}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !25, line: 16, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !45, line: 116, size: 384, elements: !62)
!62 = !{!63, !64, !238, !485, !486, !487, !496, !497, !498, !499, !500, !502}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !45, line: 117, baseType: !35, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !61, file: !45, line: 118, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !67, line: 22, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 16, size: 160, elements: !69)
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !68, file: !67, line: 17, baseType: !6, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !68, file: !67, line: 18, baseType: !30, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !67, line: 19, baseType: !19, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !68, file: !67, line: 20, baseType: !30, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !68, file: !67, line: 21, baseType: !75, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !25, line: 18, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !78, line: 57, size: 320, elements: !79)
!78 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = !{!80, !88, !89, !90, !218, !225, !237}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !77, file: !78, line: 58, baseType: !81, size: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !78, line: 54, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 49, size: 128, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !82, file: !78, line: 50, baseType: !7, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !82, file: !78, line: 51, baseType: !7, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !78, line: 52, baseType: !75, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !82, file: !78, line: 53, baseType: !30, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !77, file: !78, line: 59, baseType: !19, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !77, file: !78, line: 60, baseType: !75, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !77, file: !78, line: 61, baseType: !91, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !25, line: 19, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !94, line: 59, size: 64, elements: !95)
!94 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !{!96, !217}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !93, file: !94, line: 60, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !94, line: 18, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !94, line: 20, size: 352, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !109, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !99, file: !94, line: 21, baseType: !7, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !94, line: 22, baseType: !7, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !99, file: !94, line: 23, baseType: !17, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !99, file: !94, line: 24, baseType: !17, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !99, file: !94, line: 26, baseType: !7, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !99, file: !94, line: 27, baseType: !7, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !94, line: 28, baseType: !108, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !94, line: 16, baseType: !6)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !99, file: !94, line: 29, baseType: !110, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !25, line: 23, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !113, line: 16, size: 1216, elements: !114)
!113 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!114 = !{!115, !118, !119, !162, !163, !164, !202, !203}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !112, file: !113, line: 17, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !117, line: 16, baseType: !18)
!117 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !113, line: 18, baseType: !48, size: 64, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !112, file: !113, line: 19, baseType: !120, size: 960, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !117, line: 17, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !122, line: 4, size: 960, elements: !123)
!122 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !{!124, !126, !127, !129, !130, !132, !133, !135, !137, !139, !140, !141, !142, !143, !144, !146, !147, !149, !150, !155, !156, !157}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !121, file: !122, line: 6, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !15, line: 232, baseType: !20)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !121, file: !122, line: 7, baseType: !125, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !121, file: !122, line: 8, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !15, line: 227, baseType: !20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !121, file: !122, line: 9, baseType: !128, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !121, file: !122, line: 10, baseType: !131, size: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !15, line: 217, baseType: !20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !121, file: !122, line: 11, baseType: !131, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !121, file: !122, line: 13, baseType: !134, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !15, line: 212, baseType: !20)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !121, file: !122, line: 14, baseType: !136, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 304, baseType: !20)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !121, file: !122, line: 15, baseType: !138, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 309, baseType: !20)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !121, file: !122, line: 16, baseType: !20, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !121, file: !122, line: 17, baseType: !125, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !121, file: !122, line: 18, baseType: !125, size: 32, offset: 352)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !121, file: !122, line: 19, baseType: !17, size: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !121, file: !122, line: 20, baseType: !17, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !121, file: !122, line: 21, baseType: !145, size: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !15, line: 237, baseType: !16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !121, file: !122, line: 22, baseType: !145, size: 32, offset: 480)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !121, file: !122, line: 23, baseType: !148, size: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !15, line: 242, baseType: !18)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !121, file: !122, line: 24, baseType: !148, size: 32, offset: 544)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !121, file: !122, line: 26, baseType: !151, size: 64, offset: 576)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !15, line: 288, size: 64, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !151, file: !15, line: 288, baseType: !14, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !151, file: !15, line: 288, baseType: !16, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !121, file: !122, line: 27, baseType: !151, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !121, file: !122, line: 28, baseType: !151, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !121, file: !122, line: 29, baseType: !158, size: 192, offset: 768)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 192, elements: !160)
!159 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !112, file: !113, line: 21, baseType: !17, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !112, file: !113, line: 22, baseType: !17, size: 32, offset: 1120)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !112, file: !113, line: 24, baseType: !165, size: 32, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !25, line: 20, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !168, line: 50, size: 320, elements: !169)
!168 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!169 = !{!170, !171, !183, !187, !188, !193, !194, !199, !200, !201}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !167, file: !168, line: 51, baseType: !30, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !167, file: !168, line: 52, baseType: !172, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !25, line: 21, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !45, line: 89, size: 160, elements: !175)
!175 = !{!176, !177, !178, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !174, file: !45, line: 90, baseType: !116, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !45, line: 91, baseType: !48, size: 64, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !174, file: !45, line: 93, baseType: !179, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !172, !165}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !45, line: 94, baseType: !6, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !167, file: !168, line: 54, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !185, line: 98, baseType: !186)
!185 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !167, file: !168, line: 56, baseType: !14, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !167, file: !168, line: 58, baseType: !189, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !168, line: 45, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!7, !165, !7, !19}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !168, line: 59, baseType: !6, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !167, file: !168, line: 61, baseType: !195, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !168, line: 46, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !165, !30, !7, !19}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !167, file: !168, line: 62, baseType: !6, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !167, file: !168, line: 70, baseType: !35, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 72, baseType: !165, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !112, file: !113, line: 37, baseType: !20, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !112, file: !113, line: 38, baseType: !20, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !99, file: !94, line: 30, baseType: !97, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !99, file: !94, line: 34, baseType: !20, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !99, file: !94, line: 40, baseType: !20, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !99, file: !94, line: 43, baseType: !20, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !99, file: !94, line: 45, baseType: !20, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !99, file: !94, line: 46, baseType: !20, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !99, file: !94, line: 47, baseType: !20, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !99, file: !94, line: 48, baseType: !20, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !99, file: !94, line: 49, baseType: !20, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !99, file: !94, line: 50, baseType: !20, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !99, file: !94, line: 52, baseType: !20, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !99, file: !94, line: 53, baseType: !20, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !99, file: !94, line: 55, baseType: !18, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !94, line: 61, baseType: !91, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !77, file: !78, line: 62, baseType: !219, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !78, line: 41, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !78, line: 43, size: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !78, line: 44, baseType: !219, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !221, file: !78, line: 45, baseType: !6, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !77, file: !78, line: 63, baseType: !226, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !78, line: 32, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !78, line: 34, size: 96, elements: !229)
!229 = !{!230, !235, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !228, file: !78, line: 35, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !78, line: 30, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !6}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !78, line: 36, baseType: !6, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !78, line: 37, baseType: !226, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !77, file: !78, line: 64, baseType: !165, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !61, file: !45, line: 120, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !25, line: 17, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !242, line: 38, size: 2496, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !248, !249, !250, !251, !252, !431, !432, !433, !436, !437, !438, !439, !440, !441, !442, !443, !454, !455, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !241, file: !242, line: 39, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !241, file: !242, line: 40, baseType: !75, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 42, baseType: !165, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !241, file: !242, line: 43, baseType: !166, size: 320, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !241, file: !242, line: 45, baseType: !30, size: 32, offset: 416)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !241, file: !242, line: 47, baseType: !253, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !25, line: 26, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !257, line: 121, size: 896, elements: !258)
!257 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!258 = !{!259, !260, !316, !317, !320, !327, !329, !334, !339, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !257, line: 122, baseType: !6, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !256, file: !257, line: 123, baseType: !261, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !25, line: 24, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !264, line: 30, size: 384, elements: !265)
!264 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !293, !294, !295, !308}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 31, baseType: !6, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !263, file: !264, line: 33, baseType: !20, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !263, file: !264, line: 35, baseType: !20, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !263, file: !264, line: 38, baseType: !20, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !263, file: !264, line: 44, baseType: !20, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !263, file: !264, line: 46, baseType: !20, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !263, file: !264, line: 49, baseType: !20, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !263, file: !264, line: 51, baseType: !20, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !263, file: !264, line: 54, baseType: !20, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !263, file: !264, line: 56, baseType: !20, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !263, file: !264, line: 57, baseType: !20, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !263, file: !264, line: 59, baseType: !20, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !263, file: !264, line: 60, baseType: !20, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !263, file: !264, line: 62, baseType: !20, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !263, file: !264, line: 64, baseType: !20, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !263, file: !264, line: 67, baseType: !20, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !263, file: !264, line: 69, baseType: !20, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !263, file: !264, line: 71, baseType: !20, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !263, file: !264, line: 74, baseType: !20, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !263, file: !264, line: 75, baseType: !20, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !263, file: !264, line: 77, baseType: !20, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !263, file: !264, line: 107, baseType: !20, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !263, file: !264, line: 110, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !25, line: 31, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !261}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !263, file: !264, line: 117, baseType: !30, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !263, file: !264, line: 119, baseType: !165, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !263, file: !264, line: 121, baseType: !296, size: 160, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !297, line: 20, baseType: !298)
!297 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !297, line: 22, size: 160, elements: !299)
!299 = !{!300, !302, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !298, file: !297, line: 23, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !297, line: 16, baseType: !30)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !298, file: !297, line: 24, baseType: !303, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !298, file: !297, line: 25, baseType: !303, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !298, file: !297, line: 26, baseType: !303, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !298, file: !297, line: 27, baseType: !8, size: 8, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !297, line: 28, baseType: !8, size: 8, offset: 136)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !264, line: 124, baseType: !309, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !310, line: 16, baseType: !311)
!310 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !310, line: 18, size: 64, elements: !312)
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !310, line: 19, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !310, line: 20, baseType: !314, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !256, file: !257, line: 124, baseType: !261, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !256, file: !257, line: 126, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !319, line: 17, baseType: !18)
!319 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !256, file: !257, line: 128, baseType: !321, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !322, line: 19, baseType: !323)
!322 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !254, !7, !19}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 135, baseType: !18)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !256, file: !257, line: 129, baseType: !328, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !322, line: 22, baseType: !323)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !256, file: !257, line: 130, baseType: !330, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !322, line: 20, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!326, !254, !91, !17}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !256, file: !257, line: 131, baseType: !335, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !322, line: 23, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{!91, !254, !91, !17}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !256, file: !257, line: 133, baseType: !340, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !257, line: 16, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !257, line: 18, size: 960, elements: !343)
!343 = !{!344, !345, !357, !359, !360, !361, !362, !363, !364, !365, !370, !371, !372, !373, !374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !342, file: !257, line: 19, baseType: !318, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !342, file: !257, line: 21, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !348, line: 297, size: 128, elements: !349)
!348 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!349 = !{!350, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !347, file: !348, line: 298, baseType: !351, size: 16)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !15, line: 409, baseType: !352)
!352 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !347, file: !348, line: 299, baseType: !354, size: 112, offset: 16)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 112, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 14)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !342, file: !257, line: 22, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !15, line: 404, baseType: !20)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !342, file: !257, line: 23, baseType: !19, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !342, file: !257, line: 24, baseType: !48, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !257, line: 26, baseType: !18, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !342, file: !257, line: 28, baseType: !18, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !342, file: !257, line: 29, baseType: !18, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !342, file: !257, line: 30, baseType: !18, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !342, file: !257, line: 38, baseType: !366, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !25, line: 32, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !254}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !342, file: !257, line: 40, baseType: !6, size: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !342, file: !257, line: 42, baseType: !166, size: 320, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !342, file: !257, line: 43, baseType: !165, size: 32, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !342, file: !257, line: 45, baseType: !19, size: 32, offset: 736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !342, file: !257, line: 47, baseType: !19, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !342, file: !257, line: 49, baseType: !376, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !377, line: 16, baseType: !301)
!377 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !342, file: !257, line: 51, baseType: !340, size: 32, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !342, file: !257, line: 52, baseType: !254, size: 32, offset: 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !342, file: !257, line: 54, baseType: !30, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !342, file: !257, line: 56, baseType: !20, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !342, file: !257, line: 57, baseType: !20, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !342, file: !257, line: 58, baseType: !20, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !342, file: !257, line: 60, baseType: !20, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !342, file: !257, line: 61, baseType: !20, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !342, file: !257, line: 62, baseType: !20, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !342, file: !257, line: 63, baseType: !20, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !342, file: !257, line: 64, baseType: !20, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !342, file: !257, line: 65, baseType: !20, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !342, file: !257, line: 66, baseType: !20, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !342, file: !257, line: 67, baseType: !20, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !342, file: !257, line: 70, baseType: !20, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !342, file: !257, line: 72, baseType: !20, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !342, file: !257, line: 73, baseType: !20, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !342, file: !257, line: 74, baseType: !20, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !342, file: !257, line: 76, baseType: !20, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !342, file: !257, line: 77, baseType: !20, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !342, file: !257, line: 78, baseType: !20, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !256, file: !257, line: 135, baseType: !17, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !256, file: !257, line: 137, baseType: !165, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !257, line: 139, baseType: !75, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !257, line: 141, baseType: !18, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !256, file: !257, line: 143, baseType: !346, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !256, file: !257, line: 144, baseType: !358, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !256, file: !257, line: 145, baseType: !48, size: 64, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !256, file: !257, line: 147, baseType: !48, size: 64, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !256, file: !257, line: 148, baseType: !408, size: 16, offset: 608)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !409, line: 12, baseType: !410)
!409 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 186, baseType: !352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !256, file: !257, line: 154, baseType: !346, size: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !256, file: !257, line: 155, baseType: !358, size: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !256, file: !257, line: 157, baseType: !97, size: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !256, file: !257, line: 159, baseType: !309, size: 64, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !256, file: !257, line: 161, baseType: !184, size: 32, offset: 800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !256, file: !257, line: 163, baseType: !30, size: 32, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !256, file: !257, line: 165, baseType: !20, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !256, file: !257, line: 167, baseType: !20, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !256, file: !257, line: 169, baseType: !20, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !256, file: !257, line: 170, baseType: !20, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !256, file: !257, line: 171, baseType: !20, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !256, file: !257, line: 173, baseType: !20, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !256, file: !257, line: 174, baseType: !20, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !256, file: !257, line: 175, baseType: !20, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !256, file: !257, line: 176, baseType: !20, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !256, file: !257, line: 178, baseType: !20, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !256, file: !257, line: 179, baseType: !20, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !256, file: !257, line: 180, baseType: !20, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !256, file: !257, line: 181, baseType: !20, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !256, file: !257, line: 183, baseType: !20, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !241, file: !242, line: 48, baseType: !254, size: 32, offset: 480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !241, file: !242, line: 49, baseType: !30, size: 32, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !241, file: !242, line: 51, baseType: !434, size: 32, offset: 544)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !241, file: !242, line: 52, baseType: !30, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !241, file: !242, line: 53, baseType: !30, size: 32, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !241, file: !242, line: 55, baseType: !309, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !241, file: !242, line: 56, baseType: !30, size: 32, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !241, file: !242, line: 58, baseType: !66, size: 160, offset: 736)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !241, file: !242, line: 59, baseType: !66, size: 160, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !241, file: !242, line: 61, baseType: !66, size: 160, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !241, file: !242, line: 62, baseType: !444, size: 96, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !297, line: 32, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !297, line: 37, size: 96, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !445, file: !297, line: 38, baseType: !303, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !445, file: !297, line: 39, baseType: !303, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !445, file: !297, line: 40, baseType: !450, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !297, line: 34, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !303, !303, !303}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !241, file: !242, line: 63, baseType: !296, size: 160, offset: 1312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !241, file: !242, line: 65, baseType: !456, size: 224, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 25, size: 224, elements: !459)
!459 = !{!460, !468, !469, !470, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !458, file: !457, line: 26, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !457, line: 16, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !457, line: 18, size: 96, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !463, file: !457, line: 19, baseType: !6, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !463, file: !457, line: 20, baseType: !30, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !457, line: 21, baseType: !461, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !458, file: !457, line: 27, baseType: !462, size: 96, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !457, line: 28, baseType: !19, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !458, file: !457, line: 29, baseType: !30, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !458, file: !457, line: 30, baseType: !75, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !241, file: !242, line: 66, baseType: !456, size: 224, offset: 1696)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !241, file: !242, line: 68, baseType: !30, size: 32, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !241, file: !242, line: 69, baseType: !30, size: 32, offset: 1952)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !241, file: !242, line: 71, baseType: !254, size: 32, offset: 1984)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !241, file: !242, line: 72, baseType: !261, size: 32, offset: 2016)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !241, file: !242, line: 73, baseType: !261, size: 32, offset: 2048)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !241, file: !242, line: 75, baseType: !239, size: 32, offset: 2080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !241, file: !242, line: 77, baseType: !48, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !241, file: !242, line: 78, baseType: !48, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !241, file: !242, line: 79, baseType: !48, size: 64, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !241, file: !242, line: 80, baseType: !48, size: 64, offset: 2304)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !241, file: !242, line: 81, baseType: !48, size: 64, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !241, file: !242, line: 82, baseType: !48, size: 64, offset: 2432)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !61, file: !45, line: 121, baseType: !75, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !61, file: !45, line: 122, baseType: !75, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !61, file: !45, line: 123, baseType: !488, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !45, line: 103, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 98, size: 1344, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !490, file: !45, line: 99, baseType: !111, size: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !490, file: !45, line: 100, baseType: !97, size: 32, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !490, file: !45, line: 101, baseType: !97, size: 32, offset: 1248)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !490, file: !45, line: 102, baseType: !30, size: 32, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !61, file: !45, line: 124, baseType: !165, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !61, file: !45, line: 126, baseType: !6, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !61, file: !45, line: 127, baseType: !30, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !61, file: !45, line: 128, baseType: !30, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !61, file: !45, line: 130, baseType: !501, size: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !45, line: 112, baseType: !56)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !61, file: !45, line: 131, baseType: !35, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !44, file: !45, line: 81, baseType: !30, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !44, file: !45, line: 82, baseType: !30, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !44, file: !45, line: 83, baseType: !6, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !27, line: 236, baseType: !30, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !26, file: !27, line: 238, baseType: !508, size: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !165}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !31, line: 78, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !15, line: 140, baseType: !18)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !26, file: !27, line: 240, baseType: !514, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!511, !239}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !26, file: !27, line: 242, baseType: !514, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !26, file: !27, line: 243, baseType: !514, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !26, file: !27, line: 244, baseType: !520, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !239}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !26, file: !27, line: 245, baseType: !520, size: 32, offset: 480)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !26, file: !27, line: 247, baseType: !520, size: 32, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !26, file: !27, line: 249, baseType: !32, size: 32, offset: 544)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !26, file: !27, line: 250, baseType: !32, size: 32, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !26, file: !27, line: 251, baseType: !32, size: 32, offset: 608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !26, file: !27, line: 252, baseType: !32, size: 32, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !26, file: !27, line: 253, baseType: !32, size: 32, offset: 672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !26, file: !27, line: 254, baseType: !32, size: 32, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !26, file: !27, line: 255, baseType: !32, size: 32, offset: 736)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !26, file: !27, line: 256, baseType: !32, size: 32, offset: 768)
!533 = !DIGlobalVariableExpression(var: !534)
!534 = distinct !DIGlobalVariable(name: "ngx_http_range_body_filter_module", scope: !2, file: !3, line: 126, type: !24, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536)
!536 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !2, file: !3, line: 142, type: !537, isLocal: true, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !538, line: 521, baseType: !539)
!538 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{!511, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !544, line: 16, baseType: !545)
!544 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !546, line: 364, size: 5376, elements: !547)
!546 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!547 = !{!548, !550, !551, !552, !553, !554, !555, !560, !561, !774, !1331, !1332, !1333, !1334, !1373, !1403, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1448, !1459, !1466, !1467, !1469, !1470, !1483, !1484, !1485, !1486, !1487, !1488, !1674, !1678, !1683, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !545, file: !546, line: 365, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 191, baseType: !20)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !545, file: !546, line: 367, baseType: !254, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !545, file: !546, line: 369, baseType: !247, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !545, file: !546, line: 370, baseType: !247, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !545, file: !546, line: 371, baseType: !247, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !545, file: !546, line: 372, baseType: !247, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !545, file: !546, line: 374, baseType: !556, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !546, line: 361, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !542}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !545, file: !546, line: 375, baseType: !556, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !545, file: !546, line: 378, baseType: !562, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !544, line: 18, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !565, line: 65, size: 3008, elements: !566)
!565 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!566 = !{!567, !568, !569, !570, !574, !575, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !732, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !564, file: !565, line: 66, baseType: !111, size: 1216)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !564, file: !565, line: 67, baseType: !66, size: 160, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !564, file: !565, line: 68, baseType: !549, size: 32, offset: 1376)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !564, file: !565, line: 69, baseType: !571, size: 128, offset: 1408)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !564, file: !565, line: 70, baseType: !571, size: 128, offset: 1536)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !564, file: !565, line: 72, baseType: !576, size: 32, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !117, line: 18, baseType: !128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !564, file: !565, line: 73, baseType: !14, size: 32, offset: 1696)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !564, file: !565, line: 74, baseType: !14, size: 32, offset: 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !564, file: !565, line: 75, baseType: !14, size: 32, offset: 1760)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !564, file: !565, line: 76, baseType: !14, size: 32, offset: 1792)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !564, file: !565, line: 77, baseType: !14, size: 32, offset: 1824)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !564, file: !565, line: 79, baseType: !48, size: 64, offset: 1856)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !564, file: !565, line: 80, baseType: !48, size: 64, offset: 1920)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !564, file: !565, line: 81, baseType: !571, size: 128, offset: 1984)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !564, file: !565, line: 83, baseType: !19, size: 32, offset: 2112)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !564, file: !565, line: 84, baseType: !19, size: 32, offset: 2144)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !564, file: !565, line: 85, baseType: !17, size: 32, offset: 2176)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !564, file: !565, line: 86, baseType: !17, size: 32, offset: 2208)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !564, file: !565, line: 88, baseType: !30, size: 32, offset: 2240)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !564, file: !565, line: 89, baseType: !30, size: 32, offset: 2272)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !564, file: !565, line: 90, baseType: !30, size: 32, offset: 2304)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !564, file: !565, line: 91, baseType: !30, size: 32, offset: 2336)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !564, file: !565, line: 93, baseType: !97, size: 32, offset: 2368)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !564, file: !565, line: 95, baseType: !595, size: 32, offset: 2400)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !544, line: 19, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !565, line: 157, size: 544, elements: !598)
!598 = !{!599, !614, !675, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !731}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !597, file: !565, line: 158, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !565, line: 154, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 145, size: 480, elements: !603)
!603 = !{!604, !605, !606, !607, !610, !611, !612, !613}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !602, file: !565, line: 146, baseType: !444, size: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !602, file: !565, line: 147, baseType: !296, size: 160, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !602, file: !565, line: 148, baseType: !309, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !602, file: !565, line: 149, baseType: !608, size: 32, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !185, line: 106, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !602, file: !565, line: 150, baseType: !608, size: 32, offset: 352)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !565, line: 151, baseType: !17, size: 32, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !602, file: !565, line: 152, baseType: !30, size: 32, offset: 416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !602, file: !565, line: 153, baseType: !30, size: 32, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !597, file: !565, line: 159, baseType: !615, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !617, line: 59, baseType: !618)
!617 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 34, size: 800, elements: !619)
!619 = !{!620, !627, !628, !629, !637, !638, !639, !648, !649, !650, !651, !670, !671, !672, !673, !674}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !618, file: !617, line: 35, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !622, line: 21, baseType: !623)
!622 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 16, size: 64, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !623, file: !622, line: 17, baseType: !608, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !623, file: !622, line: 19, baseType: !608, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !618, file: !617, line: 37, baseType: !19, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !618, file: !617, line: 38, baseType: !19, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !618, file: !617, line: 40, baseType: !630, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !617, line: 16, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !617, line: 18, size: 96, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !632, file: !617, line: 19, baseType: !32, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !632, file: !617, line: 20, baseType: !630, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !632, file: !617, line: 21, baseType: !32, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !618, file: !617, line: 41, baseType: !630, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !618, file: !617, line: 42, baseType: !631, size: 96, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !618, file: !617, line: 44, baseType: !640, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !617, line: 31, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 25, size: 128, elements: !643)
!643 = !{!644, !645, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !642, file: !617, line: 26, baseType: !30, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !642, file: !617, line: 27, baseType: !30, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !642, file: !617, line: 29, baseType: !30, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !642, file: !617, line: 30, baseType: !30, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !618, file: !617, line: 45, baseType: !30, size: 32, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !618, file: !617, line: 47, baseType: !7, size: 32, offset: 352)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !618, file: !617, line: 48, baseType: !7, size: 32, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !618, file: !617, line: 50, baseType: !652, size: 256, offset: 416)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !622, line: 37, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !622, line: 24, size: 256, elements: !654)
!654 = !{!655, !657, !658, !659, !669}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !653, file: !622, line: 26, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !653, file: !622, line: 28, baseType: !656, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !653, file: !622, line: 29, baseType: !30, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !653, file: !622, line: 30, baseType: !660, size: 128, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !661, line: 19, baseType: !662)
!661 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 17, size: 128, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !662, file: !661, line: 18, baseType: !665, size: 128)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 128, elements: !667)
!666 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!667 = !{!668}
!668 = !DISubrange(count: 4)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !653, file: !622, line: 36, baseType: !30, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !618, file: !617, line: 52, baseType: !7, size: 32, offset: 672)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !618, file: !617, line: 53, baseType: !8, size: 8, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !618, file: !617, line: 55, baseType: !20, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !618, file: !617, line: 57, baseType: !6, size: 32, offset: 736)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !618, file: !617, line: 58, baseType: !6, size: 32, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !597, file: !565, line: 161, baseType: !676, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !113, line: 62, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 50, size: 384, elements: !679)
!679 = !{!680, !681, !682, !684, !689, !691, !693, !694, !695}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !113, line: 51, baseType: !48, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !678, file: !113, line: 52, baseType: !19, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !678, file: !113, line: 53, baseType: !683, size: 96, offset: 96)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !678, file: !113, line: 55, baseType: !685, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !113, line: 45, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DISubroutineType(types: !688)
!688 = !{!376, !6}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !678, file: !113, line: 56, baseType: !690, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !113, line: 46, baseType: !686)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !678, file: !113, line: 57, baseType: !692, size: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !113, line: 47, baseType: !232)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !678, file: !113, line: 58, baseType: !6, size: 32, offset: 288)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !678, file: !113, line: 60, baseType: !7, size: 32, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !678, file: !113, line: 61, baseType: !30, size: 32, offset: 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !597, file: !565, line: 163, baseType: !17, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !597, file: !565, line: 164, baseType: !19, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !597, file: !565, line: 166, baseType: !14, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !597, file: !565, line: 168, baseType: !14, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !597, file: !565, line: 170, baseType: !30, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !597, file: !565, line: 171, baseType: !30, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !597, file: !565, line: 172, baseType: !376, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !597, file: !565, line: 173, baseType: !376, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !597, file: !565, line: 174, baseType: !376, size: 32, offset: 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !597, file: !565, line: 176, baseType: !30, size: 32, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !597, file: !565, line: 177, baseType: !376, size: 32, offset: 416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !597, file: !565, line: 178, baseType: !376, size: 32, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !597, file: !565, line: 180, baseType: !709, size: 32, offset: 480)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !242, line: 25, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !242, line: 29, size: 320, elements: !712)
!712 = !{!713, !714, !724, !729, !730}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !711, file: !242, line: 30, baseType: !6, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !711, file: !242, line: 31, baseType: !715, size: 192, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !716, line: 22, baseType: !717)
!716 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 16, size: 192, elements: !718)
!718 = !{!719, !720, !721, !722, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !717, file: !716, line: 17, baseType: !7, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !717, file: !716, line: 18, baseType: !19, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !716, line: 19, baseType: !48, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !717, file: !716, line: 20, baseType: !165, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !717, file: !716, line: 21, baseType: !30, size: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !711, file: !242, line: 32, baseType: !725, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !242, line: 27, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{!511, !709, !6}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !711, file: !242, line: 33, baseType: !6, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !711, file: !242, line: 34, baseType: !30, size: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !597, file: !565, line: 182, baseType: !30, size: 32, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !564, file: !565, line: 96, baseType: !733, size: 32, offset: 2432)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !565, line: 62, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 39, size: 576, elements: !736)
!736 = !{!737, !738, !739, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !735, file: !565, line: 40, baseType: !296, size: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !735, file: !565, line: 41, baseType: !309, size: 64, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !735, file: !565, line: 43, baseType: !740, size: 96, offset: 224)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 12)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !735, file: !565, line: 46, baseType: !20, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !735, file: !565, line: 47, baseType: !20, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !735, file: !565, line: 48, baseType: !20, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !735, file: !565, line: 49, baseType: !20, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !735, file: !565, line: 50, baseType: !20, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !735, file: !565, line: 51, baseType: !20, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !735, file: !565, line: 52, baseType: !20, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !735, file: !565, line: 53, baseType: !20, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !735, file: !565, line: 56, baseType: !576, size: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !735, file: !565, line: 57, baseType: !14, size: 32, offset: 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !735, file: !565, line: 58, baseType: !14, size: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !735, file: !565, line: 59, baseType: !19, size: 32, offset: 480)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !735, file: !565, line: 60, baseType: !17, size: 32, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !735, file: !565, line: 61, baseType: !376, size: 32, offset: 544)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !564, file: !565, line: 102, baseType: !376, size: 32, offset: 2464)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !564, file: !565, line: 103, baseType: !376, size: 32, offset: 2496)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !564, file: !565, line: 104, baseType: !376, size: 32, offset: 2528)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !564, file: !565, line: 105, baseType: !376, size: 32, offset: 2560)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !564, file: !565, line: 107, baseType: !262, size: 384, offset: 2592)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !564, file: !565, line: 109, baseType: !20, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !564, file: !565, line: 110, baseType: !20, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !564, file: !565, line: 112, baseType: !20, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !564, file: !565, line: 113, baseType: !20, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !564, file: !565, line: 114, baseType: !20, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !564, file: !565, line: 115, baseType: !20, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !564, file: !565, line: 116, baseType: !20, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !564, file: !565, line: 117, baseType: !20, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !564, file: !565, line: 118, baseType: !20, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !564, file: !565, line: 119, baseType: !20, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !564, file: !565, line: 121, baseType: !20, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !564, file: !565, line: 122, baseType: !20, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !545, file: !546, line: 381, baseType: !775, size: 32, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !544, line: 17, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !778, line: 313, size: 4096, elements: !779)
!778 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!779 = !{!780, !785, !786, !827, !906, !907, !929, !938, !1061, !1062, !1063, !1101, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1297, !1301, !1302, !1314, !1315, !1316, !1317, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !777, file: !778, line: 314, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !778, line: 309, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !542, !775}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !777, file: !778, line: 315, baseType: !781, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !777, file: !778, line: 317, baseType: !787, size: 480, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !788, line: 22, baseType: !789)
!788 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !788, line: 36, size: 480, elements: !790)
!790 = !{!791, !792, !793, !794, !796, !797, !798, !804, !809, !811, !812, !821, !822, !823, !824, !825, !826}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !789, file: !788, line: 37, baseType: !254, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !789, file: !788, line: 39, baseType: !346, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !789, file: !788, line: 40, baseType: !358, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !789, file: !788, line: 41, baseType: !795, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !789, file: !788, line: 43, baseType: !30, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !789, file: !788, line: 44, baseType: !376, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !789, file: !788, line: 46, baseType: !799, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !788, line: 24, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!511, !803, !6}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !789, file: !788, line: 47, baseType: !805, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !788, line: 26, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !803, !6, !30}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !789, file: !788, line: 48, baseType: !810, size: 32, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !788, line: 28, baseType: !806)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !789, file: !788, line: 49, baseType: !6, size: 32, offset: 288)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !789, file: !788, line: 56, baseType: !813, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !815, line: 78, baseType: !816)
!815 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 74, size: 128, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !816, file: !815, line: 75, baseType: !346, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !816, file: !815, line: 76, baseType: !358, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !815, line: 77, baseType: !48, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !789, file: !788, line: 58, baseType: !18, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !789, file: !788, line: 59, baseType: !18, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !789, file: !788, line: 61, baseType: !165, size: 32, offset: 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !789, file: !788, line: 63, baseType: !20, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !789, file: !788, line: 64, baseType: !20, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !789, file: !788, line: 67, baseType: !20, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !777, file: !778, line: 319, baseType: !828, size: 32, offset: 544)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !830, line: 17, baseType: !831)
!830 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !830, line: 25, size: 1120, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !839, !840, !841, !842, !843, !848, !849, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !905}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !831, file: !830, line: 26, baseType: !254, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !831, file: !830, line: 27, baseType: !254, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !831, file: !830, line: 29, baseType: !91, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !831, file: !830, line: 30, baseType: !91, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !831, file: !830, line: 31, baseType: !838, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !831, file: !830, line: 33, baseType: !91, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !831, file: !830, line: 35, baseType: !91, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !831, file: !830, line: 36, baseType: !91, size: 32, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !831, file: !830, line: 37, baseType: !91, size: 32, offset: 256)
