; ModuleID = 'src/http/modules/ngx_http_ssi_filter_module.c'
source_filename = "src/http/modules/ngx_http_ssi_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_ssi_filter_module_ctx", scope: !2, file: !3, line: 178, type: !1925, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !61)
!3 = !DIFile(filename: "src/http/modules/ngx_http_ssi_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 49, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!7 = !DIEnumerator(name: "ssi_start_state", value: 0)
!8 = !DIEnumerator(name: "ssi_tag_state", value: 1)
!9 = !DIEnumerator(name: "ssi_comment0_state", value: 2)
!10 = !DIEnumerator(name: "ssi_comment1_state", value: 3)
!11 = !DIEnumerator(name: "ssi_sharp_state", value: 4)
!12 = !DIEnumerator(name: "ssi_precommand_state", value: 5)
!13 = !DIEnumerator(name: "ssi_command_state", value: 6)
!14 = !DIEnumerator(name: "ssi_preparam_state", value: 7)
!15 = !DIEnumerator(name: "ssi_param_state", value: 8)
!16 = !DIEnumerator(name: "ssi_preequal_state", value: 9)
!17 = !DIEnumerator(name: "ssi_prevalue_state", value: 10)
!18 = !DIEnumerator(name: "ssi_double_quoted_value_state", value: 11)
!19 = !DIEnumerator(name: "ssi_quoted_value_state", value: 12)
!20 = !DIEnumerator(name: "ssi_quoted_symbol_state", value: 13)
!21 = !DIEnumerator(name: "ssi_postparam_state", value: 14)
!22 = !DIEnumerator(name: "ssi_comment_end0_state", value: 15)
!23 = !DIEnumerator(name: "ssi_comment_end1_state", value: 16)
!24 = !DIEnumerator(name: "ssi_error_state", value: 17)
!25 = !DIEnumerator(name: "ssi_error_end0_state", value: 18)
!26 = !DIEnumerator(name: "ssi_error_end1_state", value: 19)
!27 = !{!28, !29, !38, !40, !44, !54, !50, !56, !59}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !31, line: 21, baseType: !32)
!31 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 17, size: 96, elements: !33)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !32, file: !31, line: 18, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !32, file: !31, line: 19, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !32, file: !31, line: 20, baseType: !35, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !42, line: 64, baseType: !43)
!42 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !46, line: 19, baseType: !47)
!46 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 16, size: 64, elements: !48)
!48 = !{!49, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, file: !46, line: 17, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 120, baseType: !52)
!51 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !46, line: 18, baseType: !40, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !57, line: 79, baseType: !58)
!57 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !51, line: 125, baseType: !52)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !51, line: 222, baseType: !60)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{!62, !0, !564, !1815, !1817, !1881, !1883, !1888, !1890, !1893, !1896, !1898, !1903, !1906, !1908, !1911, !1917, !1922}
!62 = !DIGlobalVariableExpression(var: !63)
!63 = distinct !DIGlobalVariable(name: "ngx_http_ssi_filter_module", scope: !2, file: !3, line: 193, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !65, line: 15, baseType: !66)
!65 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !67, line: 222, size: 800, elements: !68)
!67 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !537, !538, !544, !548, !549, !550, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !66, file: !67, line: 223, baseType: !56, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !66, file: !67, line: 224, baseType: !56, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !67, line: 226, baseType: !38, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !66, file: !67, line: 228, baseType: !56, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !66, file: !67, line: 229, baseType: !56, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !66, file: !67, line: 231, baseType: !56, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !66, file: !67, line: 232, baseType: !54, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !66, file: !67, line: 234, baseType: !28, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !66, file: !67, line: 235, baseType: !78, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !65, line: 22, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !81, line: 77, size: 224, elements: !82)
!81 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !{!83, !84, !85, !534, !535, !536}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !81, line: 78, baseType: !45, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 79, baseType: !56, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !80, file: !81, line: 80, baseType: !86, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DISubroutineType(types: !88)
!88 = !{!38, !89, !78, !28}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !65, line: 16, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !81, line: 116, size: 384, elements: !92)
!92 = !{!93, !94, !270, !516, !517, !518, !527, !528, !529, !530, !531, !533}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !81, line: 117, baseType: !38, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !91, file: !81, line: 118, baseType: !95, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !97, line: 22, baseType: !98)
!97 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 16, size: 160, elements: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !98, file: !97, line: 17, baseType: !28, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !98, file: !97, line: 18, baseType: !56, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !97, line: 19, baseType: !50, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !98, file: !97, line: 20, baseType: !56, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !98, file: !97, line: 21, baseType: !105, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !65, line: 18, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !108, line: 57, size: 320, elements: !109)
!108 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!109 = !{!110, !118, !119, !120, !250, !257, !269}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !107, file: !108, line: 58, baseType: !111, size: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !108, line: 54, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 49, size: 128, elements: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !112, file: !108, line: 50, baseType: !40, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !112, file: !108, line: 51, baseType: !40, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !108, line: 52, baseType: !105, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !112, file: !108, line: 53, baseType: !56, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !107, file: !108, line: 59, baseType: !50, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !107, file: !108, line: 60, baseType: !105, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !107, file: !108, line: 61, baseType: !121, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !65, line: 19, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !124, line: 59, size: 64, elements: !125)
!124 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!125 = !{!126, !249}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !123, file: !124, line: 60, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !124, line: 18, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !124, line: 20, size: 352, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !139, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !129, file: !124, line: 21, baseType: !40, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !129, file: !124, line: 22, baseType: !40, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !129, file: !124, line: 23, baseType: !59, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !129, file: !124, line: 24, baseType: !59, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !129, file: !124, line: 26, baseType: !40, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !129, file: !124, line: 27, baseType: !40, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !129, file: !124, line: 28, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !124, line: 16, baseType: !28)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !129, file: !124, line: 29, baseType: !140, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !65, line: 23, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !143, line: 16, size: 1216, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !148, !149, !194, !195, !196, !234, !235}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !142, file: !143, line: 17, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !147, line: 16, baseType: !60)
!147 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 18, baseType: !45, size: 64, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !142, file: !143, line: 19, baseType: !150, size: 960, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !147, line: 17, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !152, line: 4, size: 960, elements: !153)
!152 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!153 = !{!154, !156, !157, !159, !160, !162, !163, !165, !167, !169, !170, !171, !172, !173, !174, !177, !178, !180, !181, !187, !188, !189}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !151, file: !152, line: 6, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 232, baseType: !52)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !151, file: !152, line: 7, baseType: !155, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !151, file: !152, line: 8, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !51, line: 227, baseType: !52)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !151, file: !152, line: 9, baseType: !158, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !151, file: !152, line: 10, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !51, line: 217, baseType: !52)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !151, file: !152, line: 11, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !151, file: !152, line: 13, baseType: !164, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !51, line: 212, baseType: !52)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !151, file: !152, line: 14, baseType: !166, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !51, line: 304, baseType: !52)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !151, file: !152, line: 15, baseType: !168, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !51, line: 309, baseType: !52)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !151, file: !152, line: 16, baseType: !52, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !151, file: !152, line: 17, baseType: !155, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !151, file: !152, line: 18, baseType: !155, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !151, file: !152, line: 19, baseType: !59, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !151, file: !152, line: 20, baseType: !59, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !151, file: !152, line: 21, baseType: !175, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !51, line: 237, baseType: !176)
!176 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !151, file: !152, line: 22, baseType: !175, size: 32, offset: 480)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !151, file: !152, line: 23, baseType: !179, size: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !51, line: 242, baseType: !60)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !151, file: !152, line: 24, baseType: !179, size: 32, offset: 544)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !151, file: !152, line: 26, baseType: !182, size: 64, offset: 576)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !51, line: 288, size: 64, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !182, file: !51, line: 288, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !51, line: 75, baseType: !176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !182, file: !51, line: 288, baseType: !176, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !151, file: !152, line: 27, baseType: !182, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !151, file: !152, line: 28, baseType: !182, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !151, file: !152, line: 29, baseType: !190, size: 192, offset: 768)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 192, elements: !192)
!191 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !142, file: !143, line: 21, baseType: !59, size: 32, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !142, file: !143, line: 22, baseType: !59, size: 32, offset: 1120)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !142, file: !143, line: 24, baseType: !197, size: 32, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !65, line: 20, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !200, line: 50, size: 320, elements: !201)
!200 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = !{!202, !203, !215, !219, !220, !225, !226, !231, !232, !233}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !199, file: !200, line: 51, baseType: !56, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !199, file: !200, line: 52, baseType: !204, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !65, line: 21, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !81, line: 89, size: 160, elements: !207)
!207 = !{!208, !209, !210, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !206, file: !81, line: 90, baseType: !146, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !81, line: 91, baseType: !45, size: 64, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !206, file: !81, line: 93, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !204, !197}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !81, line: 94, baseType: !28, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !199, file: !200, line: 54, baseType: !216, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !217, line: 98, baseType: !218)
!217 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!218 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !199, file: !200, line: 56, baseType: !185, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !199, file: !200, line: 58, baseType: !221, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !200, line: 45, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{!40, !197, !40, !50}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !200, line: 59, baseType: !28, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !199, file: !200, line: 61, baseType: !227, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !200, line: 46, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !197, !56, !40, !50}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !199, file: !200, line: 62, baseType: !28, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !199, file: !200, line: 70, baseType: !38, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !200, line: 72, baseType: !197, size: 32, offset: 288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !142, file: !143, line: 37, baseType: !52, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !142, file: !143, line: 38, baseType: !52, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !129, file: !124, line: 30, baseType: !127, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !129, file: !124, line: 34, baseType: !52, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !129, file: !124, line: 40, baseType: !52, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !129, file: !124, line: 43, baseType: !52, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !129, file: !124, line: 45, baseType: !52, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !129, file: !124, line: 46, baseType: !52, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !129, file: !124, line: 47, baseType: !52, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !129, file: !124, line: 48, baseType: !52, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !129, file: !124, line: 49, baseType: !52, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !129, file: !124, line: 50, baseType: !52, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !129, file: !124, line: 52, baseType: !52, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !129, file: !124, line: 53, baseType: !52, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !129, file: !124, line: 55, baseType: !60, size: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !124, line: 61, baseType: !121, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !107, file: !108, line: 62, baseType: !251, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !108, line: 41, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !108, line: 43, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !108, line: 44, baseType: !251, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !253, file: !108, line: 45, baseType: !28, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !107, file: !108, line: 63, baseType: !258, size: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !108, line: 32, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !108, line: 34, size: 96, elements: !261)
!261 = !{!262, !267, !268}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !260, file: !108, line: 35, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !108, line: 30, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !28}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !108, line: 36, baseType: !28, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !108, line: 37, baseType: !258, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !107, file: !108, line: 64, baseType: !197, size: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !91, file: !81, line: 120, baseType: !271, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !65, line: 17, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !274, line: 38, size: 2496, elements: !275)
!274 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!275 = !{!276, !279, !280, !281, !282, !283, !462, !463, !464, !467, !468, !469, !470, !471, !472, !473, !474, !485, !486, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !273, file: !274, line: 39, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !273, file: !274, line: 40, baseType: !105, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !273, file: !274, line: 42, baseType: !197, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !273, file: !274, line: 43, baseType: !198, size: 320, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !273, file: !274, line: 45, baseType: !56, size: 32, offset: 416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !273, file: !274, line: 47, baseType: !284, size: 32, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !65, line: 26, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !288, line: 121, size: 896, elements: !289)
!288 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!289 = !{!290, !291, !347, !348, !351, !358, !360, !365, !370, !430, !431, !432, !433, !434, !435, !436, !437, !438, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !288, line: 122, baseType: !28, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !287, file: !288, line: 123, baseType: !292, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !65, line: 24, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !295, line: 30, size: 384, elements: !296)
!295 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !324, !325, !326, !339}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !294, file: !295, line: 31, baseType: !28, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !294, file: !295, line: 33, baseType: !52, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !294, file: !295, line: 35, baseType: !52, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !294, file: !295, line: 38, baseType: !52, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !294, file: !295, line: 44, baseType: !52, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !294, file: !295, line: 46, baseType: !52, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !294, file: !295, line: 49, baseType: !52, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !294, file: !295, line: 51, baseType: !52, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !294, file: !295, line: 54, baseType: !52, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !294, file: !295, line: 56, baseType: !52, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !294, file: !295, line: 57, baseType: !52, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !294, file: !295, line: 59, baseType: !52, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !294, file: !295, line: 60, baseType: !52, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !294, file: !295, line: 62, baseType: !52, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !294, file: !295, line: 64, baseType: !52, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !294, file: !295, line: 67, baseType: !52, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !294, file: !295, line: 69, baseType: !52, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !294, file: !295, line: 71, baseType: !52, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !294, file: !295, line: 74, baseType: !52, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !294, file: !295, line: 75, baseType: !52, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !294, file: !295, line: 77, baseType: !52, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !294, file: !295, line: 107, baseType: !52, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !294, file: !295, line: 110, baseType: !320, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !65, line: 31, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !292}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !294, file: !295, line: 117, baseType: !56, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !294, file: !295, line: 119, baseType: !197, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !294, file: !295, line: 121, baseType: !327, size: 160, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !328, line: 20, baseType: !329)
!328 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !328, line: 22, size: 160, elements: !330)
!330 = !{!331, !333, !335, !336, !337, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !329, file: !328, line: 23, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !328, line: 16, baseType: !56)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !329, file: !328, line: 24, baseType: !334, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !329, file: !328, line: 25, baseType: !334, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !328, line: 26, baseType: !334, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !329, file: !328, line: 27, baseType: !41, size: 8, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !329, file: !328, line: 28, baseType: !41, size: 8, offset: 136)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !294, file: !295, line: 124, baseType: !340, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !341, line: 16, baseType: !342)
!341 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !341, line: 18, size: 64, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !341, line: 19, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !341, line: 20, baseType: !345, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !287, file: !288, line: 124, baseType: !292, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !287, file: !288, line: 126, baseType: !349, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !350, line: 17, baseType: !60)
!350 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !287, file: !288, line: 128, baseType: !352, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !353, line: 19, baseType: !354)
!353 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !285, !40, !50}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !51, line: 135, baseType: !60)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !287, file: !288, line: 129, baseType: !359, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !353, line: 22, baseType: !354)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !287, file: !288, line: 130, baseType: !361, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !353, line: 20, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{!357, !285, !121, !59}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !287, file: !288, line: 131, baseType: !366, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !353, line: 23, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{!121, !285, !121, !59}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !287, file: !288, line: 133, baseType: !371, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !288, line: 16, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !288, line: 18, size: 960, elements: !374)
!374 = !{!375, !376, !388, !390, !391, !392, !393, !394, !395, !396, !401, !402, !403, !404, !405, !406, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !373, file: !288, line: 19, baseType: !349, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !373, file: !288, line: 21, baseType: !377, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !379, line: 297, size: 128, elements: !380)
!379 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!380 = !{!381, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !378, file: !379, line: 298, baseType: !382, size: 16)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !51, line: 409, baseType: !383)
!383 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !378, file: !379, line: 299, baseType: !385, size: 112, offset: 16)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 112, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 14)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !373, file: !288, line: 22, baseType: !389, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !51, line: 404, baseType: !52)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !373, file: !288, line: 23, baseType: !50, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !373, file: !288, line: 24, baseType: !45, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !373, file: !288, line: 26, baseType: !60, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !373, file: !288, line: 28, baseType: !60, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !373, file: !288, line: 29, baseType: !60, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !373, file: !288, line: 30, baseType: !60, size: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !373, file: !288, line: 38, baseType: !397, size: 32, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !65, line: 32, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !285}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !373, file: !288, line: 40, baseType: !28, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !373, file: !288, line: 42, baseType: !198, size: 320, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !373, file: !288, line: 43, baseType: !197, size: 32, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !373, file: !288, line: 45, baseType: !50, size: 32, offset: 736)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !373, file: !288, line: 47, baseType: !50, size: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !373, file: !288, line: 49, baseType: !407, size: 32, offset: 800)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !408, line: 16, baseType: !332)
!408 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !373, file: !288, line: 51, baseType: !371, size: 32, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !373, file: !288, line: 52, baseType: !285, size: 32, offset: 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !373, file: !288, line: 54, baseType: !56, size: 32, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !373, file: !288, line: 56, baseType: !52, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !373, file: !288, line: 57, baseType: !52, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !373, file: !288, line: 58, baseType: !52, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !373, file: !288, line: 60, baseType: !52, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !373, file: !288, line: 61, baseType: !52, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !373, file: !288, line: 62, baseType: !52, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !373, file: !288, line: 63, baseType: !52, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !373, file: !288, line: 64, baseType: !52, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !373, file: !288, line: 65, baseType: !52, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !373, file: !288, line: 66, baseType: !52, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !373, file: !288, line: 67, baseType: !52, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !373, file: !288, line: 70, baseType: !52, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !373, file: !288, line: 72, baseType: !52, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !373, file: !288, line: 73, baseType: !52, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !373, file: !288, line: 74, baseType: !52, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !373, file: !288, line: 76, baseType: !52, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !373, file: !288, line: 77, baseType: !52, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !373, file: !288, line: 78, baseType: !52, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !287, file: !288, line: 135, baseType: !59, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !287, file: !288, line: 137, baseType: !197, size: 32, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !287, file: !288, line: 139, baseType: !105, size: 32, offset: 352)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !288, line: 141, baseType: !60, size: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !287, file: !288, line: 143, baseType: !377, size: 32, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !287, file: !288, line: 144, baseType: !389, size: 32, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !287, file: !288, line: 145, baseType: !45, size: 64, offset: 480)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !287, file: !288, line: 147, baseType: !45, size: 64, offset: 544)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !287, file: !288, line: 148, baseType: !439, size: 16, offset: 608)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !440, line: 12, baseType: !441)
!440 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !51, line: 186, baseType: !383)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !287, file: !288, line: 154, baseType: !377, size: 32, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !287, file: !288, line: 155, baseType: !389, size: 32, offset: 672)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !287, file: !288, line: 157, baseType: !127, size: 32, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !287, file: !288, line: 159, baseType: !340, size: 64, offset: 736)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !287, file: !288, line: 161, baseType: !216, size: 32, offset: 800)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !287, file: !288, line: 163, baseType: !56, size: 32, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !287, file: !288, line: 165, baseType: !52, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !287, file: !288, line: 167, baseType: !52, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !287, file: !288, line: 169, baseType: !52, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !288, line: 170, baseType: !52, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !287, file: !288, line: 171, baseType: !52, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !287, file: !288, line: 173, baseType: !52, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !287, file: !288, line: 174, baseType: !52, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !287, file: !288, line: 175, baseType: !52, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !287, file: !288, line: 176, baseType: !52, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !287, file: !288, line: 178, baseType: !52, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !287, file: !288, line: 179, baseType: !52, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !287, file: !288, line: 180, baseType: !52, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !287, file: !288, line: 181, baseType: !52, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !287, file: !288, line: 183, baseType: !52, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !273, file: !274, line: 48, baseType: !285, size: 32, offset: 480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !273, file: !274, line: 49, baseType: !56, size: 32, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !273, file: !274, line: 51, baseType: !465, size: 32, offset: 544)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !273, file: !274, line: 52, baseType: !56, size: 32, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !273, file: !274, line: 53, baseType: !56, size: 32, offset: 608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !273, file: !274, line: 55, baseType: !340, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !273, file: !274, line: 56, baseType: !56, size: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !273, file: !274, line: 58, baseType: !96, size: 160, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !273, file: !274, line: 59, baseType: !96, size: 160, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !273, file: !274, line: 61, baseType: !96, size: 160, offset: 1056)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !273, file: !274, line: 62, baseType: !475, size: 96, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !328, line: 32, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !328, line: 37, size: 96, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !476, file: !328, line: 38, baseType: !334, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !476, file: !328, line: 39, baseType: !334, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !476, file: !328, line: 40, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !328, line: 34, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !334, !334, !334}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !273, file: !274, line: 63, baseType: !327, size: 160, offset: 1312)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !273, file: !274, line: 65, baseType: !487, size: 224, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !488, line: 31, baseType: !489)
!488 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 25, size: 224, elements: !490)
!490 = !{!491, !499, !500, !501, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !489, file: !488, line: 26, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !488, line: 16, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !488, line: 18, size: 96, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !494, file: !488, line: 19, baseType: !28, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !494, file: !488, line: 20, baseType: !56, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !488, line: 21, baseType: !492, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !489, file: !488, line: 27, baseType: !493, size: 96, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !489, file: !488, line: 28, baseType: !50, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !489, file: !488, line: 29, baseType: !56, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !489, file: !488, line: 30, baseType: !105, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !273, file: !274, line: 66, baseType: !487, size: 224, offset: 1696)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !273, file: !274, line: 68, baseType: !56, size: 32, offset: 1920)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !273, file: !274, line: 69, baseType: !56, size: 32, offset: 1952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !273, file: !274, line: 71, baseType: !285, size: 32, offset: 1984)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !273, file: !274, line: 72, baseType: !292, size: 32, offset: 2016)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !273, file: !274, line: 73, baseType: !292, size: 32, offset: 2048)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !273, file: !274, line: 75, baseType: !271, size: 32, offset: 2080)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !273, file: !274, line: 77, baseType: !45, size: 64, offset: 2112)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !273, file: !274, line: 78, baseType: !45, size: 64, offset: 2176)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !273, file: !274, line: 79, baseType: !45, size: 64, offset: 2240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !273, file: !274, line: 80, baseType: !45, size: 64, offset: 2304)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !273, file: !274, line: 81, baseType: !45, size: 64, offset: 2368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !273, file: !274, line: 82, baseType: !45, size: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !91, file: !81, line: 121, baseType: !105, size: 32, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !91, file: !81, line: 122, baseType: !105, size: 32, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !91, file: !81, line: 123, baseType: !519, size: 32, offset: 160)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !81, line: 103, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 98, size: 1344, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !521, file: !81, line: 99, baseType: !141, size: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !521, file: !81, line: 100, baseType: !127, size: 32, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !521, file: !81, line: 101, baseType: !127, size: 32, offset: 1248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !521, file: !81, line: 102, baseType: !56, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !91, file: !81, line: 124, baseType: !197, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !91, file: !81, line: 126, baseType: !28, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !91, file: !81, line: 127, baseType: !56, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !91, file: !81, line: 128, baseType: !56, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !91, file: !81, line: 130, baseType: !532, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !81, line: 112, baseType: !86)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !91, file: !81, line: 131, baseType: !38, size: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !80, file: !81, line: 81, baseType: !56, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !80, file: !81, line: 82, baseType: !56, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !80, file: !81, line: 83, baseType: !28, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !67, line: 236, baseType: !56, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !66, file: !67, line: 238, baseType: !539, size: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{!542, !197}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !57, line: 78, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !51, line: 140, baseType: !60)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !66, file: !67, line: 240, baseType: !545, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DISubroutineType(types: !547)
!547 = !{!542, !271}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !66, file: !67, line: 242, baseType: !545, size: 32, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !66, file: !67, line: 243, baseType: !545, size: 32, offset: 416)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !66, file: !67, line: 244, baseType: !551, size: 32, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !271}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !66, file: !67, line: 245, baseType: !551, size: 32, offset: 480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !66, file: !67, line: 247, baseType: !551, size: 32, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !66, file: !67, line: 249, baseType: !58, size: 32, offset: 544)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !66, file: !67, line: 250, baseType: !58, size: 32, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !66, file: !67, line: 251, baseType: !58, size: 32, offset: 608)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !66, file: !67, line: 252, baseType: !58, size: 32, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !66, file: !67, line: 253, baseType: !58, size: 32, offset: 672)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !66, file: !67, line: 254, baseType: !58, size: 32, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !66, file: !67, line: 255, baseType: !58, size: 32, offset: 736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !66, file: !67, line: 256, baseType: !58, size: 32, offset: 768)
!564 = !DIGlobalVariableExpression(var: !565)
!565 = distinct !DIGlobalVariable(name: "ngx_http_ssi_vars", scope: !2, file: !3, line: 316, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 672, elements: !192)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_t", file: !568, line: 21, baseType: !569)
!568 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_variable_s", file: !568, line: 37, size: 224, elements: !570)
!570 = !{!571, !572, !1807, !1812, !1813, !1814}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !568, line: 38, baseType: !45, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set_handler", scope: !569, file: !568, line: 39, baseType: !573, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_set_variable_pt", file: !568, line: 23, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !577, !1508, !58}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !579, line: 16, baseType: !580)
!579 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !581, line: 364, size: 5376, elements: !582)
!581 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!582 = !{!583, !585, !586, !587, !588, !589, !590, !595, !596, !809, !1368, !1369, !1370, !1371, !1410, !1440, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1485, !1496, !1503, !1504, !1506, !1507, !1519, !1520, !1521, !1522, !1523, !1524, !1703, !1707, !1712, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !580, file: !581, line: 365, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 191, baseType: !52)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !580, file: !581, line: 367, baseType: !285, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !580, file: !581, line: 369, baseType: !35, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !580, file: !581, line: 370, baseType: !35, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !580, file: !581, line: 371, baseType: !35, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !580, file: !581, line: 372, baseType: !35, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !580, file: !581, line: 374, baseType: !591, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !581, line: 361, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !577}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !580, file: !581, line: 375, baseType: !591, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !580, file: !581, line: 378, baseType: !597, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !579, line: 18, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !600, line: 65, size: 3008, elements: !601)
!600 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!601 = !{!602, !603, !604, !605, !609, !610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !767, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !599, file: !600, line: 66, baseType: !141, size: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !599, file: !600, line: 67, baseType: !96, size: 160, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !599, file: !600, line: 68, baseType: !584, size: 32, offset: 1376)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !599, file: !600, line: 69, baseType: !606, size: 128, offset: 1408)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !599, file: !600, line: 70, baseType: !606, size: 128, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !599, file: !600, line: 72, baseType: !611, size: 32, offset: 1664)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !147, line: 18, baseType: !158)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !599, file: !600, line: 73, baseType: !185, size: 32, offset: 1696)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !599, file: !600, line: 74, baseType: !185, size: 32, offset: 1728)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !599, file: !600, line: 75, baseType: !185, size: 32, offset: 1760)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !599, file: !600, line: 76, baseType: !185, size: 32, offset: 1792)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !599, file: !600, line: 77, baseType: !185, size: 32, offset: 1824)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !599, file: !600, line: 79, baseType: !45, size: 64, offset: 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !599, file: !600, line: 80, baseType: !45, size: 64, offset: 1920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !599, file: !600, line: 81, baseType: !606, size: 128, offset: 1984)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !599, file: !600, line: 83, baseType: !50, size: 32, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !599, file: !600, line: 84, baseType: !50, size: 32, offset: 2144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !599, file: !600, line: 85, baseType: !59, size: 32, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !599, file: !600, line: 86, baseType: !59, size: 32, offset: 2208)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !599, file: !600, line: 88, baseType: !56, size: 32, offset: 2240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !599, file: !600, line: 89, baseType: !56, size: 32, offset: 2272)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !599, file: !600, line: 90, baseType: !56, size: 32, offset: 2304)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !599, file: !600, line: 91, baseType: !56, size: 32, offset: 2336)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !599, file: !600, line: 93, baseType: !127, size: 32, offset: 2368)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !599, file: !600, line: 95, baseType: !630, size: 32, offset: 2400)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !579, line: 19, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !600, line: 157, size: 544, elements: !633)
!633 = !{!634, !649, !710, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !766}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !632, file: !600, line: 158, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !600, line: 154, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 145, size: 480, elements: !638)
!638 = !{!639, !640, !641, !642, !645, !646, !647, !648}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !637, file: !600, line: 146, baseType: !475, size: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !637, file: !600, line: 147, baseType: !327, size: 160, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !637, file: !600, line: 148, baseType: !340, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !637, file: !600, line: 149, baseType: !643, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !217, line: 106, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !637, file: !600, line: 150, baseType: !643, size: 32, offset: 352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !600, line: 151, baseType: !59, size: 32, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !637, file: !600, line: 152, baseType: !56, size: 32, offset: 416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !637, file: !600, line: 153, baseType: !56, size: 32, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !632, file: !600, line: 159, baseType: !650, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !652, line: 59, baseType: !653)
!652 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 34, size: 800, elements: !654)
!654 = !{!655, !662, !663, !664, !672, !673, !674, !683, !684, !685, !686, !705, !706, !707, !708, !709}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !653, file: !652, line: 35, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !657, line: 21, baseType: !658)
!657 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 16, size: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !658, file: !657, line: 17, baseType: !643, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !658, file: !657, line: 19, baseType: !643, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !653, file: !652, line: 37, baseType: !50, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !653, file: !652, line: 38, baseType: !50, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !653, file: !652, line: 40, baseType: !665, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !652, line: 16, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !652, line: 18, size: 96, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !667, file: !652, line: 19, baseType: !58, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !652, line: 20, baseType: !665, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !667, file: !652, line: 21, baseType: !58, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !653, file: !652, line: 41, baseType: !665, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !653, file: !652, line: 42, baseType: !666, size: 96, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !653, file: !652, line: 44, baseType: !675, size: 32, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !652, line: 31, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 25, size: 128, elements: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !677, file: !652, line: 26, baseType: !56, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !677, file: !652, line: 27, baseType: !56, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !677, file: !652, line: 29, baseType: !56, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !677, file: !652, line: 30, baseType: !56, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !653, file: !652, line: 45, baseType: !56, size: 32, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !653, file: !652, line: 47, baseType: !40, size: 32, offset: 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !653, file: !652, line: 48, baseType: !40, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !653, file: !652, line: 50, baseType: !687, size: 256, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !657, line: 37, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 24, size: 256, elements: !689)
!689 = !{!690, !692, !693, !694, !704}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !688, file: !657, line: 26, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !688, file: !657, line: 28, baseType: !691, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !688, file: !657, line: 29, baseType: !56, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !688, file: !657, line: 30, baseType: !695, size: 128, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !696, line: 19, baseType: !697)
!696 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 17, size: 128, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !697, file: !696, line: 18, baseType: !700, size: 128)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 128, elements: !702)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!702 = !{!703}
!703 = !DISubrange(count: 4)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !688, file: !657, line: 36, baseType: !56, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !653, file: !652, line: 52, baseType: !40, size: 32, offset: 672)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !653, file: !652, line: 53, baseType: !41, size: 8, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !653, file: !652, line: 55, baseType: !52, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !653, file: !652, line: 57, baseType: !28, size: 32, offset: 736)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !653, file: !652, line: 58, baseType: !28, size: 32, offset: 768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !632, file: !600, line: 161, baseType: !711, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !143, line: 62, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 50, size: 384, elements: !714)
!714 = !{!715, !716, !717, !719, !724, !726, !728, !729, !730}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !143, line: 51, baseType: !45, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !713, file: !143, line: 52, baseType: !50, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !713, file: !143, line: 53, baseType: !718, size: 96, offset: 96)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 96, elements: !192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !713, file: !143, line: 55, baseType: !720, size: 32, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !143, line: 45, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DISubroutineType(types: !723)
!723 = !{!407, !28}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !713, file: !143, line: 56, baseType: !725, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !143, line: 46, baseType: !721)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !713, file: !143, line: 57, baseType: !727, size: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !143, line: 47, baseType: !264)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !143, line: 58, baseType: !28, size: 32, offset: 288)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !713, file: !143, line: 60, baseType: !40, size: 32, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !713, file: !143, line: 61, baseType: !56, size: 32, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !632, file: !600, line: 163, baseType: !59, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !632, file: !600, line: 164, baseType: !50, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !632, file: !600, line: 166, baseType: !185, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !632, file: !600, line: 168, baseType: !185, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !632, file: !600, line: 170, baseType: !56, size: 32, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !632, file: !600, line: 171, baseType: !56, size: 32, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !632, file: !600, line: 172, baseType: !407, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !632, file: !600, line: 173, baseType: !407, size: 32, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !632, file: !600, line: 174, baseType: !407, size: 32, offset: 352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !632, file: !600, line: 176, baseType: !56, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !632, file: !600, line: 177, baseType: !407, size: 32, offset: 416)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !632, file: !600, line: 178, baseType: !407, size: 32, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !632, file: !600, line: 180, baseType: !744, size: 32, offset: 480)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !274, line: 25, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !274, line: 29, size: 320, elements: !747)
!747 = !{!748, !749, !759, !764, !765}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !746, file: !274, line: 30, baseType: !28, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !746, file: !274, line: 31, baseType: !750, size: 192, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !751, line: 22, baseType: !752)
!751 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !751, line: 16, size: 192, elements: !753)
!753 = !{!754, !755, !756, !757, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !752, file: !751, line: 17, baseType: !40, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !751, line: 18, baseType: !50, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !751, line: 19, baseType: !45, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !752, file: !751, line: 20, baseType: !197, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !752, file: !751, line: 21, baseType: !56, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !746, file: !274, line: 32, baseType: !760, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !274, line: 27, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!542, !744, !28}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !746, file: !274, line: 33, baseType: !28, size: 32, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !746, file: !274, line: 34, baseType: !56, size: 32, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !632, file: !600, line: 182, baseType: !56, size: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !599, file: !600, line: 96, baseType: !768, size: 32, offset: 2432)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !600, line: 62, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 39, size: 576, elements: !771)
!771 = !{!772, !773, !774, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !770, file: !600, line: 40, baseType: !327, size: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !770, file: !600, line: 41, baseType: !340, size: 64, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !770, file: !600, line: 43, baseType: !775, size: 96, offset: 224)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 96, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 12)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !770, file: !600, line: 46, baseType: !52, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !770, file: !600, line: 47, baseType: !52, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !770, file: !600, line: 48, baseType: !52, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !770, file: !600, line: 49, baseType: !52, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !770, file: !600, line: 50, baseType: !52, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !770, file: !600, line: 51, baseType: !52, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !770, file: !600, line: 52, baseType: !52, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !770, file: !600, line: 53, baseType: !52, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !770, file: !600, line: 56, baseType: !611, size: 32, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !770, file: !600, line: 57, baseType: !185, size: 32, offset: 416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !770, file: !600, line: 58, baseType: !185, size: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !770, file: !600, line: 59, baseType: !50, size: 32, offset: 480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !770, file: !600, line: 60, baseType: !59, size: 32, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !770, file: !600, line: 61, baseType: !407, size: 32, offset: 544)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !599, file: !600, line: 102, baseType: !407, size: 32, offset: 2464)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !599, file: !600, line: 103, baseType: !407, size: 32, offset: 2496)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !599, file: !600, line: 104, baseType: !407, size: 32, offset: 2528)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !599, file: !600, line: 105, baseType: !407, size: 32, offset: 2560)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !599, file: !600, line: 107, baseType: !293, size: 384, offset: 2592)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !599, file: !600, line: 109, baseType: !52, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !599, file: !600, line: 110, baseType: !52, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !599, file: !600, line: 112, baseType: !52, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !599, file: !600, line: 113, baseType: !52, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !599, file: !600, line: 114, baseType: !52, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !599, file: !600, line: 115, baseType: !52, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !599, file: !600, line: 116, baseType: !52, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !599, file: !600, line: 117, baseType: !52, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !599, file: !600, line: 118, baseType: !52, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !599, file: !600, line: 119, baseType: !52, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !599, file: !600, line: 121, baseType: !52, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !599, file: !600, line: 122, baseType: !52, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !580, file: !581, line: 381, baseType: !810, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !579, line: 17, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !813, line: 313, size: 4096, elements: !814)
!813 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!814 = !{!815, !820, !821, !861, !940, !941, !963, !972, !1095, !1096, !1097, !1135, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1313, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1330, !1334, !1338, !1339, !1351, !1352, !1353, !1354, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !812, file: !813, line: 314, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !813, line: 309, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !577, !810}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !812, file: !813, line: 315, baseType: !816, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !812, file: !813, line: 317, baseType: !822, size: 480, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !823, line: 22, baseType: !824)
!823 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !823, line: 36, size: 480, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !838, !843, !845, !846, !855, !856, !857, !858, !859, !860}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !824, file: !823, line: 37, baseType: !285, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !824, file: !823, line: 39, baseType: !377, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !824, file: !823, line: 40, baseType: !389, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !823, line: 41, baseType: !44, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !824, file: !823, line: 43, baseType: !56, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !824, file: !823, line: 44, baseType: !407, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !824, file: !823, line: 46, baseType: !833, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !823, line: 24, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!542, !837, !28}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !824, file: !823, line: 47, baseType: !839, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !823, line: 26, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !837, !28, !56}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !824, file: !823, line: 48, baseType: !844, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !823, line: 28, baseType: !840)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !823, line: 49, baseType: !28, size: 32, offset: 288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !824, file: !823, line: 56, baseType: !847, size: 32, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !849, line: 78, baseType: !850)
!849 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !849, line: 74, size: 128, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !850, file: !849, line: 75, baseType: !377, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !850, file: !849, line: 76, baseType: !389, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !849, line: 77, baseType: !45, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !824, file: !823, line: 58, baseType: !60, size: 32, offset: 352)
