; ModuleID = 'src/http/modules/ngx_http_static_module.c'
source_filename = "src/http/modules/ngx_http_static_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_static_module_ctx", scope: !2, file: !3, line: 17, type: !555, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !34)
!3 = !DIFile(filename: "src/http/modules/ngx_http_static_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !32, line: 64, baseType: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35, !0}
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "ngx_http_static_module", scope: !2, file: !3, line: 32, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !38, line: 15, baseType: !39)
!38 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !40, line: 222, size: 800, elements: !41)
!40 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !{!42, !48, !49, !52, !53, !54, !55, !58, !59, !528, !529, !535, !539, !540, !541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !39, file: !40, line: 223, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !44, line: 79, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !46, line: 125, baseType: !47)
!46 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !39, file: !40, line: 224, baseType: !43, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 226, baseType: !50, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !39, file: !40, line: 228, baseType: !43, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !39, file: !40, line: 229, baseType: !43, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !39, file: !40, line: 231, baseType: !43, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !39, file: !40, line: 232, baseType: !56, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !39, file: !40, line: 234, baseType: !27, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !39, file: !40, line: 235, baseType: !60, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !38, line: 22, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !63, line: 77, size: 224, elements: !64)
!63 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = !{!65, !73, !74, !525, !526, !527}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !63, line: 78, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !67, line: 19, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 16, size: 64, elements: !69)
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !68, file: !67, line: 17, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 120, baseType: !47)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !67, line: 18, baseType: !30, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !63, line: 79, baseType: !43, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !62, file: !63, line: 80, baseType: !75, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DISubroutineType(types: !77)
!77 = !{!50, !78, !60, !27}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !38, line: 16, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !63, line: 116, size: 384, elements: !81)
!81 = !{!82, !83, !261, !507, !508, !509, !518, !519, !520, !521, !522, !524}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !63, line: 117, baseType: !50, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !80, file: !63, line: 118, baseType: !84, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !86, line: 22, baseType: !87)
!86 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 16, size: 160, elements: !88)
!88 = !{!89, !90, !91, !92, !93}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !87, file: !86, line: 17, baseType: !27, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !87, file: !86, line: 18, baseType: !43, size: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !86, line: 19, baseType: !71, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !87, file: !86, line: 20, baseType: !43, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !87, file: !86, line: 21, baseType: !94, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !38, line: 18, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !97, line: 57, size: 320, elements: !98)
!97 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = !{!99, !107, !108, !109, !241, !248, !260}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !96, file: !97, line: 58, baseType: !100, size: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !97, line: 54, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 49, size: 128, elements: !102)
!102 = !{!103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !101, file: !97, line: 50, baseType: !30, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !101, file: !97, line: 51, baseType: !30, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !97, line: 52, baseType: !94, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !101, file: !97, line: 53, baseType: !43, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !96, file: !97, line: 59, baseType: !71, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !96, file: !97, line: 60, baseType: !94, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !96, file: !97, line: 61, baseType: !110, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !38, line: 19, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !113, line: 59, size: 64, elements: !114)
!113 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!114 = !{!115, !240}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !112, file: !113, line: 60, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !113, line: 18, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !113, line: 20, size: 352, elements: !119)
!119 = !{!120, !121, !122, !125, !126, !127, !128, !130, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !118, file: !113, line: 21, baseType: !30, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !118, file: !113, line: 22, baseType: !30, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !118, file: !113, line: 23, baseType: !123, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !46, line: 222, baseType: !124)
!124 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !118, file: !113, line: 24, baseType: !123, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !118, file: !113, line: 26, baseType: !30, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !118, file: !113, line: 27, baseType: !30, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !118, file: !113, line: 28, baseType: !129, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !113, line: 16, baseType: !27)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !118, file: !113, line: 29, baseType: !131, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !38, line: 23, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !134, line: 16, size: 1216, elements: !135)
!134 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!135 = !{!136, !139, !140, !185, !186, !187, !225, !226}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !133, file: !134, line: 17, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !138, line: 16, baseType: !124)
!138 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !134, line: 18, baseType: !66, size: 64, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !133, file: !134, line: 19, baseType: !141, size: 960, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !138, line: 17, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !143, line: 4, size: 960, elements: !144)
!143 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !147, !148, !150, !151, !153, !154, !156, !158, !160, !161, !162, !163, !164, !165, !168, !169, !171, !172, !178, !179, !180}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !142, file: !143, line: 6, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !46, line: 232, baseType: !47)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !142, file: !143, line: 7, baseType: !146, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !142, file: !143, line: 8, baseType: !149, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !46, line: 227, baseType: !47)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !142, file: !143, line: 9, baseType: !149, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !142, file: !143, line: 10, baseType: !152, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !46, line: 217, baseType: !47)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !142, file: !143, line: 11, baseType: !152, size: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !142, file: !143, line: 13, baseType: !155, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !46, line: 212, baseType: !47)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !142, file: !143, line: 14, baseType: !157, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !46, line: 304, baseType: !47)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !142, file: !143, line: 15, baseType: !159, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !46, line: 309, baseType: !47)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !142, file: !143, line: 16, baseType: !47, size: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !142, file: !143, line: 17, baseType: !146, size: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !142, file: !143, line: 18, baseType: !146, size: 32, offset: 352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !142, file: !143, line: 19, baseType: !123, size: 32, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !142, file: !143, line: 20, baseType: !123, size: 32, offset: 416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !142, file: !143, line: 21, baseType: !166, size: 32, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !46, line: 237, baseType: !167)
!167 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !142, file: !143, line: 22, baseType: !166, size: 32, offset: 480)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !142, file: !143, line: 23, baseType: !170, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !46, line: 242, baseType: !124)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !142, file: !143, line: 24, baseType: !170, size: 32, offset: 544)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !142, file: !143, line: 26, baseType: !173, size: 64, offset: 576)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !46, line: 288, size: 64, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !173, file: !46, line: 288, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !46, line: 75, baseType: !167)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !173, file: !46, line: 288, baseType: !167, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !142, file: !143, line: 27, baseType: !173, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !142, file: !143, line: 28, baseType: !173, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !142, file: !143, line: 29, baseType: !181, size: 192, offset: 768)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 192, elements: !183)
!182 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!183 = !{!184}
!184 = !DISubrange(count: 3)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !133, file: !134, line: 21, baseType: !123, size: 32, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !133, file: !134, line: 22, baseType: !123, size: 32, offset: 1120)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !133, file: !134, line: 24, baseType: !188, size: 32, offset: 1152)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !38, line: 20, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !191, line: 50, size: 320, elements: !192)
!191 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!192 = !{!193, !194, !206, !210, !211, !216, !217, !222, !223, !224}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !190, file: !191, line: 51, baseType: !43, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !190, file: !191, line: 52, baseType: !195, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !38, line: 21, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !63, line: 89, size: 160, elements: !198)
!198 = !{!199, !200, !201, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !197, file: !63, line: 90, baseType: !137, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !63, line: 91, baseType: !66, size: 64, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !197, file: !63, line: 93, baseType: !202, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !195, !188}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !63, line: 94, baseType: !27, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !190, file: !191, line: 54, baseType: !207, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !208, line: 98, baseType: !209)
!208 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!209 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !190, file: !191, line: 56, baseType: !176, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !190, file: !191, line: 58, baseType: !212, size: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !191, line: 45, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!30, !188, !30, !71}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !191, line: 59, baseType: !27, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !190, file: !191, line: 61, baseType: !218, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !191, line: 46, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !188, !43, !30, !71}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !190, file: !191, line: 62, baseType: !27, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !190, file: !191, line: 70, baseType: !50, size: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !191, line: 72, baseType: !188, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !133, file: !134, line: 37, baseType: !47, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !133, file: !134, line: 38, baseType: !47, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !118, file: !113, line: 30, baseType: !116, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !118, file: !113, line: 34, baseType: !47, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !118, file: !113, line: 40, baseType: !47, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !118, file: !113, line: 43, baseType: !47, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !118, file: !113, line: 45, baseType: !47, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !118, file: !113, line: 46, baseType: !47, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !118, file: !113, line: 47, baseType: !47, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !118, file: !113, line: 48, baseType: !47, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !118, file: !113, line: 49, baseType: !47, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !118, file: !113, line: 50, baseType: !47, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !118, file: !113, line: 52, baseType: !47, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !118, file: !113, line: 53, baseType: !47, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !118, file: !113, line: 55, baseType: !124, size: 32, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !113, line: 61, baseType: !110, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !96, file: !97, line: 62, baseType: !242, size: 32, offset: 224)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !97, line: 41, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !97, line: 43, size: 64, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !97, line: 44, baseType: !242, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !244, file: !97, line: 45, baseType: !27, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !96, file: !97, line: 63, baseType: !249, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !97, line: 32, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !97, line: 34, size: 96, elements: !252)
!252 = !{!253, !258, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !251, file: !97, line: 35, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !97, line: 30, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !27}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !97, line: 36, baseType: !27, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !97, line: 37, baseType: !249, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !96, file: !97, line: 64, baseType: !188, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !80, file: !63, line: 120, baseType: !262, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !38, line: 17, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !265, line: 38, size: 2496, elements: !266)
!265 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!266 = !{!267, !270, !271, !272, !273, !274, !453, !454, !455, !458, !459, !460, !461, !462, !463, !464, !465, !476, !477, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !264, file: !265, line: 39, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !264, file: !265, line: 40, baseType: !94, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !264, file: !265, line: 42, baseType: !188, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !264, file: !265, line: 43, baseType: !189, size: 320, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !264, file: !265, line: 45, baseType: !43, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !264, file: !265, line: 47, baseType: !275, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !38, line: 26, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !279, line: 121, size: 896, elements: !280)
!279 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!280 = !{!281, !282, !338, !339, !342, !349, !351, !356, !361, !421, !422, !423, !424, !425, !426, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !279, line: 122, baseType: !27, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !278, file: !279, line: 123, baseType: !283, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !38, line: 24, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !286, line: 30, size: 384, elements: !287)
!286 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !315, !316, !317, !330}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !285, file: !286, line: 31, baseType: !27, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !285, file: !286, line: 33, baseType: !47, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !285, file: !286, line: 35, baseType: !47, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !285, file: !286, line: 38, baseType: !47, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !285, file: !286, line: 44, baseType: !47, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !285, file: !286, line: 46, baseType: !47, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !285, file: !286, line: 49, baseType: !47, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !285, file: !286, line: 51, baseType: !47, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !285, file: !286, line: 54, baseType: !47, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !285, file: !286, line: 56, baseType: !47, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !285, file: !286, line: 57, baseType: !47, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !285, file: !286, line: 59, baseType: !47, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !285, file: !286, line: 60, baseType: !47, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !285, file: !286, line: 62, baseType: !47, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !285, file: !286, line: 64, baseType: !47, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !285, file: !286, line: 67, baseType: !47, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !285, file: !286, line: 69, baseType: !47, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !285, file: !286, line: 71, baseType: !47, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !285, file: !286, line: 74, baseType: !47, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !285, file: !286, line: 75, baseType: !47, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !285, file: !286, line: 77, baseType: !47, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !285, file: !286, line: 107, baseType: !47, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !285, file: !286, line: 110, baseType: !311, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !38, line: 31, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !283}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !285, file: !286, line: 117, baseType: !43, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !285, file: !286, line: 119, baseType: !188, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !285, file: !286, line: 121, baseType: !318, size: 160, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !319, line: 20, baseType: !320)
!319 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !319, line: 22, size: 160, elements: !321)
!321 = !{!322, !324, !326, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !320, file: !319, line: 23, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !319, line: 16, baseType: !43)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !320, file: !319, line: 24, baseType: !325, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !320, file: !319, line: 25, baseType: !325, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !320, file: !319, line: 26, baseType: !325, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !320, file: !319, line: 27, baseType: !31, size: 8, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !320, file: !319, line: 28, baseType: !31, size: 8, offset: 136)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !285, file: !286, line: 124, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !332, line: 16, baseType: !333)
!332 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !332, line: 18, size: 64, elements: !334)
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !332, line: 19, baseType: !336, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !332, line: 20, baseType: !336, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !278, file: !279, line: 124, baseType: !283, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !278, file: !279, line: 126, baseType: !340, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !341, line: 17, baseType: !124)
!341 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !278, file: !279, line: 128, baseType: !343, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !344, line: 19, baseType: !345)
!344 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{!348, !276, !30, !71}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !46, line: 135, baseType: !124)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !278, file: !279, line: 129, baseType: !350, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !344, line: 22, baseType: !345)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !278, file: !279, line: 130, baseType: !352, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !344, line: 20, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{!348, !276, !110, !123}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !278, file: !279, line: 131, baseType: !357, size: 32, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !344, line: 23, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{!110, !276, !110, !123}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !278, file: !279, line: 133, baseType: !362, size: 32, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !279, line: 16, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !279, line: 18, size: 960, elements: !365)
!365 = !{!366, !367, !379, !381, !382, !383, !384, !385, !386, !387, !392, !393, !394, !395, !396, !397, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !364, file: !279, line: 19, baseType: !340, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !364, file: !279, line: 21, baseType: !368, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !370, line: 297, size: 128, elements: !371)
!370 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!371 = !{!372, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !369, file: !370, line: 298, baseType: !373, size: 16)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !46, line: 409, baseType: !374)
!374 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !369, file: !370, line: 299, baseType: !376, size: 112, offset: 16)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 112, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 14)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !364, file: !279, line: 22, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !46, line: 404, baseType: !47)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !364, file: !279, line: 23, baseType: !71, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !364, file: !279, line: 24, baseType: !66, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !279, line: 26, baseType: !124, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !364, file: !279, line: 28, baseType: !124, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !364, file: !279, line: 29, baseType: !124, size: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !364, file: !279, line: 30, baseType: !124, size: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !364, file: !279, line: 38, baseType: !388, size: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !38, line: 32, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !276}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !364, file: !279, line: 40, baseType: !27, size: 32, offset: 352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !364, file: !279, line: 42, baseType: !189, size: 320, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !364, file: !279, line: 43, baseType: !188, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !364, file: !279, line: 45, baseType: !71, size: 32, offset: 736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !364, file: !279, line: 47, baseType: !71, size: 32, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !364, file: !279, line: 49, baseType: !398, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !399, line: 16, baseType: !323)
!399 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !364, file: !279, line: 51, baseType: !362, size: 32, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !364, file: !279, line: 52, baseType: !276, size: 32, offset: 864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !364, file: !279, line: 54, baseType: !43, size: 32, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !364, file: !279, line: 56, baseType: !47, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !364, file: !279, line: 57, baseType: !47, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !364, file: !279, line: 58, baseType: !47, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !364, file: !279, line: 60, baseType: !47, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !364, file: !279, line: 61, baseType: !47, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !364, file: !279, line: 62, baseType: !47, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !364, file: !279, line: 63, baseType: !47, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !364, file: !279, line: 64, baseType: !47, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !364, file: !279, line: 65, baseType: !47, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !364, file: !279, line: 66, baseType: !47, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !364, file: !279, line: 67, baseType: !47, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !364, file: !279, line: 70, baseType: !47, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !364, file: !279, line: 72, baseType: !47, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !364, file: !279, line: 73, baseType: !47, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !364, file: !279, line: 74, baseType: !47, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !364, file: !279, line: 76, baseType: !47, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !364, file: !279, line: 77, baseType: !47, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !364, file: !279, line: 78, baseType: !47, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !278, file: !279, line: 135, baseType: !123, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !278, file: !279, line: 137, baseType: !188, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !278, file: !279, line: 139, baseType: !94, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !279, line: 141, baseType: !124, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !278, file: !279, line: 143, baseType: !368, size: 32, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !278, file: !279, line: 144, baseType: !380, size: 32, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !278, file: !279, line: 145, baseType: !66, size: 64, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !278, file: !279, line: 147, baseType: !66, size: 64, offset: 544)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !278, file: !279, line: 148, baseType: !430, size: 16, offset: 608)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !431, line: 12, baseType: !432)
!431 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !46, line: 186, baseType: !374)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !278, file: !279, line: 154, baseType: !368, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !278, file: !279, line: 155, baseType: !380, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !278, file: !279, line: 157, baseType: !116, size: 32, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !278, file: !279, line: 159, baseType: !331, size: 64, offset: 736)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !278, file: !279, line: 161, baseType: !207, size: 32, offset: 800)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !278, file: !279, line: 163, baseType: !43, size: 32, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !278, file: !279, line: 165, baseType: !47, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !278, file: !279, line: 167, baseType: !47, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !278, file: !279, line: 169, baseType: !47, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !278, file: !279, line: 170, baseType: !47, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !278, file: !279, line: 171, baseType: !47, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !278, file: !279, line: 173, baseType: !47, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !278, file: !279, line: 174, baseType: !47, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !278, file: !279, line: 175, baseType: !47, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !278, file: !279, line: 176, baseType: !47, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !278, file: !279, line: 178, baseType: !47, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !278, file: !279, line: 179, baseType: !47, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !278, file: !279, line: 180, baseType: !47, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !278, file: !279, line: 181, baseType: !47, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !278, file: !279, line: 183, baseType: !47, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !264, file: !265, line: 48, baseType: !276, size: 32, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !264, file: !265, line: 49, baseType: !43, size: 32, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !264, file: !265, line: 51, baseType: !456, size: 32, offset: 544)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !264, file: !265, line: 52, baseType: !43, size: 32, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !264, file: !265, line: 53, baseType: !43, size: 32, offset: 608)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !264, file: !265, line: 55, baseType: !331, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !264, file: !265, line: 56, baseType: !43, size: 32, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !264, file: !265, line: 58, baseType: !85, size: 160, offset: 736)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !264, file: !265, line: 59, baseType: !85, size: 160, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !264, file: !265, line: 61, baseType: !85, size: 160, offset: 1056)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !264, file: !265, line: 62, baseType: !466, size: 96, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !319, line: 32, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !319, line: 37, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !467, file: !319, line: 38, baseType: !325, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !467, file: !319, line: 39, baseType: !325, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !467, file: !319, line: 40, baseType: !472, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !319, line: 34, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !325, !325, !325}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !264, file: !265, line: 63, baseType: !318, size: 160, offset: 1312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !264, file: !265, line: 65, baseType: !478, size: 224, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !479, line: 31, baseType: !480)
!479 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 25, size: 224, elements: !481)
!481 = !{!482, !490, !491, !492, !493}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !480, file: !479, line: 26, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !479, line: 16, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !479, line: 18, size: 96, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !485, file: !479, line: 19, baseType: !27, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !485, file: !479, line: 20, baseType: !43, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !485, file: !479, line: 21, baseType: !483, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !480, file: !479, line: 27, baseType: !484, size: 96, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !479, line: 28, baseType: !71, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !480, file: !479, line: 29, baseType: !43, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !480, file: !479, line: 30, baseType: !94, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !264, file: !265, line: 66, baseType: !478, size: 224, offset: 1696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !264, file: !265, line: 68, baseType: !43, size: 32, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !264, file: !265, line: 69, baseType: !43, size: 32, offset: 1952)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !264, file: !265, line: 71, baseType: !276, size: 32, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !264, file: !265, line: 72, baseType: !283, size: 32, offset: 2016)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !264, file: !265, line: 73, baseType: !283, size: 32, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !264, file: !265, line: 75, baseType: !262, size: 32, offset: 2080)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !264, file: !265, line: 77, baseType: !66, size: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !264, file: !265, line: 78, baseType: !66, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !264, file: !265, line: 79, baseType: !66, size: 64, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !264, file: !265, line: 80, baseType: !66, size: 64, offset: 2304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !264, file: !265, line: 81, baseType: !66, size: 64, offset: 2368)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !264, file: !265, line: 82, baseType: !66, size: 64, offset: 2432)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !80, file: !63, line: 121, baseType: !94, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !80, file: !63, line: 122, baseType: !94, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !80, file: !63, line: 123, baseType: !510, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !63, line: 103, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 98, size: 1344, elements: !513)
!513 = !{!514, !515, !516, !517}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !512, file: !63, line: 99, baseType: !132, size: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !512, file: !63, line: 100, baseType: !116, size: 32, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !512, file: !63, line: 101, baseType: !116, size: 32, offset: 1248)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !512, file: !63, line: 102, baseType: !43, size: 32, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !80, file: !63, line: 124, baseType: !188, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !80, file: !63, line: 126, baseType: !27, size: 32, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !80, file: !63, line: 127, baseType: !43, size: 32, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !80, file: !63, line: 128, baseType: !43, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !80, file: !63, line: 130, baseType: !523, size: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !63, line: 112, baseType: !75)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !80, file: !63, line: 131, baseType: !50, size: 32, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !62, file: !63, line: 81, baseType: !43, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !62, file: !63, line: 82, baseType: !43, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !62, file: !63, line: 83, baseType: !27, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !40, line: 236, baseType: !43, size: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !39, file: !40, line: 238, baseType: !530, size: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{!533, !188}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !44, line: 78, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !46, line: 140, baseType: !124)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !39, file: !40, line: 240, baseType: !536, size: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{!533, !262}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !39, file: !40, line: 242, baseType: !536, size: 32, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !39, file: !40, line: 243, baseType: !536, size: 32, offset: 416)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !39, file: !40, line: 244, baseType: !542, size: 32, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !262}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !39, file: !40, line: 245, baseType: !542, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !39, file: !40, line: 247, baseType: !542, size: 32, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !39, file: !40, line: 249, baseType: !45, size: 32, offset: 544)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !39, file: !40, line: 250, baseType: !45, size: 32, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !39, file: !40, line: 251, baseType: !45, size: 32, offset: 608)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !39, file: !40, line: 252, baseType: !45, size: 32, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !39, file: !40, line: 253, baseType: !45, size: 32, offset: 672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !39, file: !40, line: 254, baseType: !45, size: 32, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !39, file: !40, line: 255, baseType: !45, size: 32, offset: 736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !39, file: !40, line: 256, baseType: !45, size: 32, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !22, line: 36, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 24, size: 256, elements: !557)
!557 = !{!558, !562, !563, !567, !571, !572, !576, !577}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !556, file: !22, line: 25, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{!533, !78}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !556, file: !22, line: 26, baseType: !559, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !556, file: !22, line: 28, baseType: !564, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{!27, !78}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !556, file: !22, line: 29, baseType: !568, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{!50, !78, !27}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !556, file: !22, line: 31, baseType: !564, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !556, file: !22, line: 32, baseType: !573, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!50, !78, !27, !27}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !556, file: !22, line: 34, baseType: !564, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !556, file: !22, line: 35, baseType: !573, size: 32, offset: 224)
!578 = !{i32 2, !"Dwarf Version", i32 4}
!579 = !{i32 2, !"Debug Info Version", i32 3}
!580 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!581 = distinct !DISubprogram(name: "ngx_http_static_init", scope: !3, file: !3, line: 272, type: !560, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !582)
!582 = !{!583, !584, !1817}
!583 = !DILocalVariable(name: "cf", arg: 1, scope: !581, file: !3, line: 272, type: !78)
!584 = !DILocalVariable(name: "h", scope: !581, file: !3, line: 274, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !587, line: 360, baseType: !588)
!587 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DISubroutineType(types: !590)
!590 = !{!533, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !593, line: 16, baseType: !594)
!593 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !587, line: 364, size: 5376, elements: !595)
!595 = !{!596, !598, !599, !600, !601, !602, !603, !608, !609, !822, !1379, !1380, !1381, !1382, !1421, !1451, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1496, !1507, !1514, !1515, !1516, !1517, !1530, !1531, !1532, !1533, !1534, !1535, !1713, !1717, !1722, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !587, line: 365, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !46, line: 191, baseType: !47)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !594, file: !587, line: 367, baseType: !276, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !594, file: !587, line: 369, baseType: !26, size: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !594, file: !587, line: 370, baseType: !26, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !594, file: !587, line: 371, baseType: !26, size: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !594, file: !587, line: 372, baseType: !26, size: 32, offset: 160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !594, file: !587, line: 374, baseType: !604, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !587, line: 361, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !591}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !594, file: !587, line: 375, baseType: !604, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !594, file: !587, line: 378, baseType: !610, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !593, line: 18, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !613, line: 65, size: 3008, elements: !614)
!613 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!614 = !{!615, !616, !617, !618, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !780, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !612, file: !613, line: 66, baseType: !132, size: 1216)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !612, file: !613, line: 67, baseType: !85, size: 160, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !612, file: !613, line: 68, baseType: !597, size: 32, offset: 1376)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !612, file: !613, line: 69, baseType: !619, size: 128, offset: 1408)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 16)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !612, file: !613, line: 70, baseType: !619, size: 128, offset: 1536)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !612, file: !613, line: 72, baseType: !624, size: 32, offset: 1664)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !138, line: 18, baseType: !149)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !612, file: !613, line: 73, baseType: !176, size: 32, offset: 1696)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !612, file: !613, line: 74, baseType: !176, size: 32, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !612, file: !613, line: 75, baseType: !176, size: 32, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !612, file: !613, line: 76, baseType: !176, size: 32, offset: 1792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !612, file: !613, line: 77, baseType: !176, size: 32, offset: 1824)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !612, file: !613, line: 79, baseType: !66, size: 64, offset: 1856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !612, file: !613, line: 80, baseType: !66, size: 64, offset: 1920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !612, file: !613, line: 81, baseType: !619, size: 128, offset: 1984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !612, file: !613, line: 83, baseType: !71, size: 32, offset: 2112)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !612, file: !613, line: 84, baseType: !71, size: 32, offset: 2144)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !612, file: !613, line: 85, baseType: !123, size: 32, offset: 2176)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !612, file: !613, line: 86, baseType: !123, size: 32, offset: 2208)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !612, file: !613, line: 88, baseType: !43, size: 32, offset: 2240)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !612, file: !613, line: 89, baseType: !43, size: 32, offset: 2272)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !612, file: !613, line: 90, baseType: !43, size: 32, offset: 2304)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !612, file: !613, line: 91, baseType: !43, size: 32, offset: 2336)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !612, file: !613, line: 93, baseType: !116, size: 32, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !612, file: !613, line: 95, baseType: !643, size: 32, offset: 2400)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !593, line: 19, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !613, line: 157, size: 544, elements: !646)
!646 = !{!647, !662, !723, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !779}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !645, file: !613, line: 158, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !613, line: 154, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 145, size: 480, elements: !651)
!651 = !{!652, !653, !654, !655, !658, !659, !660, !661}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !650, file: !613, line: 146, baseType: !466, size: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !650, file: !613, line: 147, baseType: !318, size: 160, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !650, file: !613, line: 148, baseType: !331, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !650, file: !613, line: 149, baseType: !656, size: 32, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !208, line: 106, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !207)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !650, file: !613, line: 150, baseType: !656, size: 32, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !613, line: 151, baseType: !123, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !650, file: !613, line: 152, baseType: !43, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !650, file: !613, line: 153, baseType: !43, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !645, file: !613, line: 159, baseType: !663, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !665, line: 59, baseType: !666)
!665 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 34, size: 800, elements: !667)
!667 = !{!668, !675, !676, !677, !685, !686, !687, !696, !697, !698, !699, !718, !719, !720, !721, !722}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !666, file: !665, line: 35, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !670, line: 21, baseType: !671)
!670 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 16, size: 64, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !671, file: !670, line: 17, baseType: !656, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !671, file: !670, line: 19, baseType: !656, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !666, file: !665, line: 37, baseType: !71, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !666, file: !665, line: 38, baseType: !71, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !666, file: !665, line: 40, baseType: !678, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !665, line: 16, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !665, line: 18, size: 96, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !680, file: !665, line: 19, baseType: !45, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !665, line: 20, baseType: !678, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !680, file: !665, line: 21, baseType: !45, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !666, file: !665, line: 41, baseType: !678, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !666, file: !665, line: 42, baseType: !679, size: 96, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !666, file: !665, line: 44, baseType: !688, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !665, line: 31, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 25, size: 128, elements: !691)
!691 = !{!692, !693, !694, !695}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !690, file: !665, line: 26, baseType: !43, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !690, file: !665, line: 27, baseType: !43, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !690, file: !665, line: 29, baseType: !43, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !690, file: !665, line: 30, baseType: !43, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !666, file: !665, line: 45, baseType: !43, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !666, file: !665, line: 47, baseType: !30, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !666, file: !665, line: 48, baseType: !30, size: 32, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !666, file: !665, line: 50, baseType: !700, size: 256, offset: 416)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !670, line: 37, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 24, size: 256, elements: !702)
!702 = !{!703, !705, !706, !707, !717}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !701, file: !670, line: 26, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !701, file: !670, line: 28, baseType: !704, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !701, file: !670, line: 29, baseType: !43, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !701, file: !670, line: 30, baseType: !708, size: 128, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !709, line: 19, baseType: !710)
!709 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !709, line: 17, size: 128, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !710, file: !709, line: 18, baseType: !713, size: 128)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 128, elements: !715)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !124)
!715 = !{!716}
!716 = !DISubrange(count: 4)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !701, file: !670, line: 36, baseType: !43, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !666, file: !665, line: 52, baseType: !30, size: 32, offset: 672)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !666, file: !665, line: 53, baseType: !31, size: 8, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !666, file: !665, line: 55, baseType: !47, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !665, line: 57, baseType: !27, size: 32, offset: 736)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !666, file: !665, line: 58, baseType: !27, size: 32, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !645, file: !613, line: 161, baseType: !724, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !134, line: 62, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 50, size: 384, elements: !727)
!727 = !{!728, !729, !730, !732, !737, !739, !741, !742, !743}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !134, line: 51, baseType: !66, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !726, file: !134, line: 52, baseType: !71, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !726, file: !134, line: 53, baseType: !731, size: 96, offset: 96)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 96, elements: !183)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !726, file: !134, line: 55, baseType: !733, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !134, line: 45, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!398, !27}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !726, file: !134, line: 56, baseType: !738, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !134, line: 46, baseType: !734)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !726, file: !134, line: 57, baseType: !740, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !134, line: 47, baseType: !255)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !726, file: !134, line: 58, baseType: !27, size: 32, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !726, file: !134, line: 60, baseType: !30, size: 32, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !726, file: !134, line: 61, baseType: !43, size: 32, offset: 352)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !645, file: !613, line: 163, baseType: !123, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !645, file: !613, line: 164, baseType: !71, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !645, file: !613, line: 166, baseType: !176, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !645, file: !613, line: 168, baseType: !176, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !645, file: !613, line: 170, baseType: !43, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !645, file: !613, line: 171, baseType: !43, size: 32, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !645, file: !613, line: 172, baseType: !398, size: 32, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !645, file: !613, line: 173, baseType: !398, size: 32, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !645, file: !613, line: 174, baseType: !398, size: 32, offset: 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !645, file: !613, line: 176, baseType: !43, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !645, file: !613, line: 177, baseType: !398, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !645, file: !613, line: 178, baseType: !398, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !645, file: !613, line: 180, baseType: !757, size: 32, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !265, line: 25, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !265, line: 29, size: 320, elements: !760)
!760 = !{!761, !762, !772, !777, !778}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !265, line: 30, baseType: !27, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !759, file: !265, line: 31, baseType: !763, size: 192, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !764, line: 22, baseType: !765)
!764 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 16, size: 192, elements: !766)
!766 = !{!767, !768, !769, !770, !771}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !765, file: !764, line: 17, baseType: !30, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !765, file: !764, line: 18, baseType: !71, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !765, file: !764, line: 19, baseType: !66, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !765, file: !764, line: 20, baseType: !188, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !765, file: !764, line: 21, baseType: !43, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !759, file: !265, line: 32, baseType: !773, size: 32, offset: 224)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !265, line: 27, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!533, !757, !27}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !759, file: !265, line: 33, baseType: !27, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !759, file: !265, line: 34, baseType: !43, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !645, file: !613, line: 182, baseType: !43, size: 32, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !613, line: 96, baseType: !781, size: 32, offset: 2432)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !613, line: 62, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 39, size: 576, elements: !784)
!784 = !{!785, !786, !787, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !783, file: !613, line: 40, baseType: !318, size: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !783, file: !613, line: 41, baseType: !331, size: 64, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !783, file: !613, line: 43, baseType: !788, size: 96, offset: 224)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 12)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !783, file: !613, line: 46, baseType: !47, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !783, file: !613, line: 47, baseType: !47, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !783, file: !613, line: 48, baseType: !47, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !783, file: !613, line: 49, baseType: !47, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !783, file: !613, line: 50, baseType: !47, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !783, file: !613, line: 51, baseType: !47, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !783, file: !613, line: 52, baseType: !47, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !783, file: !613, line: 53, baseType: !47, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !783, file: !613, line: 56, baseType: !624, size: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !783, file: !613, line: 57, baseType: !176, size: 32, offset: 416)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !783, file: !613, line: 58, baseType: !176, size: 32, offset: 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !783, file: !613, line: 59, baseType: !71, size: 32, offset: 480)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !783, file: !613, line: 60, baseType: !123, size: 32, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !783, file: !613, line: 61, baseType: !398, size: 32, offset: 544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !612, file: !613, line: 102, baseType: !398, size: 32, offset: 2464)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !612, file: !613, line: 103, baseType: !398, size: 32, offset: 2496)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !612, file: !613, line: 104, baseType: !398, size: 32, offset: 2528)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !612, file: !613, line: 105, baseType: !398, size: 32, offset: 2560)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !612, file: !613, line: 107, baseType: !284, size: 384, offset: 2592)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !612, file: !613, line: 109, baseType: !47, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !612, file: !613, line: 110, baseType: !47, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !612, file: !613, line: 112, baseType: !47, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !612, file: !613, line: 113, baseType: !47, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !612, file: !613, line: 114, baseType: !47, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !612, file: !613, line: 115, baseType: !47, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !612, file: !613, line: 116, baseType: !47, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !612, file: !613, line: 117, baseType: !47, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !612, file: !613, line: 118, baseType: !47, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !612, file: !613, line: 119, baseType: !47, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !612, file: !613, line: 121, baseType: !47, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !612, file: !613, line: 122, baseType: !47, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !594, file: !587, line: 381, baseType: !823, size: 32, offset: 288)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !593, line: 17, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !826, line: 313, size: 4096, elements: !827)
!826 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!827 = !{!828, !833, !834, !875, !954, !955, !977, !986, !1109, !1110, !1111, !1149, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1327, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1341, !1345, !1349, !1350, !1362, !1363, !1364, !1365, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !825, file: !826, line: 314, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !826, line: 309, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !591, !823}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !825, file: !826, line: 315, baseType: !829, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !825, file: !826, line: 317, baseType: !835, size: 480, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !836, line: 22, baseType: !837)
!836 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !836, line: 36, size: 480, elements: !838)
!838 = !{!839, !840, !841, !842, !844, !845, !846, !852, !857, !859, !860, !869, !870, !871, !872, !873, !874}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !837, file: !836, line: 37, baseType: !276, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !837, file: !836, line: 39, baseType: !368, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !837, file: !836, line: 40, baseType: !380, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !836, line: 41, baseType: !843, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !837, file: !836, line: 43, baseType: !43, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !837, file: !836, line: 44, baseType: !398, size: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !837, file: !836, line: 46, baseType: !847, size: 32, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !836, line: 24, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{!533, !851, !27}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !837, file: !836, line: 47, baseType: !853, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !836, line: 26, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !851, !27, !43}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !837, file: !836, line: 48, baseType: !858, size: 32, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !836, line: 28, baseType: !854)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !837, file: !836, line: 49, baseType: !27, size: 32, offset: 288)
