; ModuleID = 'src/http/modules/ngx_http_autoindex_module.c'
source_filename = "src/http/modules/ngx_http_autoindex_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_autoindex_module_ctx", scope: !2, file: !3, line: 121, type: !1897, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !75)
!3 = !DIFile(filename: "src/http/modules/ngx_http_autoindex_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !34, !37, !31, !40, !61, !62, !73, !69}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !32, line: 64, baseType: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 120, baseType: !39)
!38 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_autoindex_entry_t", file: !3, line: 37, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !43)
!43 = !{!44, !51, !52, !53, !54, !55, !56, !59}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !3, line: 27, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !46, line: 19, baseType: !47)
!46 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 16, size: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, file: !46, line: 17, baseType: !37, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !46, line: 18, baseType: !30, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "utf_len", scope: !42, file: !3, line: 28, baseType: !37, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !42, file: !3, line: 29, baseType: !37, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "escape_html", scope: !42, file: !3, line: 30, baseType: !37, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !42, file: !3, line: 32, baseType: !39, size: 1, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !42, file: !3, line: 33, baseType: !39, size: 1, offset: 161, flags: DIFlagBitField, extraData: i64 160)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !42, file: !3, line: 35, baseType: !57, size: 32, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !38, line: 75, baseType: !58)
!58 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !3, line: 36, baseType: !60, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !38, line: 222, baseType: !61)
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !64, line: 20, baseType: !65)
!64 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 16, size: 96, elements: !66)
!66 = !{!67, !68, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !65, file: !64, line: 17, baseType: !57, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !65, file: !64, line: 18, baseType: !69, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !70, line: 79, baseType: !71)
!70 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !38, line: 125, baseType: !39)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !65, file: !64, line: 19, baseType: !73, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !70, line: 78, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !38, line: 140, baseType: !61)
!75 = !{!76, !0, !575, !1835, !1840, !1871, !1876, !1881, !1884, !1889}
!76 = !DIGlobalVariableExpression(var: !77)
!77 = distinct !DIGlobalVariable(name: "ngx_http_autoindex_module", scope: !2, file: !3, line: 136, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !79, line: 15, baseType: !80)
!79 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !81, line: 222, size: 800, elements: !82)
!81 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !{!83, !84, !85, !87, !88, !89, !90, !91, !92, !550, !551, !555, !559, !560, !561, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !80, file: !81, line: 223, baseType: !69, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !80, file: !81, line: 224, baseType: !69, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !81, line: 226, baseType: !86, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !80, file: !81, line: 228, baseType: !69, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !80, file: !81, line: 229, baseType: !69, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !81, line: 231, baseType: !69, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !80, file: !81, line: 232, baseType: !34, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !80, file: !81, line: 234, baseType: !27, size: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !80, file: !81, line: 235, baseType: !93, size: 32, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !79, line: 22, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !96, line: 77, size: 224, elements: !97)
!96 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!97 = !{!98, !99, !100, !547, !548, !549}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !96, line: 78, baseType: !45, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !96, line: 79, baseType: !69, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !95, file: !96, line: 80, baseType: !101, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DISubroutineType(types: !103)
!103 = !{!86, !104, !93, !27}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !79, line: 16, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !96, line: 116, size: 384, elements: !107)
!107 = !{!108, !109, !283, !529, !530, !531, !540, !541, !542, !543, !544, !546}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !96, line: 117, baseType: !86, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !106, file: !96, line: 118, baseType: !110, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !112, line: 22, baseType: !113)
!112 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 16, size: 160, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !113, file: !112, line: 17, baseType: !27, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !113, file: !112, line: 18, baseType: !69, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !113, file: !112, line: 19, baseType: !37, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !113, file: !112, line: 20, baseType: !69, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !113, file: !112, line: 21, baseType: !120, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !79, line: 18, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !123, line: 57, size: 320, elements: !124)
!123 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!124 = !{!125, !133, !134, !135, !263, !270, !282}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !122, file: !123, line: 58, baseType: !126, size: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !123, line: 54, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 49, size: 128, elements: !128)
!128 = !{!129, !130, !131, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !127, file: !123, line: 50, baseType: !30, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !127, file: !123, line: 51, baseType: !30, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !123, line: 52, baseType: !120, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !127, file: !123, line: 53, baseType: !69, size: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !122, file: !123, line: 59, baseType: !37, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !122, file: !123, line: 60, baseType: !120, size: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !122, file: !123, line: 61, baseType: !136, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !79, line: 19, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !139, line: 59, size: 64, elements: !140)
!139 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!140 = !{!141, !262}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !138, file: !139, line: 60, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !139, line: 18, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !139, line: 20, size: 352, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !154, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !144, file: !139, line: 21, baseType: !30, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !144, file: !139, line: 22, baseType: !30, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !144, file: !139, line: 23, baseType: !60, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !144, file: !139, line: 24, baseType: !60, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !144, file: !139, line: 26, baseType: !30, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !144, file: !139, line: 27, baseType: !30, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !144, file: !139, line: 28, baseType: !153, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !139, line: 16, baseType: !27)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !144, file: !139, line: 29, baseType: !155, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !79, line: 23, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !158, line: 16, size: 1216, elements: !159)
!158 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!159 = !{!160, !163, !164, !207, !208, !209, !247, !248}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !157, file: !158, line: 17, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !162, line: 16, baseType: !61)
!162 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 18, baseType: !45, size: 64, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !157, file: !158, line: 19, baseType: !165, size: 960, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !162, line: 17, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !167, line: 4, size: 960, elements: !168)
!167 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!168 = !{!169, !171, !172, !174, !175, !177, !178, !180, !182, !184, !185, !186, !187, !188, !189, !191, !192, !194, !195, !200, !201, !202}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !166, file: !167, line: 6, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !38, line: 232, baseType: !39)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !166, file: !167, line: 7, baseType: !170, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !166, file: !167, line: 8, baseType: !173, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !38, line: 227, baseType: !39)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !166, file: !167, line: 9, baseType: !173, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !166, file: !167, line: 10, baseType: !176, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !38, line: 217, baseType: !39)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !166, file: !167, line: 11, baseType: !176, size: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !166, file: !167, line: 13, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !38, line: 212, baseType: !39)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !166, file: !167, line: 14, baseType: !181, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !38, line: 304, baseType: !39)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !166, file: !167, line: 15, baseType: !183, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !38, line: 309, baseType: !39)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !166, file: !167, line: 16, baseType: !39, size: 32, offset: 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !166, file: !167, line: 17, baseType: !170, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !166, file: !167, line: 18, baseType: !170, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !166, file: !167, line: 19, baseType: !60, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !166, file: !167, line: 20, baseType: !60, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !166, file: !167, line: 21, baseType: !190, size: 32, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !38, line: 237, baseType: !58)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !166, file: !167, line: 22, baseType: !190, size: 32, offset: 480)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !166, file: !167, line: 23, baseType: !193, size: 32, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !38, line: 242, baseType: !61)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !166, file: !167, line: 24, baseType: !193, size: 32, offset: 544)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !166, file: !167, line: 26, baseType: !196, size: 64, offset: 576)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !38, line: 288, size: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !196, file: !38, line: 288, baseType: !57, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !196, file: !38, line: 288, baseType: !58, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !166, file: !167, line: 27, baseType: !196, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !166, file: !167, line: 28, baseType: !196, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !166, file: !167, line: 29, baseType: !203, size: 192, offset: 768)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 192, elements: !205)
!204 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!205 = !{!206}
!206 = !DISubrange(count: 3)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !157, file: !158, line: 21, baseType: !60, size: 32, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !157, file: !158, line: 22, baseType: !60, size: 32, offset: 1120)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !157, file: !158, line: 24, baseType: !210, size: 32, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !79, line: 20, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !213, line: 50, size: 320, elements: !214)
!213 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!214 = !{!215, !216, !228, !232, !233, !238, !239, !244, !245, !246}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !212, file: !213, line: 51, baseType: !69, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !212, file: !213, line: 52, baseType: !217, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !79, line: 21, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !96, line: 89, size: 160, elements: !220)
!220 = !{!221, !222, !223, !227}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !219, file: !96, line: 90, baseType: !161, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !219, file: !96, line: 91, baseType: !45, size: 64, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !219, file: !96, line: 93, baseType: !224, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !217, !210}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !219, file: !96, line: 94, baseType: !27, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !212, file: !213, line: 54, baseType: !229, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !230, line: 98, baseType: !231)
!230 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!231 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !212, file: !213, line: 56, baseType: !57, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !212, file: !213, line: 58, baseType: !234, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !213, line: 45, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DISubroutineType(types: !237)
!237 = !{!30, !210, !30, !37}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !213, line: 59, baseType: !27, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !212, file: !213, line: 61, baseType: !240, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !213, line: 46, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !210, !69, !30, !37}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !212, file: !213, line: 62, baseType: !27, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !212, file: !213, line: 70, baseType: !86, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !213, line: 72, baseType: !210, size: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !157, file: !158, line: 37, baseType: !39, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !157, file: !158, line: 38, baseType: !39, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !144, file: !139, line: 30, baseType: !142, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !144, file: !139, line: 34, baseType: !39, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !144, file: !139, line: 40, baseType: !39, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !144, file: !139, line: 43, baseType: !39, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !144, file: !139, line: 45, baseType: !39, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !144, file: !139, line: 46, baseType: !39, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !144, file: !139, line: 47, baseType: !39, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !144, file: !139, line: 48, baseType: !39, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !144, file: !139, line: 49, baseType: !39, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !144, file: !139, line: 50, baseType: !39, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !144, file: !139, line: 52, baseType: !39, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !144, file: !139, line: 53, baseType: !39, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !144, file: !139, line: 55, baseType: !61, size: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !139, line: 61, baseType: !136, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !122, file: !123, line: 62, baseType: !264, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !123, line: 41, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !123, line: 43, size: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !123, line: 44, baseType: !264, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !266, file: !123, line: 45, baseType: !27, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !122, file: !123, line: 63, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !123, line: 32, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !123, line: 34, size: 96, elements: !274)
!274 = !{!275, !280, !281}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !273, file: !123, line: 35, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !123, line: 30, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !27}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !123, line: 36, baseType: !27, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !123, line: 37, baseType: !271, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !122, file: !123, line: 64, baseType: !210, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !106, file: !96, line: 120, baseType: !284, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !79, line: 17, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !287, line: 38, size: 2496, elements: !288)
!287 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!288 = !{!289, !292, !293, !294, !295, !296, !475, !476, !477, !480, !481, !482, !483, !484, !485, !486, !487, !498, !499, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !286, file: !287, line: 39, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !286, file: !287, line: 40, baseType: !120, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !286, file: !287, line: 42, baseType: !210, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !286, file: !287, line: 43, baseType: !211, size: 320, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !286, file: !287, line: 45, baseType: !69, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !286, file: !287, line: 47, baseType: !297, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !79, line: 26, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !301, line: 121, size: 896, elements: !302)
!301 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!302 = !{!303, !304, !360, !361, !364, !371, !373, !378, !383, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !301, line: 122, baseType: !27, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !300, file: !301, line: 123, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !79, line: 24, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !308, line: 30, size: 384, elements: !309)
!308 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !337, !338, !339, !352}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !308, line: 31, baseType: !27, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !307, file: !308, line: 33, baseType: !39, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !307, file: !308, line: 35, baseType: !39, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !307, file: !308, line: 38, baseType: !39, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !307, file: !308, line: 44, baseType: !39, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !307, file: !308, line: 46, baseType: !39, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !307, file: !308, line: 49, baseType: !39, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !307, file: !308, line: 51, baseType: !39, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !307, file: !308, line: 54, baseType: !39, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !307, file: !308, line: 56, baseType: !39, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !307, file: !308, line: 57, baseType: !39, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !307, file: !308, line: 59, baseType: !39, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !307, file: !308, line: 60, baseType: !39, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !307, file: !308, line: 62, baseType: !39, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !307, file: !308, line: 64, baseType: !39, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !307, file: !308, line: 67, baseType: !39, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !307, file: !308, line: 69, baseType: !39, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !307, file: !308, line: 71, baseType: !39, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !307, file: !308, line: 74, baseType: !39, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !307, file: !308, line: 75, baseType: !39, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !307, file: !308, line: 77, baseType: !39, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !307, file: !308, line: 107, baseType: !39, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !307, file: !308, line: 110, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !79, line: 31, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !305}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !307, file: !308, line: 117, baseType: !69, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !307, file: !308, line: 119, baseType: !210, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !307, file: !308, line: 121, baseType: !340, size: 160, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !341, line: 20, baseType: !342)
!341 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !341, line: 22, size: 160, elements: !343)
!343 = !{!344, !346, !348, !349, !350, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !342, file: !341, line: 23, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !341, line: 16, baseType: !69)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !342, file: !341, line: 24, baseType: !347, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !342, file: !341, line: 25, baseType: !347, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !342, file: !341, line: 26, baseType: !347, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !342, file: !341, line: 27, baseType: !31, size: 8, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !341, line: 28, baseType: !31, size: 8, offset: 136)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !307, file: !308, line: 124, baseType: !353, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !354, line: 16, baseType: !355)
!354 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !354, line: 18, size: 64, elements: !356)
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !354, line: 19, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !354, line: 20, baseType: !358, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !300, file: !301, line: 124, baseType: !305, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !300, file: !301, line: 126, baseType: !362, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !363, line: 17, baseType: !61)
!363 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !300, file: !301, line: 128, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !366, line: 19, baseType: !367)
!366 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !298, !30, !37}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 135, baseType: !61)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !300, file: !301, line: 129, baseType: !372, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !366, line: 22, baseType: !367)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !300, file: !301, line: 130, baseType: !374, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !366, line: 20, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!370, !298, !136, !60}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !300, file: !301, line: 131, baseType: !379, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !366, line: 23, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{!136, !298, !136, !60}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !300, file: !301, line: 133, baseType: !384, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !301, line: 16, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !301, line: 18, size: 960, elements: !387)
!387 = !{!388, !389, !401, !403, !404, !405, !406, !407, !408, !409, !414, !415, !416, !417, !418, !419, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !386, file: !301, line: 19, baseType: !362, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !386, file: !301, line: 21, baseType: !390, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !392, line: 297, size: 128, elements: !393)
!392 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!393 = !{!394, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !391, file: !392, line: 298, baseType: !395, size: 16)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !38, line: 409, baseType: !396)
!396 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !391, file: !392, line: 299, baseType: !398, size: 112, offset: 16)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 112, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 14)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !386, file: !301, line: 22, baseType: !402, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !38, line: 404, baseType: !39)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !386, file: !301, line: 23, baseType: !37, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !386, file: !301, line: 24, baseType: !45, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !386, file: !301, line: 26, baseType: !61, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !386, file: !301, line: 28, baseType: !61, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !386, file: !301, line: 29, baseType: !61, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !386, file: !301, line: 30, baseType: !61, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !386, file: !301, line: 38, baseType: !410, size: 32, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !79, line: 32, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !298}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !386, file: !301, line: 40, baseType: !27, size: 32, offset: 352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !386, file: !301, line: 42, baseType: !211, size: 320, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !386, file: !301, line: 43, baseType: !210, size: 32, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !386, file: !301, line: 45, baseType: !37, size: 32, offset: 736)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !386, file: !301, line: 47, baseType: !37, size: 32, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !386, file: !301, line: 49, baseType: !420, size: 32, offset: 800)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !421, line: 16, baseType: !345)
!421 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !386, file: !301, line: 51, baseType: !384, size: 32, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !386, file: !301, line: 52, baseType: !298, size: 32, offset: 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !386, file: !301, line: 54, baseType: !69, size: 32, offset: 896)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !386, file: !301, line: 56, baseType: !39, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !386, file: !301, line: 57, baseType: !39, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !386, file: !301, line: 58, baseType: !39, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !386, file: !301, line: 60, baseType: !39, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !386, file: !301, line: 61, baseType: !39, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !386, file: !301, line: 62, baseType: !39, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !386, file: !301, line: 63, baseType: !39, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !386, file: !301, line: 64, baseType: !39, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !386, file: !301, line: 65, baseType: !39, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !386, file: !301, line: 66, baseType: !39, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !386, file: !301, line: 67, baseType: !39, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !386, file: !301, line: 70, baseType: !39, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !386, file: !301, line: 72, baseType: !39, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !386, file: !301, line: 73, baseType: !39, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !386, file: !301, line: 74, baseType: !39, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !386, file: !301, line: 76, baseType: !39, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !386, file: !301, line: 77, baseType: !39, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !386, file: !301, line: 78, baseType: !39, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !300, file: !301, line: 135, baseType: !60, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !300, file: !301, line: 137, baseType: !210, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !300, file: !301, line: 139, baseType: !120, size: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !301, line: 141, baseType: !61, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !300, file: !301, line: 143, baseType: !390, size: 32, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !300, file: !301, line: 144, baseType: !402, size: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !300, file: !301, line: 145, baseType: !45, size: 64, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !300, file: !301, line: 147, baseType: !45, size: 64, offset: 544)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !300, file: !301, line: 148, baseType: !452, size: 16, offset: 608)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !453, line: 12, baseType: !454)
!453 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !38, line: 186, baseType: !396)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !300, file: !301, line: 154, baseType: !390, size: 32, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !300, file: !301, line: 155, baseType: !402, size: 32, offset: 672)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !300, file: !301, line: 157, baseType: !142, size: 32, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !300, file: !301, line: 159, baseType: !353, size: 64, offset: 736)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !300, file: !301, line: 161, baseType: !229, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !300, file: !301, line: 163, baseType: !69, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !300, file: !301, line: 165, baseType: !39, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !300, file: !301, line: 167, baseType: !39, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !300, file: !301, line: 169, baseType: !39, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !300, file: !301, line: 170, baseType: !39, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !300, file: !301, line: 171, baseType: !39, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !300, file: !301, line: 173, baseType: !39, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !300, file: !301, line: 174, baseType: !39, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !300, file: !301, line: 175, baseType: !39, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !300, file: !301, line: 176, baseType: !39, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !300, file: !301, line: 178, baseType: !39, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !300, file: !301, line: 179, baseType: !39, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !300, file: !301, line: 180, baseType: !39, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !300, file: !301, line: 181, baseType: !39, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !300, file: !301, line: 183, baseType: !39, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !286, file: !287, line: 48, baseType: !298, size: 32, offset: 480)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !286, file: !287, line: 49, baseType: !69, size: 32, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !286, file: !287, line: 51, baseType: !478, size: 32, offset: 544)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !286, file: !287, line: 52, baseType: !69, size: 32, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !286, file: !287, line: 53, baseType: !69, size: 32, offset: 608)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !286, file: !287, line: 55, baseType: !353, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !286, file: !287, line: 56, baseType: !69, size: 32, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !286, file: !287, line: 58, baseType: !111, size: 160, offset: 736)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !286, file: !287, line: 59, baseType: !111, size: 160, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !286, file: !287, line: 61, baseType: !111, size: 160, offset: 1056)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !286, file: !287, line: 62, baseType: !488, size: 96, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !341, line: 32, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !341, line: 37, size: 96, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !489, file: !341, line: 38, baseType: !347, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !489, file: !341, line: 39, baseType: !347, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !489, file: !341, line: 40, baseType: !494, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !341, line: 34, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !347, !347, !347}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !286, file: !287, line: 63, baseType: !340, size: 160, offset: 1312)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !286, file: !287, line: 65, baseType: !500, size: 224, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !501, line: 31, baseType: !502)
!501 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 25, size: 224, elements: !503)
!503 = !{!504, !512, !513, !514, !515}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !502, file: !501, line: 26, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !501, line: 16, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !501, line: 18, size: 96, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !507, file: !501, line: 19, baseType: !27, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !507, file: !501, line: 20, baseType: !69, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !501, line: 21, baseType: !505, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !502, file: !501, line: 27, baseType: !506, size: 96, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !502, file: !501, line: 28, baseType: !37, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !502, file: !501, line: 29, baseType: !69, size: 32, offset: 160)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !502, file: !501, line: 30, baseType: !120, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !286, file: !287, line: 66, baseType: !500, size: 224, offset: 1696)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !286, file: !287, line: 68, baseType: !69, size: 32, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !286, file: !287, line: 69, baseType: !69, size: 32, offset: 1952)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !286, file: !287, line: 71, baseType: !298, size: 32, offset: 1984)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !286, file: !287, line: 72, baseType: !305, size: 32, offset: 2016)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !286, file: !287, line: 73, baseType: !305, size: 32, offset: 2048)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !286, file: !287, line: 75, baseType: !284, size: 32, offset: 2080)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !286, file: !287, line: 77, baseType: !45, size: 64, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !286, file: !287, line: 78, baseType: !45, size: 64, offset: 2176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !286, file: !287, line: 79, baseType: !45, size: 64, offset: 2240)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !286, file: !287, line: 80, baseType: !45, size: 64, offset: 2304)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !286, file: !287, line: 81, baseType: !45, size: 64, offset: 2368)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !286, file: !287, line: 82, baseType: !45, size: 64, offset: 2432)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !106, file: !96, line: 121, baseType: !120, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !106, file: !96, line: 122, baseType: !120, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !106, file: !96, line: 123, baseType: !532, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !96, line: 103, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 98, size: 1344, elements: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !534, file: !96, line: 99, baseType: !156, size: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !534, file: !96, line: 100, baseType: !142, size: 32, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !534, file: !96, line: 101, baseType: !142, size: 32, offset: 1248)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !534, file: !96, line: 102, baseType: !69, size: 32, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !106, file: !96, line: 124, baseType: !210, size: 32, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !106, file: !96, line: 126, baseType: !27, size: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !106, file: !96, line: 127, baseType: !69, size: 32, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !106, file: !96, line: 128, baseType: !69, size: 32, offset: 288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !106, file: !96, line: 130, baseType: !545, size: 32, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !96, line: 112, baseType: !101)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !106, file: !96, line: 131, baseType: !86, size: 32, offset: 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !95, file: !96, line: 81, baseType: !69, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !95, file: !96, line: 82, baseType: !69, size: 32, offset: 160)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !95, file: !96, line: 83, baseType: !27, size: 32, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !81, line: 236, baseType: !69, size: 32, offset: 288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !80, file: !81, line: 238, baseType: !552, size: 32, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{!73, !210}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !80, file: !81, line: 240, baseType: !556, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DISubroutineType(types: !558)
!558 = !{!73, !284}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !80, file: !81, line: 242, baseType: !556, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !80, file: !81, line: 243, baseType: !556, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !80, file: !81, line: 244, baseType: !562, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !284}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !80, file: !81, line: 245, baseType: !562, size: 32, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !80, file: !81, line: 247, baseType: !562, size: 32, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !80, file: !81, line: 249, baseType: !71, size: 32, offset: 544)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !80, file: !81, line: 250, baseType: !71, size: 32, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !80, file: !81, line: 251, baseType: !71, size: 32, offset: 608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !80, file: !81, line: 252, baseType: !71, size: 32, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !80, file: !81, line: 253, baseType: !71, size: 32, offset: 672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !80, file: !81, line: 254, baseType: !71, size: 32, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !80, file: !81, line: 255, baseType: !71, size: 32, offset: 736)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !80, file: !81, line: 256, baseType: !71, size: 32, offset: 768)
!575 = !DIGlobalVariableExpression(var: !576)
!576 = distinct !DIGlobalVariable(name: "head", scope: !577, file: !3, line: 847, type: !1789, isLocal: true, isDefinition: true)
!577 = distinct !DISubprogram(name: "ngx_http_autoindex_xml", scope: !3, file: !3, line: 838, type: !578, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1811)
!578 = !DISubroutineType(types: !579)
!579 = !{!142, !580, !110}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !582, line: 16, baseType: !583)
!582 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !584, line: 364, size: 5376, elements: !585)
!584 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!585 = !{!586, !588, !589, !590, !591, !592, !593, !598, !599, !812, !1372, !1373, !1374, !1375, !1414, !1444, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1489, !1500, !1507, !1508, !1510, !1511, !1524, !1525, !1526, !1527, !1528, !1529, !1707, !1711, !1716, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !583, file: !584, line: 365, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !38, line: 191, baseType: !39)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !583, file: !584, line: 367, baseType: !298, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !583, file: !584, line: 369, baseType: !26, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !583, file: !584, line: 370, baseType: !26, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !583, file: !584, line: 371, baseType: !26, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !583, file: !584, line: 372, baseType: !26, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !583, file: !584, line: 374, baseType: !594, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !584, line: 361, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !580}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !583, file: !584, line: 375, baseType: !594, size: 32, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !583, file: !584, line: 378, baseType: !600, size: 32, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !582, line: 18, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !603, line: 65, size: 3008, elements: !604)
!603 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!604 = !{!605, !606, !607, !608, !612, !613, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !770, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !602, file: !603, line: 66, baseType: !156, size: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !602, file: !603, line: 67, baseType: !111, size: 160, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !602, file: !603, line: 68, baseType: !587, size: 32, offset: 1376)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !602, file: !603, line: 69, baseType: !609, size: 128, offset: 1408)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 16)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !602, file: !603, line: 70, baseType: !609, size: 128, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !602, file: !603, line: 72, baseType: !614, size: 32, offset: 1664)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !162, line: 18, baseType: !173)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !602, file: !603, line: 73, baseType: !57, size: 32, offset: 1696)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !602, file: !603, line: 74, baseType: !57, size: 32, offset: 1728)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !602, file: !603, line: 75, baseType: !57, size: 32, offset: 1760)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !602, file: !603, line: 76, baseType: !57, size: 32, offset: 1792)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !602, file: !603, line: 77, baseType: !57, size: 32, offset: 1824)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !602, file: !603, line: 79, baseType: !45, size: 64, offset: 1856)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !602, file: !603, line: 80, baseType: !45, size: 64, offset: 1920)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !602, file: !603, line: 81, baseType: !609, size: 128, offset: 1984)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !602, file: !603, line: 83, baseType: !37, size: 32, offset: 2112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !602, file: !603, line: 84, baseType: !37, size: 32, offset: 2144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !602, file: !603, line: 85, baseType: !60, size: 32, offset: 2176)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !602, file: !603, line: 86, baseType: !60, size: 32, offset: 2208)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !602, file: !603, line: 88, baseType: !69, size: 32, offset: 2240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !602, file: !603, line: 89, baseType: !69, size: 32, offset: 2272)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !602, file: !603, line: 90, baseType: !69, size: 32, offset: 2304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !602, file: !603, line: 91, baseType: !69, size: 32, offset: 2336)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !602, file: !603, line: 93, baseType: !142, size: 32, offset: 2368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !602, file: !603, line: 95, baseType: !633, size: 32, offset: 2400)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !582, line: 19, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !603, line: 157, size: 544, elements: !636)
!636 = !{!637, !652, !713, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !769}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !635, file: !603, line: 158, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !603, line: 154, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 145, size: 480, elements: !641)
!641 = !{!642, !643, !644, !645, !648, !649, !650, !651}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !640, file: !603, line: 146, baseType: !488, size: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !640, file: !603, line: 147, baseType: !340, size: 160, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !640, file: !603, line: 148, baseType: !353, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !640, file: !603, line: 149, baseType: !646, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !230, line: 106, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !640, file: !603, line: 150, baseType: !646, size: 32, offset: 352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !640, file: !603, line: 151, baseType: !60, size: 32, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !640, file: !603, line: 152, baseType: !69, size: 32, offset: 416)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !640, file: !603, line: 153, baseType: !69, size: 32, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !635, file: !603, line: 159, baseType: !653, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !655, line: 59, baseType: !656)
!655 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 34, size: 800, elements: !657)
!657 = !{!658, !665, !666, !667, !675, !676, !677, !686, !687, !688, !689, !708, !709, !710, !711, !712}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !656, file: !655, line: 35, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !660, line: 21, baseType: !661)
!660 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 16, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !661, file: !660, line: 17, baseType: !646, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !661, file: !660, line: 19, baseType: !646, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !656, file: !655, line: 37, baseType: !37, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !656, file: !655, line: 38, baseType: !37, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !656, file: !655, line: 40, baseType: !668, size: 32, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !655, line: 16, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !655, line: 18, size: 96, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !670, file: !655, line: 19, baseType: !71, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !655, line: 20, baseType: !668, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !655, line: 21, baseType: !71, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !656, file: !655, line: 41, baseType: !668, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !656, file: !655, line: 42, baseType: !669, size: 96, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !656, file: !655, line: 44, baseType: !678, size: 32, offset: 288)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !655, line: 31, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 25, size: 128, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !680, file: !655, line: 26, baseType: !69, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !680, file: !655, line: 27, baseType: !69, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !680, file: !655, line: 29, baseType: !69, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !680, file: !655, line: 30, baseType: !69, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !656, file: !655, line: 45, baseType: !69, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !656, file: !655, line: 47, baseType: !30, size: 32, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !656, file: !655, line: 48, baseType: !30, size: 32, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !656, file: !655, line: 50, baseType: !690, size: 256, offset: 416)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !660, line: 37, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 24, size: 256, elements: !692)
!692 = !{!693, !695, !696, !697, !707}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !691, file: !660, line: 26, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !691, file: !660, line: 28, baseType: !694, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !691, file: !660, line: 29, baseType: !69, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !691, file: !660, line: 30, baseType: !698, size: 128, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !699, line: 19, baseType: !700)
!699 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !699, line: 17, size: 128, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !700, file: !699, line: 18, baseType: !703, size: 128)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 128, elements: !705)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!705 = !{!706}
!706 = !DISubrange(count: 4)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !691, file: !660, line: 36, baseType: !69, size: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !656, file: !655, line: 52, baseType: !30, size: 32, offset: 672)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !656, file: !655, line: 53, baseType: !31, size: 8, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !656, file: !655, line: 55, baseType: !39, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !656, file: !655, line: 57, baseType: !27, size: 32, offset: 736)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !656, file: !655, line: 58, baseType: !27, size: 32, offset: 768)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !635, file: !603, line: 161, baseType: !714, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !158, line: 62, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 50, size: 384, elements: !717)
!717 = !{!718, !719, !720, !722, !727, !729, !731, !732, !733}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !158, line: 51, baseType: !45, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !716, file: !158, line: 52, baseType: !37, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !716, file: !158, line: 53, baseType: !721, size: 96, offset: 96)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !205)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !716, file: !158, line: 55, baseType: !723, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !158, line: 45, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!420, !27}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !716, file: !158, line: 56, baseType: !728, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !158, line: 46, baseType: !724)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !716, file: !158, line: 57, baseType: !730, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !158, line: 47, baseType: !277)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !158, line: 58, baseType: !27, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !716, file: !158, line: 60, baseType: !30, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !716, file: !158, line: 61, baseType: !69, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !635, file: !603, line: 163, baseType: !60, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !635, file: !603, line: 164, baseType: !37, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !635, file: !603, line: 166, baseType: !57, size: 32, offset: 160)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !635, file: !603, line: 168, baseType: !57, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !635, file: !603, line: 170, baseType: !69, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !635, file: !603, line: 171, baseType: !69, size: 32, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !635, file: !603, line: 172, baseType: !420, size: 32, offset: 288)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !635, file: !603, line: 173, baseType: !420, size: 32, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !635, file: !603, line: 174, baseType: !420, size: 32, offset: 352)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !635, file: !603, line: 176, baseType: !69, size: 32, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !635, file: !603, line: 177, baseType: !420, size: 32, offset: 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !635, file: !603, line: 178, baseType: !420, size: 32, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !635, file: !603, line: 180, baseType: !747, size: 32, offset: 480)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !287, line: 25, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !287, line: 29, size: 320, elements: !750)
!750 = !{!751, !752, !762, !767, !768}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !287, line: 30, baseType: !27, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !749, file: !287, line: 31, baseType: !753, size: 192, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !754, line: 22, baseType: !755)
!754 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 16, size: 192, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !755, file: !754, line: 17, baseType: !30, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !754, line: 18, baseType: !37, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !754, line: 19, baseType: !45, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !755, file: !754, line: 20, baseType: !210, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !755, file: !754, line: 21, baseType: !69, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !749, file: !287, line: 32, baseType: !763, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !287, line: 27, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!73, !747, !27}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !749, file: !287, line: 33, baseType: !27, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !749, file: !287, line: 34, baseType: !69, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !635, file: !603, line: 182, baseType: !69, size: 32, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !603, line: 96, baseType: !771, size: 32, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !603, line: 62, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 39, size: 576, elements: !774)
!774 = !{!775, !776, !777, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !773, file: !603, line: 40, baseType: !340, size: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !773, file: !603, line: 41, baseType: !353, size: 64, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !773, file: !603, line: 43, baseType: !778, size: 96, offset: 224)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 12)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !603, line: 46, baseType: !39, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !773, file: !603, line: 47, baseType: !39, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !773, file: !603, line: 48, baseType: !39, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !773, file: !603, line: 49, baseType: !39, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !773, file: !603, line: 50, baseType: !39, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !773, file: !603, line: 51, baseType: !39, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !773, file: !603, line: 52, baseType: !39, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !773, file: !603, line: 53, baseType: !39, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !773, file: !603, line: 56, baseType: !614, size: 32, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !773, file: !603, line: 57, baseType: !57, size: 32, offset: 416)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !773, file: !603, line: 58, baseType: !57, size: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !773, file: !603, line: 59, baseType: !37, size: 32, offset: 480)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !773, file: !603, line: 60, baseType: !60, size: 32, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !773, file: !603, line: 61, baseType: !420, size: 32, offset: 544)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !602, file: !603, line: 102, baseType: !420, size: 32, offset: 2464)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !602, file: !603, line: 103, baseType: !420, size: 32, offset: 2496)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !602, file: !603, line: 104, baseType: !420, size: 32, offset: 2528)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !602, file: !603, line: 105, baseType: !420, size: 32, offset: 2560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !602, file: !603, line: 107, baseType: !306, size: 384, offset: 2592)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !602, file: !603, line: 109, baseType: !39, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !602, file: !603, line: 110, baseType: !39, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !602, file: !603, line: 112, baseType: !39, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !602, file: !603, line: 113, baseType: !39, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !602, file: !603, line: 114, baseType: !39, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !602, file: !603, line: 115, baseType: !39, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !602, file: !603, line: 116, baseType: !39, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !602, file: !603, line: 117, baseType: !39, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !602, file: !603, line: 118, baseType: !39, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !602, file: !603, line: 119, baseType: !39, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !602, file: !603, line: 121, baseType: !39, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !602, file: !603, line: 122, baseType: !39, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !583, file: !584, line: 381, baseType: !813, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !582, line: 17, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !816, line: 313, size: 4096, elements: !817)
!816 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!817 = !{!818, !823, !824, !865, !944, !945, !967, !976, !1099, !1100, !1101, !1139, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1317, !1321, !1322, !1326, !1327, !1328, !1329, !1330, !1334, !1338, !1342, !1343, !1355, !1356, !1357, !1358, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !815, file: !816, line: 314, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !816, line: 309, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !580, !813}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !815, file: !816, line: 315, baseType: !819, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !815, file: !816, line: 317, baseType: !825, size: 480, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !826, line: 22, baseType: !827)
!826 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !826, line: 36, size: 480, elements: !828)
!828 = !{!829, !830, !831, !832, !834, !835, !836, !842, !847, !849, !850, !859, !860, !861, !862, !863, !864}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !827, file: !826, line: 37, baseType: !298, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !827, file: !826, line: 39, baseType: !390, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !827, file: !826, line: 40, baseType: !402, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !826, line: 41, baseType: !833, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !827, file: !826, line: 43, baseType: !69, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !827, file: !826, line: 44, baseType: !420, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !827, file: !826, line: 46, baseType: !837, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !826, line: 24, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!73, !841, !27}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !827, file: !826, line: 47, baseType: !843, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !826, line: 26, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !841, !27, !69}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !827, file: !826, line: 48, baseType: !848, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !826, line: 28, baseType: !844)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !827, file: !826, line: 49, baseType: !27, size: 32, offset: 288)
