; ModuleID = 'src/http/modules/ngx_http_map_module.c'
source_filename = "src/http/modules/ngx_http_map_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_map_module_ctx", scope: !2, file: !3, line: 76, type: !609, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !98)
!3 = !DIFile(filename: "src/http/modules/ngx_http_map_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !9, !12, !13, !41, !87, !88, !69, !91}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !8, line: 79, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 120, baseType: !11)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_wildcard_t", file: !15, line: 32, baseType: !16)
!15 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 29, size: 96, elements: !17)
!17 = !{!18, !40}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !16, file: !15, line: 30, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_t", file: !15, line: 26, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 23, size: 64, elements: !21)
!21 = !{!22, !39}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !20, file: !15, line: 24, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_elt_t", file: !15, line: 20, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 16, size: 64, elements: !27)
!27 = !{!28, !29, !33}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !26, file: !15, line: 17, baseType: !6, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !15, line: 18, baseType: !30, size: 16, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !31, line: 65, baseType: !32)
!31 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !15, line: 19, baseType: !34, size: 8, offset: 48)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !37)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !31, line: 64, baseType: !36)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !{!38}
!38 = !DISubrange(count: 1)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !20, file: !15, line: 25, baseType: !7, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !16, file: !15, line: 31, baseType: !6, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_map_ctx_t", file: !3, line: 39, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 34, size: 352, elements: !44)
!44 = !{!45, !57, !74, !86}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !43, file: !3, line: 35, baseType: !46, size: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_map_t", file: !47, line: 99, baseType: !48)
!47 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 93, size: 128, elements: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !48, file: !47, line: 94, baseType: !51, size: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_combined_t", file: !15, line: 49, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 45, size: 128, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !52, file: !15, line: 46, baseType: !19, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "wc_head", scope: !52, file: !15, line: 47, baseType: !13, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "wc_tail", scope: !52, file: !15, line: 48, baseType: !13, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !43, file: !3, line: 36, baseType: !58, size: 160, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_complex_value_t", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 66, size: 160, elements: !61)
!61 = !{!62, !70, !72, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !60, file: !59, line: 67, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !64, line: 19, baseType: !65)
!64 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 16, size: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !64, line: 17, baseType: !12, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 18, baseType: !69, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flushes", scope: !60, file: !59, line: 68, baseType: !71, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !60, file: !59, line: 69, baseType: !6, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !60, file: !59, line: 70, baseType: !6, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !43, file: !3, line: 37, baseType: !75, size: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !47, line: 17, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !64, line: 37, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 28, size: 64, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !78, file: !64, line: 29, baseType: !11, size: 28, flags: DIFlagBitField, extraData: i64 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !78, file: !64, line: 31, baseType: !11, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !78, file: !64, line: 32, baseType: !11, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !78, file: !64, line: 33, baseType: !11, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !78, file: !64, line: 34, baseType: !11, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !64, line: 36, baseType: !69, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hostnames", scope: !43, file: !3, line: 38, baseType: !7, size: 32, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_t", file: !15, line: 39, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 35, size: 128, elements: !94)
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !93, file: !15, line: 36, baseType: !63, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !93, file: !15, line: 37, baseType: !7, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !93, file: !15, line: 38, baseType: !6, size: 32, offset: 96)
!98 = !{!99, !0, !604}
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "ngx_http_map_module", scope: !2, file: !3, line: 91, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !102, line: 15, baseType: !103)
!102 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !104, line: 222, size: 800, elements: !105)
!104 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!105 = !{!106, !107, !108, !110, !111, !112, !113, !114, !115, !577, !578, !584, !588, !589, !590, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !103, file: !104, line: 223, baseType: !7, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !103, file: !104, line: 224, baseType: !7, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !104, line: 226, baseType: !109, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !103, file: !104, line: 228, baseType: !7, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !103, file: !104, line: 229, baseType: !7, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !103, file: !104, line: 231, baseType: !7, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !103, file: !104, line: 232, baseType: !88, size: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !103, file: !104, line: 234, baseType: !6, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !103, file: !104, line: 235, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !102, line: 22, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !119, line: 77, size: 224, elements: !120)
!119 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!120 = !{!121, !122, !123, !574, !575, !576}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !119, line: 78, baseType: !63, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !119, line: 79, baseType: !7, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !118, file: !119, line: 80, baseType: !124, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!109, !127, !116, !6}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !102, line: 16, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !119, line: 116, size: 384, elements: !130)
!130 = !{!131, !132, !310, !556, !557, !558, !567, !568, !569, !570, !571, !573}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !119, line: 117, baseType: !109, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !129, file: !119, line: 118, baseType: !133, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !135, line: 22, baseType: !136)
!135 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 16, size: 160, elements: !137)
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !136, file: !135, line: 17, baseType: !6, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !136, file: !135, line: 18, baseType: !7, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !136, file: !135, line: 19, baseType: !12, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !136, file: !135, line: 20, baseType: !7, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !136, file: !135, line: 21, baseType: !143, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !102, line: 18, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !146, line: 57, size: 320, elements: !147)
!146 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!147 = !{!148, !156, !157, !158, !290, !297, !309}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !145, file: !146, line: 58, baseType: !149, size: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !146, line: 54, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 49, size: 128, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !150, file: !146, line: 50, baseType: !69, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !150, file: !146, line: 51, baseType: !69, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 52, baseType: !143, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !150, file: !146, line: 53, baseType: !7, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !145, file: !146, line: 59, baseType: !12, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !145, file: !146, line: 60, baseType: !143, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !145, file: !146, line: 61, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !102, line: 19, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !162, line: 59, size: 64, elements: !163)
!162 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !{!164, !289}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !161, file: !162, line: 60, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !162, line: 18, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !162, line: 20, size: 352, elements: !168)
!168 = !{!169, !170, !171, !174, !175, !176, !177, !179, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !167, file: !162, line: 21, baseType: !69, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !167, file: !162, line: 22, baseType: !69, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !167, file: !162, line: 23, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !10, line: 222, baseType: !173)
!173 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !167, file: !162, line: 24, baseType: !172, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !167, file: !162, line: 26, baseType: !69, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !167, file: !162, line: 27, baseType: !69, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !167, file: !162, line: 28, baseType: !178, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !162, line: 16, baseType: !6)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !167, file: !162, line: 29, baseType: !180, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !102, line: 23, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !183, line: 16, size: 1216, elements: !184)
!183 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!184 = !{!185, !188, !189, !234, !235, !236, !274, !275}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !182, file: !183, line: 17, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !187, line: 16, baseType: !173)
!187 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 18, baseType: !63, size: 64, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !182, file: !183, line: 19, baseType: !190, size: 960, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !187, line: 17, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !192, line: 4, size: 960, elements: !193)
!192 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!193 = !{!194, !196, !197, !199, !200, !202, !203, !205, !207, !209, !210, !211, !212, !213, !214, !217, !218, !220, !221, !227, !228, !229}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !191, file: !192, line: 6, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !10, line: 232, baseType: !11)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !191, file: !192, line: 7, baseType: !195, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !191, file: !192, line: 8, baseType: !198, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !10, line: 227, baseType: !11)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !191, file: !192, line: 9, baseType: !198, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !191, file: !192, line: 10, baseType: !201, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !10, line: 217, baseType: !11)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !191, file: !192, line: 11, baseType: !201, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !191, file: !192, line: 13, baseType: !204, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !10, line: 212, baseType: !11)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !191, file: !192, line: 14, baseType: !206, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !10, line: 304, baseType: !11)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !191, file: !192, line: 15, baseType: !208, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !10, line: 309, baseType: !11)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !191, file: !192, line: 16, baseType: !11, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !191, file: !192, line: 17, baseType: !195, size: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !191, file: !192, line: 18, baseType: !195, size: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !191, file: !192, line: 19, baseType: !172, size: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !191, file: !192, line: 20, baseType: !172, size: 32, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !191, file: !192, line: 21, baseType: !215, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !10, line: 237, baseType: !216)
!216 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !191, file: !192, line: 22, baseType: !215, size: 32, offset: 480)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !191, file: !192, line: 23, baseType: !219, size: 32, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !10, line: 242, baseType: !173)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !191, file: !192, line: 24, baseType: !219, size: 32, offset: 544)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !191, file: !192, line: 26, baseType: !222, size: 64, offset: 576)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !10, line: 288, size: 64, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !222, file: !10, line: 288, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !216)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !222, file: !10, line: 288, baseType: !216, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !191, file: !192, line: 27, baseType: !222, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !191, file: !192, line: 28, baseType: !222, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !191, file: !192, line: 29, baseType: !230, size: 192, offset: 768)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 192, elements: !232)
!231 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !182, file: !183, line: 21, baseType: !172, size: 32, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !182, file: !183, line: 22, baseType: !172, size: 32, offset: 1120)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !182, file: !183, line: 24, baseType: !237, size: 32, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !102, line: 20, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !240, line: 50, size: 320, elements: !241)
!240 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!241 = !{!242, !243, !255, !259, !260, !265, !266, !271, !272, !273}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !239, file: !240, line: 51, baseType: !7, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !239, file: !240, line: 52, baseType: !244, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !102, line: 21, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !119, line: 89, size: 160, elements: !247)
!247 = !{!248, !249, !250, !254}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !246, file: !119, line: 90, baseType: !186, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !119, line: 91, baseType: !63, size: 64, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !246, file: !119, line: 93, baseType: !251, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !244, !237}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !119, line: 94, baseType: !6, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !239, file: !240, line: 54, baseType: !256, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !257, line: 98, baseType: !258)
!257 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!258 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !239, file: !240, line: 56, baseType: !225, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !239, file: !240, line: 58, baseType: !261, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !240, line: 45, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!69, !237, !69, !12}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !240, line: 59, baseType: !6, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !239, file: !240, line: 61, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !240, line: 46, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !237, !7, !69, !12}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !239, file: !240, line: 62, baseType: !6, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !239, file: !240, line: 70, baseType: !109, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !240, line: 72, baseType: !237, size: 32, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !182, file: !183, line: 37, baseType: !11, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !182, file: !183, line: 38, baseType: !11, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !167, file: !162, line: 30, baseType: !165, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !167, file: !162, line: 34, baseType: !11, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !167, file: !162, line: 40, baseType: !11, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !167, file: !162, line: 43, baseType: !11, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !167, file: !162, line: 45, baseType: !11, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !167, file: !162, line: 46, baseType: !11, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !167, file: !162, line: 47, baseType: !11, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !167, file: !162, line: 48, baseType: !11, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !167, file: !162, line: 49, baseType: !11, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !167, file: !162, line: 50, baseType: !11, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !167, file: !162, line: 52, baseType: !11, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !167, file: !162, line: 53, baseType: !11, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !167, file: !162, line: 55, baseType: !173, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !162, line: 61, baseType: !159, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !145, file: !146, line: 62, baseType: !291, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !146, line: 41, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !146, line: 43, size: 64, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !146, line: 44, baseType: !291, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !293, file: !146, line: 45, baseType: !6, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !145, file: !146, line: 63, baseType: !298, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !146, line: 32, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !146, line: 34, size: 96, elements: !301)
!301 = !{!302, !307, !308}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !300, file: !146, line: 35, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !146, line: 30, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !6}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !146, line: 36, baseType: !6, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !146, line: 37, baseType: !298, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !145, file: !146, line: 64, baseType: !237, size: 32, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !129, file: !119, line: 120, baseType: !311, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !102, line: 17, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !314, line: 38, size: 2496, elements: !315)
!314 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!315 = !{!316, !320, !321, !322, !323, !324, !502, !503, !504, !507, !508, !509, !510, !511, !512, !513, !514, !525, !526, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !313, file: !314, line: 39, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !313, file: !314, line: 40, baseType: !143, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !313, file: !314, line: 42, baseType: !237, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !313, file: !314, line: 43, baseType: !238, size: 320, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !313, file: !314, line: 45, baseType: !7, size: 32, offset: 416)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !313, file: !314, line: 47, baseType: !325, size: 32, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !102, line: 26, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !329, line: 121, size: 896, elements: !330)
!329 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!330 = !{!331, !332, !388, !389, !392, !399, !401, !406, !411, !470, !471, !472, !473, !474, !475, !476, !477, !478, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !329, line: 122, baseType: !6, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !328, file: !329, line: 123, baseType: !333, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !102, line: 24, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !336, line: 30, size: 384, elements: !337)
!336 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !365, !366, !367, !380}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !336, line: 31, baseType: !6, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !335, file: !336, line: 33, baseType: !11, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !335, file: !336, line: 35, baseType: !11, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !335, file: !336, line: 38, baseType: !11, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !335, file: !336, line: 44, baseType: !11, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !335, file: !336, line: 46, baseType: !11, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !335, file: !336, line: 49, baseType: !11, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !335, file: !336, line: 51, baseType: !11, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !335, file: !336, line: 54, baseType: !11, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !335, file: !336, line: 56, baseType: !11, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !335, file: !336, line: 57, baseType: !11, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !335, file: !336, line: 59, baseType: !11, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !335, file: !336, line: 60, baseType: !11, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !335, file: !336, line: 62, baseType: !11, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !335, file: !336, line: 64, baseType: !11, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !335, file: !336, line: 67, baseType: !11, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !335, file: !336, line: 69, baseType: !11, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !335, file: !336, line: 71, baseType: !11, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !335, file: !336, line: 74, baseType: !11, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !335, file: !336, line: 75, baseType: !11, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !335, file: !336, line: 77, baseType: !11, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !335, file: !336, line: 107, baseType: !11, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !335, file: !336, line: 110, baseType: !361, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !102, line: 31, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !333}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !335, file: !336, line: 117, baseType: !7, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !335, file: !336, line: 119, baseType: !237, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !335, file: !336, line: 121, baseType: !368, size: 160, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !369, line: 20, baseType: !370)
!369 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !369, line: 22, size: 160, elements: !371)
!371 = !{!372, !374, !376, !377, !378, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !370, file: !369, line: 23, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !369, line: 16, baseType: !7)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !370, file: !369, line: 24, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !370, file: !369, line: 25, baseType: !375, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !370, file: !369, line: 26, baseType: !375, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !370, file: !369, line: 27, baseType: !35, size: 8, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !369, line: 28, baseType: !35, size: 8, offset: 136)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !335, file: !336, line: 124, baseType: !381, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !382, line: 18, size: 64, elements: !384)
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !382, line: 19, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !382, line: 20, baseType: !386, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !328, file: !329, line: 124, baseType: !333, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !328, file: !329, line: 126, baseType: !390, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !391, line: 17, baseType: !173)
!391 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!392 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !328, file: !329, line: 128, baseType: !393, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !394, line: 19, baseType: !395)
!394 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !326, !69, !12}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !10, line: 135, baseType: !173)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !328, file: !329, line: 129, baseType: !400, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !394, line: 22, baseType: !395)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !328, file: !329, line: 130, baseType: !402, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !394, line: 20, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{!398, !326, !159, !172}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !328, file: !329, line: 131, baseType: !407, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !394, line: 23, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DISubroutineType(types: !410)
!410 = !{!159, !326, !159, !172}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !328, file: !329, line: 133, baseType: !412, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !329, line: 16, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !329, line: 18, size: 960, elements: !415)
!415 = !{!416, !417, !428, !430, !431, !432, !433, !434, !435, !436, !441, !442, !443, !444, !445, !446, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !414, file: !329, line: 19, baseType: !390, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !414, file: !329, line: 21, baseType: !418, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !420, line: 297, size: 128, elements: !421)
!420 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!421 = !{!422, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !419, file: !420, line: 298, baseType: !423, size: 16)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !10, line: 409, baseType: !32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !419, file: !420, line: 299, baseType: !425, size: 112, offset: 16)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 112, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 14)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !414, file: !329, line: 22, baseType: !429, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !10, line: 404, baseType: !11)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !414, file: !329, line: 23, baseType: !12, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !414, file: !329, line: 24, baseType: !63, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !329, line: 26, baseType: !173, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !414, file: !329, line: 28, baseType: !173, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !414, file: !329, line: 29, baseType: !173, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !414, file: !329, line: 30, baseType: !173, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !414, file: !329, line: 38, baseType: !437, size: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !102, line: 32, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !326}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !414, file: !329, line: 40, baseType: !6, size: 32, offset: 352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !414, file: !329, line: 42, baseType: !238, size: 320, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !414, file: !329, line: 43, baseType: !237, size: 32, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !414, file: !329, line: 45, baseType: !12, size: 32, offset: 736)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !414, file: !329, line: 47, baseType: !12, size: 32, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !414, file: !329, line: 49, baseType: !447, size: 32, offset: 800)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !448, line: 16, baseType: !373)
!448 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!449 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !414, file: !329, line: 51, baseType: !412, size: 32, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !414, file: !329, line: 52, baseType: !326, size: 32, offset: 864)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !414, file: !329, line: 54, baseType: !7, size: 32, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !414, file: !329, line: 56, baseType: !11, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !414, file: !329, line: 57, baseType: !11, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !414, file: !329, line: 58, baseType: !11, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !414, file: !329, line: 60, baseType: !11, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !414, file: !329, line: 61, baseType: !11, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !414, file: !329, line: 62, baseType: !11, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !414, file: !329, line: 63, baseType: !11, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !414, file: !329, line: 64, baseType: !11, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !414, file: !329, line: 65, baseType: !11, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !414, file: !329, line: 66, baseType: !11, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !414, file: !329, line: 67, baseType: !11, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !414, file: !329, line: 70, baseType: !11, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !414, file: !329, line: 72, baseType: !11, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !414, file: !329, line: 73, baseType: !11, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !414, file: !329, line: 74, baseType: !11, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !414, file: !329, line: 76, baseType: !11, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !414, file: !329, line: 77, baseType: !11, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !414, file: !329, line: 78, baseType: !11, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !328, file: !329, line: 135, baseType: !172, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !328, file: !329, line: 137, baseType: !237, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !328, file: !329, line: 139, baseType: !143, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !329, line: 141, baseType: !173, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !328, file: !329, line: 143, baseType: !418, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !328, file: !329, line: 144, baseType: !429, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !328, file: !329, line: 145, baseType: !63, size: 64, offset: 480)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !328, file: !329, line: 147, baseType: !63, size: 64, offset: 544)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !328, file: !329, line: 148, baseType: !479, size: 16, offset: 608)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !480, line: 12, baseType: !481)
!480 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 186, baseType: !32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !328, file: !329, line: 154, baseType: !418, size: 32, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !328, file: !329, line: 155, baseType: !429, size: 32, offset: 672)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !328, file: !329, line: 157, baseType: !165, size: 32, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !328, file: !329, line: 159, baseType: !381, size: 64, offset: 736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !328, file: !329, line: 161, baseType: !256, size: 32, offset: 800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !328, file: !329, line: 163, baseType: !7, size: 32, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !328, file: !329, line: 165, baseType: !11, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !328, file: !329, line: 167, baseType: !11, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !328, file: !329, line: 169, baseType: !11, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !328, file: !329, line: 170, baseType: !11, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !328, file: !329, line: 171, baseType: !11, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !328, file: !329, line: 173, baseType: !11, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !328, file: !329, line: 174, baseType: !11, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !328, file: !329, line: 175, baseType: !11, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !328, file: !329, line: 176, baseType: !11, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !328, file: !329, line: 178, baseType: !11, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !328, file: !329, line: 179, baseType: !11, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !328, file: !329, line: 180, baseType: !11, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !328, file: !329, line: 181, baseType: !11, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !328, file: !329, line: 183, baseType: !11, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !313, file: !314, line: 48, baseType: !326, size: 32, offset: 480)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !313, file: !314, line: 49, baseType: !7, size: 32, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !313, file: !314, line: 51, baseType: !505, size: 32, offset: 544)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !313, file: !314, line: 52, baseType: !7, size: 32, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !313, file: !314, line: 53, baseType: !7, size: 32, offset: 608)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !313, file: !314, line: 55, baseType: !381, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !313, file: !314, line: 56, baseType: !7, size: 32, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !313, file: !314, line: 58, baseType: !134, size: 160, offset: 736)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !313, file: !314, line: 59, baseType: !134, size: 160, offset: 896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !313, file: !314, line: 61, baseType: !134, size: 160, offset: 1056)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !313, file: !314, line: 62, baseType: !515, size: 96, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !369, line: 32, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !369, line: 37, size: 96, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !516, file: !369, line: 38, baseType: !375, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !516, file: !369, line: 39, baseType: !375, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !516, file: !369, line: 40, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !369, line: 34, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !375, !375, !375}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !313, file: !314, line: 63, baseType: !368, size: 160, offset: 1312)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !313, file: !314, line: 65, baseType: !527, size: 224, offset: 1472)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !528, line: 31, baseType: !529)
!528 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 25, size: 224, elements: !530)
!530 = !{!531, !539, !540, !541, !542}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !529, file: !528, line: 26, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !528, line: 16, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !528, line: 18, size: 96, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !534, file: !528, line: 19, baseType: !6, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !534, file: !528, line: 20, baseType: !7, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !528, line: 21, baseType: !532, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !529, file: !528, line: 27, baseType: !533, size: 96, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !528, line: 28, baseType: !12, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !529, file: !528, line: 29, baseType: !7, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !529, file: !528, line: 30, baseType: !143, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !313, file: !314, line: 66, baseType: !527, size: 224, offset: 1696)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !313, file: !314, line: 68, baseType: !7, size: 32, offset: 1920)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !313, file: !314, line: 69, baseType: !7, size: 32, offset: 1952)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !313, file: !314, line: 71, baseType: !326, size: 32, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !313, file: !314, line: 72, baseType: !333, size: 32, offset: 2016)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !313, file: !314, line: 73, baseType: !333, size: 32, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !313, file: !314, line: 75, baseType: !311, size: 32, offset: 2080)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !313, file: !314, line: 77, baseType: !63, size: 64, offset: 2112)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !313, file: !314, line: 78, baseType: !63, size: 64, offset: 2176)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !313, file: !314, line: 79, baseType: !63, size: 64, offset: 2240)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !313, file: !314, line: 80, baseType: !63, size: 64, offset: 2304)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !313, file: !314, line: 81, baseType: !63, size: 64, offset: 2368)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !313, file: !314, line: 82, baseType: !63, size: 64, offset: 2432)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !129, file: !119, line: 121, baseType: !143, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !129, file: !119, line: 122, baseType: !143, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !129, file: !119, line: 123, baseType: !559, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !119, line: 103, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 98, size: 1344, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !561, file: !119, line: 99, baseType: !181, size: 1216)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !561, file: !119, line: 100, baseType: !165, size: 32, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !561, file: !119, line: 101, baseType: !165, size: 32, offset: 1248)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !561, file: !119, line: 102, baseType: !7, size: 32, offset: 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !129, file: !119, line: 124, baseType: !237, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !129, file: !119, line: 126, baseType: !6, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !129, file: !119, line: 127, baseType: !7, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !129, file: !119, line: 128, baseType: !7, size: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !129, file: !119, line: 130, baseType: !572, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !119, line: 112, baseType: !124)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !129, file: !119, line: 131, baseType: !109, size: 32, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !118, file: !119, line: 81, baseType: !7, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !118, file: !119, line: 82, baseType: !7, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !118, file: !119, line: 83, baseType: !6, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !104, line: 236, baseType: !7, size: 32, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !103, file: !104, line: 238, baseType: !579, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DISubroutineType(types: !581)
!581 = !{!582, !237}
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !8, line: 78, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 140, baseType: !173)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !103, file: !104, line: 240, baseType: !585, size: 32, offset: 352)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!582, !311}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !103, file: !104, line: 242, baseType: !585, size: 32, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !103, file: !104, line: 243, baseType: !585, size: 32, offset: 416)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !103, file: !104, line: 244, baseType: !591, size: 32, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !311}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !103, file: !104, line: 245, baseType: !591, size: 32, offset: 480)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !103, file: !104, line: 247, baseType: !591, size: 32, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !103, file: !104, line: 249, baseType: !9, size: 32, offset: 544)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !103, file: !104, line: 250, baseType: !9, size: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !103, file: !104, line: 251, baseType: !9, size: 32, offset: 608)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !103, file: !104, line: 252, baseType: !9, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !103, file: !104, line: 253, baseType: !9, size: 32, offset: 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !103, file: !104, line: 254, baseType: !9, size: 32, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !103, file: !104, line: 255, baseType: !9, size: 32, offset: 736)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !103, file: !104, line: 256, baseType: !9, size: 32, offset: 768)
!604 = !DIGlobalVariableExpression(var: !605)
!605 = distinct !DIGlobalVariable(name: "ngx_http_map_commands", scope: !2, file: !3, line: 49, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 896, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 4)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !610, line: 36, baseType: !611)
!610 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 24, size: 256, elements: !612)
!612 = !{!613, !617, !618, !622, !626, !627, !631, !632}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !611, file: !610, line: 25, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!582, !127}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !611, file: !610, line: 26, baseType: !614, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !611, file: !610, line: 28, baseType: !619, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{!6, !127}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !611, file: !610, line: 29, baseType: !623, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{!109, !127, !6}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !611, file: !610, line: 31, baseType: !619, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !611, file: !610, line: 32, baseType: !628, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!109, !127, !6, !6}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !611, file: !610, line: 34, baseType: !619, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !611, file: !610, line: 35, baseType: !628, size: 32, offset: 224)
!633 = !{i32 2, !"Dwarf Version", i32 4}
!634 = !{i32 2, !"Debug Info Version", i32 3}
!635 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!636 = distinct !DISubprogram(name: "ngx_http_map_create_conf", scope: !3, file: !3, line: 159, type: !620, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !637)
!637 = !{!638, !639}
!638 = !DILocalVariable(name: "cf", arg: 1, scope: !636, file: !3, line: 159, type: !127)
!639 = !DILocalVariable(name: "mcf", scope: !636, file: !3, line: 161, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_map_conf_t", file: !3, line: 16, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 64, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hash_max_size", scope: !642, file: !3, line: 14, baseType: !7, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bucket_size", scope: !642, file: !3, line: 15, baseType: !7, size: 32, offset: 32)
!646 = !{!647, !647, i64 0}
!647 = !{!"any pointer", !648, i64 0}
!648 = !{!"omnipotent char", !649, i64 0}
!649 = !{!"Simple C/C++ TBAA"}
!650 = !DIExpression()
!651 = !DILocation(line: 159, column: 38, scope: !636)
!652 = !DILocation(line: 161, column: 5, scope: !636)
!653 = !DILocation(line: 161, column: 27, scope: !636)
!654 = !DILocation(line: 163, column: 22, scope: !636)
!655 = !DILocation(line: 163, column: 26, scope: !636)
!656 = !{!657, !647, i64 12}
!657 = !{!"ngx_conf_s", !647, i64 0, !647, i64 4, !647, i64 8, !647, i64 12, !647, i64 16, !647, i64 20, !647, i64 24, !647, i64 28, !658, i64 32, !658, i64 36, !647, i64 40, !647, i64 44}
!658 = !{!"int", !648, i64 0}
!659 = !DILocation(line: 163, column: 11, scope: !636)
!660 = !DILocation(line: 163, column: 9, scope: !636)
!661 = !DILocation(line: 164, column: 9, scope: !662)
!662 = distinct !DILexicalBlock(scope: !636, file: !3, line: 164, column: 9)
!663 = !DILocation(line: 164, column: 13, scope: !662)
!664 = !DILocation(line: 164, column: 9, scope: !636)
!665 = !DILocation(line: 165, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !3, line: 164, column: 22)
!667 = !DILocation(line: 168, column: 5, scope: !636)
!668 = !DILocation(line: 168, column: 10, scope: !636)
!669 = !DILocation(line: 168, column: 24, scope: !636)
!670 = !{!671, !658, i64 0}
!671 = !{!"", !658, i64 0, !658, i64 4}
!672 = !DILocation(line: 169, column: 5, scope: !636)
!673 = !DILocation(line: 169, column: 10, scope: !636)
!674 = !DILocation(line: 169, column: 27, scope: !636)
!675 = !{!671, !658, i64 4}
!676 = !DILocation(line: 171, column: 12, scope: !636)
!677 = !DILocation(line: 171, column: 5, scope: !636)
!678 = !DILocation(line: 172, column: 1, scope: !636)
!679 = distinct !DISubprogram(name: "ngx_http_map_block", scope: !3, file: !3, line: 176, type: !125, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !688, !689, !690, !691, !707, !708, !1911, !1933}
!681 = !DILocalVariable(name: "cf", arg: 1, scope: !679, file: !3, line: 176, type: !127)
!682 = !DILocalVariable(name: "cmd", arg: 2, scope: !679, file: !3, line: 176, type: !116)
!683 = !DILocalVariable(name: "conf", arg: 3, scope: !679, file: !3, line: 176, type: !6)
!684 = !DILocalVariable(name: "mcf", scope: !679, file: !3, line: 178, type: !640)
!685 = !DILocalVariable(name: "rv", scope: !679, file: !3, line: 180, type: !109)
!686 = !DILocalVariable(name: "value", scope: !679, file: !3, line: 181, type: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!688 = !DILocalVariable(name: "name", scope: !679, file: !3, line: 181, type: !63)
!689 = !DILocalVariable(name: "save", scope: !679, file: !3, line: 182, type: !128)
!690 = !DILocalVariable(name: "pool", scope: !679, file: !3, line: 183, type: !143)
!691 = !DILocalVariable(name: "hash", scope: !679, file: !3, line: 184, type: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_init_t", file: !15, line: 62, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 52, size: 224, elements: !694)
!694 = !{!695, !697, !702, !703, !704, !705, !706}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !693, file: !15, line: 53, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !693, file: !15, line: 54, baseType: !698, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_pt", file: !15, line: 42, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DISubroutineType(types: !701)
!701 = !{!7, !69, !12}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !693, file: !15, line: 56, baseType: !7, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_size", scope: !693, file: !15, line: 57, baseType: !7, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !15, line: 59, baseType: !109, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !693, file: !15, line: 60, baseType: !143, size: 32, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !693, file: !15, line: 61, baseType: !143, size: 32, offset: 192)
!707 = !DILocalVariable(name: "map", scope: !679, file: !3, line: 185, type: !41)
!708 = !DILocalVariable(name: "var", scope: !679, file: !3, line: 186, type: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_t", file: !47, line: 21, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_variable_s", file: !47, line: 37, size: 224, elements: !712)
!712 = !{!713, !714, !1903, !1908, !1909, !1910}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !47, line: 38, baseType: !63, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "set_handler", scope: !711, file: !47, line: 39, baseType: !715, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_set_variable_pt", file: !47, line: 23, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !719, !75, !9}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !721, line: 16, baseType: !722)
!721 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !723, line: 364, size: 5376, elements: !724)
!723 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!724 = !{!725, !727, !728, !729, !730, !731, !732, !737, !738, !949, !1480, !1481, !1482, !1483, !1522, !1552, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1597, !1608, !1615, !1616, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1799, !1803, !1808, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !722, file: !723, line: 365, baseType: !726, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 191, baseType: !11)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !722, file: !723, line: 367, baseType: !326, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !722, file: !723, line: 369, baseType: !319, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !722, file: !723, line: 370, baseType: !319, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !722, file: !723, line: 371, baseType: !319, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !722, file: !723, line: 372, baseType: !319, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !722, file: !723, line: 374, baseType: !733, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !723, line: 361, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !719}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !722, file: !723, line: 375, baseType: !733, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !722, file: !723, line: 378, baseType: !739, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !721, line: 18, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !742, line: 65, size: 3008, elements: !743)
!742 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!743 = !{!744, !745, !746, !747, !751, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !907, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !741, file: !742, line: 66, baseType: !181, size: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !741, file: !742, line: 67, baseType: !134, size: 160, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !741, file: !742, line: 68, baseType: !726, size: 32, offset: 1376)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !741, file: !742, line: 69, baseType: !748, size: 128, offset: 1408)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 16)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !741, file: !742, line: 70, baseType: !748, size: 128, offset: 1536)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !741, file: !742, line: 72, baseType: !753, size: 32, offset: 1664)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !187, line: 18, baseType: !198)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !741, file: !742, line: 73, baseType: !225, size: 32, offset: 1696)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !741, file: !742, line: 74, baseType: !225, size: 32, offset: 1728)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !741, file: !742, line: 75, baseType: !225, size: 32, offset: 1760)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !741, file: !742, line: 76, baseType: !225, size: 32, offset: 1792)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !741, file: !742, line: 77, baseType: !225, size: 32, offset: 1824)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !741, file: !742, line: 79, baseType: !63, size: 64, offset: 1856)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !741, file: !742, line: 80, baseType: !63, size: 64, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !741, file: !742, line: 81, baseType: !748, size: 128, offset: 1984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !741, file: !742, line: 83, baseType: !12, size: 32, offset: 2112)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !741, file: !742, line: 84, baseType: !12, size: 32, offset: 2144)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !742, line: 85, baseType: !172, size: 32, offset: 2176)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !741, file: !742, line: 86, baseType: !172, size: 32, offset: 2208)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !741, file: !742, line: 88, baseType: !7, size: 32, offset: 2240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !741, file: !742, line: 89, baseType: !7, size: 32, offset: 2272)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !741, file: !742, line: 90, baseType: !7, size: 32, offset: 2304)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !741, file: !742, line: 91, baseType: !7, size: 32, offset: 2336)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !741, file: !742, line: 93, baseType: !165, size: 32, offset: 2368)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !741, file: !742, line: 95, baseType: !772, size: 32, offset: 2400)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !721, line: 19, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !742, line: 157, size: 544, elements: !775)
!775 = !{!776, !791, !850, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !906}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !774, file: !742, line: 158, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !742, line: 154, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !742, line: 145, size: 480, elements: !780)
!780 = !{!781, !782, !783, !784, !787, !788, !789, !790}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !779, file: !742, line: 146, baseType: !515, size: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !779, file: !742, line: 147, baseType: !368, size: 160, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !779, file: !742, line: 148, baseType: !381, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !779, file: !742, line: 149, baseType: !785, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !257, line: 106, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !779, file: !742, line: 150, baseType: !785, size: 32, offset: 352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !742, line: 151, baseType: !172, size: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !779, file: !742, line: 152, baseType: !7, size: 32, offset: 416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !779, file: !742, line: 153, baseType: !7, size: 32, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !774, file: !742, line: 159, baseType: !792, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !794, line: 59, baseType: !795)
!794 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 34, size: 800, elements: !796)
!796 = !{!797, !804, !805, !806, !814, !815, !816, !825, !826, !827, !828, !845, !846, !847, !848, !849}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !795, file: !794, line: 35, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !799, line: 21, baseType: !800)
!799 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !799, line: 16, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !800, file: !799, line: 17, baseType: !785, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !800, file: !799, line: 19, baseType: !785, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !795, file: !794, line: 37, baseType: !12, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !795, file: !794, line: 38, baseType: !12, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !795, file: !794, line: 40, baseType: !807, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !794, line: 16, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !794, line: 18, size: 96, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !809, file: !794, line: 19, baseType: !9, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !794, line: 20, baseType: !807, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !794, line: 21, baseType: !9, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !795, file: !794, line: 41, baseType: !807, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !795, file: !794, line: 42, baseType: !808, size: 96, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !795, file: !794, line: 44, baseType: !817, size: 32, offset: 288)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !794, line: 31, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 25, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !819, file: !794, line: 26, baseType: !7, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !819, file: !794, line: 27, baseType: !7, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !819, file: !794, line: 29, baseType: !7, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !819, file: !794, line: 30, baseType: !7, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !795, file: !794, line: 45, baseType: !7, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !795, file: !794, line: 47, baseType: !69, size: 32, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !795, file: !794, line: 48, baseType: !69, size: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !795, file: !794, line: 50, baseType: !829, size: 256, offset: 416)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !799, line: 37, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !799, line: 24, size: 256, elements: !831)
!831 = !{!832, !834, !835, !836, !844}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !830, file: !799, line: 26, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !830, file: !799, line: 28, baseType: !833, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !830, file: !799, line: 29, baseType: !7, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !830, file: !799, line: 30, baseType: !837, size: 128, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !838, line: 19, baseType: !839)
!838 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !838, line: 17, size: 128, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !839, file: !838, line: 18, baseType: !842, size: 128)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 128, elements: !607)
!843 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !173)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !830, file: !799, line: 36, baseType: !7, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !795, file: !794, line: 52, baseType: !69, size: 32, offset: 672)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !795, file: !794, line: 53, baseType: !35, size: 8, offset: 704)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !795, file: !794, line: 55, baseType: !11, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !795, file: !794, line: 57, baseType: !6, size: 32, offset: 736)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !795, file: !794, line: 58, baseType: !6, size: 32, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !774, file: !742, line: 161, baseType: !851, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !183, line: 62, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 50, size: 384, elements: !854)
!854 = !{!855, !856, !857, !859, !864, !866, !868, !869, !870}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !183, line: 51, baseType: !63, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !853, file: !183, line: 52, baseType: !12, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !853, file: !183, line: 53, baseType: !858, size: 96, offset: 96)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !232)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !853, file: !183, line: 55, baseType: !860, size: 32, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !183, line: 45, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{!447, !6}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !853, file: !183, line: 56, baseType: !865, size: 32, offset: 224)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !183, line: 46, baseType: !861)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !853, file: !183, line: 57, baseType: !867, size: 32, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !183, line: 47, baseType: !304)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !853, file: !183, line: 58, baseType: !6, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !853, file: !183, line: 60, baseType: !69, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !853, file: !183, line: 61, baseType: !7, size: 32, offset: 352)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !774, file: !742, line: 163, baseType: !172, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !774, file: !742, line: 164, baseType: !12, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !774, file: !742, line: 166, baseType: !225, size: 32, offset: 160)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !774, file: !742, line: 168, baseType: !225, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !774, file: !742, line: 170, baseType: !7, size: 32, offset: 224)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !774, file: !742, line: 171, baseType: !7, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !774, file: !742, line: 172, baseType: !447, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !774, file: !742, line: 173, baseType: !447, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !774, file: !742, line: 174, baseType: !447, size: 32, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !774, file: !742, line: 176, baseType: !7, size: 32, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !774, file: !742, line: 177, baseType: !447, size: 32, offset: 416)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !774, file: !742, line: 178, baseType: !447, size: 32, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !774, file: !742, line: 180, baseType: !884, size: 32, offset: 480)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !314, line: 25, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !314, line: 29, size: 320, elements: !887)
!887 = !{!888, !889, !899, !904, !905}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !314, line: 30, baseType: !6, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !886, file: !314, line: 31, baseType: !890, size: 192, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !891, line: 22, baseType: !892)
!891 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 16, size: 192, elements: !893)
!893 = !{!894, !895, !896, !897, !898}
