; ModuleID = 'src/http/modules/ngx_http_browser_module.c'
source_filename = "src/http/modules/ngx_http_browser_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_browser_module_ctx", scope: !2, file: !3, line: 116, type: !1811, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !31)
!3 = !DIFile(filename: "src/http/modules/ngx_http_browser_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !11, !14, !17}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 120, baseType: !16)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_modern_browser_t", file: !3, line: 37, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 32, size: 192, elements: !20)
!20 = !{!21, !25, !26, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !19, file: !3, line: 33, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !23, line: 79, baseType: !24)
!23 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !15, line: 125, baseType: !16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !19, file: !3, line: 34, baseType: !14, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !19, file: !3, line: 35, baseType: !14, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !3, line: 36, baseType: !28, size: 96, offset: 96)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 12)
!31 = !{!32, !0, !544, !1794, !1806}
!32 = !DIGlobalVariableExpression(var: !33)
!33 = distinct !DIGlobalVariable(name: "ngx_http_browser_module", scope: !2, file: !3, line: 131, type: !34, isLocal: false, isDefinition: true)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !35, line: 15, baseType: !36)
!35 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !37, line: 222, size: 800, elements: !38)
!37 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = !{!39, !40, !41, !43, !44, !45, !46, !47, !48, !517, !518, !524, !528, !529, !530, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !36, file: !37, line: 223, baseType: !22, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !36, file: !37, line: 224, baseType: !22, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !37, line: 226, baseType: !42, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !36, file: !37, line: 228, baseType: !22, size: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !36, file: !37, line: 229, baseType: !22, size: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !36, file: !37, line: 231, baseType: !22, size: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !36, file: !37, line: 232, baseType: !11, size: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !36, file: !37, line: 234, baseType: !6, size: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !36, file: !37, line: 235, baseType: !49, size: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !35, line: 22, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !52, line: 77, size: 224, elements: !53)
!52 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !{!54, !61, !62, !514, !515, !516}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !52, line: 78, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !56, line: 19, baseType: !57)
!56 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 16, size: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, file: !56, line: 17, baseType: !14, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !56, line: 18, baseType: !7, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !52, line: 79, baseType: !22, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !51, file: !52, line: 80, baseType: !63, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!64 = !DISubroutineType(types: !65)
!65 = !{!42, !66, !49, !6}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !35, line: 16, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !52, line: 116, size: 384, elements: !69)
!69 = !{!70, !71, !249, !496, !497, !498, !507, !508, !509, !510, !511, !513}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !52, line: 117, baseType: !42, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !68, file: !52, line: 118, baseType: !72, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !74, line: 22, baseType: !75)
!74 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 16, size: 160, elements: !76)
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !75, file: !74, line: 17, baseType: !6, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !75, file: !74, line: 18, baseType: !22, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !75, file: !74, line: 19, baseType: !14, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !75, file: !74, line: 20, baseType: !22, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !75, file: !74, line: 21, baseType: !82, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !35, line: 18, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !85, line: 57, size: 320, elements: !86)
!85 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = !{!87, !95, !96, !97, !229, !236, !248}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !84, file: !85, line: 58, baseType: !88, size: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !85, line: 54, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 49, size: 128, elements: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !89, file: !85, line: 50, baseType: !7, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !89, file: !85, line: 51, baseType: !7, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !85, line: 52, baseType: !82, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !89, file: !85, line: 53, baseType: !22, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !84, file: !85, line: 59, baseType: !14, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !84, file: !85, line: 60, baseType: !82, size: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !84, file: !85, line: 61, baseType: !98, size: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !35, line: 19, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !101, line: 59, size: 64, elements: !102)
!101 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!102 = !{!103, !228}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !100, file: !101, line: 60, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !101, line: 18, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !101, line: 20, size: 352, elements: !107)
!107 = !{!108, !109, !110, !113, !114, !115, !116, !118, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !106, file: !101, line: 21, baseType: !7, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !106, file: !101, line: 22, baseType: !7, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !106, file: !101, line: 23, baseType: !111, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !15, line: 222, baseType: !112)
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !106, file: !101, line: 24, baseType: !111, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !106, file: !101, line: 26, baseType: !7, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !106, file: !101, line: 27, baseType: !7, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !106, file: !101, line: 28, baseType: !117, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !101, line: 16, baseType: !6)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !106, file: !101, line: 29, baseType: !119, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !35, line: 23, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !122, line: 16, size: 1216, elements: !123)
!122 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !{!124, !127, !128, !173, !174, !175, !213, !214}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !121, file: !122, line: 17, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !126, line: 16, baseType: !112)
!126 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !122, line: 18, baseType: !55, size: 64, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !121, file: !122, line: 19, baseType: !129, size: 960, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !126, line: 17, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !131, line: 4, size: 960, elements: !132)
!131 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!132 = !{!133, !135, !136, !138, !139, !141, !142, !144, !146, !148, !149, !150, !151, !152, !153, !156, !157, !159, !160, !166, !167, !168}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !130, file: !131, line: 6, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !15, line: 232, baseType: !16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !130, file: !131, line: 7, baseType: !134, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !130, file: !131, line: 8, baseType: !137, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !15, line: 227, baseType: !16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !130, file: !131, line: 9, baseType: !137, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !130, file: !131, line: 10, baseType: !140, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !15, line: 217, baseType: !16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !130, file: !131, line: 11, baseType: !140, size: 32, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !130, file: !131, line: 13, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !15, line: 212, baseType: !16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !130, file: !131, line: 14, baseType: !145, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 304, baseType: !16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !130, file: !131, line: 15, baseType: !147, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 309, baseType: !16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !130, file: !131, line: 16, baseType: !16, size: 32, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !130, file: !131, line: 17, baseType: !134, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !130, file: !131, line: 18, baseType: !134, size: 32, offset: 352)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !130, file: !131, line: 19, baseType: !111, size: 32, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !130, file: !131, line: 20, baseType: !111, size: 32, offset: 416)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !130, file: !131, line: 21, baseType: !154, size: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !15, line: 237, baseType: !155)
!155 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !130, file: !131, line: 22, baseType: !154, size: 32, offset: 480)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !130, file: !131, line: 23, baseType: !158, size: 32, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !15, line: 242, baseType: !112)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !130, file: !131, line: 24, baseType: !158, size: 32, offset: 544)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !130, file: !131, line: 26, baseType: !161, size: 64, offset: 576)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !15, line: 288, size: 64, elements: !162)
!162 = !{!163, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !161, file: !15, line: 288, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !155)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !161, file: !15, line: 288, baseType: !155, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !130, file: !131, line: 27, baseType: !161, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !130, file: !131, line: 28, baseType: !161, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !130, file: !131, line: 29, baseType: !169, size: 192, offset: 768)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192, elements: !171)
!170 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!171 = !{!172}
!172 = !DISubrange(count: 3)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !121, file: !122, line: 21, baseType: !111, size: 32, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !121, file: !122, line: 22, baseType: !111, size: 32, offset: 1120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !121, file: !122, line: 24, baseType: !176, size: 32, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !35, line: 20, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !179, line: 50, size: 320, elements: !180)
!179 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!180 = !{!181, !182, !194, !198, !199, !204, !205, !210, !211, !212}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !178, file: !179, line: 51, baseType: !22, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !178, file: !179, line: 52, baseType: !183, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !35, line: 21, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !52, line: 89, size: 160, elements: !186)
!186 = !{!187, !188, !189, !193}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !185, file: !52, line: 90, baseType: !125, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !52, line: 91, baseType: !55, size: 64, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !185, file: !52, line: 93, baseType: !190, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !183, !176}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !185, file: !52, line: 94, baseType: !6, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !178, file: !179, line: 54, baseType: !195, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !196, line: 98, baseType: !197)
!196 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!197 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !178, file: !179, line: 56, baseType: !164, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !178, file: !179, line: 58, baseType: !200, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !179, line: 45, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{!7, !176, !7, !14}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !179, line: 59, baseType: !6, size: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !178, file: !179, line: 61, baseType: !206, size: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !179, line: 46, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !176, !22, !7, !14}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !178, file: !179, line: 62, baseType: !6, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !178, file: !179, line: 70, baseType: !42, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !179, line: 72, baseType: !176, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !121, file: !122, line: 37, baseType: !16, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !121, file: !122, line: 38, baseType: !16, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !106, file: !101, line: 30, baseType: !104, size: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !106, file: !101, line: 34, baseType: !16, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !106, file: !101, line: 40, baseType: !16, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !106, file: !101, line: 43, baseType: !16, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !106, file: !101, line: 45, baseType: !16, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !106, file: !101, line: 46, baseType: !16, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !106, file: !101, line: 47, baseType: !16, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !106, file: !101, line: 48, baseType: !16, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !106, file: !101, line: 49, baseType: !16, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !106, file: !101, line: 50, baseType: !16, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !106, file: !101, line: 52, baseType: !16, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !106, file: !101, line: 53, baseType: !16, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !106, file: !101, line: 55, baseType: !112, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !101, line: 61, baseType: !98, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !84, file: !85, line: 62, baseType: !230, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !85, line: 41, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !85, line: 43, size: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !85, line: 44, baseType: !230, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !232, file: !85, line: 45, baseType: !6, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !84, file: !85, line: 63, baseType: !237, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !85, line: 32, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !85, line: 34, size: 96, elements: !240)
!240 = !{!241, !246, !247}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !239, file: !85, line: 35, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !85, line: 30, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !6}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !85, line: 36, baseType: !6, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !85, line: 37, baseType: !237, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !84, file: !85, line: 64, baseType: !176, size: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !68, file: !52, line: 120, baseType: !250, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !35, line: 17, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !253, line: 38, size: 2496, elements: !254)
!253 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!254 = !{!255, !259, !260, !261, !262, !263, !442, !443, !444, !447, !448, !449, !450, !451, !452, !453, !454, !465, !466, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !252, file: !253, line: 39, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !252, file: !253, line: 40, baseType: !82, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !252, file: !253, line: 42, baseType: !176, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !252, file: !253, line: 43, baseType: !177, size: 320, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !252, file: !253, line: 45, baseType: !22, size: 32, offset: 416)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !252, file: !253, line: 47, baseType: !264, size: 32, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !35, line: 26, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !268, line: 121, size: 896, elements: !269)
!268 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!269 = !{!270, !271, !327, !328, !331, !338, !340, !345, !350, !410, !411, !412, !413, !414, !415, !416, !417, !418, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !268, line: 122, baseType: !6, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !267, file: !268, line: 123, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !35, line: 24, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !275, line: 30, size: 384, elements: !276)
!275 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !304, !305, !306, !319}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !275, line: 31, baseType: !6, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !274, file: !275, line: 33, baseType: !16, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !274, file: !275, line: 35, baseType: !16, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !274, file: !275, line: 38, baseType: !16, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !274, file: !275, line: 44, baseType: !16, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !274, file: !275, line: 46, baseType: !16, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !274, file: !275, line: 49, baseType: !16, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !274, file: !275, line: 51, baseType: !16, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !274, file: !275, line: 54, baseType: !16, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !274, file: !275, line: 56, baseType: !16, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !274, file: !275, line: 57, baseType: !16, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !274, file: !275, line: 59, baseType: !16, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !274, file: !275, line: 60, baseType: !16, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !274, file: !275, line: 62, baseType: !16, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !274, file: !275, line: 64, baseType: !16, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !274, file: !275, line: 67, baseType: !16, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !274, file: !275, line: 69, baseType: !16, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !274, file: !275, line: 71, baseType: !16, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !274, file: !275, line: 74, baseType: !16, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !274, file: !275, line: 75, baseType: !16, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !274, file: !275, line: 77, baseType: !16, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !274, file: !275, line: 107, baseType: !16, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !274, file: !275, line: 110, baseType: !300, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !35, line: 31, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !272}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !274, file: !275, line: 117, baseType: !22, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !274, file: !275, line: 119, baseType: !176, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !274, file: !275, line: 121, baseType: !307, size: 160, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !308, line: 20, baseType: !309)
!308 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !308, line: 22, size: 160, elements: !310)
!310 = !{!311, !313, !315, !316, !317, !318}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !309, file: !308, line: 23, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !308, line: 16, baseType: !22)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !309, file: !308, line: 24, baseType: !314, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !309, file: !308, line: 25, baseType: !314, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !309, file: !308, line: 26, baseType: !314, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !309, file: !308, line: 27, baseType: !8, size: 8, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !308, line: 28, baseType: !8, size: 8, offset: 136)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !274, file: !275, line: 124, baseType: !320, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !321, line: 16, baseType: !322)
!321 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !321, line: 18, size: 64, elements: !323)
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !321, line: 19, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !321, line: 20, baseType: !325, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !267, file: !268, line: 124, baseType: !272, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !267, file: !268, line: 126, baseType: !329, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !330, line: 17, baseType: !112)
!330 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !267, file: !268, line: 128, baseType: !332, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !333, line: 19, baseType: !334)
!333 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !265, !7, !14}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 135, baseType: !112)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !267, file: !268, line: 129, baseType: !339, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !333, line: 22, baseType: !334)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !267, file: !268, line: 130, baseType: !341, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !333, line: 20, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{!337, !265, !98, !111}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !267, file: !268, line: 131, baseType: !346, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !333, line: 23, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DISubroutineType(types: !349)
!349 = !{!98, !265, !98, !111}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !267, file: !268, line: 133, baseType: !351, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !268, line: 16, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !268, line: 18, size: 960, elements: !354)
!354 = !{!355, !356, !368, !370, !371, !372, !373, !374, !375, !376, !381, !382, !383, !384, !385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !353, file: !268, line: 19, baseType: !329, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !353, file: !268, line: 21, baseType: !357, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !359, line: 297, size: 128, elements: !360)
!359 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!360 = !{!361, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !358, file: !359, line: 298, baseType: !362, size: 16)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !15, line: 409, baseType: !363)
!363 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !358, file: !359, line: 299, baseType: !365, size: 112, offset: 16)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 112, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 14)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !353, file: !268, line: 22, baseType: !369, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !15, line: 404, baseType: !16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !353, file: !268, line: 23, baseType: !14, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !353, file: !268, line: 24, baseType: !55, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !268, line: 26, baseType: !112, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !353, file: !268, line: 28, baseType: !112, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !353, file: !268, line: 29, baseType: !112, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !353, file: !268, line: 30, baseType: !112, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !353, file: !268, line: 38, baseType: !377, size: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !35, line: 32, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !265}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !353, file: !268, line: 40, baseType: !6, size: 32, offset: 352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !353, file: !268, line: 42, baseType: !177, size: 320, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !353, file: !268, line: 43, baseType: !176, size: 32, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !353, file: !268, line: 45, baseType: !14, size: 32, offset: 736)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !353, file: !268, line: 47, baseType: !14, size: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !353, file: !268, line: 49, baseType: !387, size: 32, offset: 800)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !388, line: 16, baseType: !312)
!388 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !353, file: !268, line: 51, baseType: !351, size: 32, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !353, file: !268, line: 52, baseType: !265, size: 32, offset: 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !353, file: !268, line: 54, baseType: !22, size: 32, offset: 896)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !353, file: !268, line: 56, baseType: !16, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !353, file: !268, line: 57, baseType: !16, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !353, file: !268, line: 58, baseType: !16, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !353, file: !268, line: 60, baseType: !16, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !353, file: !268, line: 61, baseType: !16, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !353, file: !268, line: 62, baseType: !16, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !353, file: !268, line: 63, baseType: !16, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !353, file: !268, line: 64, baseType: !16, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !353, file: !268, line: 65, baseType: !16, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !353, file: !268, line: 66, baseType: !16, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !353, file: !268, line: 67, baseType: !16, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !353, file: !268, line: 70, baseType: !16, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !353, file: !268, line: 72, baseType: !16, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !353, file: !268, line: 73, baseType: !16, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !353, file: !268, line: 74, baseType: !16, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !353, file: !268, line: 76, baseType: !16, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !353, file: !268, line: 77, baseType: !16, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !353, file: !268, line: 78, baseType: !16, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !267, file: !268, line: 135, baseType: !111, size: 32, offset: 288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !267, file: !268, line: 137, baseType: !176, size: 32, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !267, file: !268, line: 139, baseType: !82, size: 32, offset: 352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !268, line: 141, baseType: !112, size: 32, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !267, file: !268, line: 143, baseType: !357, size: 32, offset: 416)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !267, file: !268, line: 144, baseType: !369, size: 32, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !267, file: !268, line: 145, baseType: !55, size: 64, offset: 480)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !267, file: !268, line: 147, baseType: !55, size: 64, offset: 544)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !267, file: !268, line: 148, baseType: !419, size: 16, offset: 608)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !420, line: 12, baseType: !421)
!420 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 186, baseType: !363)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !267, file: !268, line: 154, baseType: !357, size: 32, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !267, file: !268, line: 155, baseType: !369, size: 32, offset: 672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !267, file: !268, line: 157, baseType: !104, size: 32, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !267, file: !268, line: 159, baseType: !320, size: 64, offset: 736)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !267, file: !268, line: 161, baseType: !195, size: 32, offset: 800)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !267, file: !268, line: 163, baseType: !22, size: 32, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !267, file: !268, line: 165, baseType: !16, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !267, file: !268, line: 167, baseType: !16, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !267, file: !268, line: 169, baseType: !16, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !267, file: !268, line: 170, baseType: !16, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !267, file: !268, line: 171, baseType: !16, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !267, file: !268, line: 173, baseType: !16, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !267, file: !268, line: 174, baseType: !16, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !267, file: !268, line: 175, baseType: !16, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !267, file: !268, line: 176, baseType: !16, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !267, file: !268, line: 178, baseType: !16, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !267, file: !268, line: 179, baseType: !16, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !267, file: !268, line: 180, baseType: !16, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !267, file: !268, line: 181, baseType: !16, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !267, file: !268, line: 183, baseType: !16, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !252, file: !253, line: 48, baseType: !265, size: 32, offset: 480)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !252, file: !253, line: 49, baseType: !22, size: 32, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !252, file: !253, line: 51, baseType: !445, size: 32, offset: 544)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !252, file: !253, line: 52, baseType: !22, size: 32, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !252, file: !253, line: 53, baseType: !22, size: 32, offset: 608)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !252, file: !253, line: 55, baseType: !320, size: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !252, file: !253, line: 56, baseType: !22, size: 32, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !252, file: !253, line: 58, baseType: !73, size: 160, offset: 736)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !252, file: !253, line: 59, baseType: !73, size: 160, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !252, file: !253, line: 61, baseType: !73, size: 160, offset: 1056)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !252, file: !253, line: 62, baseType: !455, size: 96, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !308, line: 32, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !308, line: 37, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !456, file: !308, line: 38, baseType: !314, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !456, file: !308, line: 39, baseType: !314, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !456, file: !308, line: 40, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !308, line: 34, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !314, !314, !314}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !252, file: !253, line: 63, baseType: !307, size: 160, offset: 1312)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !252, file: !253, line: 65, baseType: !467, size: 224, offset: 1472)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !468, line: 31, baseType: !469)
!468 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 25, size: 224, elements: !470)
!470 = !{!471, !479, !480, !481, !482}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !469, file: !468, line: 26, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !468, line: 16, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !468, line: 18, size: 96, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !474, file: !468, line: 19, baseType: !6, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !474, file: !468, line: 20, baseType: !22, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !468, line: 21, baseType: !472, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !469, file: !468, line: 27, baseType: !473, size: 96, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !469, file: !468, line: 28, baseType: !14, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !469, file: !468, line: 29, baseType: !22, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !469, file: !468, line: 30, baseType: !82, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !252, file: !253, line: 66, baseType: !467, size: 224, offset: 1696)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !252, file: !253, line: 68, baseType: !22, size: 32, offset: 1920)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !252, file: !253, line: 69, baseType: !22, size: 32, offset: 1952)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !252, file: !253, line: 71, baseType: !265, size: 32, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !252, file: !253, line: 72, baseType: !272, size: 32, offset: 2016)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !252, file: !253, line: 73, baseType: !272, size: 32, offset: 2048)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !252, file: !253, line: 75, baseType: !250, size: 32, offset: 2080)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !252, file: !253, line: 77, baseType: !55, size: 64, offset: 2112)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !252, file: !253, line: 78, baseType: !55, size: 64, offset: 2176)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !252, file: !253, line: 79, baseType: !55, size: 64, offset: 2240)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !252, file: !253, line: 80, baseType: !55, size: 64, offset: 2304)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !252, file: !253, line: 81, baseType: !55, size: 64, offset: 2368)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !252, file: !253, line: 82, baseType: !55, size: 64, offset: 2432)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !68, file: !52, line: 121, baseType: !82, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !68, file: !52, line: 122, baseType: !82, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !68, file: !52, line: 123, baseType: !499, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !52, line: 103, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 98, size: 1344, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !501, file: !52, line: 99, baseType: !120, size: 1216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !501, file: !52, line: 100, baseType: !104, size: 32, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !501, file: !52, line: 101, baseType: !104, size: 32, offset: 1248)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !501, file: !52, line: 102, baseType: !22, size: 32, offset: 1280)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !68, file: !52, line: 124, baseType: !176, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !68, file: !52, line: 126, baseType: !6, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !68, file: !52, line: 127, baseType: !22, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !68, file: !52, line: 128, baseType: !22, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !68, file: !52, line: 130, baseType: !512, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !52, line: 112, baseType: !63)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !68, file: !52, line: 131, baseType: !42, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !51, file: !52, line: 81, baseType: !22, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !51, file: !52, line: 82, baseType: !22, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !51, file: !52, line: 83, baseType: !6, size: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !37, line: 236, baseType: !22, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !36, file: !37, line: 238, baseType: !519, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !176}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !23, line: 78, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !15, line: 140, baseType: !112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !36, file: !37, line: 240, baseType: !525, size: 32, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DISubroutineType(types: !527)
!527 = !{!522, !250}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !36, file: !37, line: 242, baseType: !525, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !36, file: !37, line: 243, baseType: !525, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !36, file: !37, line: 244, baseType: !531, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !250}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !36, file: !37, line: 245, baseType: !531, size: 32, offset: 480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !36, file: !37, line: 247, baseType: !531, size: 32, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !36, file: !37, line: 249, baseType: !24, size: 32, offset: 544)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !36, file: !37, line: 250, baseType: !24, size: 32, offset: 576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !36, file: !37, line: 251, baseType: !24, size: 32, offset: 608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !36, file: !37, line: 252, baseType: !24, size: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !36, file: !37, line: 253, baseType: !24, size: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !36, file: !37, line: 254, baseType: !24, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !36, file: !37, line: 255, baseType: !24, size: 32, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !36, file: !37, line: 256, baseType: !24, size: 32, offset: 768)
!544 = !DIGlobalVariableExpression(var: !545)
!545 = distinct !DIGlobalVariable(name: "ngx_http_browsers", scope: !2, file: !3, line: 221, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 512, elements: !682)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_browser_variable_t", file: !3, line: 44, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 40, size: 128, elements: !549)
!549 = !{!550, !551, !1793}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !3, line: 41, baseType: !55, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !548, file: !3, line: 42, baseType: !552, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_get_variable_pt", file: !553, line: 25, baseType: !554)
!553 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!522, !557, !1486, !24}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !559, line: 16, baseType: !560)
!559 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !561, line: 364, size: 5376, elements: !562)
!561 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!562 = !{!563, !565, !566, !567, !568, !569, !570, !575, !576, !786, !1346, !1347, !1348, !1349, !1388, !1418, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1463, !1474, !1481, !1482, !1484, !1485, !1497, !1498, !1499, !1500, !1501, !1502, !1689, !1693, !1698, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !560, file: !561, line: 365, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 191, baseType: !16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !560, file: !561, line: 367, baseType: !265, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !560, file: !561, line: 369, baseType: !258, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !560, file: !561, line: 370, baseType: !258, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !560, file: !561, line: 371, baseType: !258, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !560, file: !561, line: 372, baseType: !258, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !560, file: !561, line: 374, baseType: !571, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !561, line: 361, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !557}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !560, file: !561, line: 375, baseType: !571, size: 32, offset: 224)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !560, file: !561, line: 378, baseType: !577, size: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !559, line: 18, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !580, line: 65, size: 3008, elements: !581)
!580 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!581 = !{!582, !583, !584, !585, !589, !590, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !747, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !579, file: !580, line: 66, baseType: !120, size: 1216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !579, file: !580, line: 67, baseType: !73, size: 160, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !579, file: !580, line: 68, baseType: !564, size: 32, offset: 1376)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !579, file: !580, line: 69, baseType: !586, size: 128, offset: 1408)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !579, file: !580, line: 70, baseType: !586, size: 128, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !579, file: !580, line: 72, baseType: !591, size: 32, offset: 1664)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !126, line: 18, baseType: !137)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !579, file: !580, line: 73, baseType: !164, size: 32, offset: 1696)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !579, file: !580, line: 74, baseType: !164, size: 32, offset: 1728)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !579, file: !580, line: 75, baseType: !164, size: 32, offset: 1760)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !579, file: !580, line: 76, baseType: !164, size: 32, offset: 1792)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !579, file: !580, line: 77, baseType: !164, size: 32, offset: 1824)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !579, file: !580, line: 79, baseType: !55, size: 64, offset: 1856)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !579, file: !580, line: 80, baseType: !55, size: 64, offset: 1920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !579, file: !580, line: 81, baseType: !586, size: 128, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !579, file: !580, line: 83, baseType: !14, size: 32, offset: 2112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !579, file: !580, line: 84, baseType: !14, size: 32, offset: 2144)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !580, line: 85, baseType: !111, size: 32, offset: 2176)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !579, file: !580, line: 86, baseType: !111, size: 32, offset: 2208)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !579, file: !580, line: 88, baseType: !22, size: 32, offset: 2240)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !579, file: !580, line: 89, baseType: !22, size: 32, offset: 2272)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !579, file: !580, line: 90, baseType: !22, size: 32, offset: 2304)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !579, file: !580, line: 91, baseType: !22, size: 32, offset: 2336)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !579, file: !580, line: 93, baseType: !104, size: 32, offset: 2368)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !579, file: !580, line: 95, baseType: !610, size: 32, offset: 2400)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !559, line: 19, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !580, line: 157, size: 544, elements: !613)
!613 = !{!614, !629, !690, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !746}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !612, file: !580, line: 158, baseType: !615, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !580, line: 154, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 145, size: 480, elements: !618)
!618 = !{!619, !620, !621, !622, !625, !626, !627, !628}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !617, file: !580, line: 146, baseType: !455, size: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !617, file: !580, line: 147, baseType: !307, size: 160, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !617, file: !580, line: 148, baseType: !320, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !617, file: !580, line: 149, baseType: !623, size: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !196, line: 106, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !195)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !617, file: !580, line: 150, baseType: !623, size: 32, offset: 352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !580, line: 151, baseType: !111, size: 32, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !617, file: !580, line: 152, baseType: !22, size: 32, offset: 416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !617, file: !580, line: 153, baseType: !22, size: 32, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !612, file: !580, line: 159, baseType: !630, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !632, line: 59, baseType: !633)
!632 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !632, line: 34, size: 800, elements: !634)
!634 = !{!635, !642, !643, !644, !652, !653, !654, !663, !664, !665, !666, !685, !686, !687, !688, !689}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !633, file: !632, line: 35, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !637, line: 21, baseType: !638)
!637 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !637, line: 16, size: 64, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !638, file: !637, line: 17, baseType: !623, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !638, file: !637, line: 19, baseType: !623, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !633, file: !632, line: 37, baseType: !14, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !633, file: !632, line: 38, baseType: !14, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !633, file: !632, line: 40, baseType: !645, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !632, line: 16, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !632, line: 18, size: 96, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !647, file: !632, line: 19, baseType: !24, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !632, line: 20, baseType: !645, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !647, file: !632, line: 21, baseType: !24, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !633, file: !632, line: 41, baseType: !645, size: 32, offset: 160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !633, file: !632, line: 42, baseType: !646, size: 96, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !633, file: !632, line: 44, baseType: !655, size: 32, offset: 288)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !632, line: 31, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !632, line: 25, size: 128, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !657, file: !632, line: 26, baseType: !22, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !657, file: !632, line: 27, baseType: !22, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !657, file: !632, line: 29, baseType: !22, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !657, file: !632, line: 30, baseType: !22, size: 32, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !633, file: !632, line: 45, baseType: !22, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !633, file: !632, line: 47, baseType: !7, size: 32, offset: 352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !633, file: !632, line: 48, baseType: !7, size: 32, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !633, file: !632, line: 50, baseType: !667, size: 256, offset: 416)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !637, line: 37, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !637, line: 24, size: 256, elements: !669)
!669 = !{!670, !672, !673, !674, !684}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !668, file: !637, line: 26, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !668, file: !637, line: 28, baseType: !671, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !668, file: !637, line: 29, baseType: !22, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !668, file: !637, line: 30, baseType: !675, size: 128, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !676, line: 19, baseType: !677)
!676 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 17, size: 128, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !677, file: !676, line: 18, baseType: !680, size: 128)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 128, elements: !682)
!681 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !112)
!682 = !{!683}
!683 = !DISubrange(count: 4)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !668, file: !637, line: 36, baseType: !22, size: 32, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !633, file: !632, line: 52, baseType: !7, size: 32, offset: 672)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !633, file: !632, line: 53, baseType: !8, size: 8, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !633, file: !632, line: 55, baseType: !16, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !633, file: !632, line: 57, baseType: !6, size: 32, offset: 736)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !633, file: !632, line: 58, baseType: !6, size: 32, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !612, file: !580, line: 161, baseType: !691, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !122, line: 62, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 50, size: 384, elements: !694)
!694 = !{!695, !696, !697, !699, !704, !706, !708, !709, !710}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !693, file: !122, line: 51, baseType: !55, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !693, file: !122, line: 52, baseType: !14, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !693, file: !122, line: 53, baseType: !698, size: 96, offset: 96)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, elements: !171)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !693, file: !122, line: 55, baseType: !700, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !122, line: 45, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{!387, !6}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !693, file: !122, line: 56, baseType: !705, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !122, line: 46, baseType: !701)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !693, file: !122, line: 57, baseType: !707, size: 32, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !122, line: 47, baseType: !243)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !693, file: !122, line: 58, baseType: !6, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !693, file: !122, line: 60, baseType: !7, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !693, file: !122, line: 61, baseType: !22, size: 32, offset: 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !612, file: !580, line: 163, baseType: !111, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !612, file: !580, line: 164, baseType: !14, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !612, file: !580, line: 166, baseType: !164, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !612, file: !580, line: 168, baseType: !164, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !612, file: !580, line: 170, baseType: !22, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !612, file: !580, line: 171, baseType: !22, size: 32, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !612, file: !580, line: 172, baseType: !387, size: 32, offset: 288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !612, file: !580, line: 173, baseType: !387, size: 32, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !612, file: !580, line: 174, baseType: !387, size: 32, offset: 352)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !612, file: !580, line: 176, baseType: !22, size: 32, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !612, file: !580, line: 177, baseType: !387, size: 32, offset: 416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !612, file: !580, line: 178, baseType: !387, size: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !612, file: !580, line: 180, baseType: !724, size: 32, offset: 480)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !253, line: 25, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !253, line: 29, size: 320, elements: !727)
!727 = !{!728, !729, !739, !744, !745}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !726, file: !253, line: 30, baseType: !6, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !726, file: !253, line: 31, baseType: !730, size: 192, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !731, line: 22, baseType: !732)
!731 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 16, size: 192, elements: !733)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !732, file: !731, line: 17, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !732, file: !731, line: 18, baseType: !14, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !731, line: 19, baseType: !55, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !732, file: !731, line: 20, baseType: !176, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !732, file: !731, line: 21, baseType: !22, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !726, file: !253, line: 32, baseType: !740, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !253, line: 27, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!522, !724, !6}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !726, file: !253, line: 33, baseType: !6, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !726, file: !253, line: 34, baseType: !22, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !612, file: !580, line: 182, baseType: !22, size: 32, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !579, file: !580, line: 96, baseType: !748, size: 32, offset: 2432)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !580, line: 62, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 39, size: 576, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !750, file: !580, line: 40, baseType: !307, size: 160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !750, file: !580, line: 41, baseType: !320, size: 64, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !750, file: !580, line: 43, baseType: !28, size: 96, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !750, file: !580, line: 46, baseType: !16, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !750, file: !580, line: 47, baseType: !16, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !750, file: !580, line: 48, baseType: !16, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !750, file: !580, line: 49, baseType: !16, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !750, file: !580, line: 50, baseType: !16, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !750, file: !580, line: 51, baseType: !16, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !750, file: !580, line: 52, baseType: !16, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !750, file: !580, line: 53, baseType: !16, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !750, file: !580, line: 56, baseType: !591, size: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !750, file: !580, line: 57, baseType: !164, size: 32, offset: 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !750, file: !580, line: 58, baseType: !164, size: 32, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !750, file: !580, line: 59, baseType: !14, size: 32, offset: 480)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !750, file: !580, line: 60, baseType: !111, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !750, file: !580, line: 61, baseType: !387, size: 32, offset: 544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !579, file: !580, line: 102, baseType: !387, size: 32, offset: 2464)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !579, file: !580, line: 103, baseType: !387, size: 32, offset: 2496)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !579, file: !580, line: 104, baseType: !387, size: 32, offset: 2528)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !579, file: !580, line: 105, baseType: !387, size: 32, offset: 2560)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !579, file: !580, line: 107, baseType: !273, size: 384, offset: 2592)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !579, file: !580, line: 109, baseType: !16, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !579, file: !580, line: 110, baseType: !16, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !579, file: !580, line: 112, baseType: !16, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !579, file: !580, line: 113, baseType: !16, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !579, file: !580, line: 114, baseType: !16, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !579, file: !580, line: 115, baseType: !16, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !579, file: !580, line: 116, baseType: !16, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !579, file: !580, line: 117, baseType: !16, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !579, file: !580, line: 118, baseType: !16, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !579, file: !580, line: 119, baseType: !16, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !579, file: !580, line: 121, baseType: !16, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !579, file: !580, line: 122, baseType: !16, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !560, file: !561, line: 381, baseType: !787, size: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !559, line: 17, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !790, line: 313, size: 4096, elements: !791)
!790 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!791 = !{!792, !797, !798, !839, !918, !919, !941, !950, !1073, !1074, !1075, !1113, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1291, !1295, !1296, !1300, !1301, !1302, !1303, !1304, !1308, !1312, !1316, !1317, !1329, !1330, !1331, !1332, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !789, file: !790, line: 314, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !790, line: 309, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !557, !787}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !789, file: !790, line: 315, baseType: !793, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !789, file: !790, line: 317, baseType: !799, size: 480, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !800, line: 22, baseType: !801)
!800 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !800, line: 36, size: 480, elements: !802)
!802 = !{!803, !804, !805, !806, !808, !809, !810, !816, !821, !823, !824, !833, !834, !835, !836, !837, !838}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !801, file: !800, line: 37, baseType: !265, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !801, file: !800, line: 39, baseType: !357, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !801, file: !800, line: 40, baseType: !369, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !800, line: 41, baseType: !807, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !801, file: !800, line: 43, baseType: !22, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !801, file: !800, line: 44, baseType: !387, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !801, file: !800, line: 46, baseType: !811, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !800, line: 24, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!522, !815, !6}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !801, file: !800, line: 47, baseType: !817, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !800, line: 26, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !815, !6, !22}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !801, file: !800, line: 48, baseType: !822, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !800, line: 28, baseType: !818)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !800, line: 49, baseType: !6, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !801, file: !800, line: 56, baseType: !825, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !827, line: 78, baseType: !828)
!827 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 74, size: 128, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !828, file: !827, line: 75, baseType: !357, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !828, file: !827, line: 76, baseType: !369, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !827, line: 77, baseType: !55, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !801, file: !800, line: 58, baseType: !112, size: 32, offset: 352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !801, file: !800, line: 59, baseType: !112, size: 32, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !801, file: !800, line: 61, baseType: !176, size: 32, offset: 416)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !801, file: !800, line: 63, baseType: !16, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !801, file: !800, line: 64, baseType: !16, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !801, file: !800, line: 67, baseType: !16, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !789, file: !790, line: 319, baseType: !840, size: 32, offset: 544)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !842, line: 17, baseType: !843)
!842 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !842, line: 25, size: 1120, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !851, !852, !853, !854, !855, !860, !861, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !917}
