; ModuleID = 'src/http/modules/ngx_http_userid_filter_module.c'
source_filename = "src/http/modules/ngx_http_userid_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_userid_filter_module_ctx", scope: !2, file: !3, line: 159, type: !1829, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !65)
!3 = !DIFile(filename: "src/http/modules/ngx_http_userid_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !11, !14, !17, !48, !60, !8, !63}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 191, baseType: !16)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !19, line: 34, size: 224, elements: !20)
!19 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !{!21, !24, !27, !28, !47}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !18, file: !19, line: 35, baseType: !22, size: 16)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !15, line: 409, baseType: !23)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !18, file: !19, line: 36, baseType: !25, size: 16, offset: 16)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !19, line: 12, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 186, baseType: !23)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !18, file: !19, line: 37, baseType: !14, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !18, file: !19, line: 38, baseType: !29, size: 128, offset: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !19, line: 23, size: 128, elements: !30)
!30 = !{!31}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !29, file: !19, line: 28, baseType: !32, size: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !19, line: 24, size: 128, elements: !33)
!33 = !{!34, !39, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !32, file: !19, line: 25, baseType: !35, size: 128)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !37)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 181, baseType: !10)
!37 = !{!38}
!38 = !DISubrange(count: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !32, file: !19, line: 26, baseType: !40, size: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !32, file: !19, line: 27, baseType: !44, size: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 4)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !18, file: !19, line: 39, baseType: !14, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !19, line: 16, size: 128, elements: !50)
!50 = !{!51, !52, !53, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !49, file: !19, line: 17, baseType: !22, size: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !49, file: !19, line: 18, baseType: !25, size: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !49, file: !19, line: 19, baseType: !54, size: 32, offset: 32)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !19, line: 14, size: 32, elements: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !54, file: !19, line: 14, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !19, line: 13, baseType: !14)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !49, file: !19, line: 20, baseType: !59, size: 64, offset: 64)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !41)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !61, line: 79, baseType: !62)
!61 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !15, line: 125, baseType: !16)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !64)
!64 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!65 = !{!66, !0, !572, !574, !576, !578, !580, !582, !584, !586, !1799, !1804, !1809, !1819, !1825, !1827}
!66 = !DIGlobalVariableExpression(var: !67)
!67 = distinct !DIGlobalVariable(name: "ngx_http_userid_filter_module", scope: !2, file: !3, line: 174, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !69, line: 15, baseType: !70)
!69 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !71, line: 222, size: 800, elements: !72)
!71 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!72 = !{!73, !74, !75, !77, !78, !79, !80, !81, !82, !545, !546, !552, !556, !557, !558, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !70, file: !71, line: 223, baseType: !60, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !70, file: !71, line: 224, baseType: !60, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 226, baseType: !76, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !70, file: !71, line: 228, baseType: !60, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !70, file: !71, line: 229, baseType: !60, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !70, file: !71, line: 231, baseType: !60, size: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !70, file: !71, line: 232, baseType: !11, size: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !70, file: !71, line: 234, baseType: !6, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !70, file: !71, line: 235, baseType: !83, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !69, line: 22, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !86, line: 77, size: 224, elements: !87)
!86 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = !{!88, !96, !97, !542, !543, !544}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !86, line: 78, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !90, line: 19, baseType: !91)
!90 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 16, size: 64, elements: !92)
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, file: !90, line: 17, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 120, baseType: !16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !90, line: 18, baseType: !7, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !86, line: 79, baseType: !60, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !85, file: !86, line: 80, baseType: !98, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DISubroutineType(types: !100)
!100 = !{!76, !101, !83, !6}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !69, line: 16, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !86, line: 116, size: 384, elements: !104)
!104 = !{!105, !106, !282, !524, !525, !526, !535, !536, !537, !538, !539, !541}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !103, file: !86, line: 117, baseType: !76, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !103, file: !86, line: 118, baseType: !107, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !109, line: 22, baseType: !110)
!109 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 16, size: 160, elements: !111)
!111 = !{!112, !113, !114, !115, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !110, file: !109, line: 17, baseType: !6, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !110, file: !109, line: 18, baseType: !60, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !110, file: !109, line: 19, baseType: !94, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !110, file: !109, line: 20, baseType: !60, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !110, file: !109, line: 21, baseType: !117, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !69, line: 18, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !120, line: 57, size: 320, elements: !121)
!120 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = !{!122, !130, !131, !132, !262, !269, !281}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !119, file: !120, line: 58, baseType: !123, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !120, line: 54, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 49, size: 128, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !124, file: !120, line: 50, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !124, file: !120, line: 51, baseType: !7, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !120, line: 52, baseType: !117, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !124, file: !120, line: 53, baseType: !60, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !119, file: !120, line: 59, baseType: !94, size: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !119, file: !120, line: 60, baseType: !117, size: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !119, file: !120, line: 61, baseType: !133, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !69, line: 19, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !136, line: 59, size: 64, elements: !137)
!136 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!137 = !{!138, !261}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !135, file: !136, line: 60, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !136, line: 18, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !136, line: 20, size: 352, elements: !142)
!142 = !{!143, !144, !145, !148, !149, !150, !151, !153, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !141, file: !136, line: 21, baseType: !7, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !141, file: !136, line: 22, baseType: !7, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !141, file: !136, line: 23, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !15, line: 222, baseType: !147)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !141, file: !136, line: 24, baseType: !146, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !141, file: !136, line: 26, baseType: !7, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !141, file: !136, line: 27, baseType: !7, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !141, file: !136, line: 28, baseType: !152, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !136, line: 16, baseType: !6)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !141, file: !136, line: 29, baseType: !154, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !69, line: 23, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !157, line: 16, size: 1216, elements: !158)
!157 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!158 = !{!159, !162, !163, !206, !207, !208, !246, !247}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !156, file: !157, line: 17, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !161, line: 16, baseType: !147)
!161 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !157, line: 18, baseType: !89, size: 64, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !156, file: !157, line: 19, baseType: !164, size: 960, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !161, line: 17, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !166, line: 4, size: 960, elements: !167)
!166 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = !{!168, !170, !171, !173, !174, !176, !177, !179, !181, !183, !184, !185, !186, !187, !188, !190, !191, !193, !194, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !165, file: !166, line: 6, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !15, line: 232, baseType: !16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !165, file: !166, line: 7, baseType: !169, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !165, file: !166, line: 8, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !15, line: 227, baseType: !16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !165, file: !166, line: 9, baseType: !172, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !165, file: !166, line: 10, baseType: !175, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !15, line: 217, baseType: !16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !165, file: !166, line: 11, baseType: !175, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !165, file: !166, line: 13, baseType: !178, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !15, line: 212, baseType: !16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !165, file: !166, line: 14, baseType: !180, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 304, baseType: !16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !165, file: !166, line: 15, baseType: !182, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 309, baseType: !16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !165, file: !166, line: 16, baseType: !16, size: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !165, file: !166, line: 17, baseType: !169, size: 32, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !165, file: !166, line: 18, baseType: !169, size: 32, offset: 352)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !165, file: !166, line: 19, baseType: !146, size: 32, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !165, file: !166, line: 20, baseType: !146, size: 32, offset: 416)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !165, file: !166, line: 21, baseType: !189, size: 32, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !15, line: 237, baseType: !64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !165, file: !166, line: 22, baseType: !189, size: 32, offset: 480)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !165, file: !166, line: 23, baseType: !192, size: 32, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !15, line: 242, baseType: !147)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !165, file: !166, line: 24, baseType: !192, size: 32, offset: 544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !165, file: !166, line: 26, baseType: !195, size: 64, offset: 576)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !15, line: 288, size: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !195, file: !15, line: 288, baseType: !63, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !195, file: !15, line: 288, baseType: !64, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !165, file: !166, line: 27, baseType: !195, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !165, file: !166, line: 28, baseType: !195, size: 64, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !165, file: !166, line: 29, baseType: !202, size: 192, offset: 768)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 192, elements: !204)
!203 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!204 = !{!205}
!205 = !DISubrange(count: 3)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !156, file: !157, line: 21, baseType: !146, size: 32, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !156, file: !157, line: 22, baseType: !146, size: 32, offset: 1120)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !156, file: !157, line: 24, baseType: !209, size: 32, offset: 1152)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !69, line: 20, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !212, line: 50, size: 320, elements: !213)
!212 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!213 = !{!214, !215, !227, !231, !232, !237, !238, !243, !244, !245}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !211, file: !212, line: 51, baseType: !60, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !211, file: !212, line: 52, baseType: !216, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !69, line: 21, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !86, line: 89, size: 160, elements: !219)
!219 = !{!220, !221, !222, !226}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !218, file: !86, line: 90, baseType: !160, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !86, line: 91, baseType: !89, size: 64, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !218, file: !86, line: 93, baseType: !223, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !216, !209}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !86, line: 94, baseType: !6, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !211, file: !212, line: 54, baseType: !228, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !229, line: 98, baseType: !230)
!229 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!230 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !211, file: !212, line: 56, baseType: !63, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !211, file: !212, line: 58, baseType: !233, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !212, line: 45, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DISubroutineType(types: !236)
!236 = !{!7, !209, !7, !94}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !212, line: 59, baseType: !6, size: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !211, file: !212, line: 61, baseType: !239, size: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !212, line: 46, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !209, !60, !7, !94}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !211, file: !212, line: 62, baseType: !6, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !211, file: !212, line: 70, baseType: !76, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !211, file: !212, line: 72, baseType: !209, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !156, file: !157, line: 37, baseType: !16, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !156, file: !157, line: 38, baseType: !16, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !141, file: !136, line: 30, baseType: !139, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !141, file: !136, line: 34, baseType: !16, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !141, file: !136, line: 40, baseType: !16, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !141, file: !136, line: 43, baseType: !16, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !141, file: !136, line: 45, baseType: !16, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !141, file: !136, line: 46, baseType: !16, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !141, file: !136, line: 47, baseType: !16, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !141, file: !136, line: 48, baseType: !16, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !141, file: !136, line: 49, baseType: !16, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !141, file: !136, line: 50, baseType: !16, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !141, file: !136, line: 52, baseType: !16, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !141, file: !136, line: 53, baseType: !16, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !141, file: !136, line: 55, baseType: !147, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !136, line: 61, baseType: !133, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !119, file: !120, line: 62, baseType: !263, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !120, line: 41, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !120, line: 43, size: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !120, line: 44, baseType: !263, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !265, file: !120, line: 45, baseType: !6, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !119, file: !120, line: 63, baseType: !270, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !120, line: 32, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !120, line: 34, size: 96, elements: !273)
!273 = !{!274, !279, !280}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !272, file: !120, line: 35, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !120, line: 30, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !6}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !120, line: 36, baseType: !6, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !120, line: 37, baseType: !270, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !119, file: !120, line: 64, baseType: !209, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !103, file: !86, line: 120, baseType: !283, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !69, line: 17, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !286, line: 38, size: 2496, elements: !287)
!286 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!287 = !{!288, !292, !293, !294, !295, !296, !470, !471, !472, !475, !476, !477, !478, !479, !480, !481, !482, !493, !494, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !285, file: !286, line: 39, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !285, file: !286, line: 40, baseType: !117, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !285, file: !286, line: 42, baseType: !209, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !285, file: !286, line: 43, baseType: !210, size: 320, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !285, file: !286, line: 45, baseType: !60, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !285, file: !286, line: 47, baseType: !297, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !69, line: 26, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !301, line: 121, size: 896, elements: !302)
!301 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!302 = !{!303, !304, !360, !361, !364, !371, !373, !378, !383, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !301, line: 122, baseType: !6, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !300, file: !301, line: 123, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !69, line: 24, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !308, line: 30, size: 384, elements: !309)
!308 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !337, !338, !339, !352}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !308, line: 31, baseType: !6, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !307, file: !308, line: 33, baseType: !16, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !307, file: !308, line: 35, baseType: !16, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !307, file: !308, line: 38, baseType: !16, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !307, file: !308, line: 44, baseType: !16, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !307, file: !308, line: 46, baseType: !16, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !307, file: !308, line: 49, baseType: !16, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !307, file: !308, line: 51, baseType: !16, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !307, file: !308, line: 54, baseType: !16, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !307, file: !308, line: 56, baseType: !16, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !307, file: !308, line: 57, baseType: !16, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !307, file: !308, line: 59, baseType: !16, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !307, file: !308, line: 60, baseType: !16, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !307, file: !308, line: 62, baseType: !16, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !307, file: !308, line: 64, baseType: !16, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !307, file: !308, line: 67, baseType: !16, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !307, file: !308, line: 69, baseType: !16, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !307, file: !308, line: 71, baseType: !16, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !307, file: !308, line: 74, baseType: !16, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !307, file: !308, line: 75, baseType: !16, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !307, file: !308, line: 77, baseType: !16, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !307, file: !308, line: 107, baseType: !16, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !307, file: !308, line: 110, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !69, line: 31, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !305}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !307, file: !308, line: 117, baseType: !60, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !307, file: !308, line: 119, baseType: !209, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !307, file: !308, line: 121, baseType: !340, size: 160, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !341, line: 20, baseType: !342)
!341 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !341, line: 22, size: 160, elements: !343)
!343 = !{!344, !346, !348, !349, !350, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !342, file: !341, line: 23, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !341, line: 16, baseType: !60)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !342, file: !341, line: 24, baseType: !347, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !342, file: !341, line: 25, baseType: !347, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !342, file: !341, line: 26, baseType: !347, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !342, file: !341, line: 27, baseType: !8, size: 8, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !341, line: 28, baseType: !8, size: 8, offset: 136)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !307, file: !308, line: 124, baseType: !353, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !354, line: 16, baseType: !355)
!354 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !354, line: 18, size: 64, elements: !356)
!356 = !{!357, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !354, line: 19, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !354, line: 20, baseType: !358, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !300, file: !301, line: 124, baseType: !305, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !300, file: !301, line: 126, baseType: !362, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !363, line: 17, baseType: !147)
!363 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !300, file: !301, line: 128, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !366, line: 19, baseType: !367)
!366 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !298, !7, !94}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 135, baseType: !147)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !300, file: !301, line: 129, baseType: !372, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !366, line: 22, baseType: !367)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !300, file: !301, line: 130, baseType: !374, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !366, line: 20, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!370, !298, !133, !146}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !300, file: !301, line: 131, baseType: !379, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !366, line: 23, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{!133, !298, !133, !146}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !300, file: !301, line: 133, baseType: !384, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !301, line: 16, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !301, line: 18, size: 960, elements: !387)
!387 = !{!388, !389, !399, !401, !402, !403, !404, !405, !406, !407, !412, !413, !414, !415, !416, !417, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !386, file: !301, line: 19, baseType: !362, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !386, file: !301, line: 21, baseType: !390, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !392, line: 297, size: 128, elements: !393)
!392 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !391, file: !392, line: 298, baseType: !22, size: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !391, file: !392, line: 299, baseType: !396, size: 112, offset: 16)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 112, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 14)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !386, file: !301, line: 22, baseType: !400, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !15, line: 404, baseType: !16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !386, file: !301, line: 23, baseType: !94, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !386, file: !301, line: 24, baseType: !89, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !386, file: !301, line: 26, baseType: !147, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !386, file: !301, line: 28, baseType: !147, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !386, file: !301, line: 29, baseType: !147, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !386, file: !301, line: 30, baseType: !147, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !386, file: !301, line: 38, baseType: !408, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !69, line: 32, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !298}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !386, file: !301, line: 40, baseType: !6, size: 32, offset: 352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !386, file: !301, line: 42, baseType: !210, size: 320, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !386, file: !301, line: 43, baseType: !209, size: 32, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !386, file: !301, line: 45, baseType: !94, size: 32, offset: 736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !386, file: !301, line: 47, baseType: !94, size: 32, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !386, file: !301, line: 49, baseType: !418, size: 32, offset: 800)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !419, line: 16, baseType: !345)
!419 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !386, file: !301, line: 51, baseType: !384, size: 32, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !386, file: !301, line: 52, baseType: !298, size: 32, offset: 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !386, file: !301, line: 54, baseType: !60, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !386, file: !301, line: 56, baseType: !16, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !386, file: !301, line: 57, baseType: !16, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !386, file: !301, line: 58, baseType: !16, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !386, file: !301, line: 60, baseType: !16, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !386, file: !301, line: 61, baseType: !16, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !386, file: !301, line: 62, baseType: !16, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !386, file: !301, line: 63, baseType: !16, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !386, file: !301, line: 64, baseType: !16, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !386, file: !301, line: 65, baseType: !16, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !386, file: !301, line: 66, baseType: !16, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !386, file: !301, line: 67, baseType: !16, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !386, file: !301, line: 70, baseType: !16, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !386, file: !301, line: 72, baseType: !16, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !386, file: !301, line: 73, baseType: !16, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !386, file: !301, line: 74, baseType: !16, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !386, file: !301, line: 76, baseType: !16, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !386, file: !301, line: 77, baseType: !16, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !386, file: !301, line: 78, baseType: !16, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !300, file: !301, line: 135, baseType: !146, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !300, file: !301, line: 137, baseType: !209, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !300, file: !301, line: 139, baseType: !117, size: 32, offset: 352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !301, line: 141, baseType: !147, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !300, file: !301, line: 143, baseType: !390, size: 32, offset: 416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !300, file: !301, line: 144, baseType: !400, size: 32, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !300, file: !301, line: 145, baseType: !89, size: 64, offset: 480)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !300, file: !301, line: 147, baseType: !89, size: 64, offset: 544)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !300, file: !301, line: 148, baseType: !25, size: 16, offset: 608)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !300, file: !301, line: 154, baseType: !390, size: 32, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !300, file: !301, line: 155, baseType: !400, size: 32, offset: 672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !300, file: !301, line: 157, baseType: !139, size: 32, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !300, file: !301, line: 159, baseType: !353, size: 64, offset: 736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !300, file: !301, line: 161, baseType: !228, size: 32, offset: 800)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !300, file: !301, line: 163, baseType: !60, size: 32, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !300, file: !301, line: 165, baseType: !16, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !300, file: !301, line: 167, baseType: !16, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !300, file: !301, line: 169, baseType: !16, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !300, file: !301, line: 170, baseType: !16, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !300, file: !301, line: 171, baseType: !16, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !300, file: !301, line: 173, baseType: !16, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !300, file: !301, line: 174, baseType: !16, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !300, file: !301, line: 175, baseType: !16, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !300, file: !301, line: 176, baseType: !16, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !300, file: !301, line: 178, baseType: !16, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !300, file: !301, line: 179, baseType: !16, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !300, file: !301, line: 180, baseType: !16, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !300, file: !301, line: 181, baseType: !16, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !300, file: !301, line: 183, baseType: !16, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !285, file: !286, line: 48, baseType: !298, size: 32, offset: 480)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !285, file: !286, line: 49, baseType: !60, size: 32, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !285, file: !286, line: 51, baseType: !473, size: 32, offset: 544)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !285, file: !286, line: 52, baseType: !60, size: 32, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !285, file: !286, line: 53, baseType: !60, size: 32, offset: 608)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !285, file: !286, line: 55, baseType: !353, size: 64, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !285, file: !286, line: 56, baseType: !60, size: 32, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !285, file: !286, line: 58, baseType: !108, size: 160, offset: 736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !285, file: !286, line: 59, baseType: !108, size: 160, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !285, file: !286, line: 61, baseType: !108, size: 160, offset: 1056)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !285, file: !286, line: 62, baseType: !483, size: 96, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !341, line: 32, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !341, line: 37, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !484, file: !341, line: 38, baseType: !347, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !484, file: !341, line: 39, baseType: !347, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !484, file: !341, line: 40, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !341, line: 34, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !347, !347, !347}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !285, file: !286, line: 63, baseType: !340, size: 160, offset: 1312)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !285, file: !286, line: 65, baseType: !495, size: 224, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !496, line: 31, baseType: !497)
!496 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 25, size: 224, elements: !498)
!498 = !{!499, !507, !508, !509, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !497, file: !496, line: 26, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !496, line: 16, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !496, line: 18, size: 96, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !502, file: !496, line: 19, baseType: !6, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !502, file: !496, line: 20, baseType: !60, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !496, line: 21, baseType: !500, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !497, file: !496, line: 27, baseType: !501, size: 96, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !497, file: !496, line: 28, baseType: !94, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !497, file: !496, line: 29, baseType: !60, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !497, file: !496, line: 30, baseType: !117, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !285, file: !286, line: 66, baseType: !495, size: 224, offset: 1696)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !285, file: !286, line: 68, baseType: !60, size: 32, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !285, file: !286, line: 69, baseType: !60, size: 32, offset: 1952)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !285, file: !286, line: 71, baseType: !298, size: 32, offset: 1984)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !285, file: !286, line: 72, baseType: !305, size: 32, offset: 2016)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !285, file: !286, line: 73, baseType: !305, size: 32, offset: 2048)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !285, file: !286, line: 75, baseType: !283, size: 32, offset: 2080)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !285, file: !286, line: 77, baseType: !89, size: 64, offset: 2112)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !285, file: !286, line: 78, baseType: !89, size: 64, offset: 2176)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !285, file: !286, line: 79, baseType: !89, size: 64, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !285, file: !286, line: 80, baseType: !89, size: 64, offset: 2304)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !285, file: !286, line: 81, baseType: !89, size: 64, offset: 2368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !285, file: !286, line: 82, baseType: !89, size: 64, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !103, file: !86, line: 121, baseType: !117, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !103, file: !86, line: 122, baseType: !117, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !103, file: !86, line: 123, baseType: !527, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !86, line: 103, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 98, size: 1344, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !529, file: !86, line: 99, baseType: !155, size: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !529, file: !86, line: 100, baseType: !139, size: 32, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !529, file: !86, line: 101, baseType: !139, size: 32, offset: 1248)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !529, file: !86, line: 102, baseType: !60, size: 32, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !103, file: !86, line: 124, baseType: !209, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !103, file: !86, line: 126, baseType: !6, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !103, file: !86, line: 127, baseType: !60, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !103, file: !86, line: 128, baseType: !60, size: 32, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !103, file: !86, line: 130, baseType: !540, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !86, line: 112, baseType: !98)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !103, file: !86, line: 131, baseType: !76, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !85, file: !86, line: 81, baseType: !60, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !85, file: !86, line: 82, baseType: !60, size: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !85, file: !86, line: 83, baseType: !6, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !71, line: 236, baseType: !60, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !70, file: !71, line: 238, baseType: !547, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !209}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !61, line: 78, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !15, line: 140, baseType: !147)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !70, file: !71, line: 240, baseType: !553, size: 32, offset: 352)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{!550, !283}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !70, file: !71, line: 242, baseType: !553, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !70, file: !71, line: 243, baseType: !553, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !70, file: !71, line: 244, baseType: !559, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !283}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !70, file: !71, line: 245, baseType: !559, size: 32, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !70, file: !71, line: 247, baseType: !559, size: 32, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !70, file: !71, line: 249, baseType: !62, size: 32, offset: 544)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !70, file: !71, line: 250, baseType: !62, size: 32, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !70, file: !71, line: 251, baseType: !62, size: 32, offset: 608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !70, file: !71, line: 252, baseType: !62, size: 32, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !70, file: !71, line: 253, baseType: !62, size: 32, offset: 672)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !70, file: !71, line: 254, baseType: !62, size: 32, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !70, file: !71, line: 255, baseType: !62, size: 32, offset: 736)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !70, file: !71, line: 256, baseType: !62, size: 32, offset: 768)
!572 = !DIGlobalVariableExpression(var: !573)
!573 = distinct !DIGlobalVariable(name: "ngx_http_userid_got", scope: !2, file: !3, line: 190, type: !89, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575)
!575 = distinct !DIGlobalVariable(name: "ngx_http_userid_set", scope: !2, file: !3, line: 191, type: !89, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577)
!577 = distinct !DIGlobalVariable(name: "start_value", scope: !2, file: !3, line: 71, type: !14, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579)
!579 = distinct !DIGlobalVariable(name: "sequencer_v1", scope: !2, file: !3, line: 72, type: !14, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581)
!581 = distinct !DIGlobalVariable(name: "sequencer_v2", scope: !2, file: !3, line: 73, type: !14, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583)
!583 = distinct !DIGlobalVariable(name: "ngx_http_userid_reset", scope: !2, file: !3, line: 192, type: !89, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585)
!585 = distinct !DIGlobalVariable(name: "ngx_http_userid_reset_index", scope: !2, file: !3, line: 193, type: !60, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587)
!587 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !2, file: !3, line: 79, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !589, line: 521, baseType: !590)
!589 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DISubroutineType(types: !592)
!592 = !{!550, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !595, line: 16, baseType: !596)
!595 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !597, line: 364, size: 5376, elements: !598)
!597 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !610, !611, !820, !1352, !1353, !1354, !1355, !1394, !1424, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1469, !1480, !1487, !1488, !1490, !1491, !1504, !1505, !1506, !1507, !1508, !1509, !1695, !1699, !1704, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !596, file: !597, line: 365, baseType: !14, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !596, file: !597, line: 367, baseType: !298, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !596, file: !597, line: 369, baseType: !291, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !596, file: !597, line: 370, baseType: !291, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !596, file: !597, line: 371, baseType: !291, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !596, file: !597, line: 372, baseType: !291, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !596, file: !597, line: 374, baseType: !606, size: 32, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !597, line: 361, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !593}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !596, file: !597, line: 375, baseType: !606, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !596, file: !597, line: 378, baseType: !612, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !595, line: 18, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !615, line: 65, size: 3008, elements: !616)
!615 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!616 = !{!617, !618, !619, !620, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !778, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !614, file: !615, line: 66, baseType: !155, size: 1216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !614, file: !615, line: 67, baseType: !108, size: 160, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !614, file: !615, line: 68, baseType: !14, size: 32, offset: 1376)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !614, file: !615, line: 69, baseType: !621, size: 128, offset: 1408)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !37)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !614, file: !615, line: 70, baseType: !621, size: 128, offset: 1536)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !614, file: !615, line: 72, baseType: !624, size: 32, offset: 1664)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !161, line: 18, baseType: !172)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !614, file: !615, line: 73, baseType: !63, size: 32, offset: 1696)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !614, file: !615, line: 74, baseType: !63, size: 32, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !614, file: !615, line: 75, baseType: !63, size: 32, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !614, file: !615, line: 76, baseType: !63, size: 32, offset: 1792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !614, file: !615, line: 77, baseType: !63, size: 32, offset: 1824)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !614, file: !615, line: 79, baseType: !89, size: 64, offset: 1856)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !614, file: !615, line: 80, baseType: !89, size: 64, offset: 1920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !614, file: !615, line: 81, baseType: !621, size: 128, offset: 1984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !614, file: !615, line: 83, baseType: !94, size: 32, offset: 2112)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !614, file: !615, line: 84, baseType: !94, size: 32, offset: 2144)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !614, file: !615, line: 85, baseType: !146, size: 32, offset: 2176)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !614, file: !615, line: 86, baseType: !146, size: 32, offset: 2208)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !614, file: !615, line: 88, baseType: !60, size: 32, offset: 2240)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !614, file: !615, line: 89, baseType: !60, size: 32, offset: 2272)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !614, file: !615, line: 90, baseType: !60, size: 32, offset: 2304)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !614, file: !615, line: 91, baseType: !60, size: 32, offset: 2336)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !614, file: !615, line: 93, baseType: !139, size: 32, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !614, file: !615, line: 95, baseType: !643, size: 32, offset: 2400)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !595, line: 19, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !615, line: 157, size: 544, elements: !646)
!646 = !{!647, !662, !721, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !777}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !645, file: !615, line: 158, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !615, line: 154, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 145, size: 480, elements: !651)
!651 = !{!652, !653, !654, !655, !658, !659, !660, !661}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !650, file: !615, line: 146, baseType: !483, size: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !650, file: !615, line: 147, baseType: !340, size: 160, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !650, file: !615, line: 148, baseType: !353, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !650, file: !615, line: 149, baseType: !656, size: 32, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !229, line: 106, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !228)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !650, file: !615, line: 150, baseType: !656, size: 32, offset: 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !650, file: !615, line: 151, baseType: !146, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !650, file: !615, line: 152, baseType: !60, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !650, file: !615, line: 153, baseType: !60, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !645, file: !615, line: 159, baseType: !663, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !665, line: 59, baseType: !666)
!665 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 34, size: 800, elements: !667)
!667 = !{!668, !675, !676, !677, !685, !686, !687, !696, !697, !698, !699, !716, !717, !718, !719, !720}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !666, file: !665, line: 35, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !670, line: 21, baseType: !671)
!670 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 16, size: 64, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !671, file: !670, line: 17, baseType: !656, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !671, file: !670, line: 19, baseType: !656, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !666, file: !665, line: 37, baseType: !94, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !666, file: !665, line: 38, baseType: !94, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !666, file: !665, line: 40, baseType: !678, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !665, line: 16, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !665, line: 18, size: 96, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !680, file: !665, line: 19, baseType: !62, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !665, line: 20, baseType: !678, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !680, file: !665, line: 21, baseType: !62, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !666, file: !665, line: 41, baseType: !678, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !666, file: !665, line: 42, baseType: !679, size: 96, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !666, file: !665, line: 44, baseType: !688, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !665, line: 31, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 25, size: 128, elements: !691)
!691 = !{!692, !693, !694, !695}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !690, file: !665, line: 26, baseType: !60, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !690, file: !665, line: 27, baseType: !60, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !690, file: !665, line: 29, baseType: !60, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !690, file: !665, line: 30, baseType: !60, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !666, file: !665, line: 45, baseType: !60, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !666, file: !665, line: 47, baseType: !7, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !666, file: !665, line: 48, baseType: !7, size: 32, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !666, file: !665, line: 50, baseType: !700, size: 256, offset: 416)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !670, line: 37, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 24, size: 256, elements: !702)
!702 = !{!703, !705, !706, !707, !715}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !701, file: !670, line: 26, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !701, file: !670, line: 28, baseType: !704, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !701, file: !670, line: 29, baseType: !60, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !701, file: !670, line: 30, baseType: !708, size: 128, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !709, line: 19, baseType: !710)
!709 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !709, line: 17, size: 128, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !710, file: !709, line: 18, baseType: !713, size: 128)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 128, elements: !45)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !147)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !701, file: !670, line: 36, baseType: !60, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !666, file: !665, line: 52, baseType: !7, size: 32, offset: 672)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !666, file: !665, line: 53, baseType: !8, size: 8, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !666, file: !665, line: 55, baseType: !16, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !665, line: 57, baseType: !6, size: 32, offset: 736)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !666, file: !665, line: 58, baseType: !6, size: 32, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !645, file: !615, line: 161, baseType: !722, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !157, line: 62, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 50, size: 384, elements: !725)
!725 = !{!726, !727, !728, !730, !735, !737, !739, !740, !741}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !157, line: 51, baseType: !89, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !724, file: !157, line: 52, baseType: !94, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !724, file: !157, line: 53, baseType: !729, size: 96, offset: 96)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 96, elements: !204)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !724, file: !157, line: 55, baseType: !731, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !157, line: 45, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!418, !6}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !724, file: !157, line: 56, baseType: !736, size: 32, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !157, line: 46, baseType: !732)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !724, file: !157, line: 57, baseType: !738, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !157, line: 47, baseType: !276)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !724, file: !157, line: 58, baseType: !6, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !724, file: !157, line: 60, baseType: !7, size: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !724, file: !157, line: 61, baseType: !60, size: 32, offset: 352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !645, file: !615, line: 163, baseType: !146, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !645, file: !615, line: 164, baseType: !94, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !645, file: !615, line: 166, baseType: !63, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !645, file: !615, line: 168, baseType: !63, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !645, file: !615, line: 170, baseType: !60, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !645, file: !615, line: 171, baseType: !60, size: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !645, file: !615, line: 172, baseType: !418, size: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !645, file: !615, line: 173, baseType: !418, size: 32, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !645, file: !615, line: 174, baseType: !418, size: 32, offset: 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !645, file: !615, line: 176, baseType: !60, size: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !645, file: !615, line: 177, baseType: !418, size: 32, offset: 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !645, file: !615, line: 178, baseType: !418, size: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !645, file: !615, line: 180, baseType: !755, size: 32, offset: 480)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !286, line: 25, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !286, line: 29, size: 320, elements: !758)
!758 = !{!759, !760, !770, !775, !776}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !286, line: 30, baseType: !6, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !757, file: !286, line: 31, baseType: !761, size: 192, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !762, line: 22, baseType: !763)
!762 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !762, line: 16, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !763, file: !762, line: 17, baseType: !7, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !763, file: !762, line: 18, baseType: !94, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !762, line: 19, baseType: !89, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !763, file: !762, line: 20, baseType: !209, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !763, file: !762, line: 21, baseType: !60, size: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !757, file: !286, line: 32, baseType: !771, size: 32, offset: 224)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !286, line: 27, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!550, !755, !6}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !757, file: !286, line: 33, baseType: !6, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !757, file: !286, line: 34, baseType: !60, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !645, file: !615, line: 182, baseType: !60, size: 32, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !614, file: !615, line: 96, baseType: !779, size: 32, offset: 2432)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !615, line: 62, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 39, size: 576, elements: !782)
!782 = !{!783, !784, !785, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !781, file: !615, line: 40, baseType: !340, size: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !781, file: !615, line: 41, baseType: !353, size: 64, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !781, file: !615, line: 43, baseType: !786, size: 96, offset: 224)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 12)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !781, file: !615, line: 46, baseType: !16, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !781, file: !615, line: 47, baseType: !16, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !781, file: !615, line: 48, baseType: !16, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !781, file: !615, line: 49, baseType: !16, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !781, file: !615, line: 50, baseType: !16, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !781, file: !615, line: 51, baseType: !16, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !781, file: !615, line: 52, baseType: !16, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !781, file: !615, line: 53, baseType: !16, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !781, file: !615, line: 56, baseType: !624, size: 32, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !781, file: !615, line: 57, baseType: !63, size: 32, offset: 416)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !781, file: !615, line: 58, baseType: !63, size: 32, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !781, file: !615, line: 59, baseType: !94, size: 32, offset: 480)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !781, file: !615, line: 60, baseType: !146, size: 32, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !781, file: !615, line: 61, baseType: !418, size: 32, offset: 544)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !614, file: !615, line: 102, baseType: !418, size: 32, offset: 2464)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !614, file: !615, line: 103, baseType: !418, size: 32, offset: 2496)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !614, file: !615, line: 104, baseType: !418, size: 32, offset: 2528)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !614, file: !615, line: 105, baseType: !418, size: 32, offset: 2560)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !614, file: !615, line: 107, baseType: !306, size: 384, offset: 2592)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !614, file: !615, line: 109, baseType: !16, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !614, file: !615, line: 110, baseType: !16, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !614, file: !615, line: 112, baseType: !16, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !614, file: !615, line: 113, baseType: !16, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !614, file: !615, line: 114, baseType: !16, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !614, file: !615, line: 115, baseType: !16, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !614, file: !615, line: 116, baseType: !16, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !614, file: !615, line: 117, baseType: !16, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !614, file: !615, line: 118, baseType: !16, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !614, file: !615, line: 119, baseType: !16, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !614, file: !615, line: 121, baseType: !16, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !614, file: !615, line: 122, baseType: !16, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !596, file: !597, line: 381, baseType: !821, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !595, line: 17, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !824, line: 313, size: 4096, elements: !825)
!824 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!825 = !{!826, !831, !832, !873, !952, !953, !975, !984, !1107, !1108, !1109, !1147, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1300, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1314, !1318, !1322, !1323, !1335, !1336, !1337, !1338, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !823, file: !824, line: 314, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !824, line: 309, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !593, !821}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !823, file: !824, line: 315, baseType: !827, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !823, file: !824, line: 317, baseType: !833, size: 480, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !834, line: 22, baseType: !835)
!834 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !834, line: 36, size: 480, elements: !836)
!836 = !{!837, !838, !839, !840, !842, !843, !844, !850, !855, !857, !858, !867, !868, !869, !870, !871, !872}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !835, file: !834, line: 37, baseType: !298, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !835, file: !834, line: 39, baseType: !390, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !835, file: !834, line: 40, baseType: !400, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !835, file: !834, line: 41, baseType: !841, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !835, file: !834, line: 43, baseType: !60, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !835, file: !834, line: 44, baseType: !418, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !835, file: !834, line: 46, baseType: !845, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !834, line: 24, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!550, !849, !6}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
