; ModuleID = 'src/http/modules/ngx_http_proxy_module.c'
source_filename = "src/http/modules/ngx_http_proxy_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_proxy_module_ctx", scope: !2, file: !3, line: 723, type: !1884, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1798)
!3 = !DIFile(filename: "src/http/modules/ngx_http_proxy_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !11, !16, !20, !21, !30, !32, !36, !37, !1793, !43, !8, !225, !890, !79, !1794, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 125, baseType: !15)
!14 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !17, line: 16, baseType: !18)
!17 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !19, line: 16, baseType: !11)
!19 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 120, baseType: !15)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 17, size: 96, elements: !25)
!25 = !{!26, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !24, file: !23, line: 18, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !24, file: !23, line: 19, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !24, file: !23, line: 20, baseType: !27, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !31, line: 16, baseType: !6)
!31 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !33, line: 12, baseType: !34)
!33 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !14, line: 186, baseType: !35)
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !39, line: 86, baseType: !40)
!39 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DISubroutineType(types: !42)
!42 = !{!20, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !39, line: 36, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 17, size: 352, elements: !46)
!46 = !{!47, !48, !49, !63, !69, !70, !71, !72, !73, !74, !75, !76, !80}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !45, file: !39, line: 18, baseType: !7, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !45, file: !39, line: 19, baseType: !7, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !45, file: !39, line: 20, baseType: !50, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !52, line: 17, baseType: !53)
!52 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !54, line: 37, baseType: !55)
!54 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 28, size: 64, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !54, line: 29, baseType: !15, size: 28, flags: DIFlagBitField, extraData: i64 0)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !55, file: !54, line: 31, baseType: !15, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !55, file: !54, line: 32, baseType: !15, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !55, file: !54, line: 33, baseType: !15, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !55, file: !54, line: 34, baseType: !15, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !54, line: 36, baseType: !7, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !45, file: !39, line: 22, baseType: !64, size: 64, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !54, line: 19, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 16, size: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !54, line: 17, baseType: !20, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !54, line: 18, baseType: !7, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !45, file: !39, line: 23, baseType: !64, size: 64, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !45, file: !39, line: 26, baseType: !7, size: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !45, file: !39, line: 28, baseType: !15, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !45, file: !39, line: 29, baseType: !15, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !45, file: !39, line: 30, baseType: !15, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !45, file: !39, line: 31, baseType: !15, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !45, file: !39, line: 32, baseType: !15, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !45, file: !39, line: 34, baseType: !77, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !14, line: 140, baseType: !79)
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !45, file: !39, line: 35, baseType: !81, size: 32, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !83, line: 16, baseType: !84)
!83 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !85, line: 364, size: 5376, elements: !86)
!85 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = !{!87, !89, !427, !428, !429, !430, !431, !436, !437, !670, !1365, !1366, !1367, !1368, !1407, !1437, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1482, !1493, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1689, !1693, !1698, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !84, file: !85, line: 365, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 191, baseType: !15)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !84, file: !85, line: 367, baseType: !90, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !92, line: 26, baseType: !93)
!92 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !94, line: 121, size: 896, elements: !95)
!94 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !{!96, !97, !195, !196, !199, !206, !208, !300, !305, !362, !363, !364, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !94, line: 122, baseType: !6, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !93, file: !94, line: 123, baseType: !98, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !92, line: 24, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !101, line: 30, size: 384, elements: !102)
!101 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !130, !131, !176, !187}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !101, line: 31, baseType: !6, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !100, file: !101, line: 33, baseType: !15, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !100, file: !101, line: 35, baseType: !15, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !100, file: !101, line: 38, baseType: !15, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !100, file: !101, line: 44, baseType: !15, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !100, file: !101, line: 46, baseType: !15, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !100, file: !101, line: 49, baseType: !15, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !100, file: !101, line: 51, baseType: !15, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !100, file: !101, line: 54, baseType: !15, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !100, file: !101, line: 56, baseType: !15, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !100, file: !101, line: 57, baseType: !15, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !100, file: !101, line: 59, baseType: !15, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !100, file: !101, line: 60, baseType: !15, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !100, file: !101, line: 62, baseType: !15, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !100, file: !101, line: 64, baseType: !15, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !100, file: !101, line: 67, baseType: !15, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !100, file: !101, line: 69, baseType: !15, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !100, file: !101, line: 71, baseType: !15, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !100, file: !101, line: 74, baseType: !15, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !100, file: !101, line: 75, baseType: !15, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !100, file: !101, line: 77, baseType: !15, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !100, file: !101, line: 107, baseType: !15, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !100, file: !101, line: 110, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !92, line: 31, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !98}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !100, file: !101, line: 117, baseType: !11, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !100, file: !101, line: 119, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !92, line: 20, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !135, line: 50, size: 320, elements: !136)
!135 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!136 = !{!137, !138, !153, !157, !160, !165, !166, !171, !172, !175}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !134, file: !135, line: 51, baseType: !11, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !134, file: !135, line: 52, baseType: !139, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !92, line: 21, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !142, line: 89, size: 160, elements: !143)
!142 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!143 = !{!144, !147, !148, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !141, file: !142, line: 90, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !146, line: 16, baseType: !79)
!146 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 91, baseType: !64, size: 64, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !141, file: !142, line: 93, baseType: !149, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !139, !132}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !142, line: 94, baseType: !6, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !134, file: !135, line: 54, baseType: !154, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !155, line: 98, baseType: !156)
!155 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!156 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !134, file: !135, line: 56, baseType: !158, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !14, line: 75, baseType: !159)
!159 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !134, file: !135, line: 58, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !135, line: 45, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!7, !132, !7, !20}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !135, line: 59, baseType: !6, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !134, file: !135, line: 61, baseType: !167, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !135, line: 46, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !132, !11, !7, !20}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !134, file: !135, line: 62, baseType: !6, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !134, file: !135, line: 70, baseType: !173, size: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !135, line: 72, baseType: !132, size: 32, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !100, file: !101, line: 121, baseType: !177, size: 160, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !19, line: 20, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !19, line: 22, size: 160, elements: !179)
!179 = !{!180, !181, !183, !184, !185, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !178, file: !19, line: 23, baseType: !18, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !178, file: !19, line: 24, baseType: !182, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !178, file: !19, line: 25, baseType: !182, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !178, file: !19, line: 26, baseType: !182, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !178, file: !19, line: 27, baseType: !8, size: 8, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !19, line: 28, baseType: !8, size: 8, offset: 136)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !100, file: !101, line: 124, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !189, line: 16, baseType: !190)
!189 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !189, line: 18, size: 64, elements: !191)
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !189, line: 19, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !189, line: 20, baseType: !193, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !93, file: !94, line: 124, baseType: !98, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !93, file: !94, line: 126, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !198, line: 17, baseType: !79)
!198 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !93, file: !94, line: 128, baseType: !200, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !201, line: 19, baseType: !202)
!201 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !90, !7, !20}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 135, baseType: !79)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !93, file: !94, line: 129, baseType: !207, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !201, line: 22, baseType: !202)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !93, file: !94, line: 130, baseType: !209, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !201, line: 20, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!205, !90, !213, !225}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !92, line: 19, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !31, line: 59, size: 64, elements: !216)
!216 = !{!217, !299}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !215, file: !31, line: 60, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !31, line: 18, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !31, line: 20, size: 352, elements: !221)
!221 = !{!222, !223, !224, !226, !227, !228, !229, !230, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !220, file: !31, line: 21, baseType: !7, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !220, file: !31, line: 22, baseType: !7, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !220, file: !31, line: 23, baseType: !225, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !14, line: 222, baseType: !79)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !220, file: !31, line: 24, baseType: !225, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !220, file: !31, line: 26, baseType: !7, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !220, file: !31, line: 27, baseType: !7, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !220, file: !31, line: 28, baseType: !30, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !220, file: !31, line: 29, baseType: !231, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !92, line: 23, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !234, line: 16, size: 1216, elements: !235)
!234 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!235 = !{!236, !237, !238, !281, !282, !283, !284, !285}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !233, file: !234, line: 17, baseType: !145, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 18, baseType: !64, size: 64, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !233, file: !234, line: 19, baseType: !239, size: 960, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !146, line: 17, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !241, line: 4, size: 960, elements: !242)
!241 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!242 = !{!243, !245, !246, !248, !249, !251, !252, !254, !256, !258, !259, !260, !261, !262, !263, !265, !266, !268, !269, !274, !275, !276}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !240, file: !241, line: 6, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !14, line: 232, baseType: !15)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !240, file: !241, line: 7, baseType: !244, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !240, file: !241, line: 8, baseType: !247, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !14, line: 227, baseType: !15)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !240, file: !241, line: 9, baseType: !247, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !240, file: !241, line: 10, baseType: !250, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !14, line: 217, baseType: !15)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !240, file: !241, line: 11, baseType: !250, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !240, file: !241, line: 13, baseType: !253, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !14, line: 212, baseType: !15)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !240, file: !241, line: 14, baseType: !255, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !14, line: 304, baseType: !15)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !240, file: !241, line: 15, baseType: !257, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !14, line: 309, baseType: !15)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !240, file: !241, line: 16, baseType: !15, size: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !240, file: !241, line: 17, baseType: !244, size: 32, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !240, file: !241, line: 18, baseType: !244, size: 32, offset: 352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !240, file: !241, line: 19, baseType: !225, size: 32, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !240, file: !241, line: 20, baseType: !225, size: 32, offset: 416)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !240, file: !241, line: 21, baseType: !264, size: 32, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !14, line: 237, baseType: !159)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !240, file: !241, line: 22, baseType: !264, size: 32, offset: 480)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !240, file: !241, line: 23, baseType: !267, size: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !14, line: 242, baseType: !79)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !240, file: !241, line: 24, baseType: !267, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !240, file: !241, line: 26, baseType: !270, size: 64, offset: 576)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !14, line: 288, size: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !270, file: !14, line: 288, baseType: !158, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !270, file: !14, line: 288, baseType: !159, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !240, file: !241, line: 27, baseType: !270, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !240, file: !241, line: 28, baseType: !270, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !240, file: !241, line: 29, baseType: !277, size: 192, offset: 768)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 192, elements: !279)
!278 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!279 = !{!280}
!280 = !DISubrange(count: 3)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !233, file: !234, line: 21, baseType: !225, size: 32, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !233, file: !234, line: 22, baseType: !225, size: 32, offset: 1120)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !233, file: !234, line: 24, baseType: !132, size: 32, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !233, file: !234, line: 37, baseType: !15, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !233, file: !234, line: 38, baseType: !15, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !220, file: !31, line: 30, baseType: !218, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !220, file: !31, line: 34, baseType: !15, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !220, file: !31, line: 40, baseType: !15, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !220, file: !31, line: 43, baseType: !15, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !220, file: !31, line: 45, baseType: !15, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !220, file: !31, line: 46, baseType: !15, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !220, file: !31, line: 47, baseType: !15, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !220, file: !31, line: 48, baseType: !15, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !220, file: !31, line: 49, baseType: !15, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !220, file: !31, line: 50, baseType: !15, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !220, file: !31, line: 52, baseType: !15, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !220, file: !31, line: 53, baseType: !15, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !220, file: !31, line: 55, baseType: !79, size: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !31, line: 61, baseType: !213, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !93, file: !94, line: 131, baseType: !301, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !201, line: 23, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!213, !90, !213, !225}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !93, file: !94, line: 133, baseType: !306, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !94, line: 16, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !94, line: 18, size: 960, elements: !309)
!309 = !{!310, !311, !322, !324, !325, !326, !327, !328, !329, !330, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !308, file: !94, line: 19, baseType: !197, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !308, file: !94, line: 21, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !314, line: 297, size: 128, elements: !315)
!314 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !313, file: !314, line: 298, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !14, line: 409, baseType: !35)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !313, file: !314, line: 299, baseType: !319, size: 112, offset: 16)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 112, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 14)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !308, file: !94, line: 22, baseType: !323, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !14, line: 404, baseType: !15)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !308, file: !94, line: 23, baseType: !20, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !308, file: !94, line: 24, baseType: !64, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !94, line: 26, baseType: !79, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !308, file: !94, line: 28, baseType: !79, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !308, file: !94, line: 29, baseType: !79, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !308, file: !94, line: 30, baseType: !79, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !308, file: !94, line: 38, baseType: !331, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !92, line: 32, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !90}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !308, file: !94, line: 40, baseType: !6, size: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !308, file: !94, line: 42, baseType: !133, size: 320, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !308, file: !94, line: 43, baseType: !132, size: 32, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !308, file: !94, line: 45, baseType: !20, size: 32, offset: 736)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !308, file: !94, line: 47, baseType: !20, size: 32, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !308, file: !94, line: 49, baseType: !16, size: 32, offset: 800)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !308, file: !94, line: 51, baseType: !306, size: 32, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !308, file: !94, line: 52, baseType: !90, size: 32, offset: 864)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !308, file: !94, line: 54, baseType: !11, size: 32, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !308, file: !94, line: 56, baseType: !15, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !308, file: !94, line: 57, baseType: !15, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !308, file: !94, line: 58, baseType: !15, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !308, file: !94, line: 60, baseType: !15, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !308, file: !94, line: 61, baseType: !15, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !308, file: !94, line: 62, baseType: !15, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !308, file: !94, line: 63, baseType: !15, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !308, file: !94, line: 64, baseType: !15, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !308, file: !94, line: 65, baseType: !15, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !308, file: !94, line: 66, baseType: !15, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !308, file: !94, line: 67, baseType: !15, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !308, file: !94, line: 70, baseType: !15, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !308, file: !94, line: 72, baseType: !15, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !308, file: !94, line: 73, baseType: !15, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !308, file: !94, line: 74, baseType: !15, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !308, file: !94, line: 76, baseType: !15, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !308, file: !94, line: 77, baseType: !15, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !308, file: !94, line: 78, baseType: !15, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !93, file: !94, line: 135, baseType: !225, size: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !93, file: !94, line: 137, baseType: !132, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !93, file: !94, line: 139, baseType: !365, size: 32, offset: 352)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !92, line: 18, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !368, line: 57, size: 320, elements: !369)
!368 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!369 = !{!370, !378, !379, !380, !381, !388, !400}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !367, file: !368, line: 58, baseType: !371, size: 128)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !368, line: 54, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 49, size: 128, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !372, file: !368, line: 50, baseType: !7, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !372, file: !368, line: 51, baseType: !7, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !368, line: 52, baseType: !365, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !372, file: !368, line: 53, baseType: !11, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !367, file: !368, line: 59, baseType: !20, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !367, file: !368, line: 60, baseType: !365, size: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !367, file: !368, line: 61, baseType: !213, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !367, file: !368, line: 62, baseType: !382, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !368, line: 41, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !368, line: 43, size: 64, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !368, line: 44, baseType: !382, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !384, file: !368, line: 45, baseType: !6, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !367, file: !368, line: 63, baseType: !389, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !368, line: 32, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !368, line: 34, size: 96, elements: !392)
!392 = !{!393, !398, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !391, file: !368, line: 35, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !368, line: 30, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !6}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !391, file: !368, line: 36, baseType: !6, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !368, line: 37, baseType: !389, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !367, file: !368, line: 64, baseType: !132, size: 32, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 141, baseType: !79, size: 32, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !93, file: !94, line: 143, baseType: !312, size: 32, offset: 416)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !93, file: !94, line: 144, baseType: !323, size: 32, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !93, file: !94, line: 145, baseType: !64, size: 64, offset: 480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !93, file: !94, line: 147, baseType: !64, size: 64, offset: 544)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !93, file: !94, line: 148, baseType: !32, size: 16, offset: 608)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !93, file: !94, line: 154, baseType: !312, size: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !93, file: !94, line: 155, baseType: !323, size: 32, offset: 672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 157, baseType: !218, size: 32, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !93, file: !94, line: 159, baseType: !188, size: 64, offset: 736)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !93, file: !94, line: 161, baseType: !154, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !93, file: !94, line: 163, baseType: !11, size: 32, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !93, file: !94, line: 165, baseType: !15, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !93, file: !94, line: 167, baseType: !15, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !93, file: !94, line: 169, baseType: !15, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !93, file: !94, line: 170, baseType: !15, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !93, file: !94, line: 171, baseType: !15, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !93, file: !94, line: 173, baseType: !15, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !93, file: !94, line: 174, baseType: !15, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !93, file: !94, line: 175, baseType: !15, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !93, file: !94, line: 176, baseType: !15, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !93, file: !94, line: 178, baseType: !15, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !93, file: !94, line: 179, baseType: !15, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !93, file: !94, line: 180, baseType: !15, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !93, file: !94, line: 181, baseType: !15, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !93, file: !94, line: 183, baseType: !15, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !84, file: !85, line: 369, baseType: !27, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !84, file: !85, line: 370, baseType: !27, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !84, file: !85, line: 371, baseType: !27, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !84, file: !85, line: 372, baseType: !27, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !84, file: !85, line: 374, baseType: !432, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !85, line: 361, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !81}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !84, file: !85, line: 375, baseType: !432, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !84, file: !85, line: 378, baseType: !438, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !83, line: 18, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !441, line: 65, size: 3008, elements: !442)
!441 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!442 = !{!443, !444, !454, !455, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !628, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !440, file: !441, line: 66, baseType: !232, size: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !440, file: !441, line: 67, baseType: !445, size: 160, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !446, line: 22, baseType: !447)
!446 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 16, size: 160, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !447, file: !446, line: 17, baseType: !6, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !447, file: !446, line: 18, baseType: !11, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !446, line: 19, baseType: !20, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !447, file: !446, line: 20, baseType: !11, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !447, file: !446, line: 21, baseType: !365, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !440, file: !441, line: 68, baseType: !88, size: 32, offset: 1376)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !440, file: !441, line: 69, baseType: !456, size: 128, offset: 1408)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !440, file: !441, line: 70, baseType: !456, size: 128, offset: 1536)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !440, file: !441, line: 72, baseType: !461, size: 32, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !146, line: 18, baseType: !247)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !440, file: !441, line: 73, baseType: !158, size: 32, offset: 1696)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !440, file: !441, line: 74, baseType: !158, size: 32, offset: 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !440, file: !441, line: 75, baseType: !158, size: 32, offset: 1760)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !440, file: !441, line: 76, baseType: !158, size: 32, offset: 1792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !440, file: !441, line: 77, baseType: !158, size: 32, offset: 1824)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !440, file: !441, line: 79, baseType: !64, size: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !440, file: !441, line: 80, baseType: !64, size: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !440, file: !441, line: 81, baseType: !456, size: 128, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !440, file: !441, line: 83, baseType: !20, size: 32, offset: 2112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !440, file: !441, line: 84, baseType: !20, size: 32, offset: 2144)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !440, file: !441, line: 85, baseType: !225, size: 32, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !440, file: !441, line: 86, baseType: !225, size: 32, offset: 2208)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !440, file: !441, line: 88, baseType: !11, size: 32, offset: 2240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !440, file: !441, line: 89, baseType: !11, size: 32, offset: 2272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !440, file: !441, line: 90, baseType: !11, size: 32, offset: 2304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !440, file: !441, line: 91, baseType: !11, size: 32, offset: 2336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !440, file: !441, line: 93, baseType: !218, size: 32, offset: 2368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !440, file: !441, line: 95, baseType: !480, size: 32, offset: 2400)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !83, line: 19, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !441, line: 157, size: 544, elements: !483)
!483 = !{!484, !509, !570, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !627}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !482, file: !441, line: 158, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !441, line: 154, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 145, size: 480, elements: !488)
!488 = !{!489, !500, !501, !502, !505, !506, !507, !508}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !487, file: !441, line: 146, baseType: !490, size: 96)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !19, line: 32, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !19, line: 37, size: 96, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !491, file: !19, line: 38, baseType: !182, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !491, file: !19, line: 39, baseType: !182, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !491, file: !19, line: 40, baseType: !496, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !19, line: 34, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !182, !182, !182}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !487, file: !441, line: 147, baseType: !177, size: 160, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !487, file: !441, line: 148, baseType: !188, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !487, file: !441, line: 149, baseType: !503, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !155, line: 106, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !154)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !487, file: !441, line: 150, baseType: !503, size: 32, offset: 352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !441, line: 151, baseType: !225, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !487, file: !441, line: 152, baseType: !11, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !487, file: !441, line: 153, baseType: !11, size: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !482, file: !441, line: 159, baseType: !510, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !512, line: 59, baseType: !513)
!512 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 34, size: 800, elements: !514)
!514 = !{!515, !522, !523, !524, !532, !533, !534, !543, !544, !545, !546, !565, !566, !567, !568, !569}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !513, file: !512, line: 35, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !517, line: 21, baseType: !518)
!517 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 16, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !518, file: !517, line: 17, baseType: !503, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !518, file: !517, line: 19, baseType: !503, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !513, file: !512, line: 37, baseType: !20, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !513, file: !512, line: 38, baseType: !20, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !513, file: !512, line: 40, baseType: !525, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !512, line: 16, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !512, line: 18, size: 96, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !527, file: !512, line: 19, baseType: !13, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !512, line: 20, baseType: !525, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !527, file: !512, line: 21, baseType: !13, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !513, file: !512, line: 41, baseType: !525, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !513, file: !512, line: 42, baseType: !526, size: 96, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !513, file: !512, line: 44, baseType: !535, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !512, line: 31, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 25, size: 128, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !537, file: !512, line: 26, baseType: !11, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !537, file: !512, line: 27, baseType: !11, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !537, file: !512, line: 29, baseType: !11, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !537, file: !512, line: 30, baseType: !11, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !513, file: !512, line: 45, baseType: !11, size: 32, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !513, file: !512, line: 47, baseType: !7, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !513, file: !512, line: 48, baseType: !7, size: 32, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !513, file: !512, line: 50, baseType: !547, size: 256, offset: 416)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !517, line: 37, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 24, size: 256, elements: !549)
!549 = !{!550, !552, !553, !554, !564}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !548, file: !517, line: 26, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !548, file: !517, line: 28, baseType: !551, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !548, file: !517, line: 29, baseType: !11, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !548, file: !517, line: 30, baseType: !555, size: 128, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !556, line: 19, baseType: !557)
!556 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !556, line: 17, size: 128, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !557, file: !556, line: 18, baseType: !560, size: 128)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 128, elements: !562)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !79)
!562 = !{!563}
!563 = !DISubrange(count: 4)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !548, file: !517, line: 36, baseType: !11, size: 32, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !513, file: !512, line: 52, baseType: !7, size: 32, offset: 672)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !513, file: !512, line: 53, baseType: !8, size: 8, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !513, file: !512, line: 55, baseType: !15, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !513, file: !512, line: 57, baseType: !6, size: 32, offset: 736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !513, file: !512, line: 58, baseType: !6, size: 32, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !482, file: !441, line: 161, baseType: !571, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !234, line: 62, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 50, size: 384, elements: !574)
!574 = !{!575, !576, !577, !579, !584, !586, !588, !589, !590}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !234, line: 51, baseType: !64, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !573, file: !234, line: 52, baseType: !20, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !573, file: !234, line: 53, baseType: !578, size: 96, offset: 96)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !279)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !573, file: !234, line: 55, baseType: !580, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !234, line: 45, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!16, !6}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !573, file: !234, line: 56, baseType: !585, size: 32, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !234, line: 46, baseType: !581)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !573, file: !234, line: 57, baseType: !587, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !234, line: 47, baseType: !395)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !573, file: !234, line: 58, baseType: !6, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !573, file: !234, line: 60, baseType: !7, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !573, file: !234, line: 61, baseType: !11, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !482, file: !441, line: 163, baseType: !225, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !482, file: !441, line: 164, baseType: !20, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !482, file: !441, line: 166, baseType: !158, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !482, file: !441, line: 168, baseType: !158, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !482, file: !441, line: 170, baseType: !11, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !482, file: !441, line: 171, baseType: !11, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !482, file: !441, line: 172, baseType: !16, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !482, file: !441, line: 173, baseType: !16, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !482, file: !441, line: 174, baseType: !16, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !482, file: !441, line: 176, baseType: !11, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !482, file: !441, line: 177, baseType: !16, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !482, file: !441, line: 178, baseType: !16, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !482, file: !441, line: 180, baseType: !604, size: 32, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !606, line: 25, baseType: !607)
!606 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !606, line: 29, size: 320, elements: !608)
!608 = !{!609, !610, !620, !625, !626}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !606, line: 30, baseType: !6, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !607, file: !606, line: 31, baseType: !611, size: 192, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !612, line: 22, baseType: !613)
!612 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !612, line: 16, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !613, file: !612, line: 17, baseType: !7, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !613, file: !612, line: 18, baseType: !20, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !612, line: 19, baseType: !64, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !613, file: !612, line: 20, baseType: !132, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !613, file: !612, line: 21, baseType: !11, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !607, file: !606, line: 32, baseType: !621, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !606, line: 27, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{!77, !604, !6}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !607, file: !606, line: 33, baseType: !6, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !607, file: !606, line: 34, baseType: !11, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !482, file: !441, line: 182, baseType: !11, size: 32, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !440, file: !441, line: 96, baseType: !629, size: 32, offset: 2432)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !441, line: 62, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 39, size: 576, elements: !632)
!632 = !{!633, !634, !635, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !631, file: !441, line: 40, baseType: !177, size: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !631, file: !441, line: 41, baseType: !188, size: 64, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !631, file: !441, line: 43, baseType: !636, size: 96, offset: 224)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 12)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !631, file: !441, line: 46, baseType: !15, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !631, file: !441, line: 47, baseType: !15, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !631, file: !441, line: 48, baseType: !15, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !631, file: !441, line: 49, baseType: !15, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !631, file: !441, line: 50, baseType: !15, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !631, file: !441, line: 51, baseType: !15, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !631, file: !441, line: 52, baseType: !15, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !631, file: !441, line: 53, baseType: !15, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !631, file: !441, line: 56, baseType: !461, size: 32, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !631, file: !441, line: 57, baseType: !158, size: 32, offset: 416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !631, file: !441, line: 58, baseType: !158, size: 32, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !631, file: !441, line: 59, baseType: !20, size: 32, offset: 480)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !631, file: !441, line: 60, baseType: !225, size: 32, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !631, file: !441, line: 61, baseType: !16, size: 32, offset: 544)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !440, file: !441, line: 102, baseType: !16, size: 32, offset: 2464)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !440, file: !441, line: 103, baseType: !16, size: 32, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !440, file: !441, line: 104, baseType: !16, size: 32, offset: 2528)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !440, file: !441, line: 105, baseType: !16, size: 32, offset: 2560)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !440, file: !441, line: 107, baseType: !99, size: 384, offset: 2592)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !440, file: !441, line: 109, baseType: !15, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !440, file: !441, line: 110, baseType: !15, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !440, file: !441, line: 112, baseType: !15, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !440, file: !441, line: 113, baseType: !15, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !440, file: !441, line: 114, baseType: !15, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !440, file: !441, line: 115, baseType: !15, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !440, file: !441, line: 116, baseType: !15, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !440, file: !441, line: 117, baseType: !15, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !440, file: !441, line: 118, baseType: !15, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !440, file: !441, line: 119, baseType: !15, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !440, file: !441, line: 121, baseType: !15, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !440, file: !441, line: 122, baseType: !15, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !84, file: !85, line: 381, baseType: !671, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !83, line: 17, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !674, line: 313, size: 4096, elements: !675)
!674 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!675 = !{!676, !681, !682, !723, !802, !803, !825, !834, !1092, !1093, !1094, !1132, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1310, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1327, !1331, !1335, !1336, !1348, !1349, !1350, !1351, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !673, file: !674, line: 314, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !674, line: 309, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !81, !671}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !673, file: !674, line: 315, baseType: !677, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !673, file: !674, line: 317, baseType: !683, size: 480, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !684, line: 22, baseType: !685)
!684 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !684, line: 36, size: 480, elements: !686)
!686 = !{!687, !688, !689, !690, !692, !693, !694, !700, !705, !707, !708, !717, !718, !719, !720, !721, !722}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !685, file: !684, line: 37, baseType: !90, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !685, file: !684, line: 39, baseType: !312, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !685, file: !684, line: 40, baseType: !323, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !684, line: 41, baseType: !691, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !685, file: !684, line: 43, baseType: !11, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !685, file: !684, line: 44, baseType: !16, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !685, file: !684, line: 46, baseType: !695, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !684, line: 24, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!77, !699, !6}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !685, file: !684, line: 47, baseType: !701, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !684, line: 26, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !699, !6, !11}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !685, file: !684, line: 48, baseType: !706, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !684, line: 28, baseType: !702)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !685, file: !684, line: 49, baseType: !6, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !685, file: !684, line: 56, baseType: !709, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !711, line: 78, baseType: !712)
!711 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 74, size: 128, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !712, file: !711, line: 75, baseType: !312, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !712, file: !711, line: 76, baseType: !323, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !711, line: 77, baseType: !64, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !685, file: !684, line: 58, baseType: !79, size: 32, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !685, file: !684, line: 59, baseType: !79, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !685, file: !684, line: 61, baseType: !132, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !685, file: !684, line: 63, baseType: !15, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !685, file: !684, line: 64, baseType: !15, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !685, file: !684, line: 67, baseType: !15, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !673, file: !674, line: 319, baseType: !724, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !726, line: 17, baseType: !727)
!726 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !726, line: 25, size: 1120, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !735, !736, !737, !738, !739, !744, !745, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !801}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !727, file: !726, line: 26, baseType: !90, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !727, file: !726, line: 27, baseType: !90, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !727, file: !726, line: 29, baseType: !213, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !727, file: !726, line: 30, baseType: !213, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !727, file: !726, line: 31, baseType: !734, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !727, file: !726, line: 33, baseType: !213, size: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !727, file: !726, line: 35, baseType: !213, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !727, file: !726, line: 36, baseType: !213, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !727, file: !726, line: 37, baseType: !213, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !727, file: !726, line: 44, baseType: !740, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !726, line: 19, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!77, !724, !218}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !727, file: !726, line: 45, baseType: !6, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !727, file: !726, line: 47, baseType: !746, size: 32, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !726, line: 21, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{!77, !6, !213}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !727, file: !726, line: 48, baseType: !6, size: 32, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !727, file: !726, line: 57, baseType: !15, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !727, file: !726, line: 58, baseType: !15, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !727, file: !726, line: 59, baseType: !15, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !727, file: !726, line: 60, baseType: !15, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !727, file: !726, line: 61, baseType: !15, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !727, file: !726, line: 62, baseType: !15, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !727, file: !726, line: 63, baseType: !15, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !727, file: !726, line: 64, baseType: !15, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !727, file: !726, line: 65, baseType: !15, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !727, file: !726, line: 66, baseType: !15, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !727, file: !726, line: 67, baseType: !15, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !727, file: !726, line: 68, baseType: !15, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !727, file: !726, line: 70, baseType: !77, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !727, file: !726, line: 71, baseType: !765, size: 64, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !31, line: 68, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 65, size: 64, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !766, file: !31, line: 66, baseType: !77, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !31, line: 67, baseType: !20, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !727, file: !726, line: 72, baseType: !30, size: 32, offset: 544)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !727, file: !726, line: 74, baseType: !205, size: 32, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !727, file: !726, line: 76, baseType: !225, size: 32, offset: 608)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !727, file: !726, line: 77, baseType: !225, size: 32, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !727, file: !726, line: 79, baseType: !225, size: 32, offset: 672)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !727, file: !726, line: 80, baseType: !205, size: 32, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !727, file: !726, line: 82, baseType: !16, size: 32, offset: 736)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !727, file: !726, line: 83, baseType: !16, size: 32, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !727, file: !726, line: 84, baseType: !205, size: 32, offset: 800)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !727, file: !726, line: 86, baseType: !365, size: 32, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !727, file: !726, line: 87, baseType: !132, size: 32, offset: 864)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !727, file: !726, line: 89, baseType: !213, size: 32, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !727, file: !726, line: 90, baseType: !20, size: 32, offset: 928)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !727, file: !726, line: 91, baseType: !218, size: 32, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !727, file: !726, line: 93, baseType: !20, size: 32, offset: 992)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !727, file: !726, line: 94, baseType: !158, size: 32, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !727, file: !726, line: 96, baseType: !787, size: 32, offset: 1056)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !234, line: 84, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 71, size: 1408, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !789, file: !234, line: 72, baseType: !232, size: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !789, file: !234, line: 73, baseType: !225, size: 32, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !789, file: !234, line: 74, baseType: !571, size: 32, offset: 1248)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !789, file: !234, line: 75, baseType: !365, size: 32, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !789, file: !234, line: 76, baseType: !173, size: 32, offset: 1312)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !789, file: !234, line: 78, baseType: !11, size: 32, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !789, file: !234, line: 80, baseType: !15, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !789, file: !234, line: 81, baseType: !15, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !789, file: !234, line: 82, baseType: !15, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !789, file: !234, line: 83, baseType: !15, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !727, file: !726, line: 98, baseType: !79, size: 32, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !673, file: !674, line: 321, baseType: !213, size: 32, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !673, file: !674, line: 323, baseType: !804, size: 416, offset: 608)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !31, line: 71, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !31, line: 78, size: 416, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !824}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !805, file: !31, line: 79, baseType: !218, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !805, file: !31, line: 80, baseType: !213, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !805, file: !31, line: 81, baseType: !213, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !805, file: !31, line: 82, baseType: !213, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !805, file: !31, line: 84, baseType: !15, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !805, file: !31, line: 85, baseType: !15, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !805, file: !31, line: 86, baseType: !15, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !805, file: !31, line: 87, baseType: !15, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !805, file: !31, line: 88, baseType: !15, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !805, file: !31, line: 89, baseType: !15, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !805, file: !31, line: 104, baseType: !225, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !805, file: !31, line: 106, baseType: !365, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !805, file: !31, line: 107, baseType: !77, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !805, file: !31, line: 108, baseType: !765, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !805, file: !31, line: 109, baseType: !30, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !805, file: !31, line: 111, baseType: !823, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !31, line: 73, baseType: !747)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !805, file: !31, line: 112, baseType: !6, size: 32, offset: 384)
