; ModuleID = 'src/http/modules/ngx_http_index_module.c'
source_filename = "src/http/modules/ngx_http_index_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_index_module_ctx", scope: !2, file: !3, line: 55, type: !1819, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !1811)
!3 = !DIFile(filename: "src/http/modules/ngx_http_index_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !34, !1806, !41, !46}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !32, line: 125, baseType: !33)
!32 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !36, line: 86, baseType: !37)
!36 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !32, line: 120, baseType: !33)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !36, line: 36, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 17, size: 352, elements: !44)
!44 = !{!45, !50, !51, !65, !71, !72, !73, !74, !75, !76, !77, !78, !83}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !43, file: !36, line: 18, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !48, line: 64, baseType: !49)
!48 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !43, file: !36, line: 19, baseType: !46, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !43, file: !36, line: 20, baseType: !52, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !54, line: 17, baseType: !55)
!54 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !56, line: 37, baseType: !57)
!56 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 28, size: 64, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, file: !56, line: 29, baseType: !33, size: 28, flags: DIFlagBitField, extraData: i64 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !57, file: !56, line: 31, baseType: !33, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !57, file: !56, line: 32, baseType: !33, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !57, file: !56, line: 33, baseType: !33, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !57, file: !56, line: 34, baseType: !33, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !56, line: 36, baseType: !46, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !36, line: 22, baseType: !66, size: 64, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !56, line: 19, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 16, size: 64, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !56, line: 17, baseType: !40, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !56, line: 18, baseType: !46, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !43, file: !36, line: 23, baseType: !66, size: 64, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !43, file: !36, line: 26, baseType: !46, size: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !43, file: !36, line: 28, baseType: !33, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !43, file: !36, line: 29, baseType: !33, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !43, file: !36, line: 30, baseType: !33, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !43, file: !36, line: 31, baseType: !33, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !43, file: !36, line: 32, baseType: !33, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !43, file: !36, line: 34, baseType: !79, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !80, line: 78, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !32, line: 140, baseType: !82)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !43, file: !36, line: 35, baseType: !84, size: 32, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !86, line: 16, baseType: !87)
!86 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !88, line: 364, size: 5376, elements: !89)
!88 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!89 = !{!90, !92, !441, !442, !443, !444, !445, !450, !451, !684, !1379, !1380, !1381, !1382, !1421, !1451, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1496, !1507, !1514, !1515, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1702, !1706, !1711, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !87, file: !88, line: 365, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 191, baseType: !33)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !87, file: !88, line: 367, baseType: !93, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !95, line: 26, baseType: !96)
!95 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !97, line: 121, size: 896, elements: !98)
!97 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = !{!99, !100, !201, !202, !205, !212, !214, !308, !313, !373, !374, !375, !412, !413, !414, !415, !416, !417, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !97, line: 122, baseType: !27, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !96, file: !97, line: 123, baseType: !101, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !95, line: 24, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !104, line: 30, size: 384, elements: !105)
!104 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !133, !135, !180, !193}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !104, line: 31, baseType: !27, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !103, file: !104, line: 33, baseType: !33, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !103, file: !104, line: 35, baseType: !33, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !103, file: !104, line: 38, baseType: !33, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !103, file: !104, line: 44, baseType: !33, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !103, file: !104, line: 46, baseType: !33, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !103, file: !104, line: 49, baseType: !33, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !103, file: !104, line: 51, baseType: !33, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !103, file: !104, line: 54, baseType: !33, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !103, file: !104, line: 56, baseType: !33, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !103, file: !104, line: 57, baseType: !33, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !103, file: !104, line: 59, baseType: !33, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !103, file: !104, line: 60, baseType: !33, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !103, file: !104, line: 62, baseType: !33, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !103, file: !104, line: 64, baseType: !33, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !103, file: !104, line: 67, baseType: !33, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !103, file: !104, line: 69, baseType: !33, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !103, file: !104, line: 71, baseType: !33, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !103, file: !104, line: 74, baseType: !33, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !103, file: !104, line: 75, baseType: !33, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !103, file: !104, line: 77, baseType: !33, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !103, file: !104, line: 107, baseType: !33, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !103, file: !104, line: 110, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !95, line: 31, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !101}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !103, file: !104, line: 117, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !80, line: 79, baseType: !31)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !103, file: !104, line: 119, baseType: !136, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !95, line: 20, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !139, line: 50, size: 320, elements: !140)
!139 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!140 = !{!141, !142, !157, !161, !164, !169, !170, !175, !176, !179}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !138, file: !139, line: 51, baseType: !134, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !138, file: !139, line: 52, baseType: !143, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !95, line: 21, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !146, line: 89, size: 160, elements: !147)
!146 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!147 = !{!148, !151, !152, !156}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !145, file: !146, line: 90, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !150, line: 16, baseType: !82)
!150 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !146, line: 91, baseType: !66, size: 64, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !145, file: !146, line: 93, baseType: !153, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !143, !136}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !146, line: 94, baseType: !27, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !138, file: !139, line: 54, baseType: !158, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !159, line: 98, baseType: !160)
!159 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!160 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !138, file: !139, line: 56, baseType: !162, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !32, line: 75, baseType: !163)
!163 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !138, file: !139, line: 58, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !139, line: 45, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!46, !136, !46, !40}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !139, line: 59, baseType: !27, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !138, file: !139, line: 61, baseType: !171, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !139, line: 46, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !136, !134, !46, !40}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !138, file: !139, line: 62, baseType: !27, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !138, file: !139, line: 70, baseType: !177, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !139, line: 72, baseType: !136, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !103, file: !104, line: 121, baseType: !181, size: 160, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !182, line: 20, baseType: !183)
!182 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !182, line: 22, size: 160, elements: !184)
!184 = !{!185, !187, !189, !190, !191, !192}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !183, file: !182, line: 23, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !182, line: 16, baseType: !134)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !183, file: !182, line: 24, baseType: !188, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !183, file: !182, line: 25, baseType: !188, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !183, file: !182, line: 26, baseType: !188, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !183, file: !182, line: 27, baseType: !47, size: 8, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !182, line: 28, baseType: !47, size: 8, offset: 136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !103, file: !104, line: 124, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !195, line: 16, baseType: !196)
!195 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !195, line: 18, size: 64, elements: !197)
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !195, line: 19, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !195, line: 20, baseType: !199, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !96, file: !97, line: 124, baseType: !101, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !96, file: !97, line: 126, baseType: !203, size: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !204, line: 17, baseType: !82)
!204 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !96, file: !97, line: 128, baseType: !206, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !207, line: 19, baseType: !208)
!207 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !93, !46, !40}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !32, line: 135, baseType: !82)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !96, file: !97, line: 129, baseType: !213, size: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !207, line: 22, baseType: !208)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !96, file: !97, line: 130, baseType: !215, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !207, line: 20, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{!211, !93, !219, !232}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !95, line: 19, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !222, line: 59, size: 64, elements: !223)
!222 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!223 = !{!224, !307}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !222, line: 60, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !222, line: 18, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !222, line: 20, size: 352, elements: !228)
!228 = !{!229, !230, !231, !233, !234, !235, !236, !238, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !227, file: !222, line: 21, baseType: !46, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !227, file: !222, line: 22, baseType: !46, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !227, file: !222, line: 23, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !32, line: 222, baseType: !82)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !227, file: !222, line: 24, baseType: !232, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !227, file: !222, line: 26, baseType: !46, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !227, file: !222, line: 27, baseType: !46, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !227, file: !222, line: 28, baseType: !237, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !222, line: 16, baseType: !27)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !227, file: !222, line: 29, baseType: !239, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !95, line: 23, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !242, line: 16, size: 1216, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !245, !246, !289, !290, !291, !292, !293}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !241, file: !242, line: 17, baseType: !149, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !242, line: 18, baseType: !66, size: 64, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !241, file: !242, line: 19, baseType: !247, size: 960, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !150, line: 17, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !249, line: 4, size: 960, elements: !250)
!249 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!250 = !{!251, !253, !254, !256, !257, !259, !260, !262, !264, !266, !267, !268, !269, !270, !271, !273, !274, !276, !277, !282, !283, !284}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !248, file: !249, line: 6, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !32, line: 232, baseType: !33)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !248, file: !249, line: 7, baseType: !252, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !248, file: !249, line: 8, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !32, line: 227, baseType: !33)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !248, file: !249, line: 9, baseType: !255, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !248, file: !249, line: 10, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !32, line: 217, baseType: !33)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !248, file: !249, line: 11, baseType: !258, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !248, file: !249, line: 13, baseType: !261, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !32, line: 212, baseType: !33)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !248, file: !249, line: 14, baseType: !263, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !32, line: 304, baseType: !33)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !248, file: !249, line: 15, baseType: !265, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !32, line: 309, baseType: !33)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !248, file: !249, line: 16, baseType: !33, size: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !248, file: !249, line: 17, baseType: !252, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !248, file: !249, line: 18, baseType: !252, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !248, file: !249, line: 19, baseType: !232, size: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !248, file: !249, line: 20, baseType: !232, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !248, file: !249, line: 21, baseType: !272, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !32, line: 237, baseType: !163)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !248, file: !249, line: 22, baseType: !272, size: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !248, file: !249, line: 23, baseType: !275, size: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !32, line: 242, baseType: !82)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !248, file: !249, line: 24, baseType: !275, size: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !248, file: !249, line: 26, baseType: !278, size: 64, offset: 576)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !32, line: 288, size: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !278, file: !32, line: 288, baseType: !162, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !278, file: !32, line: 288, baseType: !163, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !248, file: !249, line: 27, baseType: !278, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !248, file: !249, line: 28, baseType: !278, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !248, file: !249, line: 29, baseType: !285, size: 192, offset: 768)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 192, elements: !287)
!286 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!287 = !{!288}
!288 = !DISubrange(count: 3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !241, file: !242, line: 21, baseType: !232, size: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !241, file: !242, line: 22, baseType: !232, size: 32, offset: 1120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 24, baseType: !136, size: 32, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !241, file: !242, line: 37, baseType: !33, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !241, file: !242, line: 38, baseType: !33, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !227, file: !222, line: 30, baseType: !225, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !227, file: !222, line: 34, baseType: !33, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !227, file: !222, line: 40, baseType: !33, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !227, file: !222, line: 43, baseType: !33, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !227, file: !222, line: 45, baseType: !33, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !227, file: !222, line: 46, baseType: !33, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !227, file: !222, line: 47, baseType: !33, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !227, file: !222, line: 48, baseType: !33, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !227, file: !222, line: 49, baseType: !33, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !227, file: !222, line: 50, baseType: !33, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !227, file: !222, line: 52, baseType: !33, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !227, file: !222, line: 53, baseType: !33, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !227, file: !222, line: 55, baseType: !82, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !222, line: 61, baseType: !219, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !96, file: !97, line: 131, baseType: !309, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !207, line: 23, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{!219, !93, !219, !232}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !96, file: !97, line: 133, baseType: !314, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !97, line: 16, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !97, line: 18, size: 960, elements: !317)
!317 = !{!318, !319, !331, !333, !334, !335, !336, !337, !338, !339, !344, !345, !346, !347, !348, !349, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !316, file: !97, line: 19, baseType: !203, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !316, file: !97, line: 21, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !322, line: 297, size: 128, elements: !323)
!322 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !{!324, !327}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !321, file: !322, line: 298, baseType: !325, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !32, line: 409, baseType: !326)
!326 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !321, file: !322, line: 299, baseType: !328, size: 112, offset: 16)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 112, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 14)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !316, file: !97, line: 22, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !32, line: 404, baseType: !33)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !316, file: !97, line: 23, baseType: !40, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !316, file: !97, line: 24, baseType: !66, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !97, line: 26, baseType: !82, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !316, file: !97, line: 28, baseType: !82, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !316, file: !97, line: 29, baseType: !82, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !316, file: !97, line: 30, baseType: !82, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !316, file: !97, line: 38, baseType: !340, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !95, line: 32, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !93}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !316, file: !97, line: 40, baseType: !27, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !316, file: !97, line: 42, baseType: !137, size: 320, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !316, file: !97, line: 43, baseType: !136, size: 32, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !316, file: !97, line: 45, baseType: !40, size: 32, offset: 736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !316, file: !97, line: 47, baseType: !40, size: 32, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !316, file: !97, line: 49, baseType: !350, size: 32, offset: 800)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !351, line: 16, baseType: !186)
!351 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !316, file: !97, line: 51, baseType: !314, size: 32, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !316, file: !97, line: 52, baseType: !93, size: 32, offset: 864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !316, file: !97, line: 54, baseType: !134, size: 32, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !316, file: !97, line: 56, baseType: !33, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !316, file: !97, line: 57, baseType: !33, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !316, file: !97, line: 58, baseType: !33, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !316, file: !97, line: 60, baseType: !33, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !316, file: !97, line: 61, baseType: !33, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !316, file: !97, line: 62, baseType: !33, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !316, file: !97, line: 63, baseType: !33, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !316, file: !97, line: 64, baseType: !33, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !316, file: !97, line: 65, baseType: !33, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !316, file: !97, line: 66, baseType: !33, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !316, file: !97, line: 67, baseType: !33, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !316, file: !97, line: 70, baseType: !33, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !316, file: !97, line: 72, baseType: !33, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !316, file: !97, line: 73, baseType: !33, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !316, file: !97, line: 74, baseType: !33, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !316, file: !97, line: 76, baseType: !33, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !316, file: !97, line: 77, baseType: !33, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !316, file: !97, line: 78, baseType: !33, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !96, file: !97, line: 135, baseType: !232, size: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !96, file: !97, line: 137, baseType: !136, size: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !96, file: !97, line: 139, baseType: !376, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !95, line: 18, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !379, line: 57, size: 320, elements: !380)
!379 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!380 = !{!381, !389, !390, !391, !392, !399, !411}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !378, file: !379, line: 58, baseType: !382, size: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !379, line: 54, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 49, size: 128, elements: !384)
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !383, file: !379, line: 50, baseType: !46, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !383, file: !379, line: 51, baseType: !46, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !379, line: 52, baseType: !376, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !383, file: !379, line: 53, baseType: !134, size: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !378, file: !379, line: 59, baseType: !40, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !378, file: !379, line: 60, baseType: !376, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !378, file: !379, line: 61, baseType: !219, size: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !378, file: !379, line: 62, baseType: !393, size: 32, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !379, line: 41, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !379, line: 43, size: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !379, line: 44, baseType: !393, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !395, file: !379, line: 45, baseType: !27, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !378, file: !379, line: 63, baseType: !400, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !379, line: 32, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !379, line: 34, size: 96, elements: !403)
!403 = !{!404, !409, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !402, file: !379, line: 35, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !379, line: 30, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !27}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !402, file: !379, line: 36, baseType: !27, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !379, line: 37, baseType: !400, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !378, file: !379, line: 64, baseType: !136, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !97, line: 141, baseType: !82, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !96, file: !97, line: 143, baseType: !320, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !96, file: !97, line: 144, baseType: !332, size: 32, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !96, file: !97, line: 145, baseType: !66, size: 64, offset: 480)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !96, file: !97, line: 147, baseType: !66, size: 64, offset: 544)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !96, file: !97, line: 148, baseType: !418, size: 16, offset: 608)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !419, line: 12, baseType: !420)
!419 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !32, line: 186, baseType: !326)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !96, file: !97, line: 154, baseType: !320, size: 32, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !96, file: !97, line: 155, baseType: !332, size: 32, offset: 672)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !96, file: !97, line: 157, baseType: !225, size: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !96, file: !97, line: 159, baseType: !194, size: 64, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !96, file: !97, line: 161, baseType: !158, size: 32, offset: 800)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !96, file: !97, line: 163, baseType: !134, size: 32, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !96, file: !97, line: 165, baseType: !33, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !96, file: !97, line: 167, baseType: !33, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !96, file: !97, line: 169, baseType: !33, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !96, file: !97, line: 170, baseType: !33, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !96, file: !97, line: 171, baseType: !33, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !96, file: !97, line: 173, baseType: !33, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !96, file: !97, line: 174, baseType: !33, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !96, file: !97, line: 175, baseType: !33, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !96, file: !97, line: 176, baseType: !33, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !96, file: !97, line: 178, baseType: !33, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !96, file: !97, line: 179, baseType: !33, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !96, file: !97, line: 180, baseType: !33, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !96, file: !97, line: 181, baseType: !33, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !96, file: !97, line: 183, baseType: !33, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !87, file: !88, line: 369, baseType: !26, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !87, file: !88, line: 370, baseType: !26, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !87, file: !88, line: 371, baseType: !26, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !87, file: !88, line: 372, baseType: !26, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !87, file: !88, line: 374, baseType: !446, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !88, line: 361, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !84}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !87, file: !88, line: 375, baseType: !446, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !87, file: !88, line: 378, baseType: !452, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !86, line: 18, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !455, line: 65, size: 3008, elements: !456)
!455 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!456 = !{!457, !458, !468, !469, !473, !474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !642, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !454, file: !455, line: 66, baseType: !240, size: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !454, file: !455, line: 67, baseType: !459, size: 160, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !460, line: 22, baseType: !461)
!460 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 16, size: 160, elements: !462)
!462 = !{!463, !464, !465, !466, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !461, file: !460, line: 17, baseType: !27, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !461, file: !460, line: 18, baseType: !134, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !461, file: !460, line: 19, baseType: !40, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !461, file: !460, line: 20, baseType: !134, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !461, file: !460, line: 21, baseType: !376, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !454, file: !455, line: 68, baseType: !91, size: 32, offset: 1376)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !454, file: !455, line: 69, baseType: !470, size: 128, offset: 1408)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 16)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !454, file: !455, line: 70, baseType: !470, size: 128, offset: 1536)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !454, file: !455, line: 72, baseType: !475, size: 32, offset: 1664)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !150, line: 18, baseType: !255)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !454, file: !455, line: 73, baseType: !162, size: 32, offset: 1696)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !454, file: !455, line: 74, baseType: !162, size: 32, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !454, file: !455, line: 75, baseType: !162, size: 32, offset: 1760)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !454, file: !455, line: 76, baseType: !162, size: 32, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !454, file: !455, line: 77, baseType: !162, size: 32, offset: 1824)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !454, file: !455, line: 79, baseType: !66, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !454, file: !455, line: 80, baseType: !66, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !454, file: !455, line: 81, baseType: !470, size: 128, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !454, file: !455, line: 83, baseType: !40, size: 32, offset: 2112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !454, file: !455, line: 84, baseType: !40, size: 32, offset: 2144)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !454, file: !455, line: 85, baseType: !232, size: 32, offset: 2176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !454, file: !455, line: 86, baseType: !232, size: 32, offset: 2208)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !454, file: !455, line: 88, baseType: !134, size: 32, offset: 2240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !454, file: !455, line: 89, baseType: !134, size: 32, offset: 2272)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !454, file: !455, line: 90, baseType: !134, size: 32, offset: 2304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !454, file: !455, line: 91, baseType: !134, size: 32, offset: 2336)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !454, file: !455, line: 93, baseType: !225, size: 32, offset: 2368)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !454, file: !455, line: 95, baseType: !494, size: 32, offset: 2400)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !86, line: 19, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !455, line: 157, size: 544, elements: !497)
!497 = !{!498, !523, !584, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !641}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !496, file: !455, line: 158, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !455, line: 154, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 145, size: 480, elements: !502)
!502 = !{!503, !514, !515, !516, !519, !520, !521, !522}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !501, file: !455, line: 146, baseType: !504, size: 96)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !182, line: 32, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !182, line: 37, size: 96, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !505, file: !182, line: 38, baseType: !188, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !505, file: !182, line: 39, baseType: !188, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !505, file: !182, line: 40, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !182, line: 34, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !188, !188, !188}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !501, file: !455, line: 147, baseType: !181, size: 160, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !501, file: !455, line: 148, baseType: !194, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !501, file: !455, line: 149, baseType: !517, size: 32, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !159, line: 106, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !501, file: !455, line: 150, baseType: !517, size: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !501, file: !455, line: 151, baseType: !232, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !501, file: !455, line: 152, baseType: !134, size: 32, offset: 416)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !501, file: !455, line: 153, baseType: !134, size: 32, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !496, file: !455, line: 159, baseType: !524, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !526, line: 59, baseType: !527)
!526 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 34, size: 800, elements: !528)
!528 = !{!529, !536, !537, !538, !546, !547, !548, !557, !558, !559, !560, !579, !580, !581, !582, !583}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !527, file: !526, line: 35, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !531, line: 21, baseType: !532)
!531 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 16, size: 64, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !532, file: !531, line: 17, baseType: !517, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !532, file: !531, line: 19, baseType: !517, size: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !527, file: !526, line: 37, baseType: !40, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !527, file: !526, line: 38, baseType: !40, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !527, file: !526, line: 40, baseType: !539, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !526, line: 16, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !526, line: 18, size: 96, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !541, file: !526, line: 19, baseType: !31, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !526, line: 20, baseType: !539, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !526, line: 21, baseType: !31, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !527, file: !526, line: 41, baseType: !539, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !527, file: !526, line: 42, baseType: !540, size: 96, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !527, file: !526, line: 44, baseType: !549, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !526, line: 31, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 25, size: 128, elements: !552)
!552 = !{!553, !554, !555, !556}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !551, file: !526, line: 26, baseType: !134, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !551, file: !526, line: 27, baseType: !134, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !551, file: !526, line: 29, baseType: !134, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !551, file: !526, line: 30, baseType: !134, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !527, file: !526, line: 45, baseType: !134, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !527, file: !526, line: 47, baseType: !46, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !527, file: !526, line: 48, baseType: !46, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !527, file: !526, line: 50, baseType: !561, size: 256, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !531, line: 37, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !531, line: 24, size: 256, elements: !563)
!563 = !{!564, !566, !567, !568, !578}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !562, file: !531, line: 26, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !562, file: !531, line: 28, baseType: !565, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !562, file: !531, line: 29, baseType: !134, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !562, file: !531, line: 30, baseType: !569, size: 128, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !570, line: 19, baseType: !571)
!570 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 17, size: 128, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !571, file: !570, line: 18, baseType: !574, size: 128)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 128, elements: !576)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!576 = !{!577}
!577 = !DISubrange(count: 4)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !562, file: !531, line: 36, baseType: !134, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !527, file: !526, line: 52, baseType: !46, size: 32, offset: 672)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !527, file: !526, line: 53, baseType: !47, size: 8, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !527, file: !526, line: 55, baseType: !33, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !527, file: !526, line: 57, baseType: !27, size: 32, offset: 736)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !527, file: !526, line: 58, baseType: !27, size: 32, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !496, file: !455, line: 161, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !242, line: 62, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 50, size: 384, elements: !588)
!588 = !{!589, !590, !591, !593, !598, !600, !602, !603, !604}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !242, line: 51, baseType: !66, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !587, file: !242, line: 52, baseType: !40, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !587, file: !242, line: 53, baseType: !592, size: 96, offset: 96)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 96, elements: !287)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !587, file: !242, line: 55, baseType: !594, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !242, line: 45, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{!350, !27}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !587, file: !242, line: 56, baseType: !599, size: 32, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !242, line: 46, baseType: !595)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !587, file: !242, line: 57, baseType: !601, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !242, line: 47, baseType: !406)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !242, line: 58, baseType: !27, size: 32, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !587, file: !242, line: 60, baseType: !46, size: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !587, file: !242, line: 61, baseType: !134, size: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !496, file: !455, line: 163, baseType: !232, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !496, file: !455, line: 164, baseType: !40, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !496, file: !455, line: 166, baseType: !162, size: 32, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !496, file: !455, line: 168, baseType: !162, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !496, file: !455, line: 170, baseType: !134, size: 32, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !496, file: !455, line: 171, baseType: !134, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !496, file: !455, line: 172, baseType: !350, size: 32, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !496, file: !455, line: 173, baseType: !350, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !496, file: !455, line: 174, baseType: !350, size: 32, offset: 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !496, file: !455, line: 176, baseType: !134, size: 32, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !496, file: !455, line: 177, baseType: !350, size: 32, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !496, file: !455, line: 178, baseType: !350, size: 32, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !496, file: !455, line: 180, baseType: !618, size: 32, offset: 480)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !620, line: 25, baseType: !621)
!620 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !620, line: 29, size: 320, elements: !622)
!622 = !{!623, !624, !634, !639, !640}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !620, line: 30, baseType: !27, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !621, file: !620, line: 31, baseType: !625, size: 192, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !626, line: 22, baseType: !627)
!626 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !626, line: 16, size: 192, elements: !628)
!628 = !{!629, !630, !631, !632, !633}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !627, file: !626, line: 17, baseType: !46, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !627, file: !626, line: 18, baseType: !40, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !626, line: 19, baseType: !66, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !627, file: !626, line: 20, baseType: !136, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !627, file: !626, line: 21, baseType: !134, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !621, file: !620, line: 32, baseType: !635, size: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !620, line: 27, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{!79, !618, !27}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !621, file: !620, line: 33, baseType: !27, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !621, file: !620, line: 34, baseType: !134, size: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !496, file: !455, line: 182, baseType: !134, size: 32, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !455, line: 96, baseType: !643, size: 32, offset: 2432)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !455, line: 62, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 39, size: 576, elements: !646)
!646 = !{!647, !648, !649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !645, file: !455, line: 40, baseType: !181, size: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !645, file: !455, line: 41, baseType: !194, size: 64, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !645, file: !455, line: 43, baseType: !650, size: 96, offset: 224)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 12)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !645, file: !455, line: 46, baseType: !33, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !645, file: !455, line: 47, baseType: !33, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !645, file: !455, line: 48, baseType: !33, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !645, file: !455, line: 49, baseType: !33, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !645, file: !455, line: 50, baseType: !33, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !645, file: !455, line: 51, baseType: !33, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !645, file: !455, line: 52, baseType: !33, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !645, file: !455, line: 53, baseType: !33, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !645, file: !455, line: 56, baseType: !475, size: 32, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !645, file: !455, line: 57, baseType: !162, size: 32, offset: 416)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !645, file: !455, line: 58, baseType: !162, size: 32, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !645, file: !455, line: 59, baseType: !40, size: 32, offset: 480)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !645, file: !455, line: 60, baseType: !232, size: 32, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !645, file: !455, line: 61, baseType: !350, size: 32, offset: 544)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !454, file: !455, line: 102, baseType: !350, size: 32, offset: 2464)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !454, file: !455, line: 103, baseType: !350, size: 32, offset: 2496)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !454, file: !455, line: 104, baseType: !350, size: 32, offset: 2528)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !454, file: !455, line: 105, baseType: !350, size: 32, offset: 2560)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !454, file: !455, line: 107, baseType: !102, size: 384, offset: 2592)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !454, file: !455, line: 109, baseType: !33, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !454, file: !455, line: 110, baseType: !33, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !454, file: !455, line: 112, baseType: !33, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !454, file: !455, line: 113, baseType: !33, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !454, file: !455, line: 114, baseType: !33, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !454, file: !455, line: 115, baseType: !33, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !454, file: !455, line: 116, baseType: !33, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !454, file: !455, line: 117, baseType: !33, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !454, file: !455, line: 118, baseType: !33, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !454, file: !455, line: 119, baseType: !33, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !454, file: !455, line: 121, baseType: !33, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !454, file: !455, line: 122, baseType: !33, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !87, file: !88, line: 381, baseType: !685, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !86, line: 17, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !688, line: 313, size: 4096, elements: !689)
!688 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!689 = !{!690, !695, !696, !737, !816, !817, !839, !848, !1106, !1107, !1108, !1146, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1324, !1328, !1329, !1333, !1334, !1335, !1336, !1337, !1341, !1345, !1349, !1350, !1362, !1363, !1364, !1365, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !687, file: !688, line: 314, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !688, line: 309, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !84, !685}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !687, file: !688, line: 315, baseType: !691, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !687, file: !688, line: 317, baseType: !697, size: 480, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !698, line: 22, baseType: !699)
!698 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !698, line: 36, size: 480, elements: !700)
!700 = !{!701, !702, !703, !704, !706, !707, !708, !714, !719, !721, !722, !731, !732, !733, !734, !735, !736}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !699, file: !698, line: 37, baseType: !93, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !699, file: !698, line: 39, baseType: !320, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !699, file: !698, line: 40, baseType: !332, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !698, line: 41, baseType: !705, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !699, file: !698, line: 43, baseType: !134, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !699, file: !698, line: 44, baseType: !350, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !699, file: !698, line: 46, baseType: !709, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !698, line: 24, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DISubroutineType(types: !712)
!712 = !{!79, !713, !27}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !699, file: !698, line: 47, baseType: !715, size: 32, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !698, line: 26, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !713, !27, !134}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !699, file: !698, line: 48, baseType: !720, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !698, line: 28, baseType: !716)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !698, line: 49, baseType: !27, size: 32, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !699, file: !698, line: 56, baseType: !723, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !725, line: 78, baseType: !726)
!725 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 74, size: 128, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !726, file: !725, line: 75, baseType: !320, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !726, file: !725, line: 76, baseType: !332, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !725, line: 77, baseType: !66, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !698, line: 58, baseType: !82, size: 32, offset: 352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !699, file: !698, line: 59, baseType: !82, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !699, file: !698, line: 61, baseType: !136, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !699, file: !698, line: 63, baseType: !33, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !699, file: !698, line: 64, baseType: !33, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !699, file: !698, line: 67, baseType: !33, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !687, file: !688, line: 319, baseType: !738, size: 32, offset: 544)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !740, line: 17, baseType: !741)
!740 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !740, line: 25, size: 1120, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !749, !750, !751, !752, !753, !758, !759, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !815}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !741, file: !740, line: 26, baseType: !93, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !741, file: !740, line: 27, baseType: !93, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !741, file: !740, line: 29, baseType: !219, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !741, file: !740, line: 30, baseType: !219, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !741, file: !740, line: 31, baseType: !748, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !741, file: !740, line: 33, baseType: !219, size: 32, offset: 160)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !741, file: !740, line: 35, baseType: !219, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !741, file: !740, line: 36, baseType: !219, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !741, file: !740, line: 37, baseType: !219, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !741, file: !740, line: 44, baseType: !754, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !740, line: 19, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!79, !738, !225}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !741, file: !740, line: 45, baseType: !27, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !741, file: !740, line: 47, baseType: !760, size: 32, offset: 352)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !740, line: 21, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!79, !27, !219}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !741, file: !740, line: 48, baseType: !27, size: 32, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !741, file: !740, line: 57, baseType: !33, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !741, file: !740, line: 58, baseType: !33, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !741, file: !740, line: 59, baseType: !33, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !741, file: !740, line: 60, baseType: !33, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !741, file: !740, line: 61, baseType: !33, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !741, file: !740, line: 62, baseType: !33, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !741, file: !740, line: 63, baseType: !33, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !741, file: !740, line: 64, baseType: !33, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !741, file: !740, line: 65, baseType: !33, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !741, file: !740, line: 66, baseType: !33, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !741, file: !740, line: 67, baseType: !33, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !741, file: !740, line: 68, baseType: !33, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !741, file: !740, line: 70, baseType: !79, size: 32, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !741, file: !740, line: 71, baseType: !779, size: 64, offset: 480)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !222, line: 68, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 65, size: 64, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !780, file: !222, line: 66, baseType: !79, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !222, line: 67, baseType: !40, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !741, file: !740, line: 72, baseType: !237, size: 32, offset: 544)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !741, file: !740, line: 74, baseType: !211, size: 32, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !741, file: !740, line: 76, baseType: !232, size: 32, offset: 608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !740, line: 77, baseType: !232, size: 32, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !741, file: !740, line: 79, baseType: !232, size: 32, offset: 672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !741, file: !740, line: 80, baseType: !211, size: 32, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !741, file: !740, line: 82, baseType: !350, size: 32, offset: 736)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !741, file: !740, line: 83, baseType: !350, size: 32, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !741, file: !740, line: 84, baseType: !211, size: 32, offset: 800)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !741, file: !740, line: 86, baseType: !376, size: 32, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !741, file: !740, line: 87, baseType: !136, size: 32, offset: 864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !741, file: !740, line: 89, baseType: !219, size: 32, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !741, file: !740, line: 90, baseType: !40, size: 32, offset: 928)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !741, file: !740, line: 91, baseType: !225, size: 32, offset: 960)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !741, file: !740, line: 93, baseType: !40, size: 32, offset: 992)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !741, file: !740, line: 94, baseType: !162, size: 32, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !741, file: !740, line: 96, baseType: !801, size: 32, offset: 1056)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !242, line: 84, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 71, size: 1408, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !803, file: !242, line: 72, baseType: !240, size: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !803, file: !242, line: 73, baseType: !232, size: 32, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !803, file: !242, line: 74, baseType: !585, size: 32, offset: 1248)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !803, file: !242, line: 75, baseType: !376, size: 32, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !803, file: !242, line: 76, baseType: !177, size: 32, offset: 1312)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !803, file: !242, line: 78, baseType: !134, size: 32, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !803, file: !242, line: 80, baseType: !33, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !803, file: !242, line: 81, baseType: !33, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !803, file: !242, line: 82, baseType: !33, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !803, file: !242, line: 83, baseType: !33, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !741, file: !740, line: 98, baseType: !82, size: 32, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !687, file: !688, line: 321, baseType: !219, size: 32, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !687, file: !688, line: 323, baseType: !818, size: 416, offset: 608)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !222, line: 71, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !222, line: 78, size: 416, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !819, file: !222, line: 79, baseType: !225, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !819, file: !222, line: 80, baseType: !219, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !819, file: !222, line: 81, baseType: !219, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !819, file: !222, line: 82, baseType: !219, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !819, file: !222, line: 84, baseType: !33, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !819, file: !222, line: 85, baseType: !33, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !819, file: !222, line: 86, baseType: !33, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !819, file: !222, line: 87, baseType: !33, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !819, file: !222, line: 88, baseType: !33, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !819, file: !222, line: 89, baseType: !33, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
