; ModuleID = 'src/http/modules/ngx_http_upstream_keepalive_module.c'
source_filename = "src/http/modules/ngx_http_upstream_keepalive_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_upstream_keepalive_module_ctx", scope: !2, file: !3, line: 91, type: !1818, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1810)
!3 = !DIFile(filename: "src/http/modules/ngx_http_upstream_keepalive_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !16, !80}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 17, size: 96, elements: !11)
!11 = !{!12, !14, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !10, file: !9, line: 18, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !10, file: !9, line: 19, baseType: !13, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !10, file: !9, line: 20, baseType: !13, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_keepalive_cache_t", file: !3, line: 34, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 25, size: 1056, elements: !19)
!19 = !{!20, !1784, !1785, !1786, !1787}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !18, file: !3, line: 26, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_keepalive_srv_conf_t", file: !3, line: 22, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 224, elements: !24)
!24 = !{!25, !31, !39, !40, !1783}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "max_cached", scope: !23, file: !3, line: 14, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !27, line: 79, baseType: !28)
!27 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !29, line: 125, baseType: !30)
!29 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !23, file: !3, line: 16, baseType: !32, size: 64, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !33, line: 16, baseType: !34)
!33 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !33, line: 18, size: 64, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !34, file: !33, line: 19, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 20, baseType: !37, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !23, file: !3, line: 17, baseType: !32, size: 64, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "original_init_upstream", scope: !23, file: !3, line: 19, baseType: !41, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !42, line: 79, baseType: !43)
!42 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !49, !556}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !27, line: 78, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !29, line: 140, baseType: !48)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !51, line: 16, baseType: !52)
!51 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !53, line: 116, size: 384, elements: !54)
!53 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !{!55, !58, !246, !538, !539, !540, !549, !550, !551, !552, !553, !555}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !53, line: 117, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !52, file: !53, line: 118, baseType: !59, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !61, line: 22, baseType: !62)
!61 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 16, size: 160, elements: !63)
!63 = !{!64, !65, !66, !68, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !62, file: !61, line: 17, baseType: !6, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !62, file: !61, line: 18, baseType: !26, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !61, line: 19, baseType: !67, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 120, baseType: !30)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !62, file: !61, line: 20, baseType: !26, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !62, file: !61, line: 21, baseType: !70, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !51, line: 18, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !73, line: 57, size: 320, elements: !74)
!73 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = !{!75, !87, !88, !89, !226, !233, !245}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !72, file: !73, line: 58, baseType: !76, size: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !73, line: 54, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 49, size: 128, elements: !78)
!78 = !{!79, !84, !85, !86}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !77, file: !73, line: 50, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !82, line: 64, baseType: !83)
!82 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !77, file: !73, line: 51, baseType: !80, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !73, line: 52, baseType: !70, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !77, file: !73, line: 53, baseType: !26, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !72, file: !73, line: 59, baseType: !67, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !72, file: !73, line: 60, baseType: !70, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !72, file: !73, line: 61, baseType: !90, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !51, line: 19, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !93, line: 59, size: 64, elements: !94)
!93 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!94 = !{!95, !225}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !92, file: !93, line: 60, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !93, line: 18, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !93, line: 20, size: 352, elements: !99)
!99 = !{!100, !101, !102, !104, !105, !106, !107, !109, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !98, file: !93, line: 21, baseType: !80, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !98, file: !93, line: 22, baseType: !80, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !98, file: !93, line: 23, baseType: !103, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !29, line: 222, baseType: !48)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !98, file: !93, line: 24, baseType: !103, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !98, file: !93, line: 26, baseType: !80, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !98, file: !93, line: 27, baseType: !80, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !98, file: !93, line: 28, baseType: !108, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !93, line: 16, baseType: !6)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !98, file: !93, line: 29, baseType: !110, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !51, line: 23, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !113, line: 16, size: 1216, elements: !114)
!113 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!114 = !{!115, !118, !125, !170, !171, !172, !210, !211}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !112, file: !113, line: 17, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !117, line: 16, baseType: !48)
!117 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !113, line: 18, baseType: !119, size: 64, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !120, line: 19, baseType: !121)
!120 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 16, size: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !120, line: 17, baseType: !67, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !120, line: 18, baseType: !80, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !112, file: !113, line: 19, baseType: !126, size: 960, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !117, line: 17, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !128, line: 4, size: 960, elements: !129)
!128 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!129 = !{!130, !132, !133, !135, !136, !138, !139, !141, !143, !145, !146, !147, !148, !149, !150, !153, !154, !156, !157, !163, !164, !165}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !127, file: !128, line: 6, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !29, line: 232, baseType: !30)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !127, file: !128, line: 7, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !127, file: !128, line: 8, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !29, line: 227, baseType: !30)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !127, file: !128, line: 9, baseType: !134, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !127, file: !128, line: 10, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !29, line: 217, baseType: !30)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !127, file: !128, line: 11, baseType: !137, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !127, file: !128, line: 13, baseType: !140, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !29, line: 212, baseType: !30)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !127, file: !128, line: 14, baseType: !142, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !29, line: 304, baseType: !30)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !127, file: !128, line: 15, baseType: !144, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !29, line: 309, baseType: !30)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !127, file: !128, line: 16, baseType: !30, size: 32, offset: 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !127, file: !128, line: 17, baseType: !131, size: 32, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !127, file: !128, line: 18, baseType: !131, size: 32, offset: 352)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !127, file: !128, line: 19, baseType: !103, size: 32, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !127, file: !128, line: 20, baseType: !103, size: 32, offset: 416)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !127, file: !128, line: 21, baseType: !151, size: 32, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !29, line: 237, baseType: !152)
!152 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !127, file: !128, line: 22, baseType: !151, size: 32, offset: 480)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !127, file: !128, line: 23, baseType: !155, size: 32, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !29, line: 242, baseType: !48)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !127, file: !128, line: 24, baseType: !155, size: 32, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !127, file: !128, line: 26, baseType: !158, size: 64, offset: 576)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !29, line: 288, size: 64, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !158, file: !29, line: 288, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !29, line: 75, baseType: !152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !158, file: !29, line: 288, baseType: !152, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !127, file: !128, line: 27, baseType: !158, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !127, file: !128, line: 28, baseType: !158, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !127, file: !128, line: 29, baseType: !166, size: 192, offset: 768)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 192, elements: !168)
!167 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!168 = !{!169}
!169 = !DISubrange(count: 3)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !112, file: !113, line: 21, baseType: !103, size: 32, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !112, file: !113, line: 22, baseType: !103, size: 32, offset: 1120)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !112, file: !113, line: 24, baseType: !173, size: 32, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !51, line: 20, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !176, line: 50, size: 320, elements: !177)
!176 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!177 = !{!178, !179, !191, !195, !196, !201, !202, !207, !208, !209}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !175, file: !176, line: 51, baseType: !26, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !175, file: !176, line: 52, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !51, line: 21, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !53, line: 89, size: 160, elements: !183)
!183 = !{!184, !185, !186, !190}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !182, file: !53, line: 90, baseType: !116, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !53, line: 91, baseType: !119, size: 64, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !182, file: !53, line: 93, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !180, !173}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !53, line: 94, baseType: !6, size: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !175, file: !176, line: 54, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !193, line: 98, baseType: !194)
!193 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!194 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !175, file: !176, line: 56, baseType: !161, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !175, file: !176, line: 58, baseType: !197, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !176, line: 45, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!80, !173, !80, !67}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !176, line: 59, baseType: !6, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !175, file: !176, line: 61, baseType: !203, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !176, line: 46, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !173, !26, !80, !67}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !175, file: !176, line: 62, baseType: !6, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !175, file: !176, line: 70, baseType: !56, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 72, baseType: !173, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !112, file: !113, line: 37, baseType: !30, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !112, file: !113, line: 38, baseType: !30, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !98, file: !93, line: 30, baseType: !96, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !98, file: !93, line: 34, baseType: !30, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !98, file: !93, line: 40, baseType: !30, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !98, file: !93, line: 43, baseType: !30, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !98, file: !93, line: 45, baseType: !30, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !98, file: !93, line: 46, baseType: !30, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !98, file: !93, line: 47, baseType: !30, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !98, file: !93, line: 48, baseType: !30, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !98, file: !93, line: 49, baseType: !30, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !98, file: !93, line: 50, baseType: !30, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !98, file: !93, line: 52, baseType: !30, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !98, file: !93, line: 53, baseType: !30, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !98, file: !93, line: 55, baseType: !48, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !93, line: 61, baseType: !90, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !72, file: !73, line: 62, baseType: !227, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !73, line: 41, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !73, line: 43, size: 64, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !73, line: 44, baseType: !227, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !229, file: !73, line: 45, baseType: !6, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !72, file: !73, line: 63, baseType: !234, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !73, line: 32, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !73, line: 34, size: 96, elements: !237)
!237 = !{!238, !243, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !236, file: !73, line: 35, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !73, line: 30, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !6}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !73, line: 36, baseType: !6, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !73, line: 37, baseType: !234, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !72, file: !73, line: 64, baseType: !173, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !52, file: !53, line: 120, baseType: !247, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !51, line: 17, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !250, line: 38, size: 2496, elements: !251)
!250 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!251 = !{!252, !255, !256, !257, !258, !259, !431, !432, !433, !489, !490, !491, !492, !493, !494, !495, !496, !507, !508, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !249, file: !250, line: 39, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !249, file: !250, line: 40, baseType: !70, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !249, file: !250, line: 42, baseType: !173, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !249, file: !250, line: 43, baseType: !174, size: 320, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !249, file: !250, line: 45, baseType: !26, size: 32, offset: 416)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !249, file: !250, line: 47, baseType: !260, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !51, line: 26, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !264, line: 121, size: 896, elements: !265)
!264 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!265 = !{!266, !267, !316, !317, !320, !327, !329, !334, !339, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 122, baseType: !6, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !263, file: !264, line: 123, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !51, line: 24, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !271, line: 30, size: 384, elements: !272)
!271 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !300, !301, !302, !315}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !271, line: 31, baseType: !6, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !270, file: !271, line: 33, baseType: !30, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !270, file: !271, line: 35, baseType: !30, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !270, file: !271, line: 38, baseType: !30, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !270, file: !271, line: 44, baseType: !30, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !270, file: !271, line: 46, baseType: !30, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !270, file: !271, line: 49, baseType: !30, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !270, file: !271, line: 51, baseType: !30, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !270, file: !271, line: 54, baseType: !30, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !270, file: !271, line: 56, baseType: !30, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !270, file: !271, line: 57, baseType: !30, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !270, file: !271, line: 59, baseType: !30, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !270, file: !271, line: 60, baseType: !30, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !270, file: !271, line: 62, baseType: !30, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !270, file: !271, line: 64, baseType: !30, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !270, file: !271, line: 67, baseType: !30, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !270, file: !271, line: 69, baseType: !30, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !270, file: !271, line: 71, baseType: !30, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !270, file: !271, line: 74, baseType: !30, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !270, file: !271, line: 75, baseType: !30, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !270, file: !271, line: 77, baseType: !30, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !270, file: !271, line: 107, baseType: !30, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !270, file: !271, line: 110, baseType: !296, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !51, line: 31, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !268}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !270, file: !271, line: 117, baseType: !26, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !270, file: !271, line: 119, baseType: !173, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !270, file: !271, line: 121, baseType: !303, size: 160, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !304, line: 20, baseType: !305)
!304 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !304, line: 22, size: 160, elements: !306)
!306 = !{!307, !309, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !305, file: !304, line: 23, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !304, line: 16, baseType: !26)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !305, file: !304, line: 24, baseType: !310, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !305, file: !304, line: 25, baseType: !310, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !305, file: !304, line: 26, baseType: !310, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !305, file: !304, line: 27, baseType: !81, size: 8, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !304, line: 28, baseType: !81, size: 8, offset: 136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !270, file: !271, line: 124, baseType: !32, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !263, file: !264, line: 124, baseType: !268, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !263, file: !264, line: 126, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !319, line: 17, baseType: !48)
!319 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !263, file: !264, line: 128, baseType: !321, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !322, line: 19, baseType: !323)
!322 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !261, !80, !67}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !29, line: 135, baseType: !48)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !263, file: !264, line: 129, baseType: !328, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !322, line: 22, baseType: !323)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !263, file: !264, line: 130, baseType: !330, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !322, line: 20, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!326, !261, !90, !103}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !263, file: !264, line: 131, baseType: !335, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !322, line: 23, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{!90, !261, !90, !103}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !263, file: !264, line: 133, baseType: !340, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !264, line: 16, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !264, line: 18, size: 960, elements: !343)
!343 = !{!344, !345, !357, !359, !360, !361, !362, !363, !364, !365, !370, !371, !372, !373, !374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !342, file: !264, line: 19, baseType: !318, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !342, file: !264, line: 21, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !348, line: 297, size: 128, elements: !349)
!348 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!349 = !{!350, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !347, file: !348, line: 298, baseType: !351, size: 16)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !29, line: 409, baseType: !352)
!352 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !347, file: !348, line: 299, baseType: !354, size: 112, offset: 16)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 112, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 14)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !342, file: !264, line: 22, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !29, line: 404, baseType: !30)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !342, file: !264, line: 23, baseType: !67, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !342, file: !264, line: 24, baseType: !119, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !264, line: 26, baseType: !48, size: 32, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !342, file: !264, line: 28, baseType: !48, size: 32, offset: 224)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !342, file: !264, line: 29, baseType: !48, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !342, file: !264, line: 30, baseType: !48, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !342, file: !264, line: 38, baseType: !366, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !51, line: 32, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !261}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !342, file: !264, line: 40, baseType: !6, size: 32, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !342, file: !264, line: 42, baseType: !174, size: 320, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !342, file: !264, line: 43, baseType: !173, size: 32, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !342, file: !264, line: 45, baseType: !67, size: 32, offset: 736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !342, file: !264, line: 47, baseType: !67, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !342, file: !264, line: 49, baseType: !376, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !377, line: 16, baseType: !308)
!377 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !342, file: !264, line: 51, baseType: !340, size: 32, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !342, file: !264, line: 52, baseType: !261, size: 32, offset: 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !342, file: !264, line: 54, baseType: !26, size: 32, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !342, file: !264, line: 56, baseType: !30, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !342, file: !264, line: 57, baseType: !30, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !342, file: !264, line: 58, baseType: !30, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !342, file: !264, line: 60, baseType: !30, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !342, file: !264, line: 61, baseType: !30, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !342, file: !264, line: 62, baseType: !30, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !342, file: !264, line: 63, baseType: !30, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !342, file: !264, line: 64, baseType: !30, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !342, file: !264, line: 65, baseType: !30, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !342, file: !264, line: 66, baseType: !30, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !342, file: !264, line: 67, baseType: !30, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !342, file: !264, line: 70, baseType: !30, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !342, file: !264, line: 72, baseType: !30, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !342, file: !264, line: 73, baseType: !30, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !342, file: !264, line: 74, baseType: !30, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !342, file: !264, line: 76, baseType: !30, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !342, file: !264, line: 77, baseType: !30, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !342, file: !264, line: 78, baseType: !30, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !263, file: !264, line: 135, baseType: !103, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !263, file: !264, line: 137, baseType: !173, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !263, file: !264, line: 139, baseType: !70, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !264, line: 141, baseType: !48, size: 32, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !263, file: !264, line: 143, baseType: !346, size: 32, offset: 416)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !263, file: !264, line: 144, baseType: !358, size: 32, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !263, file: !264, line: 145, baseType: !119, size: 64, offset: 480)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !263, file: !264, line: 147, baseType: !119, size: 64, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !263, file: !264, line: 148, baseType: !408, size: 16, offset: 608)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !409, line: 12, baseType: !410)
!409 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !29, line: 186, baseType: !352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !263, file: !264, line: 154, baseType: !346, size: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !263, file: !264, line: 155, baseType: !358, size: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !263, file: !264, line: 157, baseType: !96, size: 32, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !264, line: 159, baseType: !32, size: 64, offset: 736)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !263, file: !264, line: 161, baseType: !192, size: 32, offset: 800)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !263, file: !264, line: 163, baseType: !26, size: 32, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !263, file: !264, line: 165, baseType: !30, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !263, file: !264, line: 167, baseType: !30, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !263, file: !264, line: 169, baseType: !30, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !263, file: !264, line: 170, baseType: !30, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !263, file: !264, line: 171, baseType: !30, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !263, file: !264, line: 173, baseType: !30, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !263, file: !264, line: 174, baseType: !30, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !263, file: !264, line: 175, baseType: !30, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !263, file: !264, line: 176, baseType: !30, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !263, file: !264, line: 178, baseType: !30, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !263, file: !264, line: 179, baseType: !30, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !263, file: !264, line: 180, baseType: !30, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !263, file: !264, line: 181, baseType: !30, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !263, file: !264, line: 183, baseType: !30, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !249, file: !250, line: 48, baseType: !261, size: 32, offset: 480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !249, file: !250, line: 49, baseType: !26, size: 32, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !249, file: !250, line: 51, baseType: !434, size: 32, offset: 544)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !51, line: 15, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !438, line: 222, size: 800, elements: !439)
!438 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!439 = !{!440, !441, !442, !443, !444, !445, !446, !449, !450, !464, !465, !469, !473, !474, !475, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !437, file: !438, line: 223, baseType: !26, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !437, file: !438, line: 224, baseType: !26, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !438, line: 226, baseType: !56, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !437, file: !438, line: 228, baseType: !26, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !437, file: !438, line: 229, baseType: !26, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !437, file: !438, line: 231, baseType: !26, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !437, file: !438, line: 232, baseType: !447, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !437, file: !438, line: 234, baseType: !6, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !437, file: !438, line: 235, baseType: !451, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !51, line: 22, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !53, line: 77, size: 224, elements: !454)
!454 = !{!455, !456, !457, !461, !462, !463}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !53, line: 78, baseType: !119, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !53, line: 79, baseType: !26, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !453, file: !53, line: 80, baseType: !458, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{!56, !49, !451, !6}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !453, file: !53, line: 81, baseType: !26, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !453, file: !53, line: 82, baseType: !26, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !453, file: !53, line: 83, baseType: !6, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !438, line: 236, baseType: !26, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !437, file: !438, line: 238, baseType: !466, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{!46, !173}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !437, file: !438, line: 240, baseType: !470, size: 32, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DISubroutineType(types: !472)
!472 = !{!46, !247}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !437, file: !438, line: 242, baseType: !470, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !437, file: !438, line: 243, baseType: !470, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !437, file: !438, line: 244, baseType: !476, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !247}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !437, file: !438, line: 245, baseType: !476, size: 32, offset: 480)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !437, file: !438, line: 247, baseType: !476, size: 32, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !437, file: !438, line: 249, baseType: !28, size: 32, offset: 544)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !437, file: !438, line: 250, baseType: !28, size: 32, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !437, file: !438, line: 251, baseType: !28, size: 32, offset: 608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !437, file: !438, line: 252, baseType: !28, size: 32, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !437, file: !438, line: 253, baseType: !28, size: 32, offset: 672)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !437, file: !438, line: 254, baseType: !28, size: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !437, file: !438, line: 255, baseType: !28, size: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !437, file: !438, line: 256, baseType: !28, size: 32, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !249, file: !250, line: 52, baseType: !26, size: 32, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !249, file: !250, line: 53, baseType: !26, size: 32, offset: 608)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !249, file: !250, line: 55, baseType: !32, size: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !249, file: !250, line: 56, baseType: !26, size: 32, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !249, file: !250, line: 58, baseType: !60, size: 160, offset: 736)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !249, file: !250, line: 59, baseType: !60, size: 160, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !249, file: !250, line: 61, baseType: !60, size: 160, offset: 1056)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !249, file: !250, line: 62, baseType: !497, size: 96, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !304, line: 32, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !304, line: 37, size: 96, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !498, file: !304, line: 38, baseType: !310, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !498, file: !304, line: 39, baseType: !310, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !498, file: !304, line: 40, baseType: !503, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !304, line: 34, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !310, !310, !310}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !249, file: !250, line: 63, baseType: !303, size: 160, offset: 1312)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !249, file: !250, line: 65, baseType: !509, size: 224, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !510, line: 31, baseType: !511)
!510 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 25, size: 224, elements: !512)
!512 = !{!513, !521, !522, !523, !524}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !511, file: !510, line: 26, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !510, line: 16, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !510, line: 18, size: 96, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !516, file: !510, line: 19, baseType: !6, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !516, file: !510, line: 20, baseType: !26, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !510, line: 21, baseType: !514, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !511, file: !510, line: 27, baseType: !515, size: 96, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !510, line: 28, baseType: !67, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !511, file: !510, line: 29, baseType: !26, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !511, file: !510, line: 30, baseType: !70, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !249, file: !250, line: 66, baseType: !509, size: 224, offset: 1696)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !249, file: !250, line: 68, baseType: !26, size: 32, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !249, file: !250, line: 69, baseType: !26, size: 32, offset: 1952)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !249, file: !250, line: 71, baseType: !261, size: 32, offset: 1984)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !249, file: !250, line: 72, baseType: !268, size: 32, offset: 2016)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !249, file: !250, line: 73, baseType: !268, size: 32, offset: 2048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !249, file: !250, line: 75, baseType: !247, size: 32, offset: 2080)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !249, file: !250, line: 77, baseType: !119, size: 64, offset: 2112)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !249, file: !250, line: 78, baseType: !119, size: 64, offset: 2176)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !249, file: !250, line: 79, baseType: !119, size: 64, offset: 2240)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !249, file: !250, line: 80, baseType: !119, size: 64, offset: 2304)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !249, file: !250, line: 81, baseType: !119, size: 64, offset: 2368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !249, file: !250, line: 82, baseType: !119, size: 64, offset: 2432)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !52, file: !53, line: 121, baseType: !70, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !52, file: !53, line: 122, baseType: !70, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !52, file: !53, line: 123, baseType: !541, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !53, line: 103, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 98, size: 1344, elements: !544)
!544 = !{!545, !546, !547, !548}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !543, file: !53, line: 99, baseType: !111, size: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !543, file: !53, line: 100, baseType: !96, size: 32, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !543, file: !53, line: 101, baseType: !96, size: 32, offset: 1248)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !543, file: !53, line: 102, baseType: !26, size: 32, offset: 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !52, file: !53, line: 124, baseType: !173, size: 32, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !52, file: !53, line: 126, baseType: !6, size: 32, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !52, file: !53, line: 127, baseType: !26, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !52, file: !53, line: 128, baseType: !26, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !52, file: !53, line: 130, baseType: !554, size: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !53, line: 112, baseType: !458)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !52, file: !53, line: 131, baseType: !56, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !42, line: 77, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !42, line: 119, size: 416, elements: !559)
!559 = !{!560, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !558, file: !42, line: 120, baseType: !561, size: 96)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !42, line: 89, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 85, size: 96, elements: !563)
!563 = !{!564, !565, !1773}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !562, file: !42, line: 86, baseType: !41, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !562, file: !42, line: 87, baseType: !566, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !42, line: 81, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!46, !570, !556}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !572, line: 16, baseType: !573)
!572 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !574, line: 364, size: 5376, elements: !575)
!574 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!575 = !{!576, !578, !579, !580, !581, !582, !583, !588, !589, !802, !1333, !1334, !1335, !1336, !1375, !1405, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1450, !1461, !1468, !1469, !1471, !1472, !1485, !1486, !1487, !1488, !1489, !1490, !1669, !1673, !1678, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !573, file: !574, line: 365, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !29, line: 191, baseType: !30)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !573, file: !574, line: 367, baseType: !261, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !573, file: !574, line: 369, baseType: !13, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !573, file: !574, line: 370, baseType: !13, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !573, file: !574, line: 371, baseType: !13, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !573, file: !574, line: 372, baseType: !13, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !573, file: !574, line: 374, baseType: !584, size: 32, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !574, line: 361, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !570}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !573, file: !574, line: 375, baseType: !584, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !573, file: !574, line: 378, baseType: !590, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !572, line: 18, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !593, line: 65, size: 3008, elements: !594)
!593 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!594 = !{!595, !596, !597, !598, !602, !603, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !760, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !592, file: !593, line: 66, baseType: !111, size: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !592, file: !593, line: 67, baseType: !60, size: 160, offset: 1216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !592, file: !593, line: 68, baseType: !577, size: 32, offset: 1376)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !592, file: !593, line: 69, baseType: !599, size: 128, offset: 1408)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !592, file: !593, line: 70, baseType: !599, size: 128, offset: 1536)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !592, file: !593, line: 72, baseType: !604, size: 32, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !117, line: 18, baseType: !134)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !592, file: !593, line: 73, baseType: !161, size: 32, offset: 1696)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !592, file: !593, line: 74, baseType: !161, size: 32, offset: 1728)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !592, file: !593, line: 75, baseType: !161, size: 32, offset: 1760)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !592, file: !593, line: 76, baseType: !161, size: 32, offset: 1792)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !592, file: !593, line: 77, baseType: !161, size: 32, offset: 1824)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !592, file: !593, line: 79, baseType: !119, size: 64, offset: 1856)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !592, file: !593, line: 80, baseType: !119, size: 64, offset: 1920)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !592, file: !593, line: 81, baseType: !599, size: 128, offset: 1984)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !592, file: !593, line: 83, baseType: !67, size: 32, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !592, file: !593, line: 84, baseType: !67, size: 32, offset: 2144)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !592, file: !593, line: 85, baseType: !103, size: 32, offset: 2176)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !592, file: !593, line: 86, baseType: !103, size: 32, offset: 2208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !592, file: !593, line: 88, baseType: !26, size: 32, offset: 2240)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !592, file: !593, line: 89, baseType: !26, size: 32, offset: 2272)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !592, file: !593, line: 90, baseType: !26, size: 32, offset: 2304)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !592, file: !593, line: 91, baseType: !26, size: 32, offset: 2336)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !592, file: !593, line: 93, baseType: !96, size: 32, offset: 2368)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !592, file: !593, line: 95, baseType: !623, size: 32, offset: 2400)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !572, line: 19, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !593, line: 157, size: 544, elements: !626)
!626 = !{!627, !642, !703, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !759}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !625, file: !593, line: 158, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !593, line: 154, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 145, size: 480, elements: !631)
!631 = !{!632, !633, !634, !635, !638, !639, !640, !641}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !630, file: !593, line: 146, baseType: !497, size: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !630, file: !593, line: 147, baseType: !303, size: 160, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !630, file: !593, line: 148, baseType: !32, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !630, file: !593, line: 149, baseType: !636, size: 32, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !193, line: 106, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !630, file: !593, line: 150, baseType: !636, size: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !593, line: 151, baseType: !103, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !630, file: !593, line: 152, baseType: !26, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !630, file: !593, line: 153, baseType: !26, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !625, file: !593, line: 159, baseType: !643, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !645, line: 59, baseType: !646)
!645 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 34, size: 800, elements: !647)
!647 = !{!648, !655, !656, !657, !665, !666, !667, !676, !677, !678, !679, !698, !699, !700, !701, !702}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !646, file: !645, line: 35, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !650, line: 21, baseType: !651)
!650 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 16, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !651, file: !650, line: 17, baseType: !636, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !651, file: !650, line: 19, baseType: !636, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !646, file: !645, line: 37, baseType: !67, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !646, file: !645, line: 38, baseType: !67, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !646, file: !645, line: 40, baseType: !658, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !645, line: 16, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !645, line: 18, size: 96, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !660, file: !645, line: 19, baseType: !28, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !645, line: 20, baseType: !658, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !645, line: 21, baseType: !28, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !646, file: !645, line: 41, baseType: !658, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !646, file: !645, line: 42, baseType: !659, size: 96, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !646, file: !645, line: 44, baseType: !668, size: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !645, line: 31, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 25, size: 128, elements: !671)
!671 = !{!672, !673, !674, !675}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !670, file: !645, line: 26, baseType: !26, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !670, file: !645, line: 27, baseType: !26, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !670, file: !645, line: 29, baseType: !26, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !670, file: !645, line: 30, baseType: !26, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !646, file: !645, line: 45, baseType: !26, size: 32, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !646, file: !645, line: 47, baseType: !80, size: 32, offset: 352)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !646, file: !645, line: 48, baseType: !80, size: 32, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !646, file: !645, line: 50, baseType: !680, size: 256, offset: 416)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !650, line: 37, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 24, size: 256, elements: !682)
!682 = !{!683, !685, !686, !687, !697}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !681, file: !650, line: 26, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !681, file: !650, line: 28, baseType: !684, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !681, file: !650, line: 29, baseType: !26, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !681, file: !650, line: 30, baseType: !688, size: 128, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !689, line: 19, baseType: !690)
!689 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 17, size: 128, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !690, file: !689, line: 18, baseType: !693, size: 128)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 128, elements: !695)
!694 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!695 = !{!696}
!696 = !DISubrange(count: 4)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !681, file: !650, line: 36, baseType: !26, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !646, file: !645, line: 52, baseType: !80, size: 32, offset: 672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !646, file: !645, line: 53, baseType: !81, size: 8, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !646, file: !645, line: 55, baseType: !30, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !645, line: 57, baseType: !6, size: 32, offset: 736)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !646, file: !645, line: 58, baseType: !6, size: 32, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !625, file: !593, line: 161, baseType: !704, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !113, line: 62, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 50, size: 384, elements: !707)
!707 = !{!708, !709, !710, !712, !717, !719, !721, !722, !723}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !113, line: 51, baseType: !119, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !706, file: !113, line: 52, baseType: !67, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !706, file: !113, line: 53, baseType: !711, size: 96, offset: 96)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, elements: !168)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !706, file: !113, line: 55, baseType: !713, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !113, line: 45, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DISubroutineType(types: !716)
!716 = !{!376, !6}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !706, file: !113, line: 56, baseType: !718, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !113, line: 46, baseType: !714)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !706, file: !113, line: 57, baseType: !720, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !113, line: 47, baseType: !240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !706, file: !113, line: 58, baseType: !6, size: 32, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !706, file: !113, line: 60, baseType: !80, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !706, file: !113, line: 61, baseType: !26, size: 32, offset: 352)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !625, file: !593, line: 163, baseType: !103, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !625, file: !593, line: 164, baseType: !67, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !625, file: !593, line: 166, baseType: !161, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !625, file: !593, line: 168, baseType: !161, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !625, file: !593, line: 170, baseType: !26, size: 32, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !625, file: !593, line: 171, baseType: !26, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !625, file: !593, line: 172, baseType: !376, size: 32, offset: 288)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !625, file: !593, line: 173, baseType: !376, size: 32, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !625, file: !593, line: 174, baseType: !376, size: 32, offset: 352)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !625, file: !593, line: 176, baseType: !26, size: 32, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !625, file: !593, line: 177, baseType: !376, size: 32, offset: 416)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !625, file: !593, line: 178, baseType: !376, size: 32, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !625, file: !593, line: 180, baseType: !737, size: 32, offset: 480)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !250, line: 25, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !250, line: 29, size: 320, elements: !740)
!740 = !{!741, !742, !752, !757, !758}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !739, file: !250, line: 30, baseType: !6, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !739, file: !250, line: 31, baseType: !743, size: 192, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !744, line: 22, baseType: !745)
!744 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !744, line: 16, size: 192, elements: !746)
!746 = !{!747, !748, !749, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !745, file: !744, line: 17, baseType: !80, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !744, line: 18, baseType: !67, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !744, line: 19, baseType: !119, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !745, file: !744, line: 20, baseType: !173, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !745, file: !744, line: 21, baseType: !26, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !739, file: !250, line: 32, baseType: !753, size: 32, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !250, line: 27, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DISubroutineType(types: !756)
!756 = !{!46, !737, !6}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !739, file: !250, line: 33, baseType: !6, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !739, file: !250, line: 34, baseType: !26, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !625, file: !593, line: 182, baseType: !26, size: 32, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !592, file: !593, line: 96, baseType: !761, size: 32, offset: 2432)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !593, line: 62, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 39, size: 576, elements: !764)
!764 = !{!765, !766, !767, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !763, file: !593, line: 40, baseType: !303, size: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !763, file: !593, line: 41, baseType: !32, size: 64, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !763, file: !593, line: 43, baseType: !768, size: 96, offset: 224)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 96, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 12)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !763, file: !593, line: 46, baseType: !30, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !763, file: !593, line: 47, baseType: !30, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !763, file: !593, line: 48, baseType: !30, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !763, file: !593, line: 49, baseType: !30, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !763, file: !593, line: 50, baseType: !30, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !763, file: !593, line: 51, baseType: !30, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !763, file: !593, line: 52, baseType: !30, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !763, file: !593, line: 53, baseType: !30, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !763, file: !593, line: 56, baseType: !604, size: 32, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !763, file: !593, line: 57, baseType: !161, size: 32, offset: 416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !763, file: !593, line: 58, baseType: !161, size: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !763, file: !593, line: 59, baseType: !67, size: 32, offset: 480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !763, file: !593, line: 60, baseType: !103, size: 32, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !763, file: !593, line: 61, baseType: !376, size: 32, offset: 544)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !592, file: !593, line: 102, baseType: !376, size: 32, offset: 2464)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !592, file: !593, line: 103, baseType: !376, size: 32, offset: 2496)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !592, file: !593, line: 104, baseType: !376, size: 32, offset: 2528)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !592, file: !593, line: 105, baseType: !376, size: 32, offset: 2560)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !592, file: !593, line: 107, baseType: !269, size: 384, offset: 2592)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !592, file: !593, line: 109, baseType: !30, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !592, file: !593, line: 110, baseType: !30, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !592, file: !593, line: 112, baseType: !30, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !592, file: !593, line: 113, baseType: !30, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !592, file: !593, line: 114, baseType: !30, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !592, file: !593, line: 115, baseType: !30, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !592, file: !593, line: 116, baseType: !30, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !592, file: !593, line: 117, baseType: !30, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !592, file: !593, line: 118, baseType: !30, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !592, file: !593, line: 119, baseType: !30, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !592, file: !593, line: 121, baseType: !30, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !592, file: !593, line: 122, baseType: !30, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !573, file: !574, line: 381, baseType: !803, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !572, line: 17, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !42, line: 313, size: 4096, elements: !806)
!806 = !{!807, !812, !813, !854, !933, !934, !956, !965, !1060, !1061, !1062, !1100, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1278, !1282, !1283, !1287, !1288, !1289, !1290, !1291, !1295, !1299, !1303, !1304, !1316, !1317, !1318, !1319, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !805, file: !42, line: 314, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !42, line: 309, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !570, !803}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !805, file: !42, line: 315, baseType: !808, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !805, file: !42, line: 317, baseType: !814, size: 480, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !815, line: 22, baseType: !816)
!815 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !815, line: 36, size: 480, elements: !817)
!817 = !{!818, !819, !820, !821, !823, !824, !825, !831, !836, !838, !839, !848, !849, !850, !851, !852, !853}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !816, file: !815, line: 37, baseType: !261, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !816, file: !815, line: 39, baseType: !346, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !816, file: !815, line: 40, baseType: !358, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !815, line: 41, baseType: !822, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !816, file: !815, line: 43, baseType: !26, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !816, file: !815, line: 44, baseType: !376, size: 32, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !816, file: !815, line: 46, baseType: !826, size: 32, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !815, line: 24, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DISubroutineType(types: !829)
!829 = !{!46, !830, !6}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !816, file: !815, line: 47, baseType: !832, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !815, line: 26, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !830, !6, !26}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !816, file: !815, line: 48, baseType: !837, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !815, line: 28, baseType: !833)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !816, file: !815, line: 49, baseType: !6, size: 32, offset: 288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !816, file: !815, line: 56, baseType: !840, size: 32, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !842, line: 78, baseType: !843)
!842 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 74, size: 128, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !843, file: !842, line: 75, baseType: !346, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !843, file: !842, line: 76, baseType: !358, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !842, line: 77, baseType: !119, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !816, file: !815, line: 58, baseType: !48, size: 32, offset: 352)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !816, file: !815, line: 59, baseType: !48, size: 32, offset: 384)
