; ModuleID = 'src/http/modules/ngx_http_auth_basic_module.c'
source_filename = "src/http/modules/ngx_http_auth_basic_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_auth_basic_module_ctx", scope: !2, file: !3, line: 64, type: !1831, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1824, globals: !1825)
!3 = !DIFile(filename: "src/http/modules/ngx_http_auth_basic_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !20, file: !3, line: 109, size: 32, elements: !1820)
!20 = distinct !DISubprogram(name: "ngx_http_auth_basic_handler", scope: !3, file: !3, line: 96, type: !21, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1784)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !28}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !24, line: 78, baseType: !25)
!24 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !26, line: 140, baseType: !27)
!26 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !30, line: 16, baseType: !31)
!30 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !32, line: 364, size: 5376, elements: !33)
!32 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = !{!34, !37, !399, !401, !402, !403, !404, !409, !410, !643, !1337, !1338, !1339, !1340, !1379, !1409, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1454, !1465, !1472, !1473, !1475, !1476, !1489, !1490, !1491, !1492, !1493, !1494, !1680, !1684, !1689, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !31, file: !32, line: 365, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 191, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !31, file: !32, line: 367, baseType: !38, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !40, line: 26, baseType: !41)
!40 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !42, line: 121, size: 896, elements: !43)
!42 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !{!44, !46, !159, !160, !163, !170, !172, !266, !271, !331, !332, !333, !370, !371, !372, !373, !374, !375, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !42, line: 122, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !41, file: !42, line: 123, baseType: !47, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !40, line: 24, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !50, line: 30, size: 384, elements: !51)
!50 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !79, !82, !138, !151}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !50, line: 31, baseType: !45, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !49, file: !50, line: 33, baseType: !36, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !49, file: !50, line: 35, baseType: !36, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !49, file: !50, line: 38, baseType: !36, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !49, file: !50, line: 44, baseType: !36, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !49, file: !50, line: 46, baseType: !36, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !49, file: !50, line: 49, baseType: !36, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !49, file: !50, line: 51, baseType: !36, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !49, file: !50, line: 54, baseType: !36, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !49, file: !50, line: 56, baseType: !36, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !49, file: !50, line: 57, baseType: !36, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !49, file: !50, line: 59, baseType: !36, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !49, file: !50, line: 60, baseType: !36, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !49, file: !50, line: 62, baseType: !36, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !49, file: !50, line: 64, baseType: !36, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !49, file: !50, line: 67, baseType: !36, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !49, file: !50, line: 69, baseType: !36, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !49, file: !50, line: 71, baseType: !36, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !49, file: !50, line: 74, baseType: !36, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !49, file: !50, line: 75, baseType: !36, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !49, file: !50, line: 77, baseType: !36, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !49, file: !50, line: 107, baseType: !36, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !49, file: !50, line: 110, baseType: !75, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !40, line: 31, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !47}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !49, file: !50, line: 117, baseType: !80, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !24, line: 79, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 125, baseType: !36)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !49, file: !50, line: 119, baseType: !83, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !40, line: 20, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !86, line: 50, size: 320, elements: !87)
!86 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = !{!88, !89, !115, !119, !122, !127, !128, !133, !134, !137}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !85, file: !86, line: 51, baseType: !80, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !85, file: !86, line: 52, baseType: !90, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !40, line: 21, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !93, line: 89, size: 160, elements: !94)
!93 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!94 = !{!95, !98, !110, !114}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !92, file: !93, line: 90, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !97, line: 16, baseType: !27)
!97 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !93, line: 91, baseType: !99, size: 64, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !100, line: 19, baseType: !101)
!100 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 16, size: 64, elements: !102)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !101, file: !100, line: 17, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 120, baseType: !36)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !100, line: 18, baseType: !106, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !108, line: 64, baseType: !109)
!108 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !92, file: !93, line: 93, baseType: !111, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !90, !83}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !93, line: 94, baseType: !45, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !85, file: !86, line: 54, baseType: !116, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !117, line: 98, baseType: !118)
!117 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !85, file: !86, line: 56, baseType: !120, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !26, line: 75, baseType: !121)
!121 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !85, file: !86, line: 58, baseType: !123, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !86, line: 45, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106, !83, !106, !104}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !86, line: 59, baseType: !45, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !85, file: !86, line: 61, baseType: !129, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !86, line: 46, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !83, !80, !106, !104}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !85, file: !86, line: 62, baseType: !45, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !85, file: !86, line: 70, baseType: !135, size: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !86, line: 72, baseType: !83, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !49, file: !50, line: 121, baseType: !139, size: 160, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !140, line: 20, baseType: !141)
!140 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !140, line: 22, size: 160, elements: !142)
!142 = !{!143, !145, !147, !148, !149, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !141, file: !140, line: 23, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !140, line: 16, baseType: !80)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !141, file: !140, line: 24, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !141, file: !140, line: 25, baseType: !146, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !141, file: !140, line: 26, baseType: !146, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !141, file: !140, line: 27, baseType: !107, size: 8, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !140, line: 28, baseType: !107, size: 8, offset: 136)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !49, file: !50, line: 124, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !153, line: 16, baseType: !154)
!153 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !153, line: 18, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !153, line: 19, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !153, line: 20, baseType: !157, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !41, file: !42, line: 124, baseType: !47, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !41, file: !42, line: 126, baseType: !161, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !162, line: 17, baseType: !27)
!162 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !41, file: !42, line: 128, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !165, line: 19, baseType: !166)
!165 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !38, !106, !104}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 135, baseType: !27)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !41, file: !42, line: 129, baseType: !171, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !165, line: 22, baseType: !166)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !41, file: !42, line: 130, baseType: !173, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !165, line: 20, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!169, !38, !177, !190}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !40, line: 19, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !180, line: 59, size: 64, elements: !181)
!180 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!181 = !{!182, !265}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !180, line: 18, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !180, line: 20, size: 352, elements: !186)
!186 = !{!187, !188, !189, !191, !192, !193, !194, !196, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !185, file: !180, line: 21, baseType: !106, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !185, file: !180, line: 22, baseType: !106, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !185, file: !180, line: 23, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !26, line: 222, baseType: !27)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !185, file: !180, line: 24, baseType: !190, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !185, file: !180, line: 26, baseType: !106, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !185, file: !180, line: 27, baseType: !106, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !185, file: !180, line: 28, baseType: !195, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !180, line: 16, baseType: !45)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !185, file: !180, line: 29, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !40, line: 23, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !200, line: 16, size: 1216, elements: !201)
!200 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = !{!202, !203, !204, !247, !248, !249, !250, !251}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !199, file: !200, line: 17, baseType: !96, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !200, line: 18, baseType: !99, size: 64, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !199, file: !200, line: 19, baseType: !205, size: 960, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !97, line: 17, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !207, line: 4, size: 960, elements: !208)
!207 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!208 = !{!209, !211, !212, !214, !215, !217, !218, !220, !222, !224, !225, !226, !227, !228, !229, !231, !232, !234, !235, !240, !241, !242}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !206, file: !207, line: 6, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !26, line: 232, baseType: !36)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !206, file: !207, line: 7, baseType: !210, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !206, file: !207, line: 8, baseType: !213, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !26, line: 227, baseType: !36)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !206, file: !207, line: 9, baseType: !213, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !206, file: !207, line: 10, baseType: !216, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !26, line: 217, baseType: !36)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !206, file: !207, line: 11, baseType: !216, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !206, file: !207, line: 13, baseType: !219, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !26, line: 212, baseType: !36)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !206, file: !207, line: 14, baseType: !221, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !26, line: 304, baseType: !36)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !206, file: !207, line: 15, baseType: !223, size: 32, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !26, line: 309, baseType: !36)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !206, file: !207, line: 16, baseType: !36, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !206, file: !207, line: 17, baseType: !210, size: 32, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !206, file: !207, line: 18, baseType: !210, size: 32, offset: 352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !206, file: !207, line: 19, baseType: !190, size: 32, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !206, file: !207, line: 20, baseType: !190, size: 32, offset: 416)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !206, file: !207, line: 21, baseType: !230, size: 32, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !26, line: 237, baseType: !121)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !206, file: !207, line: 22, baseType: !230, size: 32, offset: 480)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !206, file: !207, line: 23, baseType: !233, size: 32, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !26, line: 242, baseType: !27)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !206, file: !207, line: 24, baseType: !233, size: 32, offset: 544)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !206, file: !207, line: 26, baseType: !236, size: 64, offset: 576)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !26, line: 288, size: 64, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !236, file: !26, line: 288, baseType: !120, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !236, file: !26, line: 288, baseType: !121, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !206, file: !207, line: 27, baseType: !236, size: 64, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !206, file: !207, line: 28, baseType: !236, size: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !206, file: !207, line: 29, baseType: !243, size: 192, offset: 768)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !245)
!244 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !199, file: !200, line: 21, baseType: !190, size: 32, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !199, file: !200, line: 22, baseType: !190, size: 32, offset: 1120)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !199, file: !200, line: 24, baseType: !83, size: 32, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !199, file: !200, line: 37, baseType: !36, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !199, file: !200, line: 38, baseType: !36, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !185, file: !180, line: 30, baseType: !183, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !185, file: !180, line: 34, baseType: !36, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !185, file: !180, line: 40, baseType: !36, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !185, file: !180, line: 43, baseType: !36, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !185, file: !180, line: 45, baseType: !36, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !185, file: !180, line: 46, baseType: !36, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !185, file: !180, line: 47, baseType: !36, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !185, file: !180, line: 48, baseType: !36, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !185, file: !180, line: 49, baseType: !36, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !185, file: !180, line: 50, baseType: !36, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !185, file: !180, line: 52, baseType: !36, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !185, file: !180, line: 53, baseType: !36, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !185, file: !180, line: 55, baseType: !27, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !180, line: 61, baseType: !177, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !41, file: !42, line: 131, baseType: !267, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !165, line: 23, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!177, !38, !177, !190}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !41, file: !42, line: 133, baseType: !272, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !42, line: 16, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !42, line: 18, size: 960, elements: !275)
!275 = !{!276, !277, !289, !291, !292, !293, !294, !295, !296, !297, !302, !303, !304, !305, !306, !307, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !274, file: !42, line: 19, baseType: !161, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !274, file: !42, line: 21, baseType: !278, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !280, line: 297, size: 128, elements: !281)
!280 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!281 = !{!282, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !279, file: !280, line: 298, baseType: !283, size: 16)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !26, line: 409, baseType: !284)
!284 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !279, file: !280, line: 299, baseType: !286, size: 112, offset: 16)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 112, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 14)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !274, file: !42, line: 22, baseType: !290, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !26, line: 404, baseType: !36)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !274, file: !42, line: 23, baseType: !104, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !274, file: !42, line: 24, baseType: !99, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !42, line: 26, baseType: !27, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !274, file: !42, line: 28, baseType: !27, size: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !274, file: !42, line: 29, baseType: !27, size: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !274, file: !42, line: 30, baseType: !27, size: 32, offset: 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !274, file: !42, line: 38, baseType: !298, size: 32, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !40, line: 32, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !38}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !274, file: !42, line: 40, baseType: !45, size: 32, offset: 352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !274, file: !42, line: 42, baseType: !84, size: 320, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !274, file: !42, line: 43, baseType: !83, size: 32, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !274, file: !42, line: 45, baseType: !104, size: 32, offset: 736)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !274, file: !42, line: 47, baseType: !104, size: 32, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !274, file: !42, line: 49, baseType: !308, size: 32, offset: 800)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !309, line: 16, baseType: !144)
!309 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !274, file: !42, line: 51, baseType: !272, size: 32, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !274, file: !42, line: 52, baseType: !38, size: 32, offset: 864)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !274, file: !42, line: 54, baseType: !80, size: 32, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !274, file: !42, line: 56, baseType: !36, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !274, file: !42, line: 57, baseType: !36, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !274, file: !42, line: 58, baseType: !36, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !274, file: !42, line: 60, baseType: !36, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !274, file: !42, line: 61, baseType: !36, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !274, file: !42, line: 62, baseType: !36, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !274, file: !42, line: 63, baseType: !36, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !274, file: !42, line: 64, baseType: !36, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !274, file: !42, line: 65, baseType: !36, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !274, file: !42, line: 66, baseType: !36, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !274, file: !42, line: 67, baseType: !36, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !274, file: !42, line: 70, baseType: !36, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !274, file: !42, line: 72, baseType: !36, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !274, file: !42, line: 73, baseType: !36, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !274, file: !42, line: 74, baseType: !36, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !274, file: !42, line: 76, baseType: !36, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !274, file: !42, line: 77, baseType: !36, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !274, file: !42, line: 78, baseType: !36, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !41, file: !42, line: 135, baseType: !190, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !41, file: !42, line: 137, baseType: !83, size: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !41, file: !42, line: 139, baseType: !334, size: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !40, line: 18, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !337, line: 57, size: 320, elements: !338)
!337 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!338 = !{!339, !347, !348, !349, !350, !357, !369}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !336, file: !337, line: 58, baseType: !340, size: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !337, line: 54, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 49, size: 128, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !341, file: !337, line: 50, baseType: !106, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !341, file: !337, line: 51, baseType: !106, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !337, line: 52, baseType: !334, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !341, file: !337, line: 53, baseType: !80, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !336, file: !337, line: 59, baseType: !104, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !336, file: !337, line: 60, baseType: !334, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !336, file: !337, line: 61, baseType: !177, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !336, file: !337, line: 62, baseType: !351, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !337, line: 41, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !337, line: 43, size: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !337, line: 44, baseType: !351, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !353, file: !337, line: 45, baseType: !45, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !336, file: !337, line: 63, baseType: !358, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !337, line: 32, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !337, line: 34, size: 96, elements: !361)
!361 = !{!362, !367, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !360, file: !337, line: 35, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !337, line: 30, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !45}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !360, file: !337, line: 36, baseType: !45, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !337, line: 37, baseType: !358, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !336, file: !337, line: 64, baseType: !83, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !42, line: 141, baseType: !27, size: 32, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !41, file: !42, line: 143, baseType: !278, size: 32, offset: 416)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !41, file: !42, line: 144, baseType: !290, size: 32, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !41, file: !42, line: 145, baseType: !99, size: 64, offset: 480)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !41, file: !42, line: 147, baseType: !99, size: 64, offset: 544)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !41, file: !42, line: 148, baseType: !376, size: 16, offset: 608)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !377, line: 12, baseType: !378)
!377 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 186, baseType: !284)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !41, file: !42, line: 154, baseType: !278, size: 32, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !41, file: !42, line: 155, baseType: !290, size: 32, offset: 672)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !41, file: !42, line: 157, baseType: !183, size: 32, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !41, file: !42, line: 159, baseType: !152, size: 64, offset: 736)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !41, file: !42, line: 161, baseType: !116, size: 32, offset: 800)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !41, file: !42, line: 163, baseType: !80, size: 32, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !41, file: !42, line: 165, baseType: !36, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !41, file: !42, line: 167, baseType: !36, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !41, file: !42, line: 169, baseType: !36, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !41, file: !42, line: 170, baseType: !36, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !41, file: !42, line: 171, baseType: !36, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !41, file: !42, line: 173, baseType: !36, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !41, file: !42, line: 174, baseType: !36, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !41, file: !42, line: 175, baseType: !36, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !41, file: !42, line: 176, baseType: !36, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !41, file: !42, line: 178, baseType: !36, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !41, file: !42, line: 179, baseType: !36, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !41, file: !42, line: 180, baseType: !36, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !41, file: !42, line: 181, baseType: !36, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !41, file: !42, line: 183, baseType: !36, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !31, file: !32, line: 369, baseType: !400, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !31, file: !32, line: 370, baseType: !400, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !31, file: !32, line: 371, baseType: !400, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !31, file: !32, line: 372, baseType: !400, size: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !31, file: !32, line: 374, baseType: !405, size: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !32, line: 361, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !28}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !31, file: !32, line: 375, baseType: !405, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !31, file: !32, line: 378, baseType: !411, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !30, line: 18, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !414, line: 65, size: 3008, elements: !415)
!414 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!415 = !{!416, !417, !427, !428, !432, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !601, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !413, file: !414, line: 66, baseType: !198, size: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !413, file: !414, line: 67, baseType: !418, size: 160, offset: 1216)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !419, line: 22, baseType: !420)
!419 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 16, size: 160, elements: !421)
!421 = !{!422, !423, !424, !425, !426}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !420, file: !419, line: 17, baseType: !45, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !420, file: !419, line: 18, baseType: !80, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !420, file: !419, line: 19, baseType: !104, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !420, file: !419, line: 20, baseType: !80, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !420, file: !419, line: 21, baseType: !334, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !413, file: !414, line: 68, baseType: !35, size: 32, offset: 1376)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !413, file: !414, line: 69, baseType: !429, size: 128, offset: 1408)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !413, file: !414, line: 70, baseType: !429, size: 128, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !413, file: !414, line: 72, baseType: !434, size: 32, offset: 1664)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !97, line: 18, baseType: !213)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !413, file: !414, line: 73, baseType: !120, size: 32, offset: 1696)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !413, file: !414, line: 74, baseType: !120, size: 32, offset: 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !413, file: !414, line: 75, baseType: !120, size: 32, offset: 1760)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !413, file: !414, line: 76, baseType: !120, size: 32, offset: 1792)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !413, file: !414, line: 77, baseType: !120, size: 32, offset: 1824)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !413, file: !414, line: 79, baseType: !99, size: 64, offset: 1856)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !413, file: !414, line: 80, baseType: !99, size: 64, offset: 1920)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !413, file: !414, line: 81, baseType: !429, size: 128, offset: 1984)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !413, file: !414, line: 83, baseType: !104, size: 32, offset: 2112)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !413, file: !414, line: 84, baseType: !104, size: 32, offset: 2144)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !413, file: !414, line: 85, baseType: !190, size: 32, offset: 2176)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !413, file: !414, line: 86, baseType: !190, size: 32, offset: 2208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !413, file: !414, line: 88, baseType: !80, size: 32, offset: 2240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !413, file: !414, line: 89, baseType: !80, size: 32, offset: 2272)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !413, file: !414, line: 90, baseType: !80, size: 32, offset: 2304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !413, file: !414, line: 91, baseType: !80, size: 32, offset: 2336)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !413, file: !414, line: 93, baseType: !183, size: 32, offset: 2368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !413, file: !414, line: 95, baseType: !453, size: 32, offset: 2400)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !30, line: 19, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !414, line: 157, size: 544, elements: !456)
!456 = !{!457, !482, !543, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !600}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !455, file: !414, line: 158, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !414, line: 154, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 145, size: 480, elements: !461)
!461 = !{!462, !473, !474, !475, !478, !479, !480, !481}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !460, file: !414, line: 146, baseType: !463, size: 96)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !140, line: 32, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !140, line: 37, size: 96, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !464, file: !140, line: 38, baseType: !146, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !464, file: !140, line: 39, baseType: !146, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !464, file: !140, line: 40, baseType: !469, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !140, line: 34, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !146, !146, !146}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !460, file: !414, line: 147, baseType: !139, size: 160, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !460, file: !414, line: 148, baseType: !152, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !460, file: !414, line: 149, baseType: !476, size: 32, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !117, line: 106, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !460, file: !414, line: 150, baseType: !476, size: 32, offset: 352)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !414, line: 151, baseType: !190, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !460, file: !414, line: 152, baseType: !80, size: 32, offset: 416)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !460, file: !414, line: 153, baseType: !80, size: 32, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !455, file: !414, line: 159, baseType: !483, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !485, line: 59, baseType: !486)
!485 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 34, size: 800, elements: !487)
!487 = !{!488, !495, !496, !497, !505, !506, !507, !516, !517, !518, !519, !538, !539, !540, !541, !542}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !486, file: !485, line: 35, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !490, line: 21, baseType: !491)
!490 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 16, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !491, file: !490, line: 17, baseType: !476, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !491, file: !490, line: 19, baseType: !476, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !486, file: !485, line: 37, baseType: !104, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !486, file: !485, line: 38, baseType: !104, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !486, file: !485, line: 40, baseType: !498, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !485, line: 16, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !485, line: 18, size: 96, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !500, file: !485, line: 19, baseType: !81, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !485, line: 20, baseType: !498, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !500, file: !485, line: 21, baseType: !81, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !486, file: !485, line: 41, baseType: !498, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !486, file: !485, line: 42, baseType: !499, size: 96, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !486, file: !485, line: 44, baseType: !508, size: 32, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !485, line: 31, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 25, size: 128, elements: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !510, file: !485, line: 26, baseType: !80, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !510, file: !485, line: 27, baseType: !80, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !510, file: !485, line: 29, baseType: !80, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !510, file: !485, line: 30, baseType: !80, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !486, file: !485, line: 45, baseType: !80, size: 32, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !486, file: !485, line: 47, baseType: !106, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !486, file: !485, line: 48, baseType: !106, size: 32, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !486, file: !485, line: 50, baseType: !520, size: 256, offset: 416)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !490, line: 37, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 24, size: 256, elements: !522)
!522 = !{!523, !525, !526, !527, !537}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !521, file: !490, line: 26, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !521, file: !490, line: 28, baseType: !524, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !521, file: !490, line: 29, baseType: !80, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !521, file: !490, line: 30, baseType: !528, size: 128, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !529, line: 19, baseType: !530)
!529 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 17, size: 128, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !530, file: !529, line: 18, baseType: !533, size: 128)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 128, elements: !535)
!534 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!535 = !{!536}
!536 = !DISubrange(count: 4)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !521, file: !490, line: 36, baseType: !80, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !486, file: !485, line: 52, baseType: !106, size: 32, offset: 672)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !486, file: !485, line: 53, baseType: !107, size: 8, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !486, file: !485, line: 55, baseType: !36, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !485, line: 57, baseType: !45, size: 32, offset: 736)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !486, file: !485, line: 58, baseType: !45, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !455, file: !414, line: 161, baseType: !544, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !200, line: 62, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 50, size: 384, elements: !547)
!547 = !{!548, !549, !550, !552, !557, !559, !561, !562, !563}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !546, file: !200, line: 51, baseType: !99, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !546, file: !200, line: 52, baseType: !104, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !546, file: !200, line: 53, baseType: !551, size: 96, offset: 96)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 96, elements: !245)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !546, file: !200, line: 55, baseType: !553, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !200, line: 45, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{!308, !45}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !546, file: !200, line: 56, baseType: !558, size: 32, offset: 224)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !200, line: 46, baseType: !554)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !546, file: !200, line: 57, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !200, line: 47, baseType: !364)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !200, line: 58, baseType: !45, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !546, file: !200, line: 60, baseType: !106, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !546, file: !200, line: 61, baseType: !80, size: 32, offset: 352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !455, file: !414, line: 163, baseType: !190, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !455, file: !414, line: 164, baseType: !104, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !455, file: !414, line: 166, baseType: !120, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !455, file: !414, line: 168, baseType: !120, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !455, file: !414, line: 170, baseType: !80, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !455, file: !414, line: 171, baseType: !80, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !455, file: !414, line: 172, baseType: !308, size: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !455, file: !414, line: 173, baseType: !308, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !455, file: !414, line: 174, baseType: !308, size: 32, offset: 352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !455, file: !414, line: 176, baseType: !80, size: 32, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !455, file: !414, line: 177, baseType: !308, size: 32, offset: 416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !455, file: !414, line: 178, baseType: !308, size: 32, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !455, file: !414, line: 180, baseType: !577, size: 32, offset: 480)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !579, line: 25, baseType: !580)
!579 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !579, line: 29, size: 320, elements: !581)
!581 = !{!582, !583, !593, !598, !599}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !580, file: !579, line: 30, baseType: !45, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !580, file: !579, line: 31, baseType: !584, size: 192, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !585, line: 22, baseType: !586)
!585 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !585, line: 16, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591, !592}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !586, file: !585, line: 17, baseType: !106, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !585, line: 18, baseType: !104, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !585, line: 19, baseType: !99, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !586, file: !585, line: 20, baseType: !83, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !586, file: !585, line: 21, baseType: !80, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !580, file: !579, line: 32, baseType: !594, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !579, line: 27, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{!23, !577, !45}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !580, file: !579, line: 33, baseType: !45, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !580, file: !579, line: 34, baseType: !80, size: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !455, file: !414, line: 182, baseType: !80, size: 32, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !413, file: !414, line: 96, baseType: !602, size: 32, offset: 2432)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !414, line: 62, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 39, size: 576, elements: !605)
!605 = !{!606, !607, !608, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !604, file: !414, line: 40, baseType: !139, size: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !604, file: !414, line: 41, baseType: !152, size: 64, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !604, file: !414, line: 43, baseType: !609, size: 96, offset: 224)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 96, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 12)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !604, file: !414, line: 46, baseType: !36, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !604, file: !414, line: 47, baseType: !36, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !604, file: !414, line: 48, baseType: !36, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !604, file: !414, line: 49, baseType: !36, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !604, file: !414, line: 50, baseType: !36, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !604, file: !414, line: 51, baseType: !36, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !604, file: !414, line: 52, baseType: !36, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !604, file: !414, line: 53, baseType: !36, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !604, file: !414, line: 56, baseType: !434, size: 32, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !604, file: !414, line: 57, baseType: !120, size: 32, offset: 416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !604, file: !414, line: 58, baseType: !120, size: 32, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !604, file: !414, line: 59, baseType: !104, size: 32, offset: 480)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !604, file: !414, line: 60, baseType: !190, size: 32, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !604, file: !414, line: 61, baseType: !308, size: 32, offset: 544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !413, file: !414, line: 102, baseType: !308, size: 32, offset: 2464)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !413, file: !414, line: 103, baseType: !308, size: 32, offset: 2496)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !413, file: !414, line: 104, baseType: !308, size: 32, offset: 2528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !413, file: !414, line: 105, baseType: !308, size: 32, offset: 2560)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !413, file: !414, line: 107, baseType: !48, size: 384, offset: 2592)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !413, file: !414, line: 109, baseType: !36, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !413, file: !414, line: 110, baseType: !36, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !413, file: !414, line: 112, baseType: !36, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !413, file: !414, line: 113, baseType: !36, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !413, file: !414, line: 114, baseType: !36, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !413, file: !414, line: 115, baseType: !36, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !413, file: !414, line: 116, baseType: !36, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !413, file: !414, line: 117, baseType: !36, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !413, file: !414, line: 118, baseType: !36, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !413, file: !414, line: 119, baseType: !36, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !413, file: !414, line: 121, baseType: !36, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !413, file: !414, line: 122, baseType: !36, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !31, file: !32, line: 381, baseType: !644, size: 32, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !30, line: 17, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !647, line: 313, size: 4096, elements: !648)
!647 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!648 = !{!649, !654, !655, !696, !775, !776, !798, !807, !1066, !1067, !1068, !1106, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1284, !1288, !1289, !1291, !1292, !1293, !1294, !1295, !1299, !1303, !1307, !1308, !1320, !1321, !1322, !1323, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !646, file: !647, line: 314, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !647, line: 309, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !28, !644}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !646, file: !647, line: 315, baseType: !650, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !646, file: !647, line: 317, baseType: !656, size: 480, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !657, line: 22, baseType: !658)
!657 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !657, line: 36, size: 480, elements: !659)
!659 = !{!660, !661, !662, !663, !665, !666, !667, !673, !678, !680, !681, !690, !691, !692, !693, !694, !695}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !658, file: !657, line: 37, baseType: !38, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !658, file: !657, line: 39, baseType: !278, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !658, file: !657, line: 40, baseType: !290, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !657, line: 41, baseType: !664, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !658, file: !657, line: 43, baseType: !80, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !658, file: !657, line: 44, baseType: !308, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !658, file: !657, line: 46, baseType: !668, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !657, line: 24, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DISubroutineType(types: !671)
!671 = !{!23, !672, !45}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !658, file: !657, line: 47, baseType: !674, size: 32, offset: 224)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !657, line: 26, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !672, !45, !80}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !658, file: !657, line: 48, baseType: !679, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !657, line: 28, baseType: !675)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !658, file: !657, line: 49, baseType: !45, size: 32, offset: 288)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !658, file: !657, line: 56, baseType: !682, size: 32, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !684, line: 78, baseType: !685)
!684 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 74, size: 128, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !685, file: !684, line: 75, baseType: !278, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !685, file: !684, line: 76, baseType: !290, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !684, line: 77, baseType: !99, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !657, line: 58, baseType: !27, size: 32, offset: 352)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !658, file: !657, line: 59, baseType: !27, size: 32, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !658, file: !657, line: 61, baseType: !83, size: 32, offset: 416)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !658, file: !657, line: 63, baseType: !36, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !658, file: !657, line: 64, baseType: !36, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !658, file: !657, line: 67, baseType: !36, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !646, file: !647, line: 319, baseType: !697, size: 32, offset: 544)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !699, line: 17, baseType: !700)
!699 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !699, line: 25, size: 1120, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !708, !709, !710, !711, !712, !717, !718, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !774}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !700, file: !699, line: 26, baseType: !38, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !700, file: !699, line: 27, baseType: !38, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !700, file: !699, line: 29, baseType: !177, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !700, file: !699, line: 30, baseType: !177, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !700, file: !699, line: 31, baseType: !707, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !700, file: !699, line: 33, baseType: !177, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !700, file: !699, line: 35, baseType: !177, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !700, file: !699, line: 36, baseType: !177, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !700, file: !699, line: 37, baseType: !177, size: 32, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !700, file: !699, line: 44, baseType: !713, size: 32, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !699, line: 19, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DISubroutineType(types: !716)
!716 = !{!23, !697, !183}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !700, file: !699, line: 45, baseType: !45, size: 32, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !700, file: !699, line: 47, baseType: !719, size: 32, offset: 352)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !699, line: 21, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{!23, !45, !177}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !700, file: !699, line: 48, baseType: !45, size: 32, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !700, file: !699, line: 57, baseType: !36, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !700, file: !699, line: 58, baseType: !36, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !700, file: !699, line: 59, baseType: !36, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !700, file: !699, line: 60, baseType: !36, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !700, file: !699, line: 61, baseType: !36, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !700, file: !699, line: 62, baseType: !36, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !700, file: !699, line: 63, baseType: !36, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !700, file: !699, line: 64, baseType: !36, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !700, file: !699, line: 65, baseType: !36, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !700, file: !699, line: 66, baseType: !36, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !700, file: !699, line: 67, baseType: !36, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !700, file: !699, line: 68, baseType: !36, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !700, file: !699, line: 70, baseType: !23, size: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !700, file: !699, line: 71, baseType: !738, size: 64, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !180, line: 68, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 65, size: 64, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !739, file: !180, line: 66, baseType: !23, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !739, file: !180, line: 67, baseType: !104, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !700, file: !699, line: 72, baseType: !195, size: 32, offset: 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !700, file: !699, line: 74, baseType: !169, size: 32, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !700, file: !699, line: 76, baseType: !190, size: 32, offset: 608)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !700, file: !699, line: 77, baseType: !190, size: 32, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !700, file: !699, line: 79, baseType: !190, size: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !700, file: !699, line: 80, baseType: !169, size: 32, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !700, file: !699, line: 82, baseType: !308, size: 32, offset: 736)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !700, file: !699, line: 83, baseType: !308, size: 32, offset: 768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !700, file: !699, line: 84, baseType: !169, size: 32, offset: 800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !700, file: !699, line: 86, baseType: !334, size: 32, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !700, file: !699, line: 87, baseType: !83, size: 32, offset: 864)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !700, file: !699, line: 89, baseType: !177, size: 32, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !700, file: !699, line: 90, baseType: !104, size: 32, offset: 928)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !700, file: !699, line: 91, baseType: !183, size: 32, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !700, file: !699, line: 93, baseType: !104, size: 32, offset: 992)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !700, file: !699, line: 94, baseType: !120, size: 32, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !700, file: !699, line: 96, baseType: !760, size: 32, offset: 1056)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !200, line: 84, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 71, size: 1408, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !762, file: !200, line: 72, baseType: !198, size: 1216)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !762, file: !200, line: 73, baseType: !190, size: 32, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !762, file: !200, line: 74, baseType: !544, size: 32, offset: 1248)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !762, file: !200, line: 75, baseType: !334, size: 32, offset: 1280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !762, file: !200, line: 76, baseType: !135, size: 32, offset: 1312)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !762, file: !200, line: 78, baseType: !80, size: 32, offset: 1344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !762, file: !200, line: 80, baseType: !36, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !762, file: !200, line: 81, baseType: !36, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !762, file: !200, line: 82, baseType: !36, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !762, file: !200, line: 83, baseType: !36, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !700, file: !699, line: 98, baseType: !27, size: 32, offset: 1088)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !646, file: !647, line: 321, baseType: !177, size: 32, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !646, file: !647, line: 323, baseType: !777, size: 416, offset: 608)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !180, line: 71, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !180, line: 78, size: 416, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !797}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !778, file: !180, line: 79, baseType: !183, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !778, file: !180, line: 80, baseType: !177, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !778, file: !180, line: 81, baseType: !177, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !778, file: !180, line: 82, baseType: !177, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !778, file: !180, line: 84, baseType: !36, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !778, file: !180, line: 85, baseType: !36, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !778, file: !180, line: 86, baseType: !36, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !778, file: !180, line: 87, baseType: !36, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !778, file: !180, line: 88, baseType: !36, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !778, file: !180, line: 89, baseType: !36, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !778, file: !180, line: 104, baseType: !190, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !778, file: !180, line: 106, baseType: !334, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !778, file: !180, line: 107, baseType: !23, size: 32, offset: 224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !778, file: !180, line: 108, baseType: !738, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !778, file: !180, line: 109, baseType: !195, size: 32, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !778, file: !180, line: 111, baseType: !796, size: 32, offset: 352)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !180, line: 73, baseType: !720)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !778, file: !180, line: 112, baseType: !45, size: 32, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !646, file: !647, line: 324, baseType: !799, size: 160, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !180, line: 122, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 116, size: 160, elements: !801)
!801 = !{!802, !803, !804, !805, !806}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !800, file: !180, line: 117, baseType: !177, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !800, file: !180, line: 118, baseType: !707, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !800, file: !180, line: 119, baseType: !38, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !800, file: !180, line: 120, baseType: !334, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !800, file: !180, line: 121, baseType: !190, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !646, file: !647, line: 326, baseType: !808, size: 32, offset: 1184)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_conf_t", file: !647, line: 238, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 147, size: 1760, elements: !811)
!811 = !{!812, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1024, !1025, !1026, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !810, file: !647, line: 148, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !647, line: 77, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !647, line: 119, size: 416, elements: !816)
!816 = !{!817, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !815, file: !647, line: 120, baseType: !818, size: 96)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !647, line: 89, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 85, size: 96, elements: !820)
!820 = !{!821, !962, !967}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !819, file: !647, line: 86, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !647, line: 79, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!23, !826, !813}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !40, line: 16, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !93, line: 116, size: 384, elements: !829)
!829 = !{!830, !831, !833, !944, !945, !946, !955, !956, !957, !958, !959, !961}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !93, line: 117, baseType: !135, size: 32)
