; ModuleID = 'src/http/modules/ngx_http_memcached_module.c'
source_filename = "src/http/modules/ngx_http_memcached_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_memcached_module_ctx", scope: !2, file: !3, line: 130, type: !563, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !37)
!3 = !DIFile(filename: "src/http/modules/ngx_http_memcached_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !12, !16, !17, !26, !30, !27, !32, !35}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !8, line: 79, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !13, line: 16, baseType: !14)
!13 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !15, line: 16, baseType: !7)
!15 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 120, baseType: !11)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !19, line: 21, baseType: !20)
!19 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 17, size: 96, elements: !21)
!21 = !{!22, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !20, file: !19, line: 18, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !20, file: !19, line: 19, baseType: !23, size: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !20, file: !19, line: 20, baseType: !23, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !28, line: 64, baseType: !29)
!28 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !31, line: 16, baseType: !6)
!31 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !10, line: 135, baseType: !36)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !0, !541, !546, !551, !553}
!38 = !DIGlobalVariableExpression(var: !39)
!39 = distinct !DIGlobalVariable(name: "ngx_http_memcached_module", scope: !2, file: !3, line: 145, type: !40, isLocal: false, isDefinition: true)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !41, line: 15, baseType: !42)
!41 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !43, line: 222, size: 800, elements: !44)
!43 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !{!45, !46, !47, !49, !50, !51, !52, !53, !54, !514, !515, !521, !525, !526, !527, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !42, file: !43, line: 223, baseType: !7, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !42, file: !43, line: 224, baseType: !7, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !43, line: 226, baseType: !48, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !42, file: !43, line: 228, baseType: !7, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !42, file: !43, line: 229, baseType: !7, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !42, file: !43, line: 231, baseType: !7, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !42, file: !43, line: 232, baseType: !32, size: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !42, file: !43, line: 234, baseType: !6, size: 32, offset: 224)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !42, file: !43, line: 235, baseType: !55, size: 32, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !41, line: 22, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !58, line: 77, size: 224, elements: !59)
!58 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !{!60, !67, !68, !511, !512, !513}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !58, line: 78, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !62, line: 19, baseType: !63)
!62 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 16, size: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !62, line: 17, baseType: !16, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !62, line: 18, baseType: !26, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !58, line: 79, baseType: !7, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !57, file: !58, line: 80, baseType: !69, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DISubroutineType(types: !71)
!71 = !{!48, !72, !55, !6}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !41, line: 16, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !58, line: 116, size: 384, elements: !75)
!75 = !{!76, !77, !252, !493, !494, !495, !504, !505, !506, !507, !508, !510}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !58, line: 117, baseType: !48, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !74, file: !58, line: 118, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !80, line: 22, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 16, size: 160, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !81, file: !80, line: 17, baseType: !6, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !81, file: !80, line: 18, baseType: !7, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !80, line: 19, baseType: !16, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !81, file: !80, line: 20, baseType: !7, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !81, file: !80, line: 21, baseType: !88, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !41, line: 18, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !91, line: 57, size: 320, elements: !92)
!91 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !{!93, !101, !102, !103, !232, !239, !251}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !90, file: !91, line: 58, baseType: !94, size: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !91, line: 54, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 49, size: 128, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !91, line: 50, baseType: !26, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !95, file: !91, line: 51, baseType: !26, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !91, line: 52, baseType: !88, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !95, file: !91, line: 53, baseType: !7, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !90, file: !91, line: 59, baseType: !16, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !90, file: !91, line: 60, baseType: !88, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !90, file: !91, line: 61, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !41, line: 19, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !31, line: 59, size: 64, elements: !107)
!107 = !{!108, !231}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !106, file: !31, line: 60, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !31, line: 18, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !31, line: 20, size: 352, elements: !112)
!112 = !{!113, !114, !115, !117, !118, !119, !120, !121, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !111, file: !31, line: 21, baseType: !26, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !111, file: !31, line: 22, baseType: !26, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !111, file: !31, line: 23, baseType: !116, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !10, line: 222, baseType: !36)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !111, file: !31, line: 24, baseType: !116, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !111, file: !31, line: 26, baseType: !26, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !111, file: !31, line: 27, baseType: !26, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !31, line: 28, baseType: !30, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !111, file: !31, line: 29, baseType: !122, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !41, line: 23, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !125, line: 16, size: 1216, elements: !126)
!125 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!126 = !{!127, !130, !131, !176, !177, !178, !216, !217}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !124, file: !125, line: 17, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !129, line: 16, baseType: !36)
!129 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !125, line: 18, baseType: !61, size: 64, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !124, file: !125, line: 19, baseType: !132, size: 960, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !129, line: 17, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !134, line: 4, size: 960, elements: !135)
!134 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!135 = !{!136, !138, !139, !141, !142, !144, !145, !147, !149, !151, !152, !153, !154, !155, !156, !159, !160, !162, !163, !169, !170, !171}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !133, file: !134, line: 6, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !10, line: 232, baseType: !11)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !133, file: !134, line: 7, baseType: !137, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !133, file: !134, line: 8, baseType: !140, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !10, line: 227, baseType: !11)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !133, file: !134, line: 9, baseType: !140, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !133, file: !134, line: 10, baseType: !143, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !10, line: 217, baseType: !11)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !133, file: !134, line: 11, baseType: !143, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !133, file: !134, line: 13, baseType: !146, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !10, line: 212, baseType: !11)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !133, file: !134, line: 14, baseType: !148, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !10, line: 304, baseType: !11)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !133, file: !134, line: 15, baseType: !150, size: 32, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !10, line: 309, baseType: !11)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !133, file: !134, line: 16, baseType: !11, size: 32, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !133, file: !134, line: 17, baseType: !137, size: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !133, file: !134, line: 18, baseType: !137, size: 32, offset: 352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !133, file: !134, line: 19, baseType: !116, size: 32, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !133, file: !134, line: 20, baseType: !116, size: 32, offset: 416)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !133, file: !134, line: 21, baseType: !157, size: 32, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !10, line: 237, baseType: !158)
!158 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !133, file: !134, line: 22, baseType: !157, size: 32, offset: 480)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !133, file: !134, line: 23, baseType: !161, size: 32, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !10, line: 242, baseType: !36)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !133, file: !134, line: 24, baseType: !161, size: 32, offset: 544)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !133, file: !134, line: 26, baseType: !164, size: 64, offset: 576)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !10, line: 288, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !164, file: !10, line: 288, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !158)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !164, file: !10, line: 288, baseType: !158, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !133, file: !134, line: 27, baseType: !164, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !133, file: !134, line: 28, baseType: !164, size: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !133, file: !134, line: 29, baseType: !172, size: 192, offset: 768)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 192, elements: !174)
!173 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !124, file: !125, line: 21, baseType: !116, size: 32, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !124, file: !125, line: 22, baseType: !116, size: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !124, file: !125, line: 24, baseType: !179, size: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !41, line: 20, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !182, line: 50, size: 320, elements: !183)
!182 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!183 = !{!184, !185, !197, !201, !202, !207, !208, !213, !214, !215}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !181, file: !182, line: 51, baseType: !7, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !181, file: !182, line: 52, baseType: !186, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !41, line: 21, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !58, line: 89, size: 160, elements: !189)
!189 = !{!190, !191, !192, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !188, file: !58, line: 90, baseType: !128, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !58, line: 91, baseType: !61, size: 64, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !188, file: !58, line: 93, baseType: !193, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !186, !179}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !58, line: 94, baseType: !6, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !181, file: !182, line: 54, baseType: !198, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !199, line: 98, baseType: !200)
!199 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!200 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !181, file: !182, line: 56, baseType: !167, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !181, file: !182, line: 58, baseType: !203, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !182, line: 45, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{!26, !179, !26, !16}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !182, line: 59, baseType: !6, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !181, file: !182, line: 61, baseType: !209, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !182, line: 46, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !179, !7, !26, !16}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !181, file: !182, line: 62, baseType: !6, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !181, file: !182, line: 70, baseType: !48, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !182, line: 72, baseType: !179, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !124, file: !125, line: 37, baseType: !11, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !124, file: !125, line: 38, baseType: !11, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !111, file: !31, line: 30, baseType: !109, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !111, file: !31, line: 34, baseType: !11, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !111, file: !31, line: 40, baseType: !11, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !111, file: !31, line: 43, baseType: !11, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !111, file: !31, line: 45, baseType: !11, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !111, file: !31, line: 46, baseType: !11, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !111, file: !31, line: 47, baseType: !11, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !111, file: !31, line: 48, baseType: !11, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !111, file: !31, line: 49, baseType: !11, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !111, file: !31, line: 50, baseType: !11, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !111, file: !31, line: 52, baseType: !11, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !111, file: !31, line: 53, baseType: !11, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !111, file: !31, line: 55, baseType: !36, size: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !31, line: 61, baseType: !104, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !90, file: !91, line: 62, baseType: !233, size: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !91, line: 41, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !91, line: 43, size: 64, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !91, line: 44, baseType: !233, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !235, file: !91, line: 45, baseType: !6, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !90, file: !91, line: 63, baseType: !240, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !91, line: 32, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !91, line: 34, size: 96, elements: !243)
!243 = !{!244, !249, !250}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !242, file: !91, line: 35, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !91, line: 30, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !6}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !91, line: 36, baseType: !6, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !91, line: 37, baseType: !240, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !90, file: !91, line: 64, baseType: !179, size: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !74, file: !58, line: 120, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !41, line: 17, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !256, line: 38, size: 2496, elements: !257)
!256 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!257 = !{!258, !261, !262, !263, !264, !265, !439, !440, !441, !444, !445, !446, !447, !448, !449, !450, !451, !462, !463, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !255, file: !256, line: 39, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !255, file: !256, line: 40, baseType: !88, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !255, file: !256, line: 42, baseType: !179, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !255, file: !256, line: 43, baseType: !180, size: 320, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !255, file: !256, line: 45, baseType: !7, size: 32, offset: 416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !255, file: !256, line: 47, baseType: !266, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !41, line: 26, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !270, line: 121, size: 896, elements: !271)
!270 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!271 = !{!272, !273, !327, !328, !331, !337, !339, !344, !349, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 122, baseType: !6, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !269, file: !270, line: 123, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !41, line: 24, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !277, line: 30, size: 384, elements: !278)
!277 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !306, !307, !308, !319}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !277, line: 31, baseType: !6, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !276, file: !277, line: 33, baseType: !11, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !276, file: !277, line: 35, baseType: !11, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !276, file: !277, line: 38, baseType: !11, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !276, file: !277, line: 44, baseType: !11, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !276, file: !277, line: 46, baseType: !11, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !276, file: !277, line: 49, baseType: !11, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !276, file: !277, line: 51, baseType: !11, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !276, file: !277, line: 54, baseType: !11, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !276, file: !277, line: 56, baseType: !11, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !276, file: !277, line: 57, baseType: !11, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !276, file: !277, line: 59, baseType: !11, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !276, file: !277, line: 60, baseType: !11, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !276, file: !277, line: 62, baseType: !11, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !276, file: !277, line: 64, baseType: !11, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !276, file: !277, line: 67, baseType: !11, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !276, file: !277, line: 69, baseType: !11, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !276, file: !277, line: 71, baseType: !11, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !276, file: !277, line: 74, baseType: !11, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !276, file: !277, line: 75, baseType: !11, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !276, file: !277, line: 77, baseType: !11, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !276, file: !277, line: 107, baseType: !11, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !276, file: !277, line: 110, baseType: !302, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !41, line: 31, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !274}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !276, file: !277, line: 117, baseType: !7, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !276, file: !277, line: 119, baseType: !179, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !276, file: !277, line: 121, baseType: !309, size: 160, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !15, line: 20, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !15, line: 22, size: 160, elements: !311)
!311 = !{!312, !313, !315, !316, !317, !318}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !310, file: !15, line: 23, baseType: !14, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !310, file: !15, line: 24, baseType: !314, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !310, file: !15, line: 25, baseType: !314, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !310, file: !15, line: 26, baseType: !314, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !310, file: !15, line: 27, baseType: !27, size: 8, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !15, line: 28, baseType: !27, size: 8, offset: 136)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !276, file: !277, line: 124, baseType: !320, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !321, line: 16, baseType: !322)
!321 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !321, line: 18, size: 64, elements: !323)
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !322, file: !321, line: 19, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !321, line: 20, baseType: !325, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !269, file: !270, line: 124, baseType: !274, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !269, file: !270, line: 126, baseType: !329, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !330, line: 17, baseType: !36)
!330 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !269, file: !270, line: 128, baseType: !332, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !333, line: 19, baseType: !334)
!333 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{!35, !267, !26, !16}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !269, file: !270, line: 129, baseType: !338, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !333, line: 22, baseType: !334)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !269, file: !270, line: 130, baseType: !340, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !333, line: 20, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!35, !267, !104, !116}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !269, file: !270, line: 131, baseType: !345, size: 32, offset: 224)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !333, line: 23, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DISubroutineType(types: !348)
!348 = !{!104, !267, !104, !116}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !269, file: !270, line: 133, baseType: !350, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !270, line: 16, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !270, line: 18, size: 960, elements: !353)
!353 = !{!354, !355, !367, !369, !370, !371, !372, !373, !374, !375, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !352, file: !270, line: 19, baseType: !329, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !352, file: !270, line: 21, baseType: !356, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !358, line: 297, size: 128, elements: !359)
!358 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!359 = !{!360, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !357, file: !358, line: 298, baseType: !361, size: 16)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !10, line: 409, baseType: !362)
!362 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !357, file: !358, line: 299, baseType: !364, size: 112, offset: 16)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 112, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 14)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !352, file: !270, line: 22, baseType: !368, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !10, line: 404, baseType: !11)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !352, file: !270, line: 23, baseType: !16, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !352, file: !270, line: 24, baseType: !61, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !270, line: 26, baseType: !36, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !352, file: !270, line: 28, baseType: !36, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !352, file: !270, line: 29, baseType: !36, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !352, file: !270, line: 30, baseType: !36, size: 32, offset: 288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !352, file: !270, line: 38, baseType: !376, size: 32, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !41, line: 32, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !267}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !352, file: !270, line: 40, baseType: !6, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !352, file: !270, line: 42, baseType: !180, size: 320, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !352, file: !270, line: 43, baseType: !179, size: 32, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !352, file: !270, line: 45, baseType: !16, size: 32, offset: 736)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !352, file: !270, line: 47, baseType: !16, size: 32, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !352, file: !270, line: 49, baseType: !12, size: 32, offset: 800)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !352, file: !270, line: 51, baseType: !350, size: 32, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !352, file: !270, line: 52, baseType: !267, size: 32, offset: 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !352, file: !270, line: 54, baseType: !7, size: 32, offset: 896)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !352, file: !270, line: 56, baseType: !11, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !352, file: !270, line: 57, baseType: !11, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !352, file: !270, line: 58, baseType: !11, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !352, file: !270, line: 60, baseType: !11, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !352, file: !270, line: 61, baseType: !11, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !352, file: !270, line: 62, baseType: !11, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !352, file: !270, line: 63, baseType: !11, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !352, file: !270, line: 64, baseType: !11, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !352, file: !270, line: 65, baseType: !11, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !352, file: !270, line: 66, baseType: !11, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !352, file: !270, line: 67, baseType: !11, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !352, file: !270, line: 70, baseType: !11, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !352, file: !270, line: 72, baseType: !11, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !352, file: !270, line: 73, baseType: !11, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !352, file: !270, line: 74, baseType: !11, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !352, file: !270, line: 76, baseType: !11, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !352, file: !270, line: 77, baseType: !11, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !352, file: !270, line: 78, baseType: !11, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !269, file: !270, line: 135, baseType: !116, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !269, file: !270, line: 137, baseType: !179, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !269, file: !270, line: 139, baseType: !88, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !270, line: 141, baseType: !36, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !269, file: !270, line: 143, baseType: !356, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !269, file: !270, line: 144, baseType: !368, size: 32, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !269, file: !270, line: 145, baseType: !61, size: 64, offset: 480)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !269, file: !270, line: 147, baseType: !61, size: 64, offset: 544)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !269, file: !270, line: 148, baseType: !416, size: 16, offset: 608)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !417, line: 12, baseType: !418)
!417 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 186, baseType: !362)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !269, file: !270, line: 154, baseType: !356, size: 32, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !269, file: !270, line: 155, baseType: !368, size: 32, offset: 672)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !269, file: !270, line: 157, baseType: !109, size: 32, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !270, line: 159, baseType: !320, size: 64, offset: 736)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !269, file: !270, line: 161, baseType: !198, size: 32, offset: 800)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !269, file: !270, line: 163, baseType: !7, size: 32, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !269, file: !270, line: 165, baseType: !11, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !269, file: !270, line: 167, baseType: !11, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !269, file: !270, line: 169, baseType: !11, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !269, file: !270, line: 170, baseType: !11, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !269, file: !270, line: 171, baseType: !11, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !269, file: !270, line: 173, baseType: !11, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !269, file: !270, line: 174, baseType: !11, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !269, file: !270, line: 175, baseType: !11, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !269, file: !270, line: 176, baseType: !11, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !269, file: !270, line: 178, baseType: !11, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !269, file: !270, line: 179, baseType: !11, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !269, file: !270, line: 180, baseType: !11, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !269, file: !270, line: 181, baseType: !11, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !269, file: !270, line: 183, baseType: !11, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !255, file: !256, line: 48, baseType: !267, size: 32, offset: 480)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !255, file: !256, line: 49, baseType: !7, size: 32, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !255, file: !256, line: 51, baseType: !442, size: 32, offset: 544)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !255, file: !256, line: 52, baseType: !7, size: 32, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !255, file: !256, line: 53, baseType: !7, size: 32, offset: 608)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !255, file: !256, line: 55, baseType: !320, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !255, file: !256, line: 56, baseType: !7, size: 32, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !255, file: !256, line: 58, baseType: !79, size: 160, offset: 736)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !255, file: !256, line: 59, baseType: !79, size: 160, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !255, file: !256, line: 61, baseType: !79, size: 160, offset: 1056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !255, file: !256, line: 62, baseType: !452, size: 96, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !15, line: 32, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !15, line: 37, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !453, file: !15, line: 38, baseType: !314, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !453, file: !15, line: 39, baseType: !314, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !453, file: !15, line: 40, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !15, line: 34, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !314, !314, !314}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !255, file: !256, line: 63, baseType: !309, size: 160, offset: 1312)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !255, file: !256, line: 65, baseType: !464, size: 224, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !465, line: 31, baseType: !466)
!465 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 25, size: 224, elements: !467)
!467 = !{!468, !476, !477, !478, !479}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !466, file: !465, line: 26, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !465, line: 16, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !465, line: 18, size: 96, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !471, file: !465, line: 19, baseType: !6, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !471, file: !465, line: 20, baseType: !7, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !465, line: 21, baseType: !469, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !466, file: !465, line: 27, baseType: !470, size: 96, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !465, line: 28, baseType: !16, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !466, file: !465, line: 29, baseType: !7, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !466, file: !465, line: 30, baseType: !88, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !255, file: !256, line: 66, baseType: !464, size: 224, offset: 1696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !255, file: !256, line: 68, baseType: !7, size: 32, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !255, file: !256, line: 69, baseType: !7, size: 32, offset: 1952)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !255, file: !256, line: 71, baseType: !267, size: 32, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !255, file: !256, line: 72, baseType: !274, size: 32, offset: 2016)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !255, file: !256, line: 73, baseType: !274, size: 32, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !255, file: !256, line: 75, baseType: !253, size: 32, offset: 2080)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !255, file: !256, line: 77, baseType: !61, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !255, file: !256, line: 78, baseType: !61, size: 64, offset: 2176)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !255, file: !256, line: 79, baseType: !61, size: 64, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !255, file: !256, line: 80, baseType: !61, size: 64, offset: 2304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !255, file: !256, line: 81, baseType: !61, size: 64, offset: 2368)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !255, file: !256, line: 82, baseType: !61, size: 64, offset: 2432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !74, file: !58, line: 121, baseType: !88, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !74, file: !58, line: 122, baseType: !88, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !74, file: !58, line: 123, baseType: !496, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !58, line: 103, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 98, size: 1344, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !498, file: !58, line: 99, baseType: !123, size: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !498, file: !58, line: 100, baseType: !109, size: 32, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !498, file: !58, line: 101, baseType: !109, size: 32, offset: 1248)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !498, file: !58, line: 102, baseType: !7, size: 32, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !74, file: !58, line: 124, baseType: !179, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !74, file: !58, line: 126, baseType: !6, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !74, file: !58, line: 127, baseType: !7, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !74, file: !58, line: 128, baseType: !7, size: 32, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !74, file: !58, line: 130, baseType: !509, size: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !58, line: 112, baseType: !69)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !74, file: !58, line: 131, baseType: !48, size: 32, offset: 352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !57, file: !58, line: 81, baseType: !7, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !57, file: !58, line: 82, baseType: !7, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !57, file: !58, line: 83, baseType: !6, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !43, line: 236, baseType: !7, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !42, file: !43, line: 238, baseType: !516, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !179}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !8, line: 78, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 140, baseType: !36)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !42, file: !43, line: 240, baseType: !522, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{!519, !253}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !42, file: !43, line: 242, baseType: !522, size: 32, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !42, file: !43, line: 243, baseType: !522, size: 32, offset: 416)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !42, file: !43, line: 244, baseType: !528, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !253}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !42, file: !43, line: 245, baseType: !528, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !42, file: !43, line: 247, baseType: !528, size: 32, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !42, file: !43, line: 249, baseType: !9, size: 32, offset: 544)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !42, file: !43, line: 250, baseType: !9, size: 32, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !42, file: !43, line: 251, baseType: !9, size: 32, offset: 608)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !42, file: !43, line: 252, baseType: !9, size: 32, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !42, file: !43, line: 253, baseType: !9, size: 32, offset: 672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !42, file: !43, line: 254, baseType: !9, size: 32, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !42, file: !43, line: 255, baseType: !9, size: 32, offset: 736)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !42, file: !43, line: 256, baseType: !9, size: 32, offset: 768)
!541 = !DIGlobalVariableExpression(var: !542)
!542 = distinct !DIGlobalVariable(name: "ngx_http_memcached_commands", scope: !2, file: !3, line: 54, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2464, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 11)
!546 = !DIGlobalVariableExpression(var: !547)
!547 = distinct !DIGlobalVariable(name: "ngx_http_memcached_end", scope: !2, file: !3, line: 165, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 8)
!551 = !DIGlobalVariableExpression(var: !552)
!552 = distinct !DIGlobalVariable(name: "ngx_http_memcached_key", scope: !2, file: !3, line: 161, type: !61, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554)
!554 = distinct !DIGlobalVariable(name: "ngx_http_memcached_next_upstream_masks", scope: !2, file: !3, line: 44, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 576, elements: !561)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_bitmask_t", file: !58, line: 168, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 165, size: 96, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !58, line: 166, baseType: !61, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !557, file: !58, line: 167, baseType: !7, size: 32, offset: 64)
!561 = !{!562}
!562 = !DISubrange(count: 6)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !19, line: 36, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 24, size: 256, elements: !565)
!565 = !{!566, !570, !571, !575, !579, !580, !584, !585}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !564, file: !19, line: 25, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!519, !72}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !564, file: !19, line: 26, baseType: !567, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !564, file: !19, line: 28, baseType: !572, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{!6, !72}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !564, file: !19, line: 29, baseType: !576, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DISubroutineType(types: !578)
!578 = !{!48, !72, !6}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !564, file: !19, line: 31, baseType: !572, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !564, file: !19, line: 32, baseType: !581, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!48, !72, !6, !6}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !564, file: !19, line: 34, baseType: !572, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !564, file: !19, line: 35, baseType: !581, size: 32, offset: 224)
!586 = !{i32 2, !"Dwarf Version", i32 4}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!589 = distinct !DISubprogram(name: "ngx_http_memcached_create_loc_conf", scope: !3, file: !3, line: 580, type: !573, isLocal: true, isDefinition: true, scopeLine: 581, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !590)
!590 = !{!591, !592}
!591 = !DILocalVariable(name: "cf", arg: 1, scope: !589, file: !3, line: 580, type: !72)
!592 = !DILocalVariable(name: "conf", scope: !589, file: !3, line: 582, type: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_memcached_loc_conf_t", file: !3, line: 17, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 1824, elements: !596)
!596 = !{!597, !1828, !1829}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !595, file: !3, line: 14, baseType: !598, size: 1760)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_conf_t", file: !599, line: 238, baseType: !600)
!599 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 147, size: 1760, elements: !601)
!601 = !{!602, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !600, file: !599, line: 148, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_srv_conf_t", file: !599, line: 77, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_srv_conf_s", file: !599, line: 119, size: 416, elements: !606)
!606 = !{!607, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !605, file: !599, line: 120, baseType: !608, size: 96)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_peer_t", file: !599, line: 89, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 85, size: 96, elements: !610)
!610 = !{!611, !616, !1758}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init_upstream", scope: !609, file: !599, line: 86, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_pt", file: !599, line: 79, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{!519, !72, !603}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !609, file: !599, line: 87, baseType: !617, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_init_peer_pt", file: !599, line: 81, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DISubroutineType(types: !620)
!620 = !{!519, !621, !603}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !623, line: 16, baseType: !624)
!623 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !625, line: 364, size: 5376, elements: !626)
!625 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!626 = !{!627, !629, !630, !631, !632, !633, !634, !639, !640, !853, !1291, !1292, !1293, !1294, !1333, !1363, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1408, !1419, !1426, !1427, !1429, !1430, !1443, !1444, !1445, !1446, !1447, !1448, !1654, !1658, !1663, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !624, file: !625, line: 365, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 191, baseType: !11)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !624, file: !625, line: 367, baseType: !267, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !624, file: !625, line: 369, baseType: !23, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !624, file: !625, line: 370, baseType: !23, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !624, file: !625, line: 371, baseType: !23, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !624, file: !625, line: 372, baseType: !23, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !624, file: !625, line: 374, baseType: !635, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !625, line: 361, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !621}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !624, file: !625, line: 375, baseType: !635, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !624, file: !625, line: 378, baseType: !641, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !623, line: 18, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !644, line: 65, size: 3008, elements: !645)
!644 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!645 = !{!646, !647, !648, !649, !653, !654, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !811, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !643, file: !644, line: 66, baseType: !123, size: 1216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !643, file: !644, line: 67, baseType: !79, size: 160, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !643, file: !644, line: 68, baseType: !628, size: 32, offset: 1376)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !643, file: !644, line: 69, baseType: !650, size: 128, offset: 1408)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !643, file: !644, line: 70, baseType: !650, size: 128, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !643, file: !644, line: 72, baseType: !655, size: 32, offset: 1664)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !129, line: 18, baseType: !140)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !643, file: !644, line: 73, baseType: !167, size: 32, offset: 1696)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !643, file: !644, line: 74, baseType: !167, size: 32, offset: 1728)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !643, file: !644, line: 75, baseType: !167, size: 32, offset: 1760)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !643, file: !644, line: 76, baseType: !167, size: 32, offset: 1792)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !643, file: !644, line: 77, baseType: !167, size: 32, offset: 1824)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !643, file: !644, line: 79, baseType: !61, size: 64, offset: 1856)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !643, file: !644, line: 80, baseType: !61, size: 64, offset: 1920)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !643, file: !644, line: 81, baseType: !650, size: 128, offset: 1984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !643, file: !644, line: 83, baseType: !16, size: 32, offset: 2112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !643, file: !644, line: 84, baseType: !16, size: 32, offset: 2144)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !643, file: !644, line: 85, baseType: !116, size: 32, offset: 2176)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !643, file: !644, line: 86, baseType: !116, size: 32, offset: 2208)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !643, file: !644, line: 88, baseType: !7, size: 32, offset: 2240)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !643, file: !644, line: 89, baseType: !7, size: 32, offset: 2272)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !643, file: !644, line: 90, baseType: !7, size: 32, offset: 2304)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !643, file: !644, line: 91, baseType: !7, size: 32, offset: 2336)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !643, file: !644, line: 93, baseType: !109, size: 32, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !643, file: !644, line: 95, baseType: !674, size: 32, offset: 2400)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !623, line: 19, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !644, line: 157, size: 544, elements: !677)
!677 = !{!678, !693, !754, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !810}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !676, file: !644, line: 158, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !644, line: 154, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 145, size: 480, elements: !682)
!682 = !{!683, !684, !685, !686, !689, !690, !691, !692}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !681, file: !644, line: 146, baseType: !452, size: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !681, file: !644, line: 147, baseType: !309, size: 160, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !681, file: !644, line: 148, baseType: !320, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !681, file: !644, line: 149, baseType: !687, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !199, line: 106, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !198)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !681, file: !644, line: 150, baseType: !687, size: 32, offset: 352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !681, file: !644, line: 151, baseType: !116, size: 32, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !681, file: !644, line: 152, baseType: !7, size: 32, offset: 416)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !681, file: !644, line: 153, baseType: !7, size: 32, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !676, file: !644, line: 159, baseType: !694, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !696, line: 59, baseType: !697)
!696 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 34, size: 800, elements: !698)
!698 = !{!699, !706, !707, !708, !716, !717, !718, !727, !728, !729, !730, !749, !750, !751, !752, !753}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !697, file: !696, line: 35, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !701, line: 21, baseType: !702)
!701 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 16, size: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !702, file: !701, line: 17, baseType: !687, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !702, file: !701, line: 19, baseType: !687, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !697, file: !696, line: 37, baseType: !16, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !697, file: !696, line: 38, baseType: !16, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !697, file: !696, line: 40, baseType: !709, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !696, line: 16, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !696, line: 18, size: 96, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !711, file: !696, line: 19, baseType: !9, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !696, line: 20, baseType: !709, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !711, file: !696, line: 21, baseType: !9, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !697, file: !696, line: 41, baseType: !709, size: 32, offset: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !697, file: !696, line: 42, baseType: !710, size: 96, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !697, file: !696, line: 44, baseType: !719, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !696, line: 31, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 25, size: 128, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !721, file: !696, line: 26, baseType: !7, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !721, file: !696, line: 27, baseType: !7, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !721, file: !696, line: 29, baseType: !7, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !721, file: !696, line: 30, baseType: !7, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !697, file: !696, line: 45, baseType: !7, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !697, file: !696, line: 47, baseType: !26, size: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !697, file: !696, line: 48, baseType: !26, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !697, file: !696, line: 50, baseType: !731, size: 256, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !701, line: 37, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !701, line: 24, size: 256, elements: !733)
!733 = !{!734, !736, !737, !738, !748}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !732, file: !701, line: 26, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !732, file: !701, line: 28, baseType: !735, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !732, file: !701, line: 29, baseType: !7, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !732, file: !701, line: 30, baseType: !739, size: 128, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !740, line: 19, baseType: !741)
!740 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 17, size: 128, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !741, file: !740, line: 18, baseType: !744, size: 128)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 128, elements: !746)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!746 = !{!747}
!747 = !DISubrange(count: 4)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !732, file: !701, line: 36, baseType: !7, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !697, file: !696, line: 52, baseType: !26, size: 32, offset: 672)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !697, file: !696, line: 53, baseType: !27, size: 8, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !697, file: !696, line: 55, baseType: !11, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !696, line: 57, baseType: !6, size: 32, offset: 736)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !697, file: !696, line: 58, baseType: !6, size: 32, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !676, file: !644, line: 161, baseType: !755, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !125, line: 62, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 50, size: 384, elements: !758)
!758 = !{!759, !760, !761, !763, !768, !770, !772, !773, !774}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !125, line: 51, baseType: !61, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !757, file: !125, line: 52, baseType: !16, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !757, file: !125, line: 53, baseType: !762, size: 96, offset: 96)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, elements: !174)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !757, file: !125, line: 55, baseType: !764, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !125, line: 45, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!12, !6}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !757, file: !125, line: 56, baseType: !769, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !125, line: 46, baseType: !765)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !757, file: !125, line: 57, baseType: !771, size: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !125, line: 47, baseType: !246)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !125, line: 58, baseType: !6, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !757, file: !125, line: 60, baseType: !26, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !757, file: !125, line: 61, baseType: !7, size: 32, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !676, file: !644, line: 163, baseType: !116, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !676, file: !644, line: 164, baseType: !16, size: 32, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !676, file: !644, line: 166, baseType: !167, size: 32, offset: 160)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !676, file: !644, line: 168, baseType: !167, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !676, file: !644, line: 170, baseType: !7, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !676, file: !644, line: 171, baseType: !7, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !676, file: !644, line: 172, baseType: !12, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !676, file: !644, line: 173, baseType: !12, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !676, file: !644, line: 174, baseType: !12, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !676, file: !644, line: 176, baseType: !7, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !676, file: !644, line: 177, baseType: !12, size: 32, offset: 416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !676, file: !644, line: 178, baseType: !12, size: 32, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !676, file: !644, line: 180, baseType: !788, size: 32, offset: 480)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !256, line: 25, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !256, line: 29, size: 320, elements: !791)
!791 = !{!792, !793, !803, !808, !809}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !790, file: !256, line: 30, baseType: !6, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !790, file: !256, line: 31, baseType: !794, size: 192, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !795, line: 22, baseType: !796)
!795 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 16, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !796, file: !795, line: 17, baseType: !26, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !795, line: 18, baseType: !16, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !795, line: 19, baseType: !61, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !796, file: !795, line: 20, baseType: !179, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !796, file: !795, line: 21, baseType: !7, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !790, file: !256, line: 32, baseType: !804, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !256, line: 27, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!519, !788, !6}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !790, file: !256, line: 33, baseType: !6, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !790, file: !256, line: 34, baseType: !7, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !676, file: !644, line: 182, baseType: !7, size: 32, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !644, line: 96, baseType: !812, size: 32, offset: 2432)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !644, line: 62, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 39, size: 576, elements: !815)
!815 = !{!816, !817, !818, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !814, file: !644, line: 40, baseType: !309, size: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !814, file: !644, line: 41, baseType: !320, size: 64, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !814, file: !644, line: 43, baseType: !819, size: 96, offset: 224)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 12)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !814, file: !644, line: 46, baseType: !11, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !814, file: !644, line: 47, baseType: !11, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !814, file: !644, line: 48, baseType: !11, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !814, file: !644, line: 49, baseType: !11, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !814, file: !644, line: 50, baseType: !11, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !814, file: !644, line: 51, baseType: !11, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !814, file: !644, line: 52, baseType: !11, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !814, file: !644, line: 53, baseType: !11, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !814, file: !644, line: 56, baseType: !655, size: 32, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !814, file: !644, line: 57, baseType: !167, size: 32, offset: 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !814, file: !644, line: 58, baseType: !167, size: 32, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !814, file: !644, line: 59, baseType: !16, size: 32, offset: 480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !814, file: !644, line: 60, baseType: !116, size: 32, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !814, file: !644, line: 61, baseType: !12, size: 32, offset: 544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !643, file: !644, line: 102, baseType: !12, size: 32, offset: 2464)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !643, file: !644, line: 103, baseType: !12, size: 32, offset: 2496)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !643, file: !644, line: 104, baseType: !12, size: 32, offset: 2528)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !643, file: !644, line: 105, baseType: !12, size: 32, offset: 2560)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !643, file: !644, line: 107, baseType: !275, size: 384, offset: 2592)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !643, file: !644, line: 109, baseType: !11, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !643, file: !644, line: 110, baseType: !11, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !643, file: !644, line: 112, baseType: !11, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !643, file: !644, line: 113, baseType: !11, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !643, file: !644, line: 114, baseType: !11, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !643, file: !644, line: 115, baseType: !11, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !643, file: !644, line: 116, baseType: !11, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !643, file: !644, line: 117, baseType: !11, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !643, file: !644, line: 118, baseType: !11, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !643, file: !644, line: 119, baseType: !11, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !643, file: !644, line: 121, baseType: !11, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !643, file: !644, line: 122, baseType: !11, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !624, file: !625, line: 381, baseType: !854, size: 32, offset: 288)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !623, line: 17, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !599, line: 313, size: 4096, elements: !857)
!857 = !{!858, !863, !864, !905, !984, !985, !1007, !1016, !1018, !1019, !1020, !1059, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1236, !1240, !1241, !1245, !1246, !1247, !1248, !1249, !1253, !1257, !1261, !1262, !1274, !1275, !1276, !1277, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !856, file: !599, line: 314, baseType: !859, size: 32)
