; ModuleID = 'src/http/modules/ngx_http_fastcgi_module.c'
source_filename = "src/http/modules/ngx_http_fastcgi_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_fastcgi_module_ctx", scope: !2, file: !3, line: 570, type: !1913, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !1822)
!3 = !DIFile(filename: "src/http/modules/ngx_http_fastcgi_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 56, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "ngx_http_fastcgi_st_version", value: 0)
!8 = !DIEnumerator(name: "ngx_http_fastcgi_st_type", value: 1)
!9 = !DIEnumerator(name: "ngx_http_fastcgi_st_request_id_hi", value: 2)
!10 = !DIEnumerator(name: "ngx_http_fastcgi_st_request_id_lo", value: 3)
!11 = !DIEnumerator(name: "ngx_http_fastcgi_st_content_length_hi", value: 4)
!12 = !DIEnumerator(name: "ngx_http_fastcgi_st_content_length_lo", value: 5)
!13 = !DIEnumerator(name: "ngx_http_fastcgi_st_padding_length", value: 6)
!14 = !DIEnumerator(name: "ngx_http_fastcgi_st_reserved", value: 7)
!15 = !DIEnumerator(name: "ngx_http_fastcgi_st_data", value: 8)
!16 = !DIEnumerator(name: "ngx_http_fastcgi_st_padding", value: 9)
!17 = !{!18, !19, !23, !28, !32, !33, !42, !44, !45, !1805, !20, !1817, !51, !181, !233, !902, !1818, !25}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !21, line: 64, baseType: !22)
!21 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !24, line: 79, baseType: !25)
!24 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 125, baseType: !27)
!26 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !29, line: 16, baseType: !30)
!29 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !31, line: 16, baseType: !23)
!31 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 120, baseType: !27)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !35, line: 21, baseType: !36)
!35 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 17, size: 96, elements: !37)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !36, file: !35, line: 18, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !36, file: !35, line: 19, baseType: !39, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !36, file: !35, line: 20, baseType: !39, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !43, line: 16, baseType: !18)
!43 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !47, line: 86, baseType: !48)
!47 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DISubroutineType(types: !50)
!50 = !{!32, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !47, line: 36, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 17, size: 352, elements: !54)
!54 = !{!55, !56, !57, !71, !77, !78, !79, !80, !81, !82, !83, !84, !88}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !53, file: !47, line: 18, baseType: !19, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !53, file: !47, line: 19, baseType: !19, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !53, file: !47, line: 20, baseType: !58, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !60, line: 17, baseType: !61)
!60 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !62, line: 37, baseType: !63)
!62 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 28, size: 64, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !62, line: 29, baseType: !27, size: 28, flags: DIFlagBitField, extraData: i64 0)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !63, file: !62, line: 31, baseType: !27, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !63, file: !62, line: 32, baseType: !27, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !63, file: !62, line: 33, baseType: !27, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !63, file: !62, line: 34, baseType: !27, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !62, line: 36, baseType: !19, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !53, file: !47, line: 22, baseType: !72, size: 64, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !62, line: 19, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 16, size: 64, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, file: !62, line: 17, baseType: !32, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !62, line: 18, baseType: !19, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !53, file: !47, line: 23, baseType: !72, size: 64, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !53, file: !47, line: 26, baseType: !19, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !53, file: !47, line: 28, baseType: !27, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !53, file: !47, line: 29, baseType: !27, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !53, file: !47, line: 30, baseType: !27, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !53, file: !47, line: 31, baseType: !27, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !53, file: !47, line: 32, baseType: !27, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !53, file: !47, line: 34, baseType: !85, size: 32, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !24, line: 78, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !26, line: 140, baseType: !87)
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !53, file: !47, line: 35, baseType: !89, size: 32, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !91, line: 16, baseType: !92)
!91 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !93, line: 364, size: 5376, elements: !94)
!93 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!94 = !{!95, !97, !439, !440, !441, !442, !443, !448, !449, !682, !1377, !1378, !1379, !1380, !1419, !1449, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1494, !1505, !1512, !1513, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1701, !1705, !1710, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !92, file: !93, line: 365, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 191, baseType: !27)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !92, file: !93, line: 367, baseType: !98, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !100, line: 26, baseType: !101)
!100 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !102, line: 121, size: 896, elements: !103)
!102 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!103 = !{!104, !105, !203, !204, !207, !214, !216, !308, !313, !371, !372, !373, !410, !411, !412, !413, !414, !415, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !102, line: 122, baseType: !18, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !101, file: !102, line: 123, baseType: !106, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !100, line: 24, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !109, line: 30, size: 384, elements: !110)
!109 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !138, !139, !184, !195}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 31, baseType: !18, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !108, file: !109, line: 33, baseType: !27, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !108, file: !109, line: 35, baseType: !27, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !108, file: !109, line: 38, baseType: !27, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !108, file: !109, line: 44, baseType: !27, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !108, file: !109, line: 46, baseType: !27, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !108, file: !109, line: 49, baseType: !27, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !108, file: !109, line: 51, baseType: !27, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !108, file: !109, line: 54, baseType: !27, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !108, file: !109, line: 56, baseType: !27, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !108, file: !109, line: 57, baseType: !27, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !108, file: !109, line: 59, baseType: !27, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !108, file: !109, line: 60, baseType: !27, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !108, file: !109, line: 62, baseType: !27, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !108, file: !109, line: 64, baseType: !27, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !108, file: !109, line: 67, baseType: !27, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !108, file: !109, line: 69, baseType: !27, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !108, file: !109, line: 71, baseType: !27, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !108, file: !109, line: 74, baseType: !27, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !108, file: !109, line: 75, baseType: !27, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !108, file: !109, line: 77, baseType: !27, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !108, file: !109, line: 107, baseType: !27, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !108, file: !109, line: 110, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !100, line: 31, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !106}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !108, file: !109, line: 117, baseType: !23, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !108, file: !109, line: 119, baseType: !140, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !100, line: 20, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !143, line: 50, size: 320, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !146, !161, !165, !168, !173, !174, !179, !180, !183}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !142, file: !143, line: 51, baseType: !23, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !142, file: !143, line: 52, baseType: !147, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !100, line: 21, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !150, line: 89, size: 160, elements: !151)
!150 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!151 = !{!152, !155, !156, !160}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !149, file: !150, line: 90, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !154, line: 16, baseType: !87)
!154 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !150, line: 91, baseType: !72, size: 64, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !149, file: !150, line: 93, baseType: !157, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !147, !140}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !150, line: 94, baseType: !18, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !142, file: !143, line: 54, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !163, line: 98, baseType: !164)
!163 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!164 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !142, file: !143, line: 56, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !26, line: 75, baseType: !167)
!167 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !142, file: !143, line: 58, baseType: !169, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !143, line: 45, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{!19, !140, !19, !32}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !143, line: 59, baseType: !18, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !142, file: !143, line: 61, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !143, line: 46, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !140, !23, !19, !32}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !142, file: !143, line: 62, baseType: !18, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !142, file: !143, line: 70, baseType: !181, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !143, line: 72, baseType: !140, size: 32, offset: 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !108, file: !109, line: 121, baseType: !185, size: 160, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !31, line: 20, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !31, line: 22, size: 160, elements: !187)
!187 = !{!188, !189, !191, !192, !193, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !186, file: !31, line: 23, baseType: !30, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !186, file: !31, line: 24, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !186, file: !31, line: 25, baseType: !190, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !31, line: 26, baseType: !190, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !186, file: !31, line: 27, baseType: !20, size: 8, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !31, line: 28, baseType: !20, size: 8, offset: 136)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !108, file: !109, line: 124, baseType: !196, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !197, line: 16, baseType: !198)
!197 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !197, line: 18, size: 64, elements: !199)
!199 = !{!200, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !197, line: 19, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !197, line: 20, baseType: !201, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !101, file: !102, line: 124, baseType: !106, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !101, file: !102, line: 126, baseType: !205, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !206, line: 17, baseType: !87)
!206 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !101, file: !102, line: 128, baseType: !208, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !209, line: 19, baseType: !210)
!209 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !98, !19, !32}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 135, baseType: !87)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !101, file: !102, line: 129, baseType: !215, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !209, line: 22, baseType: !210)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !101, file: !102, line: 130, baseType: !217, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !209, line: 20, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DISubroutineType(types: !220)
!220 = !{!213, !98, !221, !233}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !100, line: 19, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !43, line: 59, size: 64, elements: !224)
!224 = !{!225, !307}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !43, line: 60, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !43, line: 18, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !43, line: 20, size: 352, elements: !229)
!229 = !{!230, !231, !232, !234, !235, !236, !237, !238, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !228, file: !43, line: 21, baseType: !19, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !228, file: !43, line: 22, baseType: !19, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !228, file: !43, line: 23, baseType: !233, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !26, line: 222, baseType: !87)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !228, file: !43, line: 24, baseType: !233, size: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !228, file: !43, line: 26, baseType: !19, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !228, file: !43, line: 27, baseType: !19, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !228, file: !43, line: 28, baseType: !42, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !228, file: !43, line: 29, baseType: !239, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !100, line: 23, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !242, line: 16, size: 1216, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !245, !246, !289, !290, !291, !292, !293}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !241, file: !242, line: 17, baseType: !153, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !242, line: 18, baseType: !72, size: 64, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !241, file: !242, line: 19, baseType: !247, size: 960, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !154, line: 17, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !249, line: 4, size: 960, elements: !250)
!249 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!250 = !{!251, !253, !254, !256, !257, !259, !260, !262, !264, !266, !267, !268, !269, !270, !271, !273, !274, !276, !277, !282, !283, !284}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !248, file: !249, line: 6, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !26, line: 232, baseType: !27)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !248, file: !249, line: 7, baseType: !252, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !248, file: !249, line: 8, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !26, line: 227, baseType: !27)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !248, file: !249, line: 9, baseType: !255, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !248, file: !249, line: 10, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !26, line: 217, baseType: !27)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !248, file: !249, line: 11, baseType: !258, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !248, file: !249, line: 13, baseType: !261, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !26, line: 212, baseType: !27)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !248, file: !249, line: 14, baseType: !263, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !26, line: 304, baseType: !27)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !248, file: !249, line: 15, baseType: !265, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !26, line: 309, baseType: !27)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !248, file: !249, line: 16, baseType: !27, size: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !248, file: !249, line: 17, baseType: !252, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !248, file: !249, line: 18, baseType: !252, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !248, file: !249, line: 19, baseType: !233, size: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !248, file: !249, line: 20, baseType: !233, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !248, file: !249, line: 21, baseType: !272, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !26, line: 237, baseType: !167)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !248, file: !249, line: 22, baseType: !272, size: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !248, file: !249, line: 23, baseType: !275, size: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !26, line: 242, baseType: !87)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !248, file: !249, line: 24, baseType: !275, size: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !248, file: !249, line: 26, baseType: !278, size: 64, offset: 576)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !26, line: 288, size: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !278, file: !26, line: 288, baseType: !166, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !278, file: !26, line: 288, baseType: !167, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !248, file: !249, line: 27, baseType: !278, size: 64, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !248, file: !249, line: 28, baseType: !278, size: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !248, file: !249, line: 29, baseType: !285, size: 192, offset: 768)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 192, elements: !287)
!286 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!287 = !{!288}
!288 = !DISubrange(count: 3)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !241, file: !242, line: 21, baseType: !233, size: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !241, file: !242, line: 22, baseType: !233, size: 32, offset: 1120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 24, baseType: !140, size: 32, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !241, file: !242, line: 37, baseType: !27, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !241, file: !242, line: 38, baseType: !27, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !228, file: !43, line: 30, baseType: !226, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !228, file: !43, line: 34, baseType: !27, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !228, file: !43, line: 40, baseType: !27, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !228, file: !43, line: 43, baseType: !27, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !228, file: !43, line: 45, baseType: !27, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !228, file: !43, line: 46, baseType: !27, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !228, file: !43, line: 47, baseType: !27, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !228, file: !43, line: 48, baseType: !27, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !228, file: !43, line: 49, baseType: !27, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !228, file: !43, line: 50, baseType: !27, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !228, file: !43, line: 52, baseType: !27, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !228, file: !43, line: 53, baseType: !27, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !228, file: !43, line: 55, baseType: !87, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !43, line: 61, baseType: !221, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !101, file: !102, line: 131, baseType: !309, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !209, line: 23, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{!221, !98, !221, !233}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !101, file: !102, line: 133, baseType: !314, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !102, line: 16, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !102, line: 18, size: 960, elements: !317)
!317 = !{!318, !319, !331, !333, !334, !335, !336, !337, !338, !339, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !316, file: !102, line: 19, baseType: !205, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !316, file: !102, line: 21, baseType: !320, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !322, line: 297, size: 128, elements: !323)
!322 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !{!324, !327}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !321, file: !322, line: 298, baseType: !325, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !26, line: 409, baseType: !326)
!326 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !321, file: !322, line: 299, baseType: !328, size: 112, offset: 16)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 112, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 14)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !316, file: !102, line: 22, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !26, line: 404, baseType: !27)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !316, file: !102, line: 23, baseType: !32, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !316, file: !102, line: 24, baseType: !72, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !102, line: 26, baseType: !87, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !316, file: !102, line: 28, baseType: !87, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !316, file: !102, line: 29, baseType: !87, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !316, file: !102, line: 30, baseType: !87, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !316, file: !102, line: 38, baseType: !340, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !100, line: 32, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !98}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !316, file: !102, line: 40, baseType: !18, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !316, file: !102, line: 42, baseType: !141, size: 320, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !316, file: !102, line: 43, baseType: !140, size: 32, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !316, file: !102, line: 45, baseType: !32, size: 32, offset: 736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !316, file: !102, line: 47, baseType: !32, size: 32, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !316, file: !102, line: 49, baseType: !28, size: 32, offset: 800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !316, file: !102, line: 51, baseType: !314, size: 32, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !316, file: !102, line: 52, baseType: !98, size: 32, offset: 864)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !316, file: !102, line: 54, baseType: !23, size: 32, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !316, file: !102, line: 56, baseType: !27, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !316, file: !102, line: 57, baseType: !27, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !316, file: !102, line: 58, baseType: !27, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !316, file: !102, line: 60, baseType: !27, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !316, file: !102, line: 61, baseType: !27, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !316, file: !102, line: 62, baseType: !27, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !316, file: !102, line: 63, baseType: !27, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !316, file: !102, line: 64, baseType: !27, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !316, file: !102, line: 65, baseType: !27, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !316, file: !102, line: 66, baseType: !27, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !316, file: !102, line: 67, baseType: !27, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !316, file: !102, line: 70, baseType: !27, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !316, file: !102, line: 72, baseType: !27, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !316, file: !102, line: 73, baseType: !27, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !316, file: !102, line: 74, baseType: !27, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !316, file: !102, line: 76, baseType: !27, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !316, file: !102, line: 77, baseType: !27, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !316, file: !102, line: 78, baseType: !27, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !101, file: !102, line: 135, baseType: !233, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !101, file: !102, line: 137, baseType: !140, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !101, file: !102, line: 139, baseType: !374, size: 32, offset: 352)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !100, line: 18, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !377, line: 57, size: 320, elements: !378)
!377 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!378 = !{!379, !387, !388, !389, !390, !397, !409}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !376, file: !377, line: 58, baseType: !380, size: 128)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !377, line: 54, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 49, size: 128, elements: !382)
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !381, file: !377, line: 50, baseType: !19, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !381, file: !377, line: 51, baseType: !19, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !377, line: 52, baseType: !374, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !381, file: !377, line: 53, baseType: !23, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !376, file: !377, line: 59, baseType: !32, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !376, file: !377, line: 60, baseType: !374, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !376, file: !377, line: 61, baseType: !221, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !376, file: !377, line: 62, baseType: !391, size: 32, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !377, line: 41, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !377, line: 43, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !377, line: 44, baseType: !391, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !393, file: !377, line: 45, baseType: !18, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !376, file: !377, line: 63, baseType: !398, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !377, line: 32, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !377, line: 34, size: 96, elements: !401)
!401 = !{!402, !407, !408}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !400, file: !377, line: 35, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !377, line: 30, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !18}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !400, file: !377, line: 36, baseType: !18, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !377, line: 37, baseType: !398, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !376, file: !377, line: 64, baseType: !140, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 141, baseType: !87, size: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !101, file: !102, line: 143, baseType: !320, size: 32, offset: 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !101, file: !102, line: 144, baseType: !332, size: 32, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !101, file: !102, line: 145, baseType: !72, size: 64, offset: 480)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !101, file: !102, line: 147, baseType: !72, size: 64, offset: 544)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !101, file: !102, line: 148, baseType: !416, size: 16, offset: 608)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !417, line: 12, baseType: !418)
!417 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 186, baseType: !326)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !101, file: !102, line: 154, baseType: !320, size: 32, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !101, file: !102, line: 155, baseType: !332, size: 32, offset: 672)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !101, file: !102, line: 157, baseType: !226, size: 32, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !101, file: !102, line: 159, baseType: !196, size: 64, offset: 736)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !101, file: !102, line: 161, baseType: !162, size: 32, offset: 800)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !101, file: !102, line: 163, baseType: !23, size: 32, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !101, file: !102, line: 165, baseType: !27, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !101, file: !102, line: 167, baseType: !27, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !101, file: !102, line: 169, baseType: !27, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !101, file: !102, line: 170, baseType: !27, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !101, file: !102, line: 171, baseType: !27, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !101, file: !102, line: 173, baseType: !27, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !101, file: !102, line: 174, baseType: !27, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !101, file: !102, line: 175, baseType: !27, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !101, file: !102, line: 176, baseType: !27, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !101, file: !102, line: 178, baseType: !27, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !101, file: !102, line: 179, baseType: !27, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !101, file: !102, line: 180, baseType: !27, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !101, file: !102, line: 181, baseType: !27, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !101, file: !102, line: 183, baseType: !27, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !92, file: !93, line: 369, baseType: !39, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !92, file: !93, line: 370, baseType: !39, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !92, file: !93, line: 371, baseType: !39, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !92, file: !93, line: 372, baseType: !39, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !92, file: !93, line: 374, baseType: !444, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !93, line: 361, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !89}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !92, file: !93, line: 375, baseType: !444, size: 32, offset: 224)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !92, file: !93, line: 378, baseType: !450, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !91, line: 18, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !453, line: 65, size: 3008, elements: !454)
!453 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!454 = !{!455, !456, !466, !467, !471, !472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !640, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !452, file: !453, line: 66, baseType: !240, size: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !452, file: !453, line: 67, baseType: !457, size: 160, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !458, line: 22, baseType: !459)
!458 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 16, size: 160, elements: !460)
!460 = !{!461, !462, !463, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !459, file: !458, line: 17, baseType: !18, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !459, file: !458, line: 18, baseType: !23, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !459, file: !458, line: 19, baseType: !32, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !459, file: !458, line: 20, baseType: !23, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !459, file: !458, line: 21, baseType: !374, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !452, file: !453, line: 68, baseType: !96, size: 32, offset: 1376)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !452, file: !453, line: 69, baseType: !468, size: 128, offset: 1408)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 16)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !452, file: !453, line: 70, baseType: !468, size: 128, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !452, file: !453, line: 72, baseType: !473, size: 32, offset: 1664)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !154, line: 18, baseType: !255)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !452, file: !453, line: 73, baseType: !166, size: 32, offset: 1696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !452, file: !453, line: 74, baseType: !166, size: 32, offset: 1728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !452, file: !453, line: 75, baseType: !166, size: 32, offset: 1760)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !452, file: !453, line: 76, baseType: !166, size: 32, offset: 1792)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !452, file: !453, line: 77, baseType: !166, size: 32, offset: 1824)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !452, file: !453, line: 79, baseType: !72, size: 64, offset: 1856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !452, file: !453, line: 80, baseType: !72, size: 64, offset: 1920)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !452, file: !453, line: 81, baseType: !468, size: 128, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !452, file: !453, line: 83, baseType: !32, size: 32, offset: 2112)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !452, file: !453, line: 84, baseType: !32, size: 32, offset: 2144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !452, file: !453, line: 85, baseType: !233, size: 32, offset: 2176)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !452, file: !453, line: 86, baseType: !233, size: 32, offset: 2208)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !452, file: !453, line: 88, baseType: !23, size: 32, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !452, file: !453, line: 89, baseType: !23, size: 32, offset: 2272)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !452, file: !453, line: 90, baseType: !23, size: 32, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !452, file: !453, line: 91, baseType: !23, size: 32, offset: 2336)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !452, file: !453, line: 93, baseType: !226, size: 32, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !452, file: !453, line: 95, baseType: !492, size: 32, offset: 2400)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !91, line: 19, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !453, line: 157, size: 544, elements: !495)
!495 = !{!496, !521, !582, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !639}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !494, file: !453, line: 158, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !453, line: 154, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 145, size: 480, elements: !500)
!500 = !{!501, !512, !513, !514, !517, !518, !519, !520}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !499, file: !453, line: 146, baseType: !502, size: 96)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !31, line: 32, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !31, line: 37, size: 96, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !503, file: !31, line: 38, baseType: !190, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !503, file: !31, line: 39, baseType: !190, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !503, file: !31, line: 40, baseType: !508, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !31, line: 34, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !190, !190, !190}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !499, file: !453, line: 147, baseType: !185, size: 160, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !499, file: !453, line: 148, baseType: !196, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !499, file: !453, line: 149, baseType: !515, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !163, line: 106, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !499, file: !453, line: 150, baseType: !515, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !499, file: !453, line: 151, baseType: !233, size: 32, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !499, file: !453, line: 152, baseType: !23, size: 32, offset: 416)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !499, file: !453, line: 153, baseType: !23, size: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !494, file: !453, line: 159, baseType: !522, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !524, line: 59, baseType: !525)
!524 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 34, size: 800, elements: !526)
!526 = !{!527, !534, !535, !536, !544, !545, !546, !555, !556, !557, !558, !577, !578, !579, !580, !581}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !525, file: !524, line: 35, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !529, line: 21, baseType: !530)
!529 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 16, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !530, file: !529, line: 17, baseType: !515, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !530, file: !529, line: 19, baseType: !515, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !525, file: !524, line: 37, baseType: !32, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !525, file: !524, line: 38, baseType: !32, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !525, file: !524, line: 40, baseType: !537, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !524, line: 16, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !524, line: 18, size: 96, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !539, file: !524, line: 19, baseType: !25, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !524, line: 20, baseType: !537, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !539, file: !524, line: 21, baseType: !25, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !525, file: !524, line: 41, baseType: !537, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !525, file: !524, line: 42, baseType: !538, size: 96, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !525, file: !524, line: 44, baseType: !547, size: 32, offset: 288)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !524, line: 31, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 25, size: 128, elements: !550)
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !549, file: !524, line: 26, baseType: !23, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !549, file: !524, line: 27, baseType: !23, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !549, file: !524, line: 29, baseType: !23, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !549, file: !524, line: 30, baseType: !23, size: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !525, file: !524, line: 45, baseType: !23, size: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !525, file: !524, line: 47, baseType: !19, size: 32, offset: 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !525, file: !524, line: 48, baseType: !19, size: 32, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !525, file: !524, line: 50, baseType: !559, size: 256, offset: 416)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !529, line: 37, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 24, size: 256, elements: !561)
!561 = !{!562, !564, !565, !566, !576}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !560, file: !529, line: 26, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !560, file: !529, line: 28, baseType: !563, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !560, file: !529, line: 29, baseType: !23, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !560, file: !529, line: 30, baseType: !567, size: 128, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !568, line: 19, baseType: !569)
!568 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 17, size: 128, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !569, file: !568, line: 18, baseType: !572, size: 128)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, elements: !574)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !87)
!574 = !{!575}
!575 = !DISubrange(count: 4)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !560, file: !529, line: 36, baseType: !23, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !525, file: !524, line: 52, baseType: !19, size: 32, offset: 672)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !525, file: !524, line: 53, baseType: !20, size: 8, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !525, file: !524, line: 55, baseType: !27, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !524, line: 57, baseType: !18, size: 32, offset: 736)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !525, file: !524, line: 58, baseType: !18, size: 32, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !494, file: !453, line: 161, baseType: !583, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !242, line: 62, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 50, size: 384, elements: !586)
!586 = !{!587, !588, !589, !591, !596, !598, !600, !601, !602}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !242, line: 51, baseType: !72, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !585, file: !242, line: 52, baseType: !32, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !585, file: !242, line: 53, baseType: !590, size: 96, offset: 96)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 96, elements: !287)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !585, file: !242, line: 55, baseType: !592, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !242, line: 45, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{!28, !18}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !585, file: !242, line: 56, baseType: !597, size: 32, offset: 224)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !242, line: 46, baseType: !593)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !585, file: !242, line: 57, baseType: !599, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !242, line: 47, baseType: !404)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !242, line: 58, baseType: !18, size: 32, offset: 288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !585, file: !242, line: 60, baseType: !19, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !585, file: !242, line: 61, baseType: !23, size: 32, offset: 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !494, file: !453, line: 163, baseType: !233, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !494, file: !453, line: 164, baseType: !32, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !494, file: !453, line: 166, baseType: !166, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !494, file: !453, line: 168, baseType: !166, size: 32, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !494, file: !453, line: 170, baseType: !23, size: 32, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !494, file: !453, line: 171, baseType: !23, size: 32, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !494, file: !453, line: 172, baseType: !28, size: 32, offset: 288)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !494, file: !453, line: 173, baseType: !28, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !494, file: !453, line: 174, baseType: !28, size: 32, offset: 352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !494, file: !453, line: 176, baseType: !23, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !494, file: !453, line: 177, baseType: !28, size: 32, offset: 416)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !494, file: !453, line: 178, baseType: !28, size: 32, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !494, file: !453, line: 180, baseType: !616, size: 32, offset: 480)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !618, line: 25, baseType: !619)
!618 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !618, line: 29, size: 320, elements: !620)
!620 = !{!621, !622, !632, !637, !638}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !618, line: 30, baseType: !18, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !619, file: !618, line: 31, baseType: !623, size: 192, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !624, line: 22, baseType: !625)
!624 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 16, size: 192, elements: !626)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !625, file: !624, line: 17, baseType: !19, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !624, line: 18, baseType: !32, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !624, line: 19, baseType: !72, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !625, file: !624, line: 20, baseType: !140, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !625, file: !624, line: 21, baseType: !23, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !619, file: !618, line: 32, baseType: !633, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !618, line: 27, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{!85, !616, !18}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !619, file: !618, line: 33, baseType: !18, size: 32, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !619, file: !618, line: 34, baseType: !23, size: 32, offset: 288)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !494, file: !453, line: 182, baseType: !23, size: 32, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !452, file: !453, line: 96, baseType: !641, size: 32, offset: 2432)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !453, line: 62, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 39, size: 576, elements: !644)
!644 = !{!645, !646, !647, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !453, line: 40, baseType: !185, size: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !643, file: !453, line: 41, baseType: !196, size: 64, offset: 160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !643, file: !453, line: 43, baseType: !648, size: 96, offset: 224)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 12)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !643, file: !453, line: 46, baseType: !27, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !643, file: !453, line: 47, baseType: !27, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !643, file: !453, line: 48, baseType: !27, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !643, file: !453, line: 49, baseType: !27, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !643, file: !453, line: 50, baseType: !27, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !643, file: !453, line: 51, baseType: !27, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !643, file: !453, line: 52, baseType: !27, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !643, file: !453, line: 53, baseType: !27, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !643, file: !453, line: 56, baseType: !473, size: 32, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !643, file: !453, line: 57, baseType: !166, size: 32, offset: 416)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !643, file: !453, line: 58, baseType: !166, size: 32, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !643, file: !453, line: 59, baseType: !32, size: 32, offset: 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !643, file: !453, line: 60, baseType: !233, size: 32, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !643, file: !453, line: 61, baseType: !28, size: 32, offset: 544)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !452, file: !453, line: 102, baseType: !28, size: 32, offset: 2464)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !452, file: !453, line: 103, baseType: !28, size: 32, offset: 2496)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !452, file: !453, line: 104, baseType: !28, size: 32, offset: 2528)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !452, file: !453, line: 105, baseType: !28, size: 32, offset: 2560)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !452, file: !453, line: 107, baseType: !107, size: 384, offset: 2592)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !452, file: !453, line: 109, baseType: !27, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !452, file: !453, line: 110, baseType: !27, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !452, file: !453, line: 112, baseType: !27, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !452, file: !453, line: 113, baseType: !27, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !452, file: !453, line: 114, baseType: !27, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !452, file: !453, line: 115, baseType: !27, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !452, file: !453, line: 116, baseType: !27, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !452, file: !453, line: 117, baseType: !27, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !452, file: !453, line: 118, baseType: !27, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !452, file: !453, line: 119, baseType: !27, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !452, file: !453, line: 121, baseType: !27, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !452, file: !453, line: 122, baseType: !27, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !92, file: !93, line: 381, baseType: !683, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !91, line: 17, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !686, line: 313, size: 4096, elements: !687)
!686 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!687 = !{!688, !693, !694, !735, !814, !815, !837, !846, !1104, !1105, !1106, !1144, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1322, !1326, !1327, !1331, !1332, !1333, !1334, !1335, !1339, !1343, !1347, !1348, !1360, !1361, !1362, !1363, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !685, file: !686, line: 314, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !686, line: 309, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !89, !683}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !685, file: !686, line: 315, baseType: !689, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !685, file: !686, line: 317, baseType: !695, size: 480, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !696, line: 22, baseType: !697)
!696 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !696, line: 36, size: 480, elements: !698)
!698 = !{!699, !700, !701, !702, !704, !705, !706, !712, !717, !719, !720, !729, !730, !731, !732, !733, !734}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !697, file: !696, line: 37, baseType: !98, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !697, file: !696, line: 39, baseType: !320, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !697, file: !696, line: 40, baseType: !332, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !696, line: 41, baseType: !703, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !697, file: !696, line: 43, baseType: !23, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !697, file: !696, line: 44, baseType: !28, size: 32, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !697, file: !696, line: 46, baseType: !707, size: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !696, line: 24, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DISubroutineType(types: !710)
!710 = !{!85, !711, !18}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !697, file: !696, line: 47, baseType: !713, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !696, line: 26, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !711, !18, !23}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !697, file: !696, line: 48, baseType: !718, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !696, line: 28, baseType: !714)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !696, line: 49, baseType: !18, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !697, file: !696, line: 56, baseType: !721, size: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !723, line: 78, baseType: !724)
!723 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !723, line: 74, size: 128, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !724, file: !723, line: 75, baseType: !320, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !724, file: !723, line: 76, baseType: !332, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !723, line: 77, baseType: !72, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !696, line: 58, baseType: !87, size: 32, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !697, file: !696, line: 59, baseType: !87, size: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !697, file: !696, line: 61, baseType: !140, size: 32, offset: 416)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !697, file: !696, line: 63, baseType: !27, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !697, file: !696, line: 64, baseType: !27, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !697, file: !696, line: 67, baseType: !27, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !685, file: !686, line: 319, baseType: !736, size: 32, offset: 544)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !738, line: 17, baseType: !739)
!738 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !738, line: 25, size: 1120, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !747, !748, !749, !750, !751, !756, !757, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !813}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !739, file: !738, line: 26, baseType: !98, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !739, file: !738, line: 27, baseType: !98, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !739, file: !738, line: 29, baseType: !221, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !739, file: !738, line: 30, baseType: !221, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !739, file: !738, line: 31, baseType: !746, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !739, file: !738, line: 33, baseType: !221, size: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !739, file: !738, line: 35, baseType: !221, size: 32, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !739, file: !738, line: 36, baseType: !221, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !739, file: !738, line: 37, baseType: !221, size: 32, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !739, file: !738, line: 44, baseType: !752, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !738, line: 19, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{!85, !736, !226}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !739, file: !738, line: 45, baseType: !18, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !739, file: !738, line: 47, baseType: !758, size: 32, offset: 352)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !738, line: 21, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!85, !18, !221}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !739, file: !738, line: 48, baseType: !18, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !739, file: !738, line: 57, baseType: !27, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !739, file: !738, line: 58, baseType: !27, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !739, file: !738, line: 59, baseType: !27, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !739, file: !738, line: 60, baseType: !27, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !739, file: !738, line: 61, baseType: !27, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !739, file: !738, line: 62, baseType: !27, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !739, file: !738, line: 63, baseType: !27, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !739, file: !738, line: 64, baseType: !27, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !739, file: !738, line: 65, baseType: !27, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !739, file: !738, line: 66, baseType: !27, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !739, file: !738, line: 67, baseType: !27, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !739, file: !738, line: 68, baseType: !27, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !739, file: !738, line: 70, baseType: !85, size: 32, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !739, file: !738, line: 71, baseType: !777, size: 64, offset: 480)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !43, line: 68, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 65, size: 64, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !778, file: !43, line: 66, baseType: !85, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !778, file: !43, line: 67, baseType: !32, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !739, file: !738, line: 72, baseType: !42, size: 32, offset: 544)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !739, file: !738, line: 74, baseType: !213, size: 32, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !739, file: !738, line: 76, baseType: !233, size: 32, offset: 608)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !739, file: !738, line: 77, baseType: !233, size: 32, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !739, file: !738, line: 79, baseType: !233, size: 32, offset: 672)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !739, file: !738, line: 80, baseType: !213, size: 32, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !739, file: !738, line: 82, baseType: !28, size: 32, offset: 736)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !739, file: !738, line: 83, baseType: !28, size: 32, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !739, file: !738, line: 84, baseType: !213, size: 32, offset: 800)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !739, file: !738, line: 86, baseType: !374, size: 32, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !739, file: !738, line: 87, baseType: !140, size: 32, offset: 864)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !739, file: !738, line: 89, baseType: !221, size: 32, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !739, file: !738, line: 90, baseType: !32, size: 32, offset: 928)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !739, file: !738, line: 91, baseType: !226, size: 32, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !739, file: !738, line: 93, baseType: !32, size: 32, offset: 992)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !739, file: !738, line: 94, baseType: !166, size: 32, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !739, file: !738, line: 96, baseType: !799, size: 32, offset: 1056)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !242, line: 84, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 71, size: 1408, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !801, file: !242, line: 72, baseType: !240, size: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !801, file: !242, line: 73, baseType: !233, size: 32, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !801, file: !242, line: 74, baseType: !583, size: 32, offset: 1248)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !801, file: !242, line: 75, baseType: !374, size: 32, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !801, file: !242, line: 76, baseType: !181, size: 32, offset: 1312)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !801, file: !242, line: 78, baseType: !23, size: 32, offset: 1344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !801, file: !242, line: 80, baseType: !27, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !801, file: !242, line: 81, baseType: !27, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !801, file: !242, line: 82, baseType: !27, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !801, file: !242, line: 83, baseType: !27, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !739, file: !738, line: 98, baseType: !87, size: 32, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !685, file: !686, line: 321, baseType: !221, size: 32, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !685, file: !686, line: 323, baseType: !816, size: 416, offset: 608)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !43, line: 71, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !43, line: 78, size: 416, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !836}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !817, file: !43, line: 79, baseType: !226, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !817, file: !43, line: 80, baseType: !221, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !817, file: !43, line: 81, baseType: !221, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !817, file: !43, line: 82, baseType: !221, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !817, file: !43, line: 84, baseType: !27, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !817, file: !43, line: 85, baseType: !27, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !817, file: !43, line: 86, baseType: !27, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !817, file: !43, line: 87, baseType: !27, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !817, file: !43, line: 88, baseType: !27, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !817, file: !43, line: 89, baseType: !27, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
