; ModuleID = 'src/http/modules/ngx_http_scgi_module.c'
source_filename = "src/http/modules/ngx_http_scgi_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_scgi_module_ctx", scope: !2, file: !3, line: 406, type: !1834, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1798)
!3 = !DIFile(filename: "src/http/modules/ngx_http_scgi_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !12, !16, !17, !21, !30, !32, !34, !35, !1793, !41, !18, !890, !1794, !9}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !8, line: 79, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !13, line: 16, baseType: !14)
!13 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !15, line: 16, baseType: !7)
!15 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 120, baseType: !11)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !19, line: 64, baseType: !20)
!19 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 17, size: 96, elements: !25)
!25 = !{!26, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !24, file: !23, line: 18, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !24, file: !23, line: 19, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !24, file: !23, line: 20, baseType: !27, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !31, line: 16, baseType: !6)
!31 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !10, line: 222, baseType: !33)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_len_code_pt", file: !37, line: 86, baseType: !38)
!37 = !DIFile(filename: "src/http/ngx_http_script.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DISubroutineType(types: !40)
!40 = !{!16, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_script_engine_t", file: !37, line: 36, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 17, size: 352, elements: !44)
!44 = !{!45, !46, !47, !61, !67, !68, !69, !70, !71, !72, !73, !74, !77}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !43, file: !37, line: 18, baseType: !17, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !43, file: !37, line: 19, baseType: !17, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !43, file: !37, line: 20, baseType: !48, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_variable_value_t", file: !50, line: 17, baseType: !51)
!50 = !DIFile(filename: "src/http/ngx_http_variables.h", directory: "/home/sam/Projects/nginx-1.12.2")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !52, line: 37, baseType: !53)
!52 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 28, size: 64, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !53, file: !52, line: 29, baseType: !11, size: 28, flags: DIFlagBitField, extraData: i64 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !53, file: !52, line: 31, baseType: !11, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !53, file: !52, line: 32, baseType: !11, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !53, file: !52, line: 33, baseType: !11, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !53, file: !52, line: 34, baseType: !11, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !52, line: 36, baseType: !17, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !37, line: 22, baseType: !62, size: 64, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !52, line: 19, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 16, size: 64, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !52, line: 17, baseType: !16, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !52, line: 18, baseType: !17, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !43, file: !37, line: 23, baseType: !62, size: 64, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !43, file: !37, line: 26, baseType: !17, size: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flushed", scope: !43, file: !37, line: 28, baseType: !11, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !43, file: !37, line: 29, baseType: !11, size: 1, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !43, file: !37, line: 30, baseType: !11, size: 1, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "is_args", scope: !43, file: !37, line: 31, baseType: !11, size: 1, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !43, file: !37, line: 32, baseType: !11, size: 1, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !43, file: !37, line: 34, baseType: !75, size: 32, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !8, line: 78, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 140, baseType: !33)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !43, file: !37, line: 35, baseType: !78, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !80, line: 16, baseType: !81)
!80 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !82, line: 364, size: 5376, elements: !83)
!82 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !{!84, !86, !427, !428, !429, !430, !431, !436, !437, !670, !1365, !1366, !1367, !1368, !1407, !1437, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1482, !1493, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1689, !1693, !1698, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !81, file: !82, line: 365, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 191, baseType: !11)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !81, file: !82, line: 367, baseType: !87, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !89, line: 26, baseType: !90)
!89 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !91, line: 121, size: 896, elements: !92)
!91 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !{!93, !94, !192, !193, !196, !203, !205, !296, !301, !359, !360, !361, !398, !399, !400, !401, !402, !403, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !91, line: 122, baseType: !6, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !90, file: !91, line: 123, baseType: !95, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !89, line: 24, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !98, line: 30, size: 384, elements: !99)
!98 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !127, !128, !173, !184}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !98, line: 31, baseType: !6, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !97, file: !98, line: 33, baseType: !11, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !97, file: !98, line: 35, baseType: !11, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !97, file: !98, line: 38, baseType: !11, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !97, file: !98, line: 44, baseType: !11, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !97, file: !98, line: 46, baseType: !11, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !97, file: !98, line: 49, baseType: !11, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !97, file: !98, line: 51, baseType: !11, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !97, file: !98, line: 54, baseType: !11, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !97, file: !98, line: 56, baseType: !11, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !97, file: !98, line: 57, baseType: !11, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !97, file: !98, line: 59, baseType: !11, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !97, file: !98, line: 60, baseType: !11, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !97, file: !98, line: 62, baseType: !11, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !97, file: !98, line: 64, baseType: !11, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !97, file: !98, line: 67, baseType: !11, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !97, file: !98, line: 69, baseType: !11, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !97, file: !98, line: 71, baseType: !11, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !97, file: !98, line: 74, baseType: !11, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !97, file: !98, line: 75, baseType: !11, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !97, file: !98, line: 77, baseType: !11, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !97, file: !98, line: 107, baseType: !11, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !97, file: !98, line: 110, baseType: !123, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !89, line: 31, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !95}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !97, file: !98, line: 117, baseType: !7, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !97, file: !98, line: 119, baseType: !129, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !89, line: 20, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !132, line: 50, size: 320, elements: !133)
!132 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !{!134, !135, !150, !154, !157, !162, !163, !168, !169, !172}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !131, file: !132, line: 51, baseType: !7, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !131, file: !132, line: 52, baseType: !136, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !89, line: 21, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !139, line: 89, size: 160, elements: !140)
!139 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!140 = !{!141, !144, !145, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !138, file: !139, line: 90, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !143, line: 16, baseType: !33)
!143 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 91, baseType: !62, size: 64, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !138, file: !139, line: 93, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !136, !129}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !139, line: 94, baseType: !6, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !131, file: !132, line: 54, baseType: !151, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !152, line: 98, baseType: !153)
!152 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!153 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !131, file: !132, line: 56, baseType: !155, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !156)
!156 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !131, file: !132, line: 58, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !132, line: 45, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!17, !129, !17, !16}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !132, line: 59, baseType: !6, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !131, file: !132, line: 61, baseType: !164, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !132, line: 46, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !129, !7, !17, !16}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !131, file: !132, line: 62, baseType: !6, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !131, file: !132, line: 70, baseType: !170, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !132, line: 72, baseType: !129, size: 32, offset: 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !97, file: !98, line: 121, baseType: !174, size: 160, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !15, line: 20, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !15, line: 22, size: 160, elements: !176)
!176 = !{!177, !178, !180, !181, !182, !183}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !175, file: !15, line: 23, baseType: !14, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !175, file: !15, line: 24, baseType: !179, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !175, file: !15, line: 25, baseType: !179, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !175, file: !15, line: 26, baseType: !179, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !175, file: !15, line: 27, baseType: !18, size: 8, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !15, line: 28, baseType: !18, size: 8, offset: 136)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !97, file: !98, line: 124, baseType: !185, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !186, line: 16, baseType: !187)
!186 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !186, line: 18, size: 64, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !186, line: 19, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !186, line: 20, baseType: !190, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !90, file: !91, line: 124, baseType: !95, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !90, file: !91, line: 126, baseType: !194, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !195, line: 17, baseType: !33)
!195 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !90, file: !91, line: 128, baseType: !197, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !198, line: 19, baseType: !199)
!198 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !87, !17, !16}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !10, line: 135, baseType: !33)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !90, file: !91, line: 129, baseType: !204, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !198, line: 22, baseType: !199)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !90, file: !91, line: 130, baseType: !206, size: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !198, line: 20, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{!202, !87, !210, !32}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !89, line: 19, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !31, line: 59, size: 64, elements: !213)
!213 = !{!214, !295}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !212, file: !31, line: 60, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !31, line: 18, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !31, line: 20, size: 352, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !217, file: !31, line: 21, baseType: !17, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !217, file: !31, line: 22, baseType: !17, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !217, file: !31, line: 23, baseType: !32, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !217, file: !31, line: 24, baseType: !32, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !217, file: !31, line: 26, baseType: !17, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !217, file: !31, line: 27, baseType: !17, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !217, file: !31, line: 28, baseType: !30, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !217, file: !31, line: 29, baseType: !227, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !89, line: 23, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !230, line: 16, size: 1216, elements: !231)
!230 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!231 = !{!232, !233, !234, !277, !278, !279, !280, !281}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !229, file: !230, line: 17, baseType: !142, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !230, line: 18, baseType: !62, size: 64, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !229, file: !230, line: 19, baseType: !235, size: 960, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !143, line: 17, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !237, line: 4, size: 960, elements: !238)
!237 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!238 = !{!239, !241, !242, !244, !245, !247, !248, !250, !252, !254, !255, !256, !257, !258, !259, !261, !262, !264, !265, !270, !271, !272}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !236, file: !237, line: 6, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !10, line: 232, baseType: !11)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !236, file: !237, line: 7, baseType: !240, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !236, file: !237, line: 8, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !10, line: 227, baseType: !11)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !236, file: !237, line: 9, baseType: !243, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !236, file: !237, line: 10, baseType: !246, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !10, line: 217, baseType: !11)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !236, file: !237, line: 11, baseType: !246, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !236, file: !237, line: 13, baseType: !249, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !10, line: 212, baseType: !11)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !236, file: !237, line: 14, baseType: !251, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !10, line: 304, baseType: !11)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !236, file: !237, line: 15, baseType: !253, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !10, line: 309, baseType: !11)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !236, file: !237, line: 16, baseType: !11, size: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !236, file: !237, line: 17, baseType: !240, size: 32, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !236, file: !237, line: 18, baseType: !240, size: 32, offset: 352)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !236, file: !237, line: 19, baseType: !32, size: 32, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !236, file: !237, line: 20, baseType: !32, size: 32, offset: 416)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !236, file: !237, line: 21, baseType: !260, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !10, line: 237, baseType: !156)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !236, file: !237, line: 22, baseType: !260, size: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !236, file: !237, line: 23, baseType: !263, size: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !10, line: 242, baseType: !33)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !236, file: !237, line: 24, baseType: !263, size: 32, offset: 544)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !236, file: !237, line: 26, baseType: !266, size: 64, offset: 576)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !10, line: 288, size: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !266, file: !10, line: 288, baseType: !155, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !266, file: !10, line: 288, baseType: !156, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !236, file: !237, line: 27, baseType: !266, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !236, file: !237, line: 28, baseType: !266, size: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !236, file: !237, line: 29, baseType: !273, size: 192, offset: 768)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 192, elements: !275)
!274 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!275 = !{!276}
!276 = !DISubrange(count: 3)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !229, file: !230, line: 21, baseType: !32, size: 32, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !229, file: !230, line: 22, baseType: !32, size: 32, offset: 1120)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !229, file: !230, line: 24, baseType: !129, size: 32, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !229, file: !230, line: 37, baseType: !11, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !229, file: !230, line: 38, baseType: !11, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !217, file: !31, line: 30, baseType: !215, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !217, file: !31, line: 34, baseType: !11, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !217, file: !31, line: 40, baseType: !11, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !217, file: !31, line: 43, baseType: !11, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !217, file: !31, line: 45, baseType: !11, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !217, file: !31, line: 46, baseType: !11, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !217, file: !31, line: 47, baseType: !11, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !217, file: !31, line: 48, baseType: !11, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !217, file: !31, line: 49, baseType: !11, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !217, file: !31, line: 50, baseType: !11, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !217, file: !31, line: 52, baseType: !11, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !217, file: !31, line: 53, baseType: !11, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !217, file: !31, line: 55, baseType: !33, size: 32, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !31, line: 61, baseType: !210, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !90, file: !91, line: 131, baseType: !297, size: 32, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !198, line: 23, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{!210, !87, !210, !32}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !90, file: !91, line: 133, baseType: !302, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !91, line: 16, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !91, line: 18, size: 960, elements: !305)
!305 = !{!306, !307, !319, !321, !322, !323, !324, !325, !326, !327, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !304, file: !91, line: 19, baseType: !194, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !304, file: !91, line: 21, baseType: !308, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !310, line: 297, size: 128, elements: !311)
!310 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!311 = !{!312, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !309, file: !310, line: 298, baseType: !313, size: 16)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !10, line: 409, baseType: !314)
!314 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !309, file: !310, line: 299, baseType: !316, size: 112, offset: 16)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 112, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 14)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !304, file: !91, line: 22, baseType: !320, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !10, line: 404, baseType: !11)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !304, file: !91, line: 23, baseType: !16, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !304, file: !91, line: 24, baseType: !62, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !91, line: 26, baseType: !33, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !304, file: !91, line: 28, baseType: !33, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !304, file: !91, line: 29, baseType: !33, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !304, file: !91, line: 30, baseType: !33, size: 32, offset: 288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !304, file: !91, line: 38, baseType: !328, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !89, line: 32, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !87}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !304, file: !91, line: 40, baseType: !6, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !304, file: !91, line: 42, baseType: !130, size: 320, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !304, file: !91, line: 43, baseType: !129, size: 32, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !304, file: !91, line: 45, baseType: !16, size: 32, offset: 736)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !304, file: !91, line: 47, baseType: !16, size: 32, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !304, file: !91, line: 49, baseType: !12, size: 32, offset: 800)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !304, file: !91, line: 51, baseType: !302, size: 32, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !304, file: !91, line: 52, baseType: !87, size: 32, offset: 864)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !304, file: !91, line: 54, baseType: !7, size: 32, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !304, file: !91, line: 56, baseType: !11, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !304, file: !91, line: 57, baseType: !11, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !304, file: !91, line: 58, baseType: !11, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !304, file: !91, line: 60, baseType: !11, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !304, file: !91, line: 61, baseType: !11, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !304, file: !91, line: 62, baseType: !11, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !304, file: !91, line: 63, baseType: !11, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !304, file: !91, line: 64, baseType: !11, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !304, file: !91, line: 65, baseType: !11, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !304, file: !91, line: 66, baseType: !11, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !304, file: !91, line: 67, baseType: !11, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !304, file: !91, line: 70, baseType: !11, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !304, file: !91, line: 72, baseType: !11, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !304, file: !91, line: 73, baseType: !11, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !304, file: !91, line: 74, baseType: !11, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !304, file: !91, line: 76, baseType: !11, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !304, file: !91, line: 77, baseType: !11, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !304, file: !91, line: 78, baseType: !11, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !90, file: !91, line: 135, baseType: !32, size: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !90, file: !91, line: 137, baseType: !129, size: 32, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !90, file: !91, line: 139, baseType: !362, size: 32, offset: 352)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !89, line: 18, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !365, line: 57, size: 320, elements: !366)
!365 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!366 = !{!367, !375, !376, !377, !378, !385, !397}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !364, file: !365, line: 58, baseType: !368, size: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !365, line: 54, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 49, size: 128, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !369, file: !365, line: 50, baseType: !17, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !369, file: !365, line: 51, baseType: !17, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !365, line: 52, baseType: !362, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !369, file: !365, line: 53, baseType: !7, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !364, file: !365, line: 59, baseType: !16, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !364, file: !365, line: 60, baseType: !362, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !364, file: !365, line: 61, baseType: !210, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !364, file: !365, line: 62, baseType: !379, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !365, line: 41, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !365, line: 43, size: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !365, line: 44, baseType: !379, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !381, file: !365, line: 45, baseType: !6, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !364, file: !365, line: 63, baseType: !386, size: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !365, line: 32, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !365, line: 34, size: 96, elements: !389)
!389 = !{!390, !395, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !388, file: !365, line: 35, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !365, line: 30, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !6}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !365, line: 36, baseType: !6, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !365, line: 37, baseType: !386, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !364, file: !365, line: 64, baseType: !129, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !91, line: 141, baseType: !33, size: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !90, file: !91, line: 143, baseType: !308, size: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !90, file: !91, line: 144, baseType: !320, size: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !90, file: !91, line: 145, baseType: !62, size: 64, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !90, file: !91, line: 147, baseType: !62, size: 64, offset: 544)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !90, file: !91, line: 148, baseType: !404, size: 16, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !405, line: 12, baseType: !406)
!405 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 186, baseType: !314)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !90, file: !91, line: 154, baseType: !308, size: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !90, file: !91, line: 155, baseType: !320, size: 32, offset: 672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !90, file: !91, line: 157, baseType: !215, size: 32, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !90, file: !91, line: 159, baseType: !185, size: 64, offset: 736)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !90, file: !91, line: 161, baseType: !151, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !90, file: !91, line: 163, baseType: !7, size: 32, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !90, file: !91, line: 165, baseType: !11, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !90, file: !91, line: 167, baseType: !11, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !90, file: !91, line: 169, baseType: !11, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !90, file: !91, line: 170, baseType: !11, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !90, file: !91, line: 171, baseType: !11, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !90, file: !91, line: 173, baseType: !11, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !90, file: !91, line: 174, baseType: !11, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !90, file: !91, line: 175, baseType: !11, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !90, file: !91, line: 176, baseType: !11, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !90, file: !91, line: 178, baseType: !11, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !90, file: !91, line: 179, baseType: !11, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !90, file: !91, line: 180, baseType: !11, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !90, file: !91, line: 181, baseType: !11, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !90, file: !91, line: 183, baseType: !11, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !81, file: !82, line: 369, baseType: !27, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !81, file: !82, line: 370, baseType: !27, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !81, file: !82, line: 371, baseType: !27, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !81, file: !82, line: 372, baseType: !27, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !81, file: !82, line: 374, baseType: !432, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !82, line: 361, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !78}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !81, file: !82, line: 375, baseType: !432, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !81, file: !82, line: 378, baseType: !438, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !80, line: 18, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !441, line: 65, size: 3008, elements: !442)
!441 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!442 = !{!443, !444, !454, !455, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !628, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !440, file: !441, line: 66, baseType: !228, size: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !440, file: !441, line: 67, baseType: !445, size: 160, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !446, line: 22, baseType: !447)
!446 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 16, size: 160, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !447, file: !446, line: 17, baseType: !6, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !447, file: !446, line: 18, baseType: !7, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !446, line: 19, baseType: !16, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !447, file: !446, line: 20, baseType: !7, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !447, file: !446, line: 21, baseType: !362, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !440, file: !441, line: 68, baseType: !85, size: 32, offset: 1376)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !440, file: !441, line: 69, baseType: !456, size: 128, offset: 1408)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 16)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !440, file: !441, line: 70, baseType: !456, size: 128, offset: 1536)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !440, file: !441, line: 72, baseType: !461, size: 32, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !143, line: 18, baseType: !243)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !440, file: !441, line: 73, baseType: !155, size: 32, offset: 1696)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !440, file: !441, line: 74, baseType: !155, size: 32, offset: 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !440, file: !441, line: 75, baseType: !155, size: 32, offset: 1760)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !440, file: !441, line: 76, baseType: !155, size: 32, offset: 1792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !440, file: !441, line: 77, baseType: !155, size: 32, offset: 1824)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !440, file: !441, line: 79, baseType: !62, size: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !440, file: !441, line: 80, baseType: !62, size: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !440, file: !441, line: 81, baseType: !456, size: 128, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !440, file: !441, line: 83, baseType: !16, size: 32, offset: 2112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !440, file: !441, line: 84, baseType: !16, size: 32, offset: 2144)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !440, file: !441, line: 85, baseType: !32, size: 32, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !440, file: !441, line: 86, baseType: !32, size: 32, offset: 2208)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !440, file: !441, line: 88, baseType: !7, size: 32, offset: 2240)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !440, file: !441, line: 89, baseType: !7, size: 32, offset: 2272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !440, file: !441, line: 90, baseType: !7, size: 32, offset: 2304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !440, file: !441, line: 91, baseType: !7, size: 32, offset: 2336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !440, file: !441, line: 93, baseType: !215, size: 32, offset: 2368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !440, file: !441, line: 95, baseType: !480, size: 32, offset: 2400)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !80, line: 19, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !441, line: 157, size: 544, elements: !483)
!483 = !{!484, !509, !570, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !627}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !482, file: !441, line: 158, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !441, line: 154, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 145, size: 480, elements: !488)
!488 = !{!489, !500, !501, !502, !505, !506, !507, !508}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !487, file: !441, line: 146, baseType: !490, size: 96)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !15, line: 32, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !15, line: 37, size: 96, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !491, file: !15, line: 38, baseType: !179, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !491, file: !15, line: 39, baseType: !179, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !491, file: !15, line: 40, baseType: !496, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !15, line: 34, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !179, !179, !179}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !487, file: !441, line: 147, baseType: !174, size: 160, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !487, file: !441, line: 148, baseType: !185, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !487, file: !441, line: 149, baseType: !503, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !152, line: 106, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !151)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !487, file: !441, line: 150, baseType: !503, size: 32, offset: 352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !487, file: !441, line: 151, baseType: !32, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !487, file: !441, line: 152, baseType: !7, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !487, file: !441, line: 153, baseType: !7, size: 32, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !482, file: !441, line: 159, baseType: !510, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !512, line: 59, baseType: !513)
!512 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 34, size: 800, elements: !514)
!514 = !{!515, !522, !523, !524, !532, !533, !534, !543, !544, !545, !546, !565, !566, !567, !568, !569}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !513, file: !512, line: 35, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !517, line: 21, baseType: !518)
!517 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 16, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !518, file: !517, line: 17, baseType: !503, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !518, file: !517, line: 19, baseType: !503, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !513, file: !512, line: 37, baseType: !16, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !513, file: !512, line: 38, baseType: !16, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !513, file: !512, line: 40, baseType: !525, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !512, line: 16, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !512, line: 18, size: 96, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !527, file: !512, line: 19, baseType: !9, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !512, line: 20, baseType: !525, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !527, file: !512, line: 21, baseType: !9, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !513, file: !512, line: 41, baseType: !525, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !513, file: !512, line: 42, baseType: !526, size: 96, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !513, file: !512, line: 44, baseType: !535, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !512, line: 31, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 25, size: 128, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !537, file: !512, line: 26, baseType: !7, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !537, file: !512, line: 27, baseType: !7, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !537, file: !512, line: 29, baseType: !7, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !537, file: !512, line: 30, baseType: !7, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !513, file: !512, line: 45, baseType: !7, size: 32, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !513, file: !512, line: 47, baseType: !17, size: 32, offset: 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !513, file: !512, line: 48, baseType: !17, size: 32, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !513, file: !512, line: 50, baseType: !547, size: 256, offset: 416)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !517, line: 37, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 24, size: 256, elements: !549)
!549 = !{!550, !552, !553, !554, !564}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !548, file: !517, line: 26, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !548, file: !517, line: 28, baseType: !551, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !548, file: !517, line: 29, baseType: !7, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !548, file: !517, line: 30, baseType: !555, size: 128, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !556, line: 19, baseType: !557)
!556 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !556, line: 17, size: 128, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !557, file: !556, line: 18, baseType: !560, size: 128)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 128, elements: !562)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!562 = !{!563}
!563 = !DISubrange(count: 4)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !548, file: !517, line: 36, baseType: !7, size: 32, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !513, file: !512, line: 52, baseType: !17, size: 32, offset: 672)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !513, file: !512, line: 53, baseType: !18, size: 8, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !513, file: !512, line: 55, baseType: !11, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !513, file: !512, line: 57, baseType: !6, size: 32, offset: 736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !513, file: !512, line: 58, baseType: !6, size: 32, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !482, file: !441, line: 161, baseType: !571, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !230, line: 62, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 50, size: 384, elements: !574)
!574 = !{!575, !576, !577, !579, !584, !586, !588, !589, !590}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !230, line: 51, baseType: !62, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !573, file: !230, line: 52, baseType: !16, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !573, file: !230, line: 53, baseType: !578, size: 96, offset: 96)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 96, elements: !275)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !573, file: !230, line: 55, baseType: !580, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !230, line: 45, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!12, !6}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !573, file: !230, line: 56, baseType: !585, size: 32, offset: 224)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !230, line: 46, baseType: !581)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !573, file: !230, line: 57, baseType: !587, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !230, line: 47, baseType: !392)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !573, file: !230, line: 58, baseType: !6, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !573, file: !230, line: 60, baseType: !17, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !573, file: !230, line: 61, baseType: !7, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !482, file: !441, line: 163, baseType: !32, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !482, file: !441, line: 164, baseType: !16, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !482, file: !441, line: 166, baseType: !155, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !482, file: !441, line: 168, baseType: !155, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !482, file: !441, line: 170, baseType: !7, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !482, file: !441, line: 171, baseType: !7, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !482, file: !441, line: 172, baseType: !12, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !482, file: !441, line: 173, baseType: !12, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !482, file: !441, line: 174, baseType: !12, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !482, file: !441, line: 176, baseType: !7, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !482, file: !441, line: 177, baseType: !12, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !482, file: !441, line: 178, baseType: !12, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !482, file: !441, line: 180, baseType: !604, size: 32, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !606, line: 25, baseType: !607)
!606 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !606, line: 29, size: 320, elements: !608)
!608 = !{!609, !610, !620, !625, !626}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !606, line: 30, baseType: !6, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !607, file: !606, line: 31, baseType: !611, size: 192, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !612, line: 22, baseType: !613)
!612 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !612, line: 16, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !613, file: !612, line: 17, baseType: !17, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !613, file: !612, line: 18, baseType: !16, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !612, line: 19, baseType: !62, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !613, file: !612, line: 20, baseType: !129, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !613, file: !612, line: 21, baseType: !7, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !607, file: !606, line: 32, baseType: !621, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !606, line: 27, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{!75, !604, !6}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !607, file: !606, line: 33, baseType: !6, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !607, file: !606, line: 34, baseType: !7, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !482, file: !441, line: 182, baseType: !7, size: 32, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !440, file: !441, line: 96, baseType: !629, size: 32, offset: 2432)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !441, line: 62, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 39, size: 576, elements: !632)
!632 = !{!633, !634, !635, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !631, file: !441, line: 40, baseType: !174, size: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !631, file: !441, line: 41, baseType: !185, size: 64, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !631, file: !441, line: 43, baseType: !636, size: 96, offset: 224)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 96, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 12)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !631, file: !441, line: 46, baseType: !11, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !631, file: !441, line: 47, baseType: !11, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !631, file: !441, line: 48, baseType: !11, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !631, file: !441, line: 49, baseType: !11, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !631, file: !441, line: 50, baseType: !11, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !631, file: !441, line: 51, baseType: !11, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !631, file: !441, line: 52, baseType: !11, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !631, file: !441, line: 53, baseType: !11, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !631, file: !441, line: 56, baseType: !461, size: 32, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !631, file: !441, line: 57, baseType: !155, size: 32, offset: 416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !631, file: !441, line: 58, baseType: !155, size: 32, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !631, file: !441, line: 59, baseType: !16, size: 32, offset: 480)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !631, file: !441, line: 60, baseType: !32, size: 32, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !631, file: !441, line: 61, baseType: !12, size: 32, offset: 544)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !440, file: !441, line: 102, baseType: !12, size: 32, offset: 2464)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !440, file: !441, line: 103, baseType: !12, size: 32, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !440, file: !441, line: 104, baseType: !12, size: 32, offset: 2528)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !440, file: !441, line: 105, baseType: !12, size: 32, offset: 2560)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !440, file: !441, line: 107, baseType: !96, size: 384, offset: 2592)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !440, file: !441, line: 109, baseType: !11, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !440, file: !441, line: 110, baseType: !11, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !440, file: !441, line: 112, baseType: !11, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !440, file: !441, line: 113, baseType: !11, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !440, file: !441, line: 114, baseType: !11, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !440, file: !441, line: 115, baseType: !11, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !440, file: !441, line: 116, baseType: !11, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !440, file: !441, line: 117, baseType: !11, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !440, file: !441, line: 118, baseType: !11, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !440, file: !441, line: 119, baseType: !11, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !440, file: !441, line: 121, baseType: !11, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !440, file: !441, line: 122, baseType: !11, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !81, file: !82, line: 381, baseType: !671, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !80, line: 17, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !674, line: 313, size: 4096, elements: !675)
!674 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!675 = !{!676, !681, !682, !723, !802, !803, !825, !834, !1092, !1093, !1094, !1132, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1310, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1327, !1331, !1335, !1336, !1348, !1349, !1350, !1351, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !673, file: !674, line: 314, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !674, line: 309, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !78, !671}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !673, file: !674, line: 315, baseType: !677, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !673, file: !674, line: 317, baseType: !683, size: 480, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !684, line: 22, baseType: !685)
!684 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !684, line: 36, size: 480, elements: !686)
!686 = !{!687, !688, !689, !690, !692, !693, !694, !700, !705, !707, !708, !717, !718, !719, !720, !721, !722}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !685, file: !684, line: 37, baseType: !87, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !685, file: !684, line: 39, baseType: !308, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !685, file: !684, line: 40, baseType: !320, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !684, line: 41, baseType: !691, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !685, file: !684, line: 43, baseType: !7, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !685, file: !684, line: 44, baseType: !12, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !685, file: !684, line: 46, baseType: !695, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !684, line: 24, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!75, !699, !6}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !685, file: !684, line: 47, baseType: !701, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !684, line: 26, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !699, !6, !7}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !685, file: !684, line: 48, baseType: !706, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !684, line: 28, baseType: !702)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !685, file: !684, line: 49, baseType: !6, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !685, file: !684, line: 56, baseType: !709, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !711, line: 78, baseType: !712)
!711 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 74, size: 128, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !712, file: !711, line: 75, baseType: !308, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !712, file: !711, line: 76, baseType: !320, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !711, line: 77, baseType: !62, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !685, file: !684, line: 58, baseType: !33, size: 32, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !685, file: !684, line: 59, baseType: !33, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !685, file: !684, line: 61, baseType: !129, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !685, file: !684, line: 63, baseType: !11, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !685, file: !684, line: 64, baseType: !11, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !685, file: !684, line: 67, baseType: !11, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !673, file: !674, line: 319, baseType: !724, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !726, line: 17, baseType: !727)
!726 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !726, line: 25, size: 1120, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !735, !736, !737, !738, !739, !744, !745, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !801}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !727, file: !726, line: 26, baseType: !87, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !727, file: !726, line: 27, baseType: !87, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !727, file: !726, line: 29, baseType: !210, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !727, file: !726, line: 30, baseType: !210, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !727, file: !726, line: 31, baseType: !734, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !727, file: !726, line: 33, baseType: !210, size: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !727, file: !726, line: 35, baseType: !210, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !727, file: !726, line: 36, baseType: !210, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !727, file: !726, line: 37, baseType: !210, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !727, file: !726, line: 44, baseType: !740, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !726, line: 19, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{!75, !724, !215}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !727, file: !726, line: 45, baseType: !6, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !727, file: !726, line: 47, baseType: !746, size: 32, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !726, line: 21, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{!75, !6, !210}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !727, file: !726, line: 48, baseType: !6, size: 32, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !727, file: !726, line: 57, baseType: !11, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !727, file: !726, line: 58, baseType: !11, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !727, file: !726, line: 59, baseType: !11, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !727, file: !726, line: 60, baseType: !11, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !727, file: !726, line: 61, baseType: !11, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !727, file: !726, line: 62, baseType: !11, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !727, file: !726, line: 63, baseType: !11, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !727, file: !726, line: 64, baseType: !11, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !727, file: !726, line: 65, baseType: !11, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !727, file: !726, line: 66, baseType: !11, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !727, file: !726, line: 67, baseType: !11, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !727, file: !726, line: 68, baseType: !11, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !727, file: !726, line: 70, baseType: !75, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !727, file: !726, line: 71, baseType: !765, size: 64, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !31, line: 68, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 65, size: 64, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !766, file: !31, line: 66, baseType: !75, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !766, file: !31, line: 67, baseType: !16, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !727, file: !726, line: 72, baseType: !30, size: 32, offset: 544)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !727, file: !726, line: 74, baseType: !202, size: 32, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !727, file: !726, line: 76, baseType: !32, size: 32, offset: 608)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !727, file: !726, line: 77, baseType: !32, size: 32, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !727, file: !726, line: 79, baseType: !32, size: 32, offset: 672)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !727, file: !726, line: 80, baseType: !202, size: 32, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !727, file: !726, line: 82, baseType: !12, size: 32, offset: 736)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !727, file: !726, line: 83, baseType: !12, size: 32, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !727, file: !726, line: 84, baseType: !202, size: 32, offset: 800)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !727, file: !726, line: 86, baseType: !362, size: 32, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !727, file: !726, line: 87, baseType: !129, size: 32, offset: 864)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !727, file: !726, line: 89, baseType: !210, size: 32, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !727, file: !726, line: 90, baseType: !16, size: 32, offset: 928)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !727, file: !726, line: 91, baseType: !215, size: 32, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !727, file: !726, line: 93, baseType: !16, size: 32, offset: 992)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !727, file: !726, line: 94, baseType: !155, size: 32, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !727, file: !726, line: 96, baseType: !787, size: 32, offset: 1056)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !230, line: 84, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 71, size: 1408, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !789, file: !230, line: 72, baseType: !228, size: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !789, file: !230, line: 73, baseType: !32, size: 32, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !789, file: !230, line: 74, baseType: !571, size: 32, offset: 1248)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !789, file: !230, line: 75, baseType: !362, size: 32, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !789, file: !230, line: 76, baseType: !170, size: 32, offset: 1312)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !789, file: !230, line: 78, baseType: !7, size: 32, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !789, file: !230, line: 80, baseType: !11, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !789, file: !230, line: 81, baseType: !11, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !789, file: !230, line: 82, baseType: !11, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !789, file: !230, line: 83, baseType: !11, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !727, file: !726, line: 98, baseType: !33, size: 32, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "request_bufs", scope: !673, file: !674, line: 321, baseType: !210, size: 32, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !673, file: !674, line: 323, baseType: !804, size: 416, offset: 608)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !31, line: 71, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !31, line: 78, size: 416, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !824}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !805, file: !31, line: 79, baseType: !215, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !805, file: !31, line: 80, baseType: !210, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !805, file: !31, line: 81, baseType: !210, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !805, file: !31, line: 82, baseType: !210, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !805, file: !31, line: 84, baseType: !11, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !805, file: !31, line: 85, baseType: !11, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !805, file: !31, line: 86, baseType: !11, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !805, file: !31, line: 87, baseType: !11, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !805, file: !31, line: 88, baseType: !11, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !805, file: !31, line: 89, baseType: !11, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !805, file: !31, line: 104, baseType: !32, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !805, file: !31, line: 106, baseType: !362, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !805, file: !31, line: 107, baseType: !75, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !805, file: !31, line: 108, baseType: !765, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !805, file: !31, line: 109, baseType: !30, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !805, file: !31, line: 111, baseType: !823, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !31, line: 73, baseType: !747)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !805, file: !31, line: 112, baseType: !6, size: 32, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !673, file: !674, line: 324, baseType: !826, size: 160, offset: 1024)
