; ModuleID = 'src/http/modules/ngx_http_limit_conn_module.c'
source_filename = "src/http/modules/ngx_http_limit_conn_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_limit_conn_module_ctx", scope: !2, file: !3, line: 109, type: !654, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !123)
!3 = !DIFile(filename: "src/http/modules/ngx_http_limit_conn_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 108, size: 32, elements: !7)
!6 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!8 = !DIEnumerator(name: "NGX_HTTP_POST_READ_PHASE", value: 0)
!9 = !DIEnumerator(name: "NGX_HTTP_SERVER_REWRITE_PHASE", value: 1)
!10 = !DIEnumerator(name: "NGX_HTTP_FIND_CONFIG_PHASE", value: 2)
!11 = !DIEnumerator(name: "NGX_HTTP_REWRITE_PHASE", value: 3)
!12 = !DIEnumerator(name: "NGX_HTTP_POST_REWRITE_PHASE", value: 4)
!13 = !DIEnumerator(name: "NGX_HTTP_PREACCESS_PHASE", value: 5)
!14 = !DIEnumerator(name: "NGX_HTTP_ACCESS_PHASE", value: 6)
!15 = !DIEnumerator(name: "NGX_HTTP_POST_ACCESS_PHASE", value: 7)
!16 = !DIEnumerator(name: "NGX_HTTP_TRY_FILES_PHASE", value: 8)
!17 = !DIEnumerator(name: "NGX_HTTP_CONTENT_PHASE", value: 9)
!18 = !DIEnumerator(name: "NGX_HTTP_LOG_PHASE", value: 10)
!19 = !{!20, !27, !30, !106, !77, !69, !48, !119, !76, !97, !122}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 17, size: 96, elements: !24)
!24 = !{!25, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !23, file: !22, line: 18, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !23, file: !22, line: 19, baseType: !26, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !23, file: !22, line: 20, baseType: !26, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !32, line: 59, baseType: !33)
!32 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 34, size: 800, elements: !34)
!34 = !{!35, !47, !51, !52, !61, !62, !63, !74, !75, !80, !81, !101, !102, !103, !104, !105}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !33, file: !32, line: 35, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !37, line: 21, baseType: !38)
!37 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 16, size: 64, elements: !39)
!39 = !{!40, !46}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !38, file: !37, line: 17, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !42, line: 106, baseType: !43)
!42 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !42, line: 98, baseType: !45)
!45 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !38, file: !37, line: 19, baseType: !41, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !33, file: !32, line: 37, baseType: !48, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 120, baseType: !50)
!49 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !33, file: !32, line: 38, baseType: !48, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !33, file: !32, line: 40, baseType: !53, size: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !32, line: 16, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !32, line: 18, size: 96, elements: !56)
!56 = !{!57, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !55, file: !32, line: 19, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !49, line: 125, baseType: !50)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !32, line: 20, baseType: !53, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !32, line: 21, baseType: !58, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !33, file: !32, line: 41, baseType: !53, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !33, file: !32, line: 42, baseType: !54, size: 96, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !33, file: !32, line: 44, baseType: !64, size: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !32, line: 31, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 25, size: 128, elements: !67)
!67 = !{!68, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !66, file: !32, line: 26, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !70, line: 79, baseType: !58)
!70 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !66, file: !32, line: 27, baseType: !69, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !66, file: !32, line: 29, baseType: !69, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !66, file: !32, line: 30, baseType: !69, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !33, file: !32, line: 45, baseType: !69, size: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !33, file: !32, line: 47, baseType: !76, size: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !78, line: 64, baseType: !79)
!78 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !33, file: !32, line: 48, baseType: !76, size: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !33, file: !32, line: 50, baseType: !82, size: 256, offset: 416)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !37, line: 37, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 24, size: 256, elements: !84)
!84 = !{!85, !87, !88, !89, !100}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !83, file: !37, line: 26, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !83, file: !37, line: 28, baseType: !86, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !83, file: !37, line: 29, baseType: !69, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !83, file: !37, line: 30, baseType: !90, size: 128, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !91, line: 19, baseType: !92)
!91 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 17, size: 128, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !92, file: !91, line: 18, baseType: !95, size: 128)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !98)
!96 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!97 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !83, file: !37, line: 36, baseType: !69, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !33, file: !32, line: 52, baseType: !76, size: 32, offset: 672)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !33, file: !32, line: 53, baseType: !77, size: 8, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !33, file: !32, line: 55, baseType: !50, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !32, line: 57, baseType: !27, size: 32, offset: 736)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !33, file: !32, line: 58, baseType: !27, size: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_limit_conn_node_t", file: !3, line: 18, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 13, size: 48, elements: !109)
!109 = !{!110, !111, !112, !115}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !108, file: !3, line: 14, baseType: !77, size: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !108, file: !3, line: 15, baseType: !77, size: 8, offset: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !108, file: !3, line: 16, baseType: !113, size: 16, offset: 16)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !78, line: 65, baseType: !114)
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !3, line: 17, baseType: !116, size: 8, offset: 32)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !49, line: 135, baseType: !97)
!123 = !{!124, !0, !629, !634, !642}
!124 = !DIGlobalVariableExpression(var: !125)
!125 = distinct !DIGlobalVariable(name: "ngx_http_limit_conn_module", scope: !2, file: !3, line: 124, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !127, line: 15, baseType: !128)
!127 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !129, line: 222, size: 800, elements: !130)
!129 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !{!131, !132, !133, !135, !136, !137, !138, !139, !140, !602, !603, !609, !613, !614, !615, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !128, file: !129, line: 223, baseType: !69, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !128, file: !129, line: 224, baseType: !69, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 226, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !128, file: !129, line: 228, baseType: !69, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !128, file: !129, line: 229, baseType: !69, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !128, file: !129, line: 231, baseType: !69, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !128, file: !129, line: 232, baseType: !119, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !128, file: !129, line: 234, baseType: !27, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !128, file: !129, line: 235, baseType: !141, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !127, line: 22, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !144, line: 77, size: 224, elements: !145)
!144 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!145 = !{!146, !153, !154, !599, !600, !601}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 78, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !148, line: 19, baseType: !149)
!148 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 16, size: 64, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !148, line: 17, baseType: !48, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !148, line: 18, baseType: !76, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !144, line: 79, baseType: !69, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !143, file: !144, line: 80, baseType: !155, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!134, !158, !141, !27}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !127, line: 16, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !144, line: 116, size: 384, elements: !161)
!161 = !{!162, !163, !337, !581, !582, !583, !592, !593, !594, !595, !596, !598}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !144, line: 117, baseType: !134, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !160, file: !144, line: 118, baseType: !164, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !166, line: 22, baseType: !167)
!166 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 16, size: 160, elements: !168)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !167, file: !166, line: 17, baseType: !27, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !167, file: !166, line: 18, baseType: !69, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !166, line: 19, baseType: !48, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !167, file: !166, line: 20, baseType: !69, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !167, file: !166, line: 21, baseType: !174, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !127, line: 18, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !177, line: 57, size: 320, elements: !178)
!177 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!178 = !{!179, !187, !188, !189, !317, !324, !336}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !176, file: !177, line: 58, baseType: !180, size: 128)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !177, line: 54, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 49, size: 128, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !181, file: !177, line: 50, baseType: !76, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !181, file: !177, line: 51, baseType: !76, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !177, line: 52, baseType: !174, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !181, file: !177, line: 53, baseType: !69, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !176, file: !177, line: 59, baseType: !48, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !176, file: !177, line: 60, baseType: !174, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !176, file: !177, line: 61, baseType: !190, size: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !127, line: 19, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !193, line: 59, size: 64, elements: !194)
!193 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!194 = !{!195, !316}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !193, line: 60, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !193, line: 18, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !193, line: 20, size: 352, elements: !199)
!199 = !{!200, !201, !202, !204, !205, !206, !207, !209, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !198, file: !193, line: 21, baseType: !76, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !198, file: !193, line: 22, baseType: !76, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !198, file: !193, line: 23, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !49, line: 222, baseType: !97)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !198, file: !193, line: 24, baseType: !203, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !198, file: !193, line: 26, baseType: !76, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !198, file: !193, line: 27, baseType: !76, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !198, file: !193, line: 28, baseType: !208, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !193, line: 16, baseType: !27)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !198, file: !193, line: 29, baseType: !210, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !127, line: 23, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !213, line: 16, size: 1216, elements: !214)
!213 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!214 = !{!215, !218, !219, !264, !265, !266, !301, !302}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !212, file: !213, line: 17, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !217, line: 16, baseType: !97)
!217 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !213, line: 18, baseType: !147, size: 64, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !212, file: !213, line: 19, baseType: !220, size: 960, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !217, line: 17, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !222, line: 4, size: 960, elements: !223)
!222 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!223 = !{!224, !226, !227, !229, !230, !232, !233, !235, !237, !239, !240, !241, !242, !243, !244, !247, !248, !250, !251, !257, !258, !259}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !221, file: !222, line: 6, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !49, line: 232, baseType: !50)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !221, file: !222, line: 7, baseType: !225, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !221, file: !222, line: 8, baseType: !228, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !49, line: 227, baseType: !50)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !221, file: !222, line: 9, baseType: !228, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !221, file: !222, line: 10, baseType: !231, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !49, line: 217, baseType: !50)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !221, file: !222, line: 11, baseType: !231, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !221, file: !222, line: 13, baseType: !234, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !49, line: 212, baseType: !50)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !221, file: !222, line: 14, baseType: !236, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !49, line: 304, baseType: !50)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !221, file: !222, line: 15, baseType: !238, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !49, line: 309, baseType: !50)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !221, file: !222, line: 16, baseType: !50, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !221, file: !222, line: 17, baseType: !225, size: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !221, file: !222, line: 18, baseType: !225, size: 32, offset: 352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !221, file: !222, line: 19, baseType: !203, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !221, file: !222, line: 20, baseType: !203, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !221, file: !222, line: 21, baseType: !245, size: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !49, line: 237, baseType: !246)
!246 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !221, file: !222, line: 22, baseType: !245, size: 32, offset: 480)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !221, file: !222, line: 23, baseType: !249, size: 32, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !49, line: 242, baseType: !97)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !221, file: !222, line: 24, baseType: !249, size: 32, offset: 544)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !221, file: !222, line: 26, baseType: !252, size: 64, offset: 576)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !49, line: 288, size: 64, elements: !253)
!253 = !{!254, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !252, file: !49, line: 288, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !49, line: 75, baseType: !246)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !252, file: !49, line: 288, baseType: !246, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !221, file: !222, line: 27, baseType: !252, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !221, file: !222, line: 28, baseType: !252, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !221, file: !222, line: 29, baseType: !260, size: 192, offset: 768)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 192, elements: !262)
!261 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!262 = !{!263}
!263 = !DISubrange(count: 3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !212, file: !213, line: 21, baseType: !203, size: 32, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !212, file: !213, line: 22, baseType: !203, size: 32, offset: 1120)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !212, file: !213, line: 24, baseType: !267, size: 32, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !127, line: 20, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !270, line: 50, size: 320, elements: !271)
!270 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!271 = !{!272, !273, !285, !286, !287, !292, !293, !298, !299, !300}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !269, file: !270, line: 51, baseType: !69, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !269, file: !270, line: 52, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !127, line: 21, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !144, line: 89, size: 160, elements: !277)
!277 = !{!278, !279, !280, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !276, file: !144, line: 90, baseType: !216, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !144, line: 91, baseType: !147, size: 64, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !276, file: !144, line: 93, baseType: !281, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !274, !267}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !144, line: 94, baseType: !27, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !269, file: !270, line: 54, baseType: !44, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !269, file: !270, line: 56, baseType: !255, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !269, file: !270, line: 58, baseType: !288, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !270, line: 45, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!76, !267, !76, !48}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !270, line: 59, baseType: !27, size: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !269, file: !270, line: 61, baseType: !294, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !270, line: 46, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !267, !69, !76, !48}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !269, file: !270, line: 62, baseType: !27, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !269, file: !270, line: 70, baseType: !134, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !270, line: 72, baseType: !267, size: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !212, file: !213, line: 37, baseType: !50, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !212, file: !213, line: 38, baseType: !50, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !198, file: !193, line: 30, baseType: !196, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !198, file: !193, line: 34, baseType: !50, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !198, file: !193, line: 40, baseType: !50, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !198, file: !193, line: 43, baseType: !50, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !198, file: !193, line: 45, baseType: !50, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !198, file: !193, line: 46, baseType: !50, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !198, file: !193, line: 47, baseType: !50, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !198, file: !193, line: 48, baseType: !50, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !198, file: !193, line: 49, baseType: !50, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !198, file: !193, line: 50, baseType: !50, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !198, file: !193, line: 52, baseType: !50, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !198, file: !193, line: 53, baseType: !50, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !198, file: !193, line: 55, baseType: !97, size: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !193, line: 61, baseType: !190, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !176, file: !177, line: 62, baseType: !318, size: 32, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !177, line: 41, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !177, line: 43, size: 64, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !177, line: 44, baseType: !318, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !320, file: !177, line: 45, baseType: !27, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !176, file: !177, line: 63, baseType: !325, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !177, line: 32, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !177, line: 34, size: 96, elements: !328)
!328 = !{!329, !334, !335}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !327, file: !177, line: 35, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !177, line: 30, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !27}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !327, file: !177, line: 36, baseType: !27, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !177, line: 37, baseType: !325, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !176, file: !177, line: 64, baseType: !267, size: 32, offset: 288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !160, file: !144, line: 120, baseType: !338, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !127, line: 17, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !341, line: 38, size: 2496, elements: !342)
!341 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !{!343, !346, !347, !348, !349, !350, !527, !528, !529, !532, !533, !534, !535, !536, !537, !538, !539, !550, !551, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !340, file: !341, line: 39, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !340, file: !341, line: 40, baseType: !174, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !340, file: !341, line: 42, baseType: !267, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !340, file: !341, line: 43, baseType: !268, size: 320, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !340, file: !341, line: 45, baseType: !69, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !340, file: !341, line: 47, baseType: !351, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !127, line: 26, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !355, line: 121, size: 896, elements: !356)
!355 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!356 = !{!357, !358, !414, !415, !418, !424, !426, !431, !436, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !355, line: 122, baseType: !27, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !354, file: !355, line: 123, baseType: !359, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !127, line: 24, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !362, line: 30, size: 384, elements: !363)
!362 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !391, !392, !393, !406}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !362, line: 31, baseType: !27, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !361, file: !362, line: 33, baseType: !50, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !361, file: !362, line: 35, baseType: !50, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !361, file: !362, line: 38, baseType: !50, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !361, file: !362, line: 44, baseType: !50, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !361, file: !362, line: 46, baseType: !50, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !361, file: !362, line: 49, baseType: !50, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !361, file: !362, line: 51, baseType: !50, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !361, file: !362, line: 54, baseType: !50, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !361, file: !362, line: 56, baseType: !50, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !361, file: !362, line: 57, baseType: !50, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !361, file: !362, line: 59, baseType: !50, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !361, file: !362, line: 60, baseType: !50, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !361, file: !362, line: 62, baseType: !50, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !361, file: !362, line: 64, baseType: !50, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !361, file: !362, line: 67, baseType: !50, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !361, file: !362, line: 69, baseType: !50, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !361, file: !362, line: 71, baseType: !50, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !361, file: !362, line: 74, baseType: !50, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !361, file: !362, line: 75, baseType: !50, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !361, file: !362, line: 77, baseType: !50, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !361, file: !362, line: 107, baseType: !50, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !361, file: !362, line: 110, baseType: !387, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !127, line: 31, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !359}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !361, file: !362, line: 117, baseType: !69, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !361, file: !362, line: 119, baseType: !267, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !361, file: !362, line: 121, baseType: !394, size: 160, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !395, line: 20, baseType: !396)
!395 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !395, line: 22, size: 160, elements: !397)
!397 = !{!398, !400, !402, !403, !404, !405}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !396, file: !395, line: 23, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !395, line: 16, baseType: !69)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !396, file: !395, line: 24, baseType: !401, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !396, file: !395, line: 25, baseType: !401, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !396, file: !395, line: 26, baseType: !401, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !396, file: !395, line: 27, baseType: !77, size: 8, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !395, line: 28, baseType: !77, size: 8, offset: 136)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !361, file: !362, line: 124, baseType: !407, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !408, line: 16, baseType: !409)
!408 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !408, line: 18, size: 64, elements: !410)
!410 = !{!411, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !409, file: !408, line: 19, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !409, file: !408, line: 20, baseType: !412, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !354, file: !355, line: 124, baseType: !359, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !354, file: !355, line: 126, baseType: !416, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !417, line: 17, baseType: !97)
!417 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !354, file: !355, line: 128, baseType: !419, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !420, line: 19, baseType: !421)
!420 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DISubroutineType(types: !423)
!423 = !{!122, !352, !76, !48}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !354, file: !355, line: 129, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !420, line: 22, baseType: !421)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !354, file: !355, line: 130, baseType: !427, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !420, line: 20, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DISubroutineType(types: !430)
!430 = !{!122, !352, !190, !203}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !354, file: !355, line: 131, baseType: !432, size: 32, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !420, line: 23, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{!190, !352, !190, !203}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !354, file: !355, line: 133, baseType: !437, size: 32, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !355, line: 16, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !355, line: 18, size: 960, elements: !440)
!440 = !{!441, !442, !453, !455, !456, !457, !458, !459, !460, !461, !466, !467, !468, !469, !470, !471, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !439, file: !355, line: 19, baseType: !416, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !439, file: !355, line: 21, baseType: !443, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !445, line: 297, size: 128, elements: !446)
!445 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!446 = !{!447, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !444, file: !445, line: 298, baseType: !448, size: 16)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !49, line: 409, baseType: !114)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !444, file: !445, line: 299, baseType: !450, size: 112, offset: 16)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 112, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 14)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !439, file: !355, line: 22, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !49, line: 404, baseType: !50)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !439, file: !355, line: 23, baseType: !48, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !439, file: !355, line: 24, baseType: !147, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !439, file: !355, line: 26, baseType: !97, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !439, file: !355, line: 28, baseType: !97, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !439, file: !355, line: 29, baseType: !97, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !439, file: !355, line: 30, baseType: !97, size: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !439, file: !355, line: 38, baseType: !462, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !127, line: 32, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !352}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !439, file: !355, line: 40, baseType: !27, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !439, file: !355, line: 42, baseType: !268, size: 320, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !439, file: !355, line: 43, baseType: !267, size: 32, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !439, file: !355, line: 45, baseType: !48, size: 32, offset: 736)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !439, file: !355, line: 47, baseType: !48, size: 32, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !439, file: !355, line: 49, baseType: !472, size: 32, offset: 800)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !473, line: 16, baseType: !399)
!473 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!474 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !439, file: !355, line: 51, baseType: !437, size: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !439, file: !355, line: 52, baseType: !352, size: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !439, file: !355, line: 54, baseType: !69, size: 32, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !439, file: !355, line: 56, baseType: !50, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !439, file: !355, line: 57, baseType: !50, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !439, file: !355, line: 58, baseType: !50, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !439, file: !355, line: 60, baseType: !50, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !439, file: !355, line: 61, baseType: !50, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !439, file: !355, line: 62, baseType: !50, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !439, file: !355, line: 63, baseType: !50, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !439, file: !355, line: 64, baseType: !50, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !439, file: !355, line: 65, baseType: !50, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !439, file: !355, line: 66, baseType: !50, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !439, file: !355, line: 67, baseType: !50, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !439, file: !355, line: 70, baseType: !50, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !439, file: !355, line: 72, baseType: !50, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !439, file: !355, line: 73, baseType: !50, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !439, file: !355, line: 74, baseType: !50, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !439, file: !355, line: 76, baseType: !50, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !439, file: !355, line: 77, baseType: !50, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !439, file: !355, line: 78, baseType: !50, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !354, file: !355, line: 135, baseType: !203, size: 32, offset: 288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !354, file: !355, line: 137, baseType: !267, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !354, file: !355, line: 139, baseType: !174, size: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !355, line: 141, baseType: !97, size: 32, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !354, file: !355, line: 143, baseType: !443, size: 32, offset: 416)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !354, file: !355, line: 144, baseType: !454, size: 32, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !354, file: !355, line: 145, baseType: !147, size: 64, offset: 480)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !354, file: !355, line: 147, baseType: !147, size: 64, offset: 544)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !354, file: !355, line: 148, baseType: !504, size: 16, offset: 608)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !505, line: 12, baseType: !506)
!505 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !49, line: 186, baseType: !114)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !354, file: !355, line: 154, baseType: !443, size: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !354, file: !355, line: 155, baseType: !454, size: 32, offset: 672)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !354, file: !355, line: 157, baseType: !196, size: 32, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !354, file: !355, line: 159, baseType: !407, size: 64, offset: 736)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !354, file: !355, line: 161, baseType: !44, size: 32, offset: 800)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !354, file: !355, line: 163, baseType: !69, size: 32, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !354, file: !355, line: 165, baseType: !50, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !354, file: !355, line: 167, baseType: !50, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !354, file: !355, line: 169, baseType: !50, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !354, file: !355, line: 170, baseType: !50, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !354, file: !355, line: 171, baseType: !50, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !354, file: !355, line: 173, baseType: !50, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !354, file: !355, line: 174, baseType: !50, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !354, file: !355, line: 175, baseType: !50, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !354, file: !355, line: 176, baseType: !50, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !354, file: !355, line: 178, baseType: !50, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !354, file: !355, line: 179, baseType: !50, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !354, file: !355, line: 180, baseType: !50, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !354, file: !355, line: 181, baseType: !50, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !354, file: !355, line: 183, baseType: !50, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !340, file: !341, line: 48, baseType: !352, size: 32, offset: 480)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !340, file: !341, line: 49, baseType: !69, size: 32, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !340, file: !341, line: 51, baseType: !530, size: 32, offset: 544)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !340, file: !341, line: 52, baseType: !69, size: 32, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !340, file: !341, line: 53, baseType: !69, size: 32, offset: 608)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !340, file: !341, line: 55, baseType: !407, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !340, file: !341, line: 56, baseType: !69, size: 32, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !340, file: !341, line: 58, baseType: !165, size: 160, offset: 736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !340, file: !341, line: 59, baseType: !165, size: 160, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !340, file: !341, line: 61, baseType: !165, size: 160, offset: 1056)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !340, file: !341, line: 62, baseType: !540, size: 96, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !395, line: 32, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !395, line: 37, size: 96, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !541, file: !395, line: 38, baseType: !401, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !541, file: !395, line: 39, baseType: !401, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !541, file: !395, line: 40, baseType: !546, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !395, line: 34, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !401, !401, !401}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !340, file: !341, line: 63, baseType: !394, size: 160, offset: 1312)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !340, file: !341, line: 65, baseType: !552, size: 224, offset: 1472)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !553, line: 31, baseType: !554)
!553 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 25, size: 224, elements: !555)
!555 = !{!556, !564, !565, !566, !567}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !554, file: !553, line: 26, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !553, line: 16, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !553, line: 18, size: 96, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !559, file: !553, line: 19, baseType: !27, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !559, file: !553, line: 20, baseType: !69, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !553, line: 21, baseType: !557, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !554, file: !553, line: 27, baseType: !558, size: 96, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !553, line: 28, baseType: !48, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !554, file: !553, line: 29, baseType: !69, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !554, file: !553, line: 30, baseType: !174, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !340, file: !341, line: 66, baseType: !552, size: 224, offset: 1696)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !340, file: !341, line: 68, baseType: !69, size: 32, offset: 1920)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !340, file: !341, line: 69, baseType: !69, size: 32, offset: 1952)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !340, file: !341, line: 71, baseType: !352, size: 32, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !340, file: !341, line: 72, baseType: !359, size: 32, offset: 2016)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !340, file: !341, line: 73, baseType: !359, size: 32, offset: 2048)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !340, file: !341, line: 75, baseType: !338, size: 32, offset: 2080)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !340, file: !341, line: 77, baseType: !147, size: 64, offset: 2112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !340, file: !341, line: 78, baseType: !147, size: 64, offset: 2176)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !340, file: !341, line: 79, baseType: !147, size: 64, offset: 2240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !340, file: !341, line: 80, baseType: !147, size: 64, offset: 2304)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !340, file: !341, line: 81, baseType: !147, size: 64, offset: 2368)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !340, file: !341, line: 82, baseType: !147, size: 64, offset: 2432)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !160, file: !144, line: 121, baseType: !174, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !160, file: !144, line: 122, baseType: !174, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !160, file: !144, line: 123, baseType: !584, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !144, line: 103, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 98, size: 1344, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !586, file: !144, line: 99, baseType: !211, size: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !586, file: !144, line: 100, baseType: !196, size: 32, offset: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !586, file: !144, line: 101, baseType: !196, size: 32, offset: 1248)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !586, file: !144, line: 102, baseType: !69, size: 32, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !160, file: !144, line: 124, baseType: !267, size: 32, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !160, file: !144, line: 126, baseType: !27, size: 32, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !160, file: !144, line: 127, baseType: !69, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !160, file: !144, line: 128, baseType: !69, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !160, file: !144, line: 130, baseType: !597, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !144, line: 112, baseType: !155)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !160, file: !144, line: 131, baseType: !134, size: 32, offset: 352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !143, file: !144, line: 81, baseType: !69, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !143, file: !144, line: 82, baseType: !69, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !143, file: !144, line: 83, baseType: !27, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !129, line: 236, baseType: !69, size: 32, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !128, file: !129, line: 238, baseType: !604, size: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !267}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !70, line: 78, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !49, line: 140, baseType: !97)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !128, file: !129, line: 240, baseType: !610, size: 32, offset: 352)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DISubroutineType(types: !612)
!612 = !{!607, !338}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !128, file: !129, line: 242, baseType: !610, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !128, file: !129, line: 243, baseType: !610, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !128, file: !129, line: 244, baseType: !616, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 32)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !338}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !128, file: !129, line: 245, baseType: !616, size: 32, offset: 480)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !128, file: !129, line: 247, baseType: !616, size: 32, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !128, file: !129, line: 249, baseType: !58, size: 32, offset: 544)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !128, file: !129, line: 250, baseType: !58, size: 32, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !128, file: !129, line: 251, baseType: !58, size: 32, offset: 608)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !128, file: !129, line: 252, baseType: !58, size: 32, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !128, file: !129, line: 253, baseType: !58, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !128, file: !129, line: 254, baseType: !58, size: 32, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !128, file: !129, line: 255, baseType: !58, size: 32, offset: 736)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !128, file: !129, line: 256, baseType: !58, size: 32, offset: 768)
!629 = !DIGlobalVariableExpression(var: !630)
!630 = distinct !DIGlobalVariable(name: "ngx_http_limit_conn_commands", scope: !2, file: !3, line: 75, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1120, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 5)
!634 = !DIGlobalVariableExpression(var: !635)
!635 = distinct !DIGlobalVariable(name: "ngx_http_limit_conn_log_levels", scope: !2, file: !3, line: 61, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 480, elements: !632)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_enum_t", file: !144, line: 160, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 157, size: 96, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !144, line: 158, baseType: !147, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !638, file: !144, line: 159, baseType: !69, size: 32, offset: 64)
!642 = !DIGlobalVariableExpression(var: !643)
!643 = distinct !DIGlobalVariable(name: "ngx_http_limit_conn_status_bounds", scope: !2, file: !3, line: 70, type: !644, isLocal: true, isDefinition: true)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_num_bounds_t", file: !144, line: 154, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 150, size: 96, elements: !646)
!646 = !{!647, !652, !653}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "post_handler", scope: !645, file: !144, line: 151, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_post_handler_pt", file: !144, line: 135, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DISubroutineType(types: !651)
!651 = !{!134, !158, !27, !27}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !645, file: !144, line: 152, baseType: !607, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !645, file: !144, line: 153, baseType: !607, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !22, line: 36, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 24, size: 256, elements: !656)
!656 = !{!657, !661, !662, !666, !670, !671, !672, !673}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !655, file: !22, line: 25, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!607, !158}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !655, file: !22, line: 26, baseType: !658, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !655, file: !22, line: 28, baseType: !663, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{!27, !158}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !655, file: !22, line: 29, baseType: !667, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{!134, !158, !27}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !655, file: !22, line: 31, baseType: !663, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !655, file: !22, line: 32, baseType: !649, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !655, file: !22, line: 34, baseType: !663, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !655, file: !22, line: 35, baseType: !649, size: 32, offset: 224)
!674 = !{i32 2, !"Dwarf Version", i32 4}
!675 = !{i32 2, !"Debug Info Version", i32 3}
!676 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!677 = distinct !DISubprogram(name: "ngx_http_limit_conn_init", scope: !3, file: !3, line: 655, type: !659, isLocal: true, isDefinition: true, scopeLine: 656, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !678)
!678 = !{!679, !680, !1847}
!679 = !DILocalVariable(name: "cf", arg: 1, scope: !677, file: !3, line: 655, type: !158)
!680 = !DILocalVariable(name: "h", scope: !677, file: !3, line: 657, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !683, line: 360, baseType: !684)
!683 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DISubroutineType(types: !686)
!686 = !{!607, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !689, line: 16, baseType: !690)
!689 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !683, line: 364, size: 5376, elements: !691)
!691 = !{!692, !694, !695, !696, !697, !698, !699, !704, !705, !856, !1409, !1410, !1411, !1412, !1451, !1481, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1526, !1537, !1544, !1545, !1546, !1547, !1560, !1561, !1562, !1563, !1564, !1565, !1743, !1747, !1752, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !690, file: !683, line: 365, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 191, baseType: !50)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !690, file: !683, line: 367, baseType: !352, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !690, file: !683, line: 369, baseType: !26, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !690, file: !683, line: 370, baseType: !26, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !690, file: !683, line: 371, baseType: !26, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !690, file: !683, line: 372, baseType: !26, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !690, file: !683, line: 374, baseType: !700, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !683, line: 361, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !687}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !690, file: !683, line: 375, baseType: !700, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !690, file: !683, line: 378, baseType: !706, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !689, line: 18, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !709, line: 65, size: 3008, elements: !710)
!709 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!710 = !{!711, !712, !713, !714, !718, !719, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !814, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !708, file: !709, line: 66, baseType: !211, size: 1216)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !708, file: !709, line: 67, baseType: !165, size: 160, offset: 1216)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !708, file: !709, line: 68, baseType: !693, size: 32, offset: 1376)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !708, file: !709, line: 69, baseType: !715, size: 128, offset: 1408)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !708, file: !709, line: 70, baseType: !715, size: 128, offset: 1536)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !708, file: !709, line: 72, baseType: !720, size: 32, offset: 1664)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !217, line: 18, baseType: !228)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !708, file: !709, line: 73, baseType: !255, size: 32, offset: 1696)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !708, file: !709, line: 74, baseType: !255, size: 32, offset: 1728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !708, file: !709, line: 75, baseType: !255, size: 32, offset: 1760)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !708, file: !709, line: 76, baseType: !255, size: 32, offset: 1792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !708, file: !709, line: 77, baseType: !255, size: 32, offset: 1824)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !708, file: !709, line: 79, baseType: !147, size: 64, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !708, file: !709, line: 80, baseType: !147, size: 64, offset: 1920)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !708, file: !709, line: 81, baseType: !715, size: 128, offset: 1984)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !708, file: !709, line: 83, baseType: !48, size: 32, offset: 2112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !708, file: !709, line: 84, baseType: !48, size: 32, offset: 2144)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !708, file: !709, line: 85, baseType: !203, size: 32, offset: 2176)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !708, file: !709, line: 86, baseType: !203, size: 32, offset: 2208)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !708, file: !709, line: 88, baseType: !69, size: 32, offset: 2240)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !708, file: !709, line: 89, baseType: !69, size: 32, offset: 2272)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !708, file: !709, line: 90, baseType: !69, size: 32, offset: 2304)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !708, file: !709, line: 91, baseType: !69, size: 32, offset: 2336)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !708, file: !709, line: 93, baseType: !196, size: 32, offset: 2368)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !708, file: !709, line: 95, baseType: !739, size: 32, offset: 2400)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !689, line: 19, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !709, line: 157, size: 544, elements: !742)
!742 = !{!743, !756, !757, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !813}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !741, file: !709, line: 158, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !709, line: 154, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !709, line: 145, size: 480, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !746, file: !709, line: 146, baseType: !540, size: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !746, file: !709, line: 147, baseType: !394, size: 160, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !746, file: !709, line: 148, baseType: !407, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !746, file: !709, line: 149, baseType: !41, size: 32, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !746, file: !709, line: 150, baseType: !41, size: 32, offset: 352)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !709, line: 151, baseType: !203, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !746, file: !709, line: 152, baseType: !69, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !746, file: !709, line: 153, baseType: !69, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !741, file: !709, line: 159, baseType: !30, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !741, file: !709, line: 161, baseType: !758, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !213, line: 62, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 50, size: 384, elements: !761)
!761 = !{!762, !763, !764, !766, !771, !773, !775, !776, !777}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !213, line: 51, baseType: !147, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !760, file: !213, line: 52, baseType: !48, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !760, file: !213, line: 53, baseType: !765, size: 96, offset: 96)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !262)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !760, file: !213, line: 55, baseType: !767, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !213, line: 45, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!472, !27}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !760, file: !213, line: 56, baseType: !772, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !213, line: 46, baseType: !768)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !760, file: !213, line: 57, baseType: !774, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !213, line: 47, baseType: !331)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !213, line: 58, baseType: !27, size: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !760, file: !213, line: 60, baseType: !76, size: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !760, file: !213, line: 61, baseType: !69, size: 32, offset: 352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !741, file: !709, line: 163, baseType: !203, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !741, file: !709, line: 164, baseType: !48, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !741, file: !709, line: 166, baseType: !255, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !741, file: !709, line: 168, baseType: !255, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !741, file: !709, line: 170, baseType: !69, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !741, file: !709, line: 171, baseType: !69, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !741, file: !709, line: 172, baseType: !472, size: 32, offset: 288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !741, file: !709, line: 173, baseType: !472, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !741, file: !709, line: 174, baseType: !472, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !741, file: !709, line: 176, baseType: !69, size: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !741, file: !709, line: 177, baseType: !472, size: 32, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !741, file: !709, line: 178, baseType: !472, size: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !741, file: !709, line: 180, baseType: !791, size: 32, offset: 480)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !341, line: 25, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !341, line: 29, size: 320, elements: !794)
!794 = !{!795, !796, !806, !811, !812}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !793, file: !341, line: 30, baseType: !27, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !793, file: !341, line: 31, baseType: !797, size: 192, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !798, line: 22, baseType: !799)
!798 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 16, size: 192, elements: !800)
!800 = !{!801, !802, !803, !804, !805}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !799, file: !798, line: 17, baseType: !76, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !799, file: !798, line: 18, baseType: !48, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !798, line: 19, baseType: !147, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !799, file: !798, line: 20, baseType: !267, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !799, file: !798, line: 21, baseType: !69, size: 32, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !793, file: !341, line: 32, baseType: !807, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !341, line: 27, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!607, !791, !27}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !793, file: !341, line: 33, baseType: !27, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !793, file: !341, line: 34, baseType: !69, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !741, file: !709, line: 182, baseType: !69, size: 32, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !708, file: !709, line: 96, baseType: !815, size: 32, offset: 2432)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !709, line: 62, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !709, line: 39, size: 576, elements: !818)
!818 = !{!819, !820, !821, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !817, file: !709, line: 40, baseType: !394, size: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !817, file: !709, line: 41, baseType: !407, size: 64, offset: 160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !817, file: !709, line: 43, baseType: !822, size: 96, offset: 224)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 96, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 12)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !817, file: !709, line: 46, baseType: !50, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !817, file: !709, line: 47, baseType: !50, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !817, file: !709, line: 48, baseType: !50, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !817, file: !709, line: 49, baseType: !50, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !817, file: !709, line: 50, baseType: !50, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !817, file: !709, line: 51, baseType: !50, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !817, file: !709, line: 52, baseType: !50, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !817, file: !709, line: 53, baseType: !50, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !817, file: !709, line: 56, baseType: !720, size: 32, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !817, file: !709, line: 57, baseType: !255, size: 32, offset: 416)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !817, file: !709, line: 58, baseType: !255, size: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !817, file: !709, line: 59, baseType: !48, size: 32, offset: 480)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !817, file: !709, line: 60, baseType: !203, size: 32, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !817, file: !709, line: 61, baseType: !472, size: 32, offset: 544)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !708, file: !709, line: 102, baseType: !472, size: 32, offset: 2464)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !708, file: !709, line: 103, baseType: !472, size: 32, offset: 2496)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !708, file: !709, line: 104, baseType: !472, size: 32, offset: 2528)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !708, file: !709, line: 105, baseType: !472, size: 32, offset: 2560)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !708, file: !709, line: 107, baseType: !360, size: 384, offset: 2592)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !708, file: !709, line: 109, baseType: !50, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !708, file: !709, line: 110, baseType: !50, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !708, file: !709, line: 112, baseType: !50, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !708, file: !709, line: 113, baseType: !50, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !708, file: !709, line: 114, baseType: !50, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !708, file: !709, line: 115, baseType: !50, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !708, file: !709, line: 116, baseType: !50, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !708, file: !709, line: 117, baseType: !50, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !708, file: !709, line: 118, baseType: !50, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !708, file: !709, line: 119, baseType: !50, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !708, file: !709, line: 121, baseType: !50, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !708, file: !709, line: 122, baseType: !50, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !690, file: !683, line: 381, baseType: !857, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !689, line: 17, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !860, line: 313, size: 4096, elements: !861)
!860 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
