; ModuleID = 'src/http/modules/ngx_http_referer_module.c'
source_filename = "src/http/modules/ngx_http_referer_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_referer_module_ctx", scope: !2, file: !3, line: 79, type: !577, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !68)
!3 = !DIFile(filename: "src/http/modules/ngx_http_referer_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !12, !21, !22, !50, !61, !64, !67, !44}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !8, line: 79, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_conf_ctx_t", file: !14, line: 21, baseType: !15)
!14 = !DIFile(filename: "src/http/ngx_http_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 17, size: 96, elements: !16)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !15, file: !14, line: 18, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !15, file: !14, line: 19, baseType: !18, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !15, file: !14, line: 20, baseType: !18, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 120, baseType: !11)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_wildcard_t", file: !24, line: 32, baseType: !25)
!24 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 29, size: 96, elements: !26)
!26 = !{!27, !49}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !25, file: !24, line: 30, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_t", file: !24, line: 26, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 23, size: 64, elements: !30)
!30 = !{!31, !48}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !29, file: !24, line: 24, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_elt_t", file: !24, line: 20, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 16, size: 64, elements: !36)
!36 = !{!37, !38, !42}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !35, file: !24, line: 17, baseType: !6, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, file: !24, line: 18, baseType: !39, size: 16, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !40, line: 65, baseType: !41)
!40 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !24, line: 19, baseType: !43, size: 8, offset: 48)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !40, line: 64, baseType: !45)
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !{!47}
!47 = !DISubrange(count: 1)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !24, line: 25, baseType: !7, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !25, file: !24, line: 31, baseType: !6, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_t", file: !24, line: 39, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 35, size: 128, elements: !53)
!53 = !{!54, !62, !63}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !52, file: !24, line: 36, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !56, line: 19, baseType: !57)
!56 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 16, size: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !57, file: !56, line: 17, baseType: !21, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !56, line: 18, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !52, file: !24, line: 37, baseType: !7, size: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !52, file: !24, line: 38, baseType: !6, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{!69, !0, !572}
!69 = !DIGlobalVariableExpression(var: !70)
!70 = distinct !DIGlobalVariable(name: "ngx_http_referer_module", scope: !2, file: !3, line: 94, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !72, line: 15, baseType: !73)
!72 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !74, line: 222, size: 800, elements: !75)
!74 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = !{!76, !77, !78, !80, !81, !82, !83, !84, !85, !545, !546, !552, !556, !557, !558, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !73, file: !74, line: 223, baseType: !7, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !73, file: !74, line: 224, baseType: !7, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !74, line: 226, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !73, file: !74, line: 228, baseType: !7, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !73, file: !74, line: 229, baseType: !7, size: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !73, file: !74, line: 231, baseType: !7, size: 32, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !73, file: !74, line: 232, baseType: !64, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !73, file: !74, line: 234, baseType: !6, size: 32, offset: 224)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !73, file: !74, line: 235, baseType: !86, size: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !72, line: 22, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !89, line: 77, size: 224, elements: !90)
!89 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = !{!91, !92, !93, !542, !543, !544}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !89, line: 78, baseType: !55, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !89, line: 79, baseType: !7, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !88, file: !89, line: 80, baseType: !94, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!95 = !DISubroutineType(types: !96)
!96 = !{!79, !97, !86, !6}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !72, line: 16, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !89, line: 116, size: 384, elements: !100)
!100 = !{!101, !102, !279, !524, !525, !526, !535, !536, !537, !538, !539, !541}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !89, line: 117, baseType: !79, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !99, file: !89, line: 118, baseType: !103, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !105, line: 22, baseType: !106)
!105 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !105, line: 16, size: 160, elements: !107)
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !106, file: !105, line: 17, baseType: !6, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !106, file: !105, line: 18, baseType: !7, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !105, line: 19, baseType: !21, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !106, file: !105, line: 20, baseType: !7, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !106, file: !105, line: 21, baseType: !113, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !72, line: 18, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !116, line: 57, size: 320, elements: !117)
!116 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = !{!118, !126, !127, !128, !259, !266, !278}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !115, file: !116, line: 58, baseType: !119, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !116, line: 54, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 49, size: 128, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !120, file: !116, line: 50, baseType: !61, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !120, file: !116, line: 51, baseType: !61, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !116, line: 52, baseType: !113, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !120, file: !116, line: 53, baseType: !7, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !115, file: !116, line: 59, baseType: !21, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !115, file: !116, line: 60, baseType: !113, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !115, file: !116, line: 61, baseType: !129, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !72, line: 19, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !132, line: 59, size: 64, elements: !133)
!132 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !{!134, !258}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !132, line: 18, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !132, line: 20, size: 352, elements: !138)
!138 = !{!139, !140, !141, !143, !144, !145, !146, !148, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !137, file: !132, line: 21, baseType: !61, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !137, file: !132, line: 22, baseType: !61, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !137, file: !132, line: 23, baseType: !142, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !10, line: 222, baseType: !67)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !137, file: !132, line: 24, baseType: !142, size: 32, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !137, file: !132, line: 26, baseType: !61, size: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !137, file: !132, line: 27, baseType: !61, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !137, file: !132, line: 28, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !132, line: 16, baseType: !6)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !137, file: !132, line: 29, baseType: !149, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !72, line: 23, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !152, line: 16, size: 1216, elements: !153)
!152 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!153 = !{!154, !157, !158, !203, !204, !205, !243, !244}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !151, file: !152, line: 17, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !156, line: 16, baseType: !67)
!156 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !151, file: !152, line: 18, baseType: !55, size: 64, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !151, file: !152, line: 19, baseType: !159, size: 960, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !156, line: 17, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !161, line: 4, size: 960, elements: !162)
!161 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!162 = !{!163, !165, !166, !168, !169, !171, !172, !174, !176, !178, !179, !180, !181, !182, !183, !186, !187, !189, !190, !196, !197, !198}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !160, file: !161, line: 6, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !10, line: 232, baseType: !11)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !160, file: !161, line: 7, baseType: !164, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !160, file: !161, line: 8, baseType: !167, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !10, line: 227, baseType: !11)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !160, file: !161, line: 9, baseType: !167, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !160, file: !161, line: 10, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !10, line: 217, baseType: !11)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !160, file: !161, line: 11, baseType: !170, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !160, file: !161, line: 13, baseType: !173, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !10, line: 212, baseType: !11)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !160, file: !161, line: 14, baseType: !175, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !10, line: 304, baseType: !11)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !160, file: !161, line: 15, baseType: !177, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !10, line: 309, baseType: !11)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !160, file: !161, line: 16, baseType: !11, size: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !160, file: !161, line: 17, baseType: !164, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !160, file: !161, line: 18, baseType: !164, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !160, file: !161, line: 19, baseType: !142, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !160, file: !161, line: 20, baseType: !142, size: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !160, file: !161, line: 21, baseType: !184, size: 32, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !10, line: 237, baseType: !185)
!185 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !160, file: !161, line: 22, baseType: !184, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !160, file: !161, line: 23, baseType: !188, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !10, line: 242, baseType: !67)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !160, file: !161, line: 24, baseType: !188, size: 32, offset: 544)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !160, file: !161, line: 26, baseType: !191, size: 64, offset: 576)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !10, line: 288, size: 64, elements: !192)
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !191, file: !10, line: 288, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !185)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !191, file: !10, line: 288, baseType: !185, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !160, file: !161, line: 27, baseType: !191, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !160, file: !161, line: 28, baseType: !191, size: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !160, file: !161, line: 29, baseType: !199, size: 192, offset: 768)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 192, elements: !201)
!200 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!201 = !{!202}
!202 = !DISubrange(count: 3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !151, file: !152, line: 21, baseType: !142, size: 32, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !151, file: !152, line: 22, baseType: !142, size: 32, offset: 1120)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !151, file: !152, line: 24, baseType: !206, size: 32, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !72, line: 20, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !209, line: 50, size: 320, elements: !210)
!209 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!210 = !{!211, !212, !224, !228, !229, !234, !235, !240, !241, !242}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !208, file: !209, line: 51, baseType: !7, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !208, file: !209, line: 52, baseType: !213, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !72, line: 21, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !89, line: 89, size: 160, elements: !216)
!216 = !{!217, !218, !219, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !215, file: !89, line: 90, baseType: !155, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !89, line: 91, baseType: !55, size: 64, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !215, file: !89, line: 93, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !213, !206}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !89, line: 94, baseType: !6, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !208, file: !209, line: 54, baseType: !225, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !226, line: 98, baseType: !227)
!226 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!227 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !208, file: !209, line: 56, baseType: !194, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !208, file: !209, line: 58, baseType: !230, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !209, line: 45, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{!61, !206, !61, !21}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !209, line: 59, baseType: !6, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !208, file: !209, line: 61, baseType: !236, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !209, line: 46, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !206, !7, !61, !21}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !208, file: !209, line: 62, baseType: !6, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !208, file: !209, line: 70, baseType: !79, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !209, line: 72, baseType: !206, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !151, file: !152, line: 37, baseType: !11, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !151, file: !152, line: 38, baseType: !11, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !137, file: !132, line: 30, baseType: !135, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !137, file: !132, line: 34, baseType: !11, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !137, file: !132, line: 40, baseType: !11, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !137, file: !132, line: 43, baseType: !11, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !137, file: !132, line: 45, baseType: !11, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !137, file: !132, line: 46, baseType: !11, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !137, file: !132, line: 47, baseType: !11, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !137, file: !132, line: 48, baseType: !11, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !137, file: !132, line: 49, baseType: !11, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !137, file: !132, line: 50, baseType: !11, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !137, file: !132, line: 52, baseType: !11, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !137, file: !132, line: 53, baseType: !11, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !137, file: !132, line: 55, baseType: !67, size: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !132, line: 61, baseType: !129, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !115, file: !116, line: 62, baseType: !260, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !116, line: 41, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !116, line: 43, size: 64, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !116, line: 44, baseType: !260, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !262, file: !116, line: 45, baseType: !6, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !115, file: !116, line: 63, baseType: !267, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !116, line: 32, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !116, line: 34, size: 96, elements: !270)
!270 = !{!271, !276, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !269, file: !116, line: 35, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !116, line: 30, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !6}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !116, line: 36, baseType: !6, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !116, line: 37, baseType: !267, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !115, file: !116, line: 64, baseType: !206, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !99, file: !89, line: 120, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !72, line: 17, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !283, line: 38, size: 2496, elements: !284)
!283 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !{!285, !288, !289, !290, !291, !292, !470, !471, !472, !475, !476, !477, !478, !479, !480, !481, !482, !493, !494, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !282, file: !283, line: 39, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !282, file: !283, line: 40, baseType: !113, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !282, file: !283, line: 42, baseType: !206, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !282, file: !283, line: 43, baseType: !207, size: 320, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !282, file: !283, line: 45, baseType: !7, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !282, file: !283, line: 47, baseType: !293, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !72, line: 26, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !297, line: 121, size: 896, elements: !298)
!297 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = !{!299, !300, !356, !357, !360, !367, !369, !374, !379, !438, !439, !440, !441, !442, !443, !444, !445, !446, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !297, line: 122, baseType: !6, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !296, file: !297, line: 123, baseType: !301, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !72, line: 24, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !304, line: 30, size: 384, elements: !305)
!304 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !333, !334, !335, !348}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !303, file: !304, line: 31, baseType: !6, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !303, file: !304, line: 33, baseType: !11, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !303, file: !304, line: 35, baseType: !11, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !303, file: !304, line: 38, baseType: !11, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !303, file: !304, line: 44, baseType: !11, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !303, file: !304, line: 46, baseType: !11, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !303, file: !304, line: 49, baseType: !11, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !303, file: !304, line: 51, baseType: !11, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !303, file: !304, line: 54, baseType: !11, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !303, file: !304, line: 56, baseType: !11, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !303, file: !304, line: 57, baseType: !11, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !303, file: !304, line: 59, baseType: !11, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !303, file: !304, line: 60, baseType: !11, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !303, file: !304, line: 62, baseType: !11, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !303, file: !304, line: 64, baseType: !11, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !303, file: !304, line: 67, baseType: !11, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !303, file: !304, line: 69, baseType: !11, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !303, file: !304, line: 71, baseType: !11, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !303, file: !304, line: 74, baseType: !11, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !303, file: !304, line: 75, baseType: !11, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !303, file: !304, line: 77, baseType: !11, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !303, file: !304, line: 107, baseType: !11, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !303, file: !304, line: 110, baseType: !329, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !72, line: 31, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !301}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !303, file: !304, line: 117, baseType: !7, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !303, file: !304, line: 119, baseType: !206, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !303, file: !304, line: 121, baseType: !336, size: 160, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !337, line: 20, baseType: !338)
!337 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !337, line: 22, size: 160, elements: !339)
!339 = !{!340, !342, !344, !345, !346, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !338, file: !337, line: 23, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !337, line: 16, baseType: !7)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !338, file: !337, line: 24, baseType: !343, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !338, file: !337, line: 25, baseType: !343, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !337, line: 26, baseType: !343, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !338, file: !337, line: 27, baseType: !44, size: 8, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !337, line: 28, baseType: !44, size: 8, offset: 136)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !303, file: !304, line: 124, baseType: !349, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !350, line: 16, baseType: !351)
!350 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !350, line: 18, size: 64, elements: !352)
!352 = !{!353, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !351, file: !350, line: 19, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !350, line: 20, baseType: !354, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !296, file: !297, line: 124, baseType: !301, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !296, file: !297, line: 126, baseType: !358, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !359, line: 17, baseType: !67)
!359 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !296, file: !297, line: 128, baseType: !361, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !362, line: 19, baseType: !363)
!362 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !294, !61, !21}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !10, line: 135, baseType: !67)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !296, file: !297, line: 129, baseType: !368, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !362, line: 22, baseType: !363)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !296, file: !297, line: 130, baseType: !370, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !362, line: 20, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DISubroutineType(types: !373)
!373 = !{!366, !294, !129, !142}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !296, file: !297, line: 131, baseType: !375, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !362, line: 23, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DISubroutineType(types: !378)
!378 = !{!129, !294, !129, !142}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !296, file: !297, line: 133, baseType: !380, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !297, line: 16, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !297, line: 18, size: 960, elements: !383)
!383 = !{!384, !385, !396, !398, !399, !400, !401, !402, !403, !404, !409, !410, !411, !412, !413, !414, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !382, file: !297, line: 19, baseType: !358, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !382, file: !297, line: 21, baseType: !386, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !388, line: 297, size: 128, elements: !389)
!388 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!389 = !{!390, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !387, file: !388, line: 298, baseType: !391, size: 16)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !10, line: 409, baseType: !41)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !387, file: !388, line: 299, baseType: !393, size: 112, offset: 16)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 112, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 14)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !382, file: !297, line: 22, baseType: !397, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !10, line: 404, baseType: !11)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !382, file: !297, line: 23, baseType: !21, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !382, file: !297, line: 24, baseType: !55, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !297, line: 26, baseType: !67, size: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !382, file: !297, line: 28, baseType: !67, size: 32, offset: 224)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !382, file: !297, line: 29, baseType: !67, size: 32, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !382, file: !297, line: 30, baseType: !67, size: 32, offset: 288)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !382, file: !297, line: 38, baseType: !405, size: 32, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !72, line: 32, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !294}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !382, file: !297, line: 40, baseType: !6, size: 32, offset: 352)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !382, file: !297, line: 42, baseType: !207, size: 320, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !382, file: !297, line: 43, baseType: !206, size: 32, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !382, file: !297, line: 45, baseType: !21, size: 32, offset: 736)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !382, file: !297, line: 47, baseType: !21, size: 32, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !382, file: !297, line: 49, baseType: !415, size: 32, offset: 800)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !416, line: 16, baseType: !341)
!416 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !382, file: !297, line: 51, baseType: !380, size: 32, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !382, file: !297, line: 52, baseType: !294, size: 32, offset: 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !382, file: !297, line: 54, baseType: !7, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !382, file: !297, line: 56, baseType: !11, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !382, file: !297, line: 57, baseType: !11, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !382, file: !297, line: 58, baseType: !11, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !382, file: !297, line: 60, baseType: !11, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !382, file: !297, line: 61, baseType: !11, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !382, file: !297, line: 62, baseType: !11, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !382, file: !297, line: 63, baseType: !11, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !382, file: !297, line: 64, baseType: !11, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !382, file: !297, line: 65, baseType: !11, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !382, file: !297, line: 66, baseType: !11, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !382, file: !297, line: 67, baseType: !11, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !382, file: !297, line: 70, baseType: !11, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !382, file: !297, line: 72, baseType: !11, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !382, file: !297, line: 73, baseType: !11, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !382, file: !297, line: 74, baseType: !11, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !382, file: !297, line: 76, baseType: !11, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !382, file: !297, line: 77, baseType: !11, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !382, file: !297, line: 78, baseType: !11, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !296, file: !297, line: 135, baseType: !142, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !296, file: !297, line: 137, baseType: !206, size: 32, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !296, file: !297, line: 139, baseType: !113, size: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !297, line: 141, baseType: !67, size: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !296, file: !297, line: 143, baseType: !386, size: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !296, file: !297, line: 144, baseType: !397, size: 32, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !296, file: !297, line: 145, baseType: !55, size: 64, offset: 480)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !296, file: !297, line: 147, baseType: !55, size: 64, offset: 544)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !296, file: !297, line: 148, baseType: !447, size: 16, offset: 608)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !448, line: 12, baseType: !449)
!448 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 186, baseType: !41)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !296, file: !297, line: 154, baseType: !386, size: 32, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !296, file: !297, line: 155, baseType: !397, size: 32, offset: 672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !296, file: !297, line: 157, baseType: !135, size: 32, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !296, file: !297, line: 159, baseType: !349, size: 64, offset: 736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !296, file: !297, line: 161, baseType: !225, size: 32, offset: 800)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !296, file: !297, line: 163, baseType: !7, size: 32, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !296, file: !297, line: 165, baseType: !11, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !296, file: !297, line: 167, baseType: !11, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !296, file: !297, line: 169, baseType: !11, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !296, file: !297, line: 170, baseType: !11, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !296, file: !297, line: 171, baseType: !11, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !296, file: !297, line: 173, baseType: !11, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !296, file: !297, line: 174, baseType: !11, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !296, file: !297, line: 175, baseType: !11, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !296, file: !297, line: 176, baseType: !11, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !296, file: !297, line: 178, baseType: !11, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !296, file: !297, line: 179, baseType: !11, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !296, file: !297, line: 180, baseType: !11, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !296, file: !297, line: 181, baseType: !11, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !296, file: !297, line: 183, baseType: !11, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !282, file: !283, line: 48, baseType: !294, size: 32, offset: 480)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !282, file: !283, line: 49, baseType: !7, size: 32, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !282, file: !283, line: 51, baseType: !473, size: 32, offset: 544)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !282, file: !283, line: 52, baseType: !7, size: 32, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !282, file: !283, line: 53, baseType: !7, size: 32, offset: 608)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !282, file: !283, line: 55, baseType: !349, size: 64, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !282, file: !283, line: 56, baseType: !7, size: 32, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !282, file: !283, line: 58, baseType: !104, size: 160, offset: 736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !282, file: !283, line: 59, baseType: !104, size: 160, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !282, file: !283, line: 61, baseType: !104, size: 160, offset: 1056)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !282, file: !283, line: 62, baseType: !483, size: 96, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !337, line: 32, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !337, line: 37, size: 96, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !484, file: !337, line: 38, baseType: !343, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !484, file: !337, line: 39, baseType: !343, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !484, file: !337, line: 40, baseType: !489, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !337, line: 34, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !343, !343, !343}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !282, file: !283, line: 63, baseType: !336, size: 160, offset: 1312)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !282, file: !283, line: 65, baseType: !495, size: 224, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !496, line: 31, baseType: !497)
!496 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 25, size: 224, elements: !498)
!498 = !{!499, !507, !508, !509, !510}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !497, file: !496, line: 26, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !496, line: 16, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !496, line: 18, size: 96, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !502, file: !496, line: 19, baseType: !6, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !502, file: !496, line: 20, baseType: !7, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !496, line: 21, baseType: !500, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !497, file: !496, line: 27, baseType: !501, size: 96, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !497, file: !496, line: 28, baseType: !21, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !497, file: !496, line: 29, baseType: !7, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !497, file: !496, line: 30, baseType: !113, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !282, file: !283, line: 66, baseType: !495, size: 224, offset: 1696)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !282, file: !283, line: 68, baseType: !7, size: 32, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !282, file: !283, line: 69, baseType: !7, size: 32, offset: 1952)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !282, file: !283, line: 71, baseType: !294, size: 32, offset: 1984)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !282, file: !283, line: 72, baseType: !301, size: 32, offset: 2016)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !282, file: !283, line: 73, baseType: !301, size: 32, offset: 2048)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !282, file: !283, line: 75, baseType: !280, size: 32, offset: 2080)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !282, file: !283, line: 77, baseType: !55, size: 64, offset: 2112)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !282, file: !283, line: 78, baseType: !55, size: 64, offset: 2176)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !282, file: !283, line: 79, baseType: !55, size: 64, offset: 2240)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !282, file: !283, line: 80, baseType: !55, size: 64, offset: 2304)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !282, file: !283, line: 81, baseType: !55, size: 64, offset: 2368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !282, file: !283, line: 82, baseType: !55, size: 64, offset: 2432)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !99, file: !89, line: 121, baseType: !113, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !99, file: !89, line: 122, baseType: !113, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !99, file: !89, line: 123, baseType: !527, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !89, line: 103, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 98, size: 1344, elements: !530)
!530 = !{!531, !532, !533, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !529, file: !89, line: 99, baseType: !150, size: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !529, file: !89, line: 100, baseType: !135, size: 32, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !529, file: !89, line: 101, baseType: !135, size: 32, offset: 1248)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !529, file: !89, line: 102, baseType: !7, size: 32, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !99, file: !89, line: 124, baseType: !206, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !99, file: !89, line: 126, baseType: !6, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !99, file: !89, line: 127, baseType: !7, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !99, file: !89, line: 128, baseType: !7, size: 32, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !99, file: !89, line: 130, baseType: !540, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !89, line: 112, baseType: !94)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !99, file: !89, line: 131, baseType: !79, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !88, file: !89, line: 81, baseType: !7, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !88, file: !89, line: 82, baseType: !7, size: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !88, file: !89, line: 83, baseType: !6, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !74, line: 236, baseType: !7, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !73, file: !74, line: 238, baseType: !547, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !206}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !8, line: 78, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 140, baseType: !67)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !73, file: !74, line: 240, baseType: !553, size: 32, offset: 352)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{!550, !280}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !73, file: !74, line: 242, baseType: !553, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !73, file: !74, line: 243, baseType: !553, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !73, file: !74, line: 244, baseType: !559, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !280}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !73, file: !74, line: 245, baseType: !559, size: 32, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !73, file: !74, line: 247, baseType: !559, size: 32, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !73, file: !74, line: 249, baseType: !9, size: 32, offset: 544)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !73, file: !74, line: 250, baseType: !9, size: 32, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !73, file: !74, line: 251, baseType: !9, size: 32, offset: 608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !73, file: !74, line: 252, baseType: !9, size: 32, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !73, file: !74, line: 253, baseType: !9, size: 32, offset: 672)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !73, file: !74, line: 254, baseType: !9, size: 32, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !73, file: !74, line: 255, baseType: !9, size: 32, offset: 736)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !73, file: !74, line: 256, baseType: !9, size: 32, offset: 768)
!572 = !DIGlobalVariableExpression(var: !573)
!573 = distinct !DIGlobalVariable(name: "ngx_http_referer_commands", scope: !2, file: !3, line: 52, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 896, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 4)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_module_t", file: !14, line: 36, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 24, size: 256, elements: !579)
!579 = !{!580, !584, !585, !589, !593, !594, !598, !599}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "preconfiguration", scope: !578, file: !14, line: 25, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!550, !97}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "postconfiguration", scope: !578, file: !14, line: 26, baseType: !581, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "create_main_conf", scope: !578, file: !14, line: 28, baseType: !586, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DISubroutineType(types: !588)
!588 = !{!6, !97}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_main_conf", scope: !578, file: !14, line: 29, baseType: !590, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DISubroutineType(types: !592)
!592 = !{!79, !97, !6}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "create_srv_conf", scope: !578, file: !14, line: 31, baseType: !586, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "merge_srv_conf", scope: !578, file: !14, line: 32, baseType: !595, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DISubroutineType(types: !597)
!597 = !{!79, !97, !6, !6}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "create_loc_conf", scope: !578, file: !14, line: 34, baseType: !586, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "merge_loc_conf", scope: !578, file: !14, line: 35, baseType: !595, size: 32, offset: 224)
!600 = !{i32 2, !"Dwarf Version", i32 4}
!601 = !{i32 2, !"Debug Info Version", i32 3}
!602 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!603 = distinct !DISubprogram(name: "ngx_http_referer_create_conf", scope: !3, file: !3, line: 267, type: !587, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !604)
!604 = !{!605, !606}
!605 = !DILocalVariable(name: "cf", arg: 1, scope: !603, file: !3, line: 267, type: !97)
!606 = !DILocalVariable(name: "conf", scope: !603, file: !3, line: 269, type: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_referer_conf_t", file: !3, line: 32, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 16, size: 320, elements: !610)
!610 = !{!611, !618, !620, !621, !622, !636, !637}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !609, file: !3, line: 17, baseType: !612, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_combined_t", file: !24, line: 49, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 45, size: 128, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !613, file: !24, line: 46, baseType: !28, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wc_head", scope: !613, file: !24, line: 47, baseType: !22, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wc_tail", scope: !613, file: !24, line: 48, baseType: !22, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "no_referer", scope: !609, file: !3, line: 24, baseType: !619, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !8, line: 80, baseType: !551)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "blocked_referer", scope: !609, file: !3, line: 25, baseType: !619, size: 32, offset: 160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "server_names", scope: !609, file: !3, line: 26, baseType: !619, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !609, file: !3, line: 28, baseType: !623, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_keys_arrays_t", file: !24, line: 89, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 75, size: 672, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hsize", scope: !625, file: !24, line: 76, baseType: !7, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !625, file: !24, line: 78, baseType: !113, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !625, file: !24, line: 79, baseType: !113, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !625, file: !24, line: 81, baseType: !104, size: 160, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "keys_hash", scope: !625, file: !24, line: 82, baseType: !103, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dns_wc_head", scope: !625, file: !24, line: 84, baseType: !104, size: 160, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dns_wc_head_hash", scope: !625, file: !24, line: 85, baseType: !103, size: 32, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dns_wc_tail", scope: !625, file: !24, line: 87, baseType: !104, size: 160, offset: 480)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dns_wc_tail_hash", scope: !625, file: !24, line: 88, baseType: !103, size: 32, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "referer_hash_max_size", scope: !609, file: !3, line: 30, baseType: !7, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "referer_hash_bucket_size", scope: !609, file: !3, line: 31, baseType: !7, size: 32, offset: 288)
!638 = !{!639, !639, i64 0}
!639 = !{!"any pointer", !640, i64 0}
!640 = !{!"omnipotent char", !641, i64 0}
!641 = !{!"Simple C/C++ TBAA"}
!642 = !DIExpression()
!643 = !DILocation(line: 267, column: 42, scope: !603)
!644 = !DILocation(line: 269, column: 5, scope: !603)
!645 = !DILocation(line: 269, column: 31, scope: !603)
!646 = !DILocation(line: 271, column: 24, scope: !603)
!647 = !DILocation(line: 271, column: 28, scope: !603)
!648 = !{!649, !639, i64 12}
!649 = !{!"ngx_conf_s", !639, i64 0, !639, i64 4, !639, i64 8, !639, i64 12, !639, i64 16, !639, i64 20, !639, i64 24, !639, i64 28, !650, i64 32, !650, i64 36, !639, i64 40, !639, i64 44}
!650 = !{!"int", !640, i64 0}
!651 = !DILocation(line: 271, column: 12, scope: !603)
!652 = !DILocation(line: 271, column: 10, scope: !603)
!653 = !DILocation(line: 272, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !603, file: !3, line: 272, column: 9)
!655 = !DILocation(line: 272, column: 14, scope: !654)
!656 = !DILocation(line: 272, column: 9, scope: !603)
!657 = !DILocation(line: 273, column: 9, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !3, line: 272, column: 23)
!659 = !DILocation(line: 289, column: 5, scope: !603)
!660 = !DILocation(line: 289, column: 11, scope: !603)
!661 = !DILocation(line: 289, column: 22, scope: !603)
!662 = !{!663, !650, i64 16}
!663 = !{!"", !664, i64 0, !650, i64 16, !650, i64 20, !650, i64 24, !639, i64 28, !650, i64 32, !650, i64 36}
!664 = !{!"", !665, i64 0, !639, i64 8, !639, i64 12}
!665 = !{!"", !639, i64 0, !650, i64 4}
!666 = !DILocation(line: 290, column: 5, scope: !603)
!667 = !DILocation(line: 290, column: 11, scope: !603)
!668 = !DILocation(line: 290, column: 27, scope: !603)
!669 = !{!663, !650, i64 20}
!670 = !DILocation(line: 291, column: 5, scope: !603)
!671 = !DILocation(line: 291, column: 11, scope: !603)
!672 = !DILocation(line: 291, column: 33, scope: !603)
!673 = !{!663, !650, i64 32}
!674 = !DILocation(line: 292, column: 5, scope: !603)
!675 = !DILocation(line: 292, column: 11, scope: !603)
!676 = !DILocation(line: 292, column: 36, scope: !603)
!677 = !{!663, !650, i64 36}
!678 = !DILocation(line: 294, column: 12, scope: !603)
!679 = !DILocation(line: 294, column: 5, scope: !603)
!680 = !DILocation(line: 295, column: 1, scope: !603)
!681 = distinct !DISubprogram(name: "ngx_http_referer_merge_conf", scope: !3, file: !3, line: 299, type: !596, isLocal: true, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !705, !1905}
!683 = !DILocalVariable(name: "cf", arg: 1, scope: !681, file: !3, line: 299, type: !97)
!684 = !DILocalVariable(name: "parent", arg: 2, scope: !681, file: !3, line: 299, type: !6)
!685 = !DILocalVariable(name: "child", arg: 3, scope: !681, file: !3, line: 299, type: !6)
!686 = !DILocalVariable(name: "prev", scope: !681, file: !3, line: 301, type: !607)
!687 = !DILocalVariable(name: "conf", scope: !681, file: !3, line: 302, type: !607)
!688 = !DILocalVariable(name: "n", scope: !681, file: !3, line: 304, type: !7)
!689 = !DILocalVariable(name: "hash", scope: !681, file: !3, line: 305, type: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_init_t", file: !24, line: 62, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 52, size: 224, elements: !692)
!692 = !{!693, !695, !700, !701, !702, !703, !704}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !691, file: !24, line: 53, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !691, file: !24, line: 54, baseType: !696, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_pt", file: !24, line: 42, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = !DISubroutineType(types: !699)
!699 = !{!7, !61, !21}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !691, file: !24, line: 56, baseType: !7, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_size", scope: !691, file: !24, line: 57, baseType: !7, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !24, line: 59, baseType: !79, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !691, file: !24, line: 60, baseType: !113, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !691, file: !24, line: 61, baseType: !113, size: 32, offset: 192)
!705 = !DILocalVariable(name: "sn", scope: !681, file: !3, line: 306, type: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_server_name_t", file: !708, line: 220, baseType: !709)
!708 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 214, size: 96, elements: !710)
!710 = !{!711, !1904}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !709, file: !708, line: 218, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_core_srv_conf_t", file: !708, line: 208, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !708, line: 181, size: 608, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !728, !729, !730, !731, !732, !733}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "server_names", scope: !714, file: !708, line: 183, baseType: !104, size: 160)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !714, file: !708, line: 186, baseType: !12, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !714, file: !708, line: 188, baseType: !55, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "connection_pool_size", scope: !714, file: !708, line: 190, baseType: !21, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "request_pool_size", scope: !714, file: !708, line: 191, baseType: !21, size: 32, offset: 288)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "client_header_buffer_size", scope: !714, file: !708, line: 192, baseType: !21, size: 32, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "large_client_header_buffers", scope: !714, file: !708, line: 194, baseType: !723, size: 64, offset: 352)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !132, line: 68, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 65, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !724, file: !132, line: 66, baseType: !550, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !724, file: !132, line: 67, baseType: !21, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "client_header_timeout", scope: !714, file: !708, line: 196, baseType: !415, size: 32, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_invalid_headers", scope: !714, file: !708, line: 198, baseType: !619, size: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "merge_slashes", scope: !714, file: !708, line: 199, baseType: !619, size: 32, offset: 480)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "underscores_in_headers", scope: !714, file: !708, line: 200, baseType: !619, size: 32, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !714, file: !708, line: 202, baseType: !11, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "named_locations", scope: !714, file: !708, line: 207, baseType: !734, size: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_core_loc_conf_t", file: !708, line: 64, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_core_loc_conf_s", file: !708, line: 309, size: 2496, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !759, !760, !762, !763, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1883, !1884, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !708, line: 310, baseType: !55, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "noname", scope: !737, file: !708, line: 316, baseType: !11, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lmt_excpt", scope: !737, file: !708, line: 317, baseType: !11, size: 1, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !737, file: !708, line: 318, baseType: !11, size: 1, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !737, file: !708, line: 320, baseType: !11, size: 1, offset: 67, flags: DIFlagBitField, extraData: i64 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "noregex", scope: !737, file: !708, line: 321, baseType: !11, size: 1, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !737, file: !708, line: 323, baseType: !11, size: 1, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "static_locations", scope: !737, file: !708, line: 329, baseType: !747, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_location_tree_node_t", file: !708, line: 63, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_location_tree_node_s", file: !708, line: 462, size: 192, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !749, file: !708, line: 463, baseType: !747, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !749, file: !708, line: 464, baseType: !747, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !749, file: !708, line: 465, baseType: !747, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !749, file: !708, line: 467, baseType: !735, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "inclusive", scope: !749, file: !708, line: 468, baseType: !735, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "auto_redirect", scope: !749, file: !708, line: 470, baseType: !44, size: 8, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !749, file: !708, line: 471, baseType: !44, size: 8, offset: 168)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !708, line: 472, baseType: !43, size: 8, offset: 176)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !737, file: !708, line: 335, baseType: !18, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except", scope: !737, file: !708, line: 337, baseType: !761, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 191, baseType: !11)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "limit_except_loc_conf", scope: !737, file: !708, line: 338, baseType: !18, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !737, file: !708, line: 340, baseType: !764, size: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_handler_pt", file: !765, line: 360, baseType: !766)
!765 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DISubroutineType(types: !768)
!768 = !{!550, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !771, line: 16, baseType: !772)
!771 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !765, line: 364, size: 5376, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !785, !786, !997, !1530, !1531, !1532, !1533, !1572, !1602, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1647, !1658, !1665, !1666, !1667, !1668, !1681, !1682, !1683, !1684, !1685, !1686, !1714, !1718, !1723, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !772, file: !765, line: 365, baseType: !761, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !772, file: !765, line: 367, baseType: !294, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !772, file: !765, line: 369, baseType: !18, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !772, file: !765, line: 370, baseType: !18, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !772, file: !765, line: 371, baseType: !18, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !772, file: !765, line: 372, baseType: !18, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !772, file: !765, line: 374, baseType: !781, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !765, line: 361, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !769}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !772, file: !765, line: 375, baseType: !781, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !772, file: !765, line: 378, baseType: !787, size: 32, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !771, line: 18, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !790, line: 65, size: 3008, elements: !791)
!790 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!791 = !{!792, !793, !794, !795, !799, !800, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !955, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !789, file: !790, line: 66, baseType: !150, size: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !789, file: !790, line: 67, baseType: !104, size: 160, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !789, file: !790, line: 68, baseType: !761, size: 32, offset: 1376)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !789, file: !790, line: 69, baseType: !796, size: 128, offset: 1408)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 16)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !789, file: !790, line: 70, baseType: !796, size: 128, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !789, file: !790, line: 72, baseType: !801, size: 32, offset: 1664)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !156, line: 18, baseType: !167)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !789, file: !790, line: 73, baseType: !194, size: 32, offset: 1696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !789, file: !790, line: 74, baseType: !194, size: 32, offset: 1728)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !789, file: !790, line: 75, baseType: !194, size: 32, offset: 1760)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !789, file: !790, line: 76, baseType: !194, size: 32, offset: 1792)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !789, file: !790, line: 77, baseType: !194, size: 32, offset: 1824)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !789, file: !790, line: 79, baseType: !55, size: 64, offset: 1856)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !789, file: !790, line: 80, baseType: !55, size: 64, offset: 1920)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !789, file: !790, line: 81, baseType: !796, size: 128, offset: 1984)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !789, file: !790, line: 83, baseType: !21, size: 32, offset: 2112)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !789, file: !790, line: 84, baseType: !21, size: 32, offset: 2144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !789, file: !790, line: 85, baseType: !142, size: 32, offset: 2176)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !789, file: !790, line: 86, baseType: !142, size: 32, offset: 2208)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !789, file: !790, line: 88, baseType: !7, size: 32, offset: 2240)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !789, file: !790, line: 89, baseType: !7, size: 32, offset: 2272)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !789, file: !790, line: 90, baseType: !7, size: 32, offset: 2304)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !789, file: !790, line: 91, baseType: !7, size: 32, offset: 2336)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !789, file: !790, line: 93, baseType: !135, size: 32, offset: 2368)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !789, file: !790, line: 95, baseType: !820, size: 32, offset: 2400)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !771, line: 19, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !790, line: 157, size: 544, elements: !823)
!823 = !{!824, !839, !898, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !954}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !822, file: !790, line: 158, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !790, line: 154, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !790, line: 145, size: 480, elements: !828)
!828 = !{!829, !830, !831, !832, !835, !836, !837, !838}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !827, file: !790, line: 146, baseType: !483, size: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !827, file: !790, line: 147, baseType: !336, size: 160, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !827, file: !790, line: 148, baseType: !349, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !827, file: !790, line: 149, baseType: !833, size: 32, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !226, line: 106, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !827, file: !790, line: 150, baseType: !833, size: 32, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !790, line: 151, baseType: !142, size: 32, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !827, file: !790, line: 152, baseType: !7, size: 32, offset: 416)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !827, file: !790, line: 153, baseType: !7, size: 32, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !822, file: !790, line: 159, baseType: !840, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !842, line: 59, baseType: !843)
!842 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 34, size: 800, elements: !844)
!844 = !{!845, !852, !853, !854, !862, !863, !864, !873, !874, !875, !876, !893, !894, !895, !896, !897}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !843, file: !842, line: 35, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !847, line: 21, baseType: !848)
!847 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !847, line: 16, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !848, file: !847, line: 17, baseType: !833, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !848, file: !847, line: 19, baseType: !833, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !843, file: !842, line: 37, baseType: !21, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !843, file: !842, line: 38, baseType: !21, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !843, file: !842, line: 40, baseType: !855, size: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !842, line: 16, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !842, line: 18, size: 96, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !857, file: !842, line: 19, baseType: !9, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !842, line: 20, baseType: !855, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !857, file: !842, line: 21, baseType: !9, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !843, file: !842, line: 41, baseType: !855, size: 32, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !843, file: !842, line: 42, baseType: !856, size: 96, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !843, file: !842, line: 44, baseType: !865, size: 32, offset: 288)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !842, line: 31, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 25, size: 128, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !867, file: !842, line: 26, baseType: !7, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !867, file: !842, line: 27, baseType: !7, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !867, file: !842, line: 29, baseType: !7, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !867, file: !842, line: 30, baseType: !7, size: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !843, file: !842, line: 45, baseType: !7, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !843, file: !842, line: 47, baseType: !61, size: 32, offset: 352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !843, file: !842, line: 48, baseType: !61, size: 32, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !843, file: !842, line: 50, baseType: !877, size: 256, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !847, line: 37, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !847, line: 24, size: 256, elements: !879)
!879 = !{!880, !882, !883, !884, !892}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !878, file: !847, line: 26, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !878, file: !847, line: 28, baseType: !881, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !878, file: !847, line: 29, baseType: !7, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !878, file: !847, line: 30, baseType: !885, size: 128, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !886, line: 19, baseType: !887)
