; ModuleID = 'src/http/modules/ngx_http_headers_filter_module.c'
source_filename = "src/http/modules/ngx_http_headers_filter_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_http_module_t = type { i32 (%struct.ngx_conf_s*)*, i32 (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)*, i8* (%struct.ngx_conf_s*)*, i8* (%struct.ngx_conf_s*, i8*, i8*)* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_http_headers_filter_module_ctx", scope: !2, file: !3, line: 115, type: !1811, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !48)
!3 = !DIFile(filename: "src/http/modules/ngx_http_headers_filter_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 35, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11, !12, !13}
!7 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_OFF", value: 0)
!8 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_EPOCH", value: 1)
!9 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_MAX", value: 2)
!10 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_ACCESS", value: 3)
!11 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_MODIFIED", value: 4)
!12 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_DAILY", value: 5)
!13 = !DIEnumerator(name: "NGX_HTTP_EXPIRES_UNSET", value: 6)
!14 = !{!15, !16, !20, !23, !26, !47}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !18, line: 64, baseType: !19)
!18 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !24, line: 75, baseType: !25)
!24 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_table_elt_t", file: !29, line: 97, baseType: !30)
!29 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 92, size: 192, elements: !31)
!31 = !{!32, !37, !45, !46}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !30, file: !29, line: 93, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !34, line: 79, baseType: !35)
!34 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !24, line: 125, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !30, file: !29, line: 94, baseType: !38, size: 64, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !39, line: 19, baseType: !40)
!39 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 16, size: 64, elements: !41)
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 17, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 120, baseType: !36)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 18, baseType: !16, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !29, line: 95, baseType: !38, size: 64, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lowcase_key", scope: !30, file: !29, line: 96, baseType: !16, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!48 = !{!49, !0, !552, !1786, !1789}
!49 = !DIGlobalVariableExpression(var: !50)
!50 = distinct !DIGlobalVariable(name: "ngx_http_headers_filter_module", scope: !2, file: !3, line: 130, type: !51, isLocal: false, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !52, line: 15, baseType: !53)
!52 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !54, line: 222, size: 800, elements: !55)
!54 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !525, !526, !532, !536, !537, !538, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !53, file: !54, line: 223, baseType: !33, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !53, file: !54, line: 224, baseType: !33, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !54, line: 226, baseType: !47, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !53, file: !54, line: 228, baseType: !33, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !53, file: !54, line: 229, baseType: !33, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !53, file: !54, line: 231, baseType: !33, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !53, file: !54, line: 232, baseType: !20, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !53, file: !54, line: 234, baseType: !15, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !53, file: !54, line: 235, baseType: !65, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !52, line: 22, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !68, line: 77, size: 224, elements: !69)
!68 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!69 = !{!70, !71, !72, !522, !523, !524}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !68, line: 78, baseType: !38, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !68, line: 79, baseType: !33, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !67, file: !68, line: 80, baseType: !73, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DISubroutineType(types: !75)
!75 = !{!47, !76, !65, !15}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !52, line: 16, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !68, line: 116, size: 384, elements: !79)
!79 = !{!80, !81, !257, !504, !505, !506, !515, !516, !517, !518, !519, !521}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !68, line: 117, baseType: !47, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !78, file: !68, line: 118, baseType: !82, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !84, line: 22, baseType: !85)
!84 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 16, size: 160, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !85, file: !84, line: 17, baseType: !15, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !85, file: !84, line: 18, baseType: !33, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !84, line: 19, baseType: !43, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !85, file: !84, line: 20, baseType: !33, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !85, file: !84, line: 21, baseType: !92, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !52, line: 18, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !95, line: 57, size: 320, elements: !96)
!95 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = !{!97, !105, !106, !107, !237, !244, !256}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !94, file: !95, line: 58, baseType: !98, size: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !95, line: 54, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 49, size: 128, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !95, line: 50, baseType: !16, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !99, file: !95, line: 51, baseType: !16, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !95, line: 52, baseType: !92, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !99, file: !95, line: 53, baseType: !33, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !94, file: !95, line: 59, baseType: !43, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !94, file: !95, line: 60, baseType: !92, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !94, file: !95, line: 61, baseType: !108, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !52, line: 19, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !111, line: 59, size: 64, elements: !112)
!111 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!112 = !{!113, !236}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !110, file: !111, line: 60, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !111, line: 18, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !111, line: 20, size: 352, elements: !117)
!117 = !{!118, !119, !120, !123, !124, !125, !126, !128, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !116, file: !111, line: 21, baseType: !16, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !111, line: 22, baseType: !16, size: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !116, file: !111, line: 23, baseType: !121, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !24, line: 222, baseType: !122)
!122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !116, file: !111, line: 24, baseType: !121, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !116, file: !111, line: 26, baseType: !16, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !116, file: !111, line: 27, baseType: !16, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !116, file: !111, line: 28, baseType: !127, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !111, line: 16, baseType: !15)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !116, file: !111, line: 29, baseType: !129, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !52, line: 23, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !132, line: 16, size: 1216, elements: !133)
!132 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !{!134, !137, !138, !181, !182, !183, !221, !222}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !131, file: !132, line: 17, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !136, line: 16, baseType: !122)
!136 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 18, baseType: !38, size: 64, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !131, file: !132, line: 19, baseType: !139, size: 960, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !136, line: 17, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !141, line: 4, size: 960, elements: !142)
!141 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!142 = !{!143, !145, !146, !148, !149, !151, !152, !154, !156, !158, !159, !160, !161, !162, !163, !165, !166, !168, !169, !174, !175, !176}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !140, file: !141, line: 6, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !24, line: 232, baseType: !36)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !140, file: !141, line: 7, baseType: !144, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !140, file: !141, line: 8, baseType: !147, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !24, line: 227, baseType: !36)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !140, file: !141, line: 9, baseType: !147, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !140, file: !141, line: 10, baseType: !150, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !24, line: 217, baseType: !36)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !140, file: !141, line: 11, baseType: !150, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !140, file: !141, line: 13, baseType: !153, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !24, line: 212, baseType: !36)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !140, file: !141, line: 14, baseType: !155, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !24, line: 304, baseType: !36)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !140, file: !141, line: 15, baseType: !157, size: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !24, line: 309, baseType: !36)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !140, file: !141, line: 16, baseType: !36, size: 32, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !140, file: !141, line: 17, baseType: !144, size: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !140, file: !141, line: 18, baseType: !144, size: 32, offset: 352)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !140, file: !141, line: 19, baseType: !121, size: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !140, file: !141, line: 20, baseType: !121, size: 32, offset: 416)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !140, file: !141, line: 21, baseType: !164, size: 32, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !24, line: 237, baseType: !25)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !140, file: !141, line: 22, baseType: !164, size: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !140, file: !141, line: 23, baseType: !167, size: 32, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !24, line: 242, baseType: !122)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !140, file: !141, line: 24, baseType: !167, size: 32, offset: 544)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !140, file: !141, line: 26, baseType: !170, size: 64, offset: 576)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !24, line: 288, size: 64, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !170, file: !24, line: 288, baseType: !23, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !170, file: !24, line: 288, baseType: !25, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !140, file: !141, line: 27, baseType: !170, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !140, file: !141, line: 28, baseType: !170, size: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !140, file: !141, line: 29, baseType: !177, size: 192, offset: 768)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 192, elements: !179)
!178 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !131, file: !132, line: 21, baseType: !121, size: 32, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !131, file: !132, line: 22, baseType: !121, size: 32, offset: 1120)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !131, file: !132, line: 24, baseType: !184, size: 32, offset: 1152)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !52, line: 20, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !187, line: 50, size: 320, elements: !188)
!187 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!188 = !{!189, !190, !202, !206, !207, !212, !213, !218, !219, !220}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !186, file: !187, line: 51, baseType: !33, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !186, file: !187, line: 52, baseType: !191, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !52, line: 21, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !68, line: 89, size: 160, elements: !194)
!194 = !{!195, !196, !197, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !193, file: !68, line: 90, baseType: !135, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !68, line: 91, baseType: !38, size: 64, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !193, file: !68, line: 93, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !191, !184}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !68, line: 94, baseType: !15, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !186, file: !187, line: 54, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !204, line: 98, baseType: !205)
!204 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!205 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !186, file: !187, line: 56, baseType: !23, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !186, file: !187, line: 58, baseType: !208, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !187, line: 45, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{!16, !184, !16, !43}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !187, line: 59, baseType: !15, size: 32, offset: 160)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !186, file: !187, line: 61, baseType: !214, size: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !187, line: 46, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !184, !33, !16, !43}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !186, file: !187, line: 62, baseType: !15, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !186, file: !187, line: 70, baseType: !47, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !187, line: 72, baseType: !184, size: 32, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !131, file: !132, line: 37, baseType: !36, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !131, file: !132, line: 38, baseType: !36, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !116, file: !111, line: 30, baseType: !114, size: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !116, file: !111, line: 34, baseType: !36, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !116, file: !111, line: 40, baseType: !36, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !116, file: !111, line: 43, baseType: !36, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !116, file: !111, line: 45, baseType: !36, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !116, file: !111, line: 46, baseType: !36, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !116, file: !111, line: 47, baseType: !36, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !116, file: !111, line: 48, baseType: !36, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !116, file: !111, line: 49, baseType: !36, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !116, file: !111, line: 50, baseType: !36, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !116, file: !111, line: 52, baseType: !36, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !116, file: !111, line: 53, baseType: !36, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !116, file: !111, line: 55, baseType: !122, size: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !111, line: 61, baseType: !108, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !94, file: !95, line: 62, baseType: !238, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !95, line: 41, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !95, line: 43, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !95, line: 44, baseType: !238, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !240, file: !95, line: 45, baseType: !15, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !94, file: !95, line: 63, baseType: !245, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !95, line: 32, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !95, line: 34, size: 96, elements: !248)
!248 = !{!249, !254, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !247, file: !95, line: 35, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !95, line: 30, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !15}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !95, line: 36, baseType: !15, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !95, line: 37, baseType: !245, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !94, file: !95, line: 64, baseType: !184, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !78, file: !68, line: 120, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !52, line: 17, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !261, line: 38, size: 2496, elements: !262)
!261 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!262 = !{!263, !267, !268, !269, !270, !271, !450, !451, !452, !455, !456, !457, !458, !459, !460, !461, !462, !473, !474, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !260, file: !261, line: 39, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !260, file: !261, line: 40, baseType: !92, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !260, file: !261, line: 42, baseType: !184, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !260, file: !261, line: 43, baseType: !185, size: 320, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !260, file: !261, line: 45, baseType: !33, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !260, file: !261, line: 47, baseType: !272, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !52, line: 26, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !276, line: 121, size: 896, elements: !277)
!276 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!277 = !{!278, !279, !335, !336, !339, !346, !348, !353, !358, !418, !419, !420, !421, !422, !423, !424, !425, !426, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 122, baseType: !15, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !275, file: !276, line: 123, baseType: !280, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !52, line: 24, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !283, line: 30, size: 384, elements: !284)
!283 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !312, !313, !314, !327}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !282, file: !283, line: 31, baseType: !15, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !282, file: !283, line: 33, baseType: !36, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !282, file: !283, line: 35, baseType: !36, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !282, file: !283, line: 38, baseType: !36, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !282, file: !283, line: 44, baseType: !36, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !282, file: !283, line: 46, baseType: !36, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !282, file: !283, line: 49, baseType: !36, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !282, file: !283, line: 51, baseType: !36, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !282, file: !283, line: 54, baseType: !36, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !282, file: !283, line: 56, baseType: !36, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !282, file: !283, line: 57, baseType: !36, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !282, file: !283, line: 59, baseType: !36, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !282, file: !283, line: 60, baseType: !36, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !282, file: !283, line: 62, baseType: !36, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !282, file: !283, line: 64, baseType: !36, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !282, file: !283, line: 67, baseType: !36, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !282, file: !283, line: 69, baseType: !36, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !282, file: !283, line: 71, baseType: !36, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !282, file: !283, line: 74, baseType: !36, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !282, file: !283, line: 75, baseType: !36, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !282, file: !283, line: 77, baseType: !36, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !282, file: !283, line: 107, baseType: !36, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !282, file: !283, line: 110, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !52, line: 31, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !280}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !282, file: !283, line: 117, baseType: !33, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !282, file: !283, line: 119, baseType: !184, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !282, file: !283, line: 121, baseType: !315, size: 160, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !316, line: 20, baseType: !317)
!316 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !316, line: 22, size: 160, elements: !318)
!318 = !{!319, !321, !323, !324, !325, !326}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !317, file: !316, line: 23, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !316, line: 16, baseType: !33)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !317, file: !316, line: 24, baseType: !322, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !317, file: !316, line: 25, baseType: !322, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !316, line: 26, baseType: !322, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !317, file: !316, line: 27, baseType: !17, size: 8, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !316, line: 28, baseType: !17, size: 8, offset: 136)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !282, file: !283, line: 124, baseType: !328, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !329, line: 16, baseType: !330)
!329 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !329, line: 18, size: 64, elements: !331)
!331 = !{!332, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !330, file: !329, line: 19, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !329, line: 20, baseType: !333, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !275, file: !276, line: 124, baseType: !280, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !275, file: !276, line: 126, baseType: !337, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !338, line: 17, baseType: !122)
!338 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !275, file: !276, line: 128, baseType: !340, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !341, line: 19, baseType: !342)
!341 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !273, !16, !43}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 135, baseType: !122)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !275, file: !276, line: 129, baseType: !347, size: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !341, line: 22, baseType: !342)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !275, file: !276, line: 130, baseType: !349, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !341, line: 20, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DISubroutineType(types: !352)
!352 = !{!345, !273, !108, !121}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !275, file: !276, line: 131, baseType: !354, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !341, line: 23, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DISubroutineType(types: !357)
!357 = !{!108, !273, !108, !121}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !275, file: !276, line: 133, baseType: !359, size: 32, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !276, line: 16, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !276, line: 18, size: 960, elements: !362)
!362 = !{!363, !364, !376, !378, !379, !380, !381, !382, !383, !384, !389, !390, !391, !392, !393, !394, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !361, file: !276, line: 19, baseType: !337, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !361, file: !276, line: 21, baseType: !365, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !367, line: 297, size: 128, elements: !368)
!367 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!368 = !{!369, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !366, file: !367, line: 298, baseType: !370, size: 16)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !24, line: 409, baseType: !371)
!371 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !366, file: !367, line: 299, baseType: !373, size: 112, offset: 16)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 112, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 14)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !361, file: !276, line: 22, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !24, line: 404, baseType: !36)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !361, file: !276, line: 23, baseType: !43, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !361, file: !276, line: 24, baseType: !38, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !276, line: 26, baseType: !122, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !361, file: !276, line: 28, baseType: !122, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !361, file: !276, line: 29, baseType: !122, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !361, file: !276, line: 30, baseType: !122, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !361, file: !276, line: 38, baseType: !385, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !52, line: 32, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !273}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !361, file: !276, line: 40, baseType: !15, size: 32, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !361, file: !276, line: 42, baseType: !185, size: 320, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !361, file: !276, line: 43, baseType: !184, size: 32, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !361, file: !276, line: 45, baseType: !43, size: 32, offset: 736)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !361, file: !276, line: 47, baseType: !43, size: 32, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !361, file: !276, line: 49, baseType: !395, size: 32, offset: 800)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !396, line: 16, baseType: !320)
!396 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!397 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !361, file: !276, line: 51, baseType: !359, size: 32, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !361, file: !276, line: 52, baseType: !273, size: 32, offset: 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !361, file: !276, line: 54, baseType: !33, size: 32, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !361, file: !276, line: 56, baseType: !36, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !361, file: !276, line: 57, baseType: !36, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !361, file: !276, line: 58, baseType: !36, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !361, file: !276, line: 60, baseType: !36, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !361, file: !276, line: 61, baseType: !36, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !361, file: !276, line: 62, baseType: !36, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !361, file: !276, line: 63, baseType: !36, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !361, file: !276, line: 64, baseType: !36, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !361, file: !276, line: 65, baseType: !36, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !361, file: !276, line: 66, baseType: !36, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !361, file: !276, line: 67, baseType: !36, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !361, file: !276, line: 70, baseType: !36, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !361, file: !276, line: 72, baseType: !36, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !361, file: !276, line: 73, baseType: !36, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !361, file: !276, line: 74, baseType: !36, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !361, file: !276, line: 76, baseType: !36, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !361, file: !276, line: 77, baseType: !36, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !361, file: !276, line: 78, baseType: !36, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !275, file: !276, line: 135, baseType: !121, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !275, file: !276, line: 137, baseType: !184, size: 32, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !275, file: !276, line: 139, baseType: !92, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !276, line: 141, baseType: !122, size: 32, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !275, file: !276, line: 143, baseType: !365, size: 32, offset: 416)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !275, file: !276, line: 144, baseType: !377, size: 32, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !275, file: !276, line: 145, baseType: !38, size: 64, offset: 480)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !275, file: !276, line: 147, baseType: !38, size: 64, offset: 544)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !275, file: !276, line: 148, baseType: !427, size: 16, offset: 608)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !428, line: 12, baseType: !429)
!428 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !24, line: 186, baseType: !371)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !275, file: !276, line: 154, baseType: !365, size: 32, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !275, file: !276, line: 155, baseType: !377, size: 32, offset: 672)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !275, file: !276, line: 157, baseType: !114, size: 32, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !275, file: !276, line: 159, baseType: !328, size: 64, offset: 736)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !275, file: !276, line: 161, baseType: !203, size: 32, offset: 800)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !275, file: !276, line: 163, baseType: !33, size: 32, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !275, file: !276, line: 165, baseType: !36, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !275, file: !276, line: 167, baseType: !36, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !275, file: !276, line: 169, baseType: !36, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !275, file: !276, line: 170, baseType: !36, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !275, file: !276, line: 171, baseType: !36, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !275, file: !276, line: 173, baseType: !36, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !275, file: !276, line: 174, baseType: !36, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !275, file: !276, line: 175, baseType: !36, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !275, file: !276, line: 176, baseType: !36, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !275, file: !276, line: 178, baseType: !36, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !275, file: !276, line: 179, baseType: !36, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !275, file: !276, line: 180, baseType: !36, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !275, file: !276, line: 181, baseType: !36, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !275, file: !276, line: 183, baseType: !36, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !260, file: !261, line: 48, baseType: !273, size: 32, offset: 480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !260, file: !261, line: 49, baseType: !33, size: 32, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !260, file: !261, line: 51, baseType: !453, size: 32, offset: 544)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !260, file: !261, line: 52, baseType: !33, size: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !260, file: !261, line: 53, baseType: !33, size: 32, offset: 608)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !260, file: !261, line: 55, baseType: !328, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !260, file: !261, line: 56, baseType: !33, size: 32, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !260, file: !261, line: 58, baseType: !83, size: 160, offset: 736)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !260, file: !261, line: 59, baseType: !83, size: 160, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !260, file: !261, line: 61, baseType: !83, size: 160, offset: 1056)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !260, file: !261, line: 62, baseType: !463, size: 96, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !316, line: 32, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !316, line: 37, size: 96, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !464, file: !316, line: 38, baseType: !322, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !464, file: !316, line: 39, baseType: !322, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !464, file: !316, line: 40, baseType: !469, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !316, line: 34, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !322, !322, !322}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !260, file: !261, line: 63, baseType: !315, size: 160, offset: 1312)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !260, file: !261, line: 65, baseType: !475, size: 224, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !476, line: 31, baseType: !477)
!476 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 25, size: 224, elements: !478)
!478 = !{!479, !487, !488, !489, !490}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !477, file: !476, line: 26, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !476, line: 16, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !476, line: 18, size: 96, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !482, file: !476, line: 19, baseType: !15, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !482, file: !476, line: 20, baseType: !33, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !476, line: 21, baseType: !480, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !477, file: !476, line: 27, baseType: !481, size: 96, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !477, file: !476, line: 28, baseType: !43, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !477, file: !476, line: 29, baseType: !33, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !477, file: !476, line: 30, baseType: !92, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !260, file: !261, line: 66, baseType: !475, size: 224, offset: 1696)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !260, file: !261, line: 68, baseType: !33, size: 32, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !260, file: !261, line: 69, baseType: !33, size: 32, offset: 1952)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !260, file: !261, line: 71, baseType: !273, size: 32, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !260, file: !261, line: 72, baseType: !280, size: 32, offset: 2016)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !260, file: !261, line: 73, baseType: !280, size: 32, offset: 2048)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !260, file: !261, line: 75, baseType: !258, size: 32, offset: 2080)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !260, file: !261, line: 77, baseType: !38, size: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !260, file: !261, line: 78, baseType: !38, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !260, file: !261, line: 79, baseType: !38, size: 64, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !260, file: !261, line: 80, baseType: !38, size: 64, offset: 2304)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !260, file: !261, line: 81, baseType: !38, size: 64, offset: 2368)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !260, file: !261, line: 82, baseType: !38, size: 64, offset: 2432)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !78, file: !68, line: 121, baseType: !92, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !78, file: !68, line: 122, baseType: !92, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !78, file: !68, line: 123, baseType: !507, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !68, line: 103, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 98, size: 1344, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !509, file: !68, line: 99, baseType: !130, size: 1216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !509, file: !68, line: 100, baseType: !114, size: 32, offset: 1216)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !509, file: !68, line: 101, baseType: !114, size: 32, offset: 1248)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !509, file: !68, line: 102, baseType: !33, size: 32, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !78, file: !68, line: 124, baseType: !184, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !78, file: !68, line: 126, baseType: !15, size: 32, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !78, file: !68, line: 127, baseType: !33, size: 32, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !78, file: !68, line: 128, baseType: !33, size: 32, offset: 288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !78, file: !68, line: 130, baseType: !520, size: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !68, line: 112, baseType: !73)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !78, file: !68, line: 131, baseType: !47, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !67, file: !68, line: 81, baseType: !33, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !67, file: !68, line: 82, baseType: !33, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !67, file: !68, line: 83, baseType: !15, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !54, line: 236, baseType: !33, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !53, file: !54, line: 238, baseType: !527, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !184}
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !34, line: 78, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !24, line: 140, baseType: !122)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !53, file: !54, line: 240, baseType: !533, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DISubroutineType(types: !535)
!535 = !{!530, !258}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !53, file: !54, line: 242, baseType: !533, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !53, file: !54, line: 243, baseType: !533, size: 32, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !53, file: !54, line: 244, baseType: !539, size: 32, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !258}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !53, file: !54, line: 245, baseType: !539, size: 32, offset: 480)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !53, file: !54, line: 247, baseType: !539, size: 32, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !53, file: !54, line: 249, baseType: !35, size: 32, offset: 544)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !53, file: !54, line: 250, baseType: !35, size: 32, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !53, file: !54, line: 251, baseType: !35, size: 32, offset: 608)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !53, file: !54, line: 252, baseType: !35, size: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !53, file: !54, line: 253, baseType: !35, size: 32, offset: 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !53, file: !54, line: 254, baseType: !35, size: 32, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !53, file: !54, line: 255, baseType: !35, size: 32, offset: 736)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !53, file: !54, line: 256, baseType: !35, size: 32, offset: 768)
!552 = !DIGlobalVariableExpression(var: !553)
!553 = distinct !DIGlobalVariable(name: "ngx_http_next_header_filter", scope: !2, file: !3, line: 146, type: !554, isLocal: true, isDefinition: true)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_output_header_filter_pt", file: !555, line: 521, baseType: !556)
!555 = !DIFile(filename: "src/http/ngx_http_core_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DISubroutineType(types: !558)
!558 = !{!530, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_request_t", file: !561, line: 16, baseType: !562)
!561 = !DIFile(filename: "src/http/ngx_http.h", directory: "/home/sam/Projects/nginx-1.12.2")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_request_s", file: !563, line: 364, size: 5376, elements: !564)
!563 = !DIFile(filename: "src/http/ngx_http_request.h", directory: "/home/sam/Projects/nginx-1.12.2")
!564 = !{!565, !567, !568, !569, !570, !571, !572, !577, !578, !791, !1339, !1340, !1341, !1342, !1381, !1411, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1456, !1467, !1474, !1475, !1477, !1478, !1491, !1492, !1493, !1494, !1495, !1496, !1682, !1686, !1691, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !562, file: !563, line: 365, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 191, baseType: !36)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !562, file: !563, line: 367, baseType: !273, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !562, file: !563, line: 369, baseType: !266, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "main_conf", scope: !562, file: !563, line: 370, baseType: !266, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "srv_conf", scope: !562, file: !563, line: 371, baseType: !266, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "loc_conf", scope: !562, file: !563, line: 372, baseType: !266, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !562, file: !563, line: 374, baseType: !573, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_event_handler_pt", file: !563, line: 361, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !559}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !562, file: !563, line: 375, baseType: !573, size: 32, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !562, file: !563, line: 378, baseType: !579, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_cache_t", file: !561, line: 18, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_cache_s", file: !582, line: 65, size: 3008, elements: !583)
!582 = !DIFile(filename: "src/http/ngx_http_cache.h", directory: "/home/sam/Projects/nginx-1.12.2")
!583 = !{!584, !585, !586, !587, !591, !592, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !749, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !581, file: !582, line: 66, baseType: !130, size: 1216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !581, file: !582, line: 67, baseType: !83, size: 160, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !581, file: !582, line: 68, baseType: !566, size: 32, offset: 1376)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !581, file: !582, line: 69, baseType: !588, size: 128, offset: 1408)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !581, file: !582, line: 70, baseType: !588, size: 128, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !581, file: !582, line: 72, baseType: !593, size: 32, offset: 1664)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_uniq_t", file: !136, line: 18, baseType: !147)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !581, file: !582, line: 73, baseType: !23, size: 32, offset: 1696)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "updating_sec", scope: !581, file: !582, line: 74, baseType: !23, size: 32, offset: 1728)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "error_sec", scope: !581, file: !582, line: 75, baseType: !23, size: 32, offset: 1760)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !581, file: !582, line: 76, baseType: !23, size: 32, offset: 1792)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !581, file: !582, line: 77, baseType: !23, size: 32, offset: 1824)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !581, file: !582, line: 79, baseType: !38, size: 64, offset: 1856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vary", scope: !581, file: !582, line: 80, baseType: !38, size: 64, offset: 1920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "variant", scope: !581, file: !582, line: 81, baseType: !588, size: 128, offset: 1984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "header_start", scope: !581, file: !582, line: 83, baseType: !43, size: 32, offset: 2112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !581, file: !582, line: 84, baseType: !43, size: 32, offset: 2144)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !581, file: !582, line: 85, baseType: !121, size: 32, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !581, file: !582, line: 86, baseType: !121, size: 32, offset: 2208)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "min_uses", scope: !581, file: !582, line: 88, baseType: !33, size: 32, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !581, file: !582, line: 89, baseType: !33, size: 32, offset: 2272)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !581, file: !582, line: 90, baseType: !33, size: 32, offset: 2304)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vary_tag", scope: !581, file: !582, line: 91, baseType: !33, size: 32, offset: 2336)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !581, file: !582, line: 93, baseType: !114, size: 32, offset: 2368)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "file_cache", scope: !581, file: !582, line: 95, baseType: !612, size: 32, offset: 2400)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_t", file: !561, line: 19, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_file_cache_s", file: !582, line: 157, size: 544, elements: !615)
!615 = !{!616, !631, !692, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !748}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !614, file: !582, line: 158, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_sh_t", file: !582, line: 154, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 145, size: 480, elements: !620)
!620 = !{!621, !622, !623, !624, !627, !628, !629, !630}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rbtree", scope: !619, file: !582, line: 146, baseType: !463, size: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !619, file: !582, line: 147, baseType: !315, size: 160, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !619, file: !582, line: 148, baseType: !328, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cold", scope: !619, file: !582, line: 149, baseType: !625, size: 32, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !204, line: 106, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !203)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "loading", scope: !619, file: !582, line: 150, baseType: !625, size: 32, offset: 352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !582, line: 151, baseType: !121, size: 32, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !619, file: !582, line: 152, baseType: !33, size: 32, offset: 416)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "watermark", scope: !619, file: !582, line: 153, baseType: !33, size: 32, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "shpool", scope: !614, file: !582, line: 159, baseType: !632, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !634, line: 59, baseType: !635)
!634 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 34, size: 800, elements: !636)
!636 = !{!637, !644, !645, !646, !654, !655, !656, !665, !666, !667, !668, !687, !688, !689, !690, !691}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !634, line: 35, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !639, line: 21, baseType: !640)
!639 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 16, size: 64, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !640, file: !639, line: 17, baseType: !625, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !640, file: !639, line: 19, baseType: !625, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !635, file: !634, line: 37, baseType: !43, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !635, file: !634, line: 38, baseType: !43, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !635, file: !634, line: 40, baseType: !647, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !634, line: 16, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !634, line: 18, size: 96, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !649, file: !634, line: 19, baseType: !35, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !634, line: 20, baseType: !647, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !634, line: 21, baseType: !35, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !635, file: !634, line: 41, baseType: !647, size: 32, offset: 160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !635, file: !634, line: 42, baseType: !648, size: 96, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !635, file: !634, line: 44, baseType: !657, size: 32, offset: 288)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !634, line: 31, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 25, size: 128, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !659, file: !634, line: 26, baseType: !33, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !659, file: !634, line: 27, baseType: !33, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !659, file: !634, line: 29, baseType: !33, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !659, file: !634, line: 30, baseType: !33, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !635, file: !634, line: 45, baseType: !33, size: 32, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !635, file: !634, line: 47, baseType: !16, size: 32, offset: 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !635, file: !634, line: 48, baseType: !16, size: 32, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !635, file: !634, line: 50, baseType: !669, size: 256, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !639, line: 37, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 24, size: 256, elements: !671)
!671 = !{!672, !674, !675, !676, !686}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !670, file: !639, line: 26, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !670, file: !639, line: 28, baseType: !673, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !670, file: !639, line: 29, baseType: !33, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !670, file: !639, line: 30, baseType: !677, size: 128, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !678, line: 19, baseType: !679)
!678 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 17, size: 128, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !679, file: !678, line: 18, baseType: !682, size: 128)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 128, elements: !684)
!683 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !122)
!684 = !{!685}
!685 = !DISubrange(count: 4)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !670, file: !639, line: 36, baseType: !33, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !635, file: !634, line: 52, baseType: !16, size: 32, offset: 672)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !635, file: !634, line: 53, baseType: !17, size: 8, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !635, file: !634, line: 55, baseType: !36, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !635, file: !634, line: 57, baseType: !15, size: 32, offset: 736)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !635, file: !634, line: 58, baseType: !15, size: 32, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !614, file: !582, line: 161, baseType: !693, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !132, line: 62, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 50, size: 384, elements: !696)
!696 = !{!697, !698, !699, !701, !706, !708, !710, !711, !712}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !132, line: 51, baseType: !38, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !695, file: !132, line: 52, baseType: !43, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !695, file: !132, line: 53, baseType: !700, size: 96, offset: 96)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 96, elements: !179)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !695, file: !132, line: 55, baseType: !702, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !132, line: 45, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DISubroutineType(types: !705)
!705 = !{!395, !15}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !695, file: !132, line: 56, baseType: !707, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !132, line: 46, baseType: !703)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !695, file: !132, line: 57, baseType: !709, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !132, line: 47, baseType: !251)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !695, file: !132, line: 58, baseType: !15, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !695, file: !132, line: 60, baseType: !16, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !695, file: !132, line: 61, baseType: !33, size: 32, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !614, file: !582, line: 163, baseType: !121, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bsize", scope: !614, file: !582, line: 164, baseType: !43, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "inactive", scope: !614, file: !582, line: 166, baseType: !23, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fail_time", scope: !614, file: !582, line: 168, baseType: !23, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !614, file: !582, line: 170, baseType: !33, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "loader_files", scope: !614, file: !582, line: 171, baseType: !33, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !614, file: !582, line: 172, baseType: !395, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "loader_sleep", scope: !614, file: !582, line: 173, baseType: !395, size: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "loader_threshold", scope: !614, file: !582, line: 174, baseType: !395, size: 32, offset: 352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "manager_files", scope: !614, file: !582, line: 176, baseType: !33, size: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "manager_sleep", scope: !614, file: !582, line: 177, baseType: !395, size: 32, offset: 416)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "manager_threshold", scope: !614, file: !582, line: 178, baseType: !395, size: 32, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "shm_zone", scope: !614, file: !582, line: 180, baseType: !726, size: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !261, line: 25, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !261, line: 29, size: 320, elements: !729)
!729 = !{!730, !731, !741, !746, !747}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !728, file: !261, line: 30, baseType: !15, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !728, file: !261, line: 31, baseType: !732, size: 192, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !733, line: 22, baseType: !734)
!733 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !733, line: 16, size: 192, elements: !735)
!735 = !{!736, !737, !738, !739, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !734, file: !733, line: 17, baseType: !16, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !734, file: !733, line: 18, baseType: !43, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !733, line: 19, baseType: !38, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !734, file: !733, line: 20, baseType: !184, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !734, file: !733, line: 21, baseType: !33, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !728, file: !261, line: 32, baseType: !742, size: 32, offset: 224)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !261, line: 27, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DISubroutineType(types: !745)
!745 = !{!530, !726, !15}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !728, file: !261, line: 33, baseType: !15, size: 32, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !728, file: !261, line: 34, baseType: !33, size: 32, offset: 288)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "use_temp_path", scope: !614, file: !582, line: 182, baseType: !33, size: 32, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !581, file: !582, line: 96, baseType: !750, size: 32, offset: 2432)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_file_cache_node_t", file: !582, line: 62, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 39, size: 576, elements: !753)
!753 = !{!754, !755, !756, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !752, file: !582, line: 40, baseType: !315, size: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !752, file: !582, line: 41, baseType: !328, size: 64, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !752, file: !582, line: 43, baseType: !757, size: 96, offset: 224)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 96, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 12)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !752, file: !582, line: 46, baseType: !36, size: 20, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "uses", scope: !752, file: !582, line: 47, baseType: !36, size: 10, offset: 340, flags: DIFlagBitField, extraData: i64 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "valid_msec", scope: !752, file: !582, line: 48, baseType: !36, size: 10, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !752, file: !582, line: 49, baseType: !36, size: 10, offset: 362, flags: DIFlagBitField, extraData: i64 352)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !752, file: !582, line: 50, baseType: !36, size: 1, offset: 372, flags: DIFlagBitField, extraData: i64 352)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !752, file: !582, line: 51, baseType: !36, size: 1, offset: 373, flags: DIFlagBitField, extraData: i64 352)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "deleting", scope: !752, file: !582, line: 52, baseType: !36, size: 1, offset: 374, flags: DIFlagBitField, extraData: i64 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !752, file: !582, line: 53, baseType: !36, size: 1, offset: 375, flags: DIFlagBitField, extraData: i64 352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !752, file: !582, line: 56, baseType: !593, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !752, file: !582, line: 57, baseType: !23, size: 32, offset: 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sec", scope: !752, file: !582, line: 58, baseType: !23, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "body_start", scope: !752, file: !582, line: 59, baseType: !43, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fs_size", scope: !752, file: !582, line: 60, baseType: !121, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !752, file: !582, line: 61, baseType: !395, size: 32, offset: 544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lock_timeout", scope: !581, file: !582, line: 102, baseType: !395, size: 32, offset: 2464)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lock_age", scope: !581, file: !582, line: 103, baseType: !395, size: 32, offset: 2496)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lock_time", scope: !581, file: !582, line: 104, baseType: !395, size: 32, offset: 2528)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "wait_time", scope: !581, file: !582, line: 105, baseType: !395, size: 32, offset: 2560)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "wait_event", scope: !581, file: !582, line: 107, baseType: !281, size: 384, offset: 2592)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !581, file: !582, line: 109, baseType: !36, size: 1, offset: 2976, flags: DIFlagBitField, extraData: i64 2976)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !581, file: !582, line: 110, baseType: !36, size: 1, offset: 2977, flags: DIFlagBitField, extraData: i64 2976)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "updated", scope: !581, file: !582, line: 112, baseType: !36, size: 1, offset: 2978, flags: DIFlagBitField, extraData: i64 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "updating", scope: !581, file: !582, line: 113, baseType: !36, size: 1, offset: 2979, flags: DIFlagBitField, extraData: i64 2976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !581, file: !582, line: 114, baseType: !36, size: 1, offset: 2980, flags: DIFlagBitField, extraData: i64 2976)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !581, file: !582, line: 115, baseType: !36, size: 1, offset: 2981, flags: DIFlagBitField, extraData: i64 2976)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "purged", scope: !581, file: !582, line: 116, baseType: !36, size: 1, offset: 2982, flags: DIFlagBitField, extraData: i64 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !581, file: !582, line: 117, baseType: !36, size: 1, offset: 2983, flags: DIFlagBitField, extraData: i64 2976)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !581, file: !582, line: 118, baseType: !36, size: 1, offset: 2984, flags: DIFlagBitField, extraData: i64 2976)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !581, file: !582, line: 119, baseType: !36, size: 1, offset: 2985, flags: DIFlagBitField, extraData: i64 2976)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stale_updating", scope: !581, file: !582, line: 121, baseType: !36, size: 1, offset: 2986, flags: DIFlagBitField, extraData: i64 2976)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stale_error", scope: !581, file: !582, line: 122, baseType: !36, size: 1, offset: 2987, flags: DIFlagBitField, extraData: i64 2976)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !562, file: !563, line: 381, baseType: !792, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_t", file: !561, line: 17, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_http_upstream_s", file: !795, line: 313, size: 4096, elements: !796)
!795 = !DIFile(filename: "src/http/ngx_http_upstream.h", directory: "/home/sam/Projects/nginx-1.12.2")
!796 = !{!797, !802, !803, !844, !923, !924, !946, !955, !1077, !1078, !1079, !1109, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1287, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1301, !1305, !1309, !1310, !1322, !1323, !1324, !1325, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "read_event_handler", scope: !794, file: !795, line: 314, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_http_upstream_handler_pt", file: !795, line: 309, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !559, !792}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "write_event_handler", scope: !794, file: !795, line: 315, baseType: !798, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !794, file: !795, line: 317, baseType: !804, size: 480, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !805, line: 22, baseType: !806)
!805 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !805, line: 36, size: 480, elements: !807)
!807 = !{!808, !809, !810, !811, !813, !814, !815, !821, !826, !828, !829, !838, !839, !840, !841, !842, !843}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !806, file: !805, line: 37, baseType: !273, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !806, file: !805, line: 39, baseType: !365, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !806, file: !805, line: 40, baseType: !377, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !806, file: !805, line: 41, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !806, file: !805, line: 43, baseType: !33, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !806, file: !805, line: 44, baseType: !395, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !806, file: !805, line: 46, baseType: !816, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !805, line: 24, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{!530, !820, !15}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !806, file: !805, line: 47, baseType: !822, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !805, line: 26, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !820, !15, !33}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !806, file: !805, line: 48, baseType: !827, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !805, line: 28, baseType: !823)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !806, file: !805, line: 49, baseType: !15, size: 32, offset: 288)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !806, file: !805, line: 56, baseType: !830, size: 32, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !832, line: 78, baseType: !833)
!832 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !832, line: 74, size: 128, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !833, file: !832, line: 75, baseType: !365, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !833, file: !832, line: 76, baseType: !377, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !833, file: !832, line: 77, baseType: !38, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !806, file: !805, line: 58, baseType: !122, size: 32, offset: 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !806, file: !805, line: 59, baseType: !122, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !806, file: !805, line: 61, baseType: !184, size: 32, offset: 416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !806, file: !805, line: 63, baseType: !36, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !806, file: !805, line: 64, baseType: !36, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !806, file: !805, line: 67, baseType: !36, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !794, file: !795, line: 319, baseType: !845, size: 32, offset: 544)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !847, line: 17, baseType: !848)
!847 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !847, line: 25, size: 1120, elements: !849)
