; ModuleID = 'src/event/ngx_event.c'
source_filename = "src/event/ngx_event.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_core_module_t = type { %struct.ngx_str_t, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "connection_counter", scope: !2, file: !3, line: 47, type: !251, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !270)
!3 = !DIFile(filename: "src/event/ngx_event.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !15, !16, !18, !19, !10, !20, !23, !35, !66, !250, !253, !260, !268}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !7, line: 16, baseType: !8)
!7 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !9, line: 16, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !11, line: 79, baseType: !12)
!11 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 125, baseType: !14)
!13 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_conf_t", file: !25, line: 117, baseType: !26)
!25 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 86, size: 928, elements: !27)
!27 = !{!28, !31, !32, !33, !34, !36, !37, !38, !40, !41, !42, !43, !49, !51, !55, !58, !70, !71, !72, !73, !248}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !26, file: !25, line: 87, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !11, line: 80, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !13, line: 140, baseType: !15)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !26, file: !25, line: 88, baseType: !29, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "timer_resolution", scope: !26, file: !25, line: 90, baseType: !6, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timeout", scope: !26, file: !25, line: 91, baseType: !6, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "worker_processes", scope: !26, file: !25, line: 93, baseType: !35, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !11, line: 78, baseType: !30)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "debug_points", scope: !26, file: !25, line: 94, baseType: !35, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_nofile", scope: !26, file: !25, line: 96, baseType: !35, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_core", scope: !26, file: !25, line: 97, baseType: !39, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !13, line: 222, baseType: !15)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !26, file: !25, line: 99, baseType: !15, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_auto", scope: !26, file: !25, line: 101, baseType: !10, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_n", scope: !26, file: !25, line: 102, baseType: !10, size: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity", scope: !26, file: !25, line: 103, baseType: !44, size: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cpuset_t", file: !46, line: 32, baseType: !47)
!46 = !DIFile(filename: "src/os/unix/ngx_setaffinity.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 196, baseType: !48)
!48 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !26, file: !25, line: 105, baseType: !50, size: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !26, file: !25, line: 106, baseType: !52, size: 32, offset: 416)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !53, line: 16, baseType: !54)
!53 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !13, line: 304, baseType: !14)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !26, file: !25, line: 107, baseType: !56, size: 32, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_gid_t", file: !53, line: 17, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !13, line: 309, baseType: !14)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "working_directory", scope: !26, file: !25, line: 109, baseType: !59, size: 64, offset: 480)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !60, line: 19, baseType: !61)
!60 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 16, size: 64, elements: !62)
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !61, file: !60, line: 17, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 120, baseType: !14)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !60, line: 18, baseType: !66, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !68, line: 64, baseType: !69)
!68 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !26, file: !25, line: 110, baseType: !59, size: 64, offset: 544)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !26, file: !25, line: 112, baseType: !59, size: 64, offset: 608)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "oldpid", scope: !26, file: !25, line: 113, baseType: !59, size: 64, offset: 672)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !26, file: !25, line: 115, baseType: !74, size: 160, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !75, line: 22, baseType: !76)
!75 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 16, size: 160, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !76, file: !75, line: 17, baseType: !18, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !76, file: !75, line: 18, baseType: !10, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !76, file: !75, line: 19, baseType: !64, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !76, file: !75, line: 20, baseType: !10, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !76, file: !75, line: 21, baseType: !83, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !85, line: 18, baseType: !86)
!85 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !87, line: 57, size: 320, elements: !88)
!87 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = !{!89, !97, !98, !99, !228, !235, !247}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !86, file: !87, line: 58, baseType: !90, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !87, line: 54, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 49, size: 128, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !91, file: !87, line: 50, baseType: !66, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !91, file: !87, line: 51, baseType: !66, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !87, line: 52, baseType: !83, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !91, file: !87, line: 53, baseType: !10, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !86, file: !87, line: 59, baseType: !64, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !86, file: !87, line: 60, baseType: !83, size: 32, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !86, file: !87, line: 61, baseType: !100, size: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !85, line: 19, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !103, line: 59, size: 64, elements: !104)
!103 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!104 = !{!105, !227}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !102, file: !103, line: 60, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !103, line: 18, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !103, line: 20, size: 352, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !118, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !108, file: !103, line: 21, baseType: !66, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !103, line: 22, baseType: !66, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !108, file: !103, line: 23, baseType: !39, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !108, file: !103, line: 24, baseType: !39, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !108, file: !103, line: 26, baseType: !66, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !108, file: !103, line: 27, baseType: !66, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !108, file: !103, line: 28, baseType: !117, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !103, line: 16, baseType: !18)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !108, file: !103, line: 29, baseType: !119, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !85, line: 23, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !122, line: 16, size: 1216, elements: !123)
!122 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !{!124, !127, !128, !171, !172, !173, !212, !213}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !121, file: !122, line: 17, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !126, line: 16, baseType: !15)
!126 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !122, line: 18, baseType: !59, size: 64, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !121, file: !122, line: 19, baseType: !129, size: 960, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !126, line: 17, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !131, line: 4, size: 960, elements: !132)
!131 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!132 = !{!133, !135, !136, !138, !139, !141, !142, !144, !145, !146, !147, !148, !149, !150, !151, !154, !155, !157, !158, !164, !165, !166}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !130, file: !131, line: 6, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !13, line: 232, baseType: !14)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !130, file: !131, line: 7, baseType: !134, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !130, file: !131, line: 8, baseType: !137, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !13, line: 227, baseType: !14)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !130, file: !131, line: 9, baseType: !137, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !130, file: !131, line: 10, baseType: !140, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !13, line: 217, baseType: !14)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !130, file: !131, line: 11, baseType: !140, size: 32, offset: 160)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !130, file: !131, line: 13, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !13, line: 212, baseType: !14)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !130, file: !131, line: 14, baseType: !54, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !130, file: !131, line: 15, baseType: !57, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !130, file: !131, line: 16, baseType: !14, size: 32, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !130, file: !131, line: 17, baseType: !134, size: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !130, file: !131, line: 18, baseType: !134, size: 32, offset: 352)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !130, file: !131, line: 19, baseType: !39, size: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !130, file: !131, line: 20, baseType: !39, size: 32, offset: 416)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !130, file: !131, line: 21, baseType: !152, size: 32, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !13, line: 237, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !130, file: !131, line: 22, baseType: !152, size: 32, offset: 480)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !130, file: !131, line: 23, baseType: !156, size: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !13, line: 242, baseType: !15)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !130, file: !131, line: 24, baseType: !156, size: 32, offset: 544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !130, file: !131, line: 26, baseType: !159, size: 64, offset: 576)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !13, line: 288, size: 64, elements: !160)
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !159, file: !13, line: 288, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !13, line: 75, baseType: !153)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !159, file: !13, line: 288, baseType: !153, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !130, file: !131, line: 27, baseType: !159, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !130, file: !131, line: 28, baseType: !159, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !130, file: !131, line: 29, baseType: !167, size: 192, offset: 768)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 192, elements: !169)
!168 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!169 = !{!170}
!170 = !DISubrange(count: 3)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !121, file: !122, line: 21, baseType: !39, size: 32, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !121, file: !122, line: 22, baseType: !39, size: 32, offset: 1120)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !121, file: !122, line: 24, baseType: !174, size: 32, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !85, line: 20, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !177, line: 50, size: 320, elements: !178)
!177 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!178 = !{!179, !180, !193, !197, !198, !203, !204, !209, !210, !211}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !176, file: !177, line: 51, baseType: !10, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !176, file: !177, line: 52, baseType: !181, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !85, line: 21, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !184, line: 89, size: 160, elements: !185)
!184 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!185 = !{!186, !187, !188, !192}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !183, file: !184, line: 90, baseType: !125, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !184, line: 91, baseType: !59, size: 64, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !183, file: !184, line: 93, baseType: !189, size: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !181, !174}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !184, line: 94, baseType: !18, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !176, file: !177, line: 54, baseType: !194, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !195, line: 98, baseType: !196)
!195 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!196 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !176, file: !177, line: 56, baseType: !162, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !176, file: !177, line: 58, baseType: !199, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !177, line: 45, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{!66, !174, !66, !64}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !177, line: 59, baseType: !18, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !176, file: !177, line: 61, baseType: !205, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !177, line: 46, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !174, !10, !66, !64}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !176, file: !177, line: 62, baseType: !18, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !176, file: !177, line: 70, baseType: !50, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !177, line: 72, baseType: !174, size: 32, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !121, file: !122, line: 37, baseType: !14, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !121, file: !122, line: 38, baseType: !14, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !108, file: !103, line: 30, baseType: !106, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !108, file: !103, line: 34, baseType: !14, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !108, file: !103, line: 40, baseType: !14, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !108, file: !103, line: 43, baseType: !14, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !108, file: !103, line: 45, baseType: !14, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !108, file: !103, line: 46, baseType: !14, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !108, file: !103, line: 47, baseType: !14, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !108, file: !103, line: 48, baseType: !14, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !108, file: !103, line: 49, baseType: !14, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !108, file: !103, line: 50, baseType: !14, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !108, file: !103, line: 52, baseType: !14, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !108, file: !103, line: 53, baseType: !14, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !108, file: !103, line: 55, baseType: !15, size: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !103, line: 61, baseType: !100, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !86, file: !87, line: 62, baseType: !229, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !87, line: 41, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !87, line: 43, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !87, line: 44, baseType: !229, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !231, file: !87, line: 45, baseType: !18, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !86, file: !87, line: 63, baseType: !236, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !87, line: 32, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !87, line: 34, size: 96, elements: !239)
!239 = !{!240, !245, !246}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !238, file: !87, line: 35, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !87, line: 30, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !18}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !87, line: 36, baseType: !18, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !87, line: 37, baseType: !236, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !86, file: !87, line: 64, baseType: !174, size: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "environment", scope: !26, file: !25, line: 116, baseType: !249, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !195, line: 106, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !255, line: 21, baseType: !256)
!255 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 16, size: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !256, file: !255, line: 17, baseType: !251, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !256, file: !255, line: 19, baseType: !251, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !262, line: 20, baseType: !263)
!262 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 16, size: 96, elements: !264)
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !263, file: !262, line: 17, baseType: !162, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !263, file: !262, line: 18, baseType: !10, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !263, file: !262, line: 19, baseType: !35, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !269, line: 17, baseType: !15)
!269 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!270 = !{!271, !273, !590, !592, !594, !598, !600, !633, !635, !654, !656, !658, !660, !662, !0, !664, !678, !683, !685, !695, !697}
!271 = !DIGlobalVariableExpression(var: !272)
!272 = distinct !DIGlobalVariable(name: "ngx_connection_counter", scope: !2, file: !3, line: 48, type: !250, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274)
!274 = distinct !DIGlobalVariable(name: "ngx_events_module", scope: !2, file: !3, line: 101, type: !275, isLocal: false, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !85, line: 15, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !277, line: 222, size: 800, elements: !278)
!277 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !565, !566, !570, !574, !575, !576, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !276, file: !277, line: 223, baseType: !10, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !276, file: !277, line: 224, baseType: !10, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 226, baseType: !50, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !276, file: !277, line: 228, baseType: !10, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !276, file: !277, line: 229, baseType: !10, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !276, file: !277, line: 231, baseType: !10, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !276, file: !277, line: 232, baseType: !20, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !276, file: !277, line: 234, baseType: !18, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !276, file: !277, line: 235, baseType: !288, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !85, line: 22, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !184, line: 77, size: 224, elements: !291)
!291 = !{!292, !293, !294, !562, !563, !564}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !184, line: 78, baseType: !59, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !184, line: 79, baseType: !10, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !290, file: !184, line: 80, baseType: !295, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!50, !298, !288, !18}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !85, line: 16, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !184, line: 116, size: 384, elements: !301)
!301 = !{!302, !303, !305, !544, !545, !546, !555, !556, !557, !558, !559, !561}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !184, line: 117, baseType: !50, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !300, file: !184, line: 118, baseType: !304, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !300, file: !184, line: 120, baseType: !306, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !85, line: 17, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !25, line: 38, size: 2496, elements: !309)
!309 = !{!310, !313, !314, !315, !316, !317, !490, !491, !492, !495, !496, !497, !498, !499, !500, !501, !502, !513, !514, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !308, file: !25, line: 39, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !308, file: !25, line: 40, baseType: !83, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !308, file: !25, line: 42, baseType: !174, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !308, file: !25, line: 43, baseType: !175, size: 320, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !308, file: !25, line: 45, baseType: !10, size: 32, offset: 416)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !308, file: !25, line: 47, baseType: !318, size: 32, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !85, line: 26, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !322, line: 121, size: 896, elements: !323)
!322 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!323 = !{!324, !325, !379, !380, !381, !388, !390, !395, !400, !458, !459, !460, !461, !462, !463, !464, !465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !322, line: 122, baseType: !18, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !321, file: !322, line: 123, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !85, line: 24, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !329, line: 30, size: 384, elements: !330)
!329 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !358, !359, !360, !371}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !329, line: 31, baseType: !18, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !328, file: !329, line: 33, baseType: !14, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !328, file: !329, line: 35, baseType: !14, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !328, file: !329, line: 38, baseType: !14, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !328, file: !329, line: 44, baseType: !14, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !328, file: !329, line: 46, baseType: !14, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !328, file: !329, line: 49, baseType: !14, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !328, file: !329, line: 51, baseType: !14, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !328, file: !329, line: 54, baseType: !14, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !328, file: !329, line: 56, baseType: !14, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !328, file: !329, line: 57, baseType: !14, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !328, file: !329, line: 59, baseType: !14, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !328, file: !329, line: 60, baseType: !14, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !328, file: !329, line: 62, baseType: !14, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !328, file: !329, line: 64, baseType: !14, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !328, file: !329, line: 67, baseType: !14, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !328, file: !329, line: 69, baseType: !14, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !328, file: !329, line: 71, baseType: !14, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !328, file: !329, line: 74, baseType: !14, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !328, file: !329, line: 75, baseType: !14, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !328, file: !329, line: 77, baseType: !14, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !328, file: !329, line: 107, baseType: !14, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !328, file: !329, line: 110, baseType: !354, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !85, line: 31, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !326}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !328, file: !329, line: 117, baseType: !10, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !328, file: !329, line: 119, baseType: !174, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !328, file: !329, line: 121, baseType: !361, size: 160, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !9, line: 20, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !9, line: 22, size: 160, elements: !363)
!363 = !{!364, !365, !367, !368, !369, !370}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !362, file: !9, line: 23, baseType: !8, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !362, file: !9, line: 24, baseType: !366, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !362, file: !9, line: 25, baseType: !366, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !362, file: !9, line: 26, baseType: !366, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !362, file: !9, line: 27, baseType: !67, size: 8, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !9, line: 28, baseType: !67, size: 8, offset: 136)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !328, file: !329, line: 124, baseType: !372, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !373, line: 16, baseType: !374)
!373 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !373, line: 18, size: 64, elements: !375)
!375 = !{!376, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !373, line: 19, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !373, line: 20, baseType: !377, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !321, file: !322, line: 124, baseType: !326, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !321, file: !322, line: 126, baseType: !268, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !321, file: !322, line: 128, baseType: !382, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !383, line: 19, baseType: !384)
!383 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !319, !66, !64}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 135, baseType: !15)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !321, file: !322, line: 129, baseType: !389, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !383, line: 22, baseType: !384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !321, file: !322, line: 130, baseType: !391, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !383, line: 20, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DISubroutineType(types: !394)
!394 = !{!387, !319, !100, !39}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !321, file: !322, line: 131, baseType: !396, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !383, line: 23, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DISubroutineType(types: !399)
!399 = !{!100, !319, !100, !39}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !321, file: !322, line: 133, baseType: !401, size: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !322, line: 16, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !322, line: 18, size: 960, elements: !404)
!404 = !{!405, !406, !418, !420, !421, !422, !423, !424, !425, !426, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !403, file: !322, line: 19, baseType: !268, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !403, file: !322, line: 21, baseType: !407, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !409, line: 297, size: 128, elements: !410)
!409 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!410 = !{!411, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !408, file: !409, line: 298, baseType: !412, size: 16)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !13, line: 409, baseType: !413)
!413 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !408, file: !409, line: 299, baseType: !415, size: 112, offset: 16)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 112, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 14)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !403, file: !322, line: 22, baseType: !419, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !13, line: 404, baseType: !14)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !403, file: !322, line: 23, baseType: !64, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !403, file: !322, line: 24, baseType: !59, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !322, line: 26, baseType: !15, size: 32, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !403, file: !322, line: 28, baseType: !15, size: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !403, file: !322, line: 29, baseType: !15, size: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !403, file: !322, line: 30, baseType: !15, size: 32, offset: 288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !403, file: !322, line: 38, baseType: !427, size: 32, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !85, line: 32, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !319}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !403, file: !322, line: 40, baseType: !18, size: 32, offset: 352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !403, file: !322, line: 42, baseType: !175, size: 320, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !403, file: !322, line: 43, baseType: !174, size: 32, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !403, file: !322, line: 45, baseType: !64, size: 32, offset: 736)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !403, file: !322, line: 47, baseType: !64, size: 32, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !403, file: !322, line: 49, baseType: !6, size: 32, offset: 800)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !403, file: !322, line: 51, baseType: !401, size: 32, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !403, file: !322, line: 52, baseType: !319, size: 32, offset: 864)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !403, file: !322, line: 54, baseType: !10, size: 32, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !403, file: !322, line: 56, baseType: !14, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !403, file: !322, line: 57, baseType: !14, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !403, file: !322, line: 58, baseType: !14, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !403, file: !322, line: 60, baseType: !14, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !403, file: !322, line: 61, baseType: !14, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !403, file: !322, line: 62, baseType: !14, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !403, file: !322, line: 63, baseType: !14, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !403, file: !322, line: 64, baseType: !14, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !403, file: !322, line: 65, baseType: !14, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !403, file: !322, line: 66, baseType: !14, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !403, file: !322, line: 67, baseType: !14, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !403, file: !322, line: 70, baseType: !14, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !403, file: !322, line: 72, baseType: !14, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !403, file: !322, line: 73, baseType: !14, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !403, file: !322, line: 74, baseType: !14, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !403, file: !322, line: 76, baseType: !14, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !403, file: !322, line: 77, baseType: !14, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !403, file: !322, line: 78, baseType: !14, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !321, file: !322, line: 135, baseType: !39, size: 32, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !321, file: !322, line: 137, baseType: !174, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !321, file: !322, line: 139, baseType: !83, size: 32, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !322, line: 141, baseType: !15, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !321, file: !322, line: 143, baseType: !407, size: 32, offset: 416)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !321, file: !322, line: 144, baseType: !419, size: 32, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !321, file: !322, line: 145, baseType: !59, size: 64, offset: 480)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !321, file: !322, line: 147, baseType: !59, size: 64, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !321, file: !322, line: 148, baseType: !467, size: 16, offset: 608)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !468, line: 12, baseType: !469)
!468 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 186, baseType: !413)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !321, file: !322, line: 154, baseType: !407, size: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !321, file: !322, line: 155, baseType: !419, size: 32, offset: 672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !321, file: !322, line: 157, baseType: !106, size: 32, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !321, file: !322, line: 159, baseType: !372, size: 64, offset: 736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !321, file: !322, line: 161, baseType: !194, size: 32, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !321, file: !322, line: 163, baseType: !10, size: 32, offset: 832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !321, file: !322, line: 165, baseType: !14, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !321, file: !322, line: 167, baseType: !14, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !321, file: !322, line: 169, baseType: !14, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !321, file: !322, line: 170, baseType: !14, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !321, file: !322, line: 171, baseType: !14, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !321, file: !322, line: 173, baseType: !14, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !321, file: !322, line: 174, baseType: !14, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !321, file: !322, line: 175, baseType: !14, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !321, file: !322, line: 176, baseType: !14, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !321, file: !322, line: 178, baseType: !14, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !321, file: !322, line: 179, baseType: !14, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !321, file: !322, line: 180, baseType: !14, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !321, file: !322, line: 181, baseType: !14, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !321, file: !322, line: 183, baseType: !14, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !308, file: !25, line: 48, baseType: !319, size: 32, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !308, file: !25, line: 49, baseType: !10, size: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !308, file: !25, line: 51, baseType: !493, size: 32, offset: 544)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !308, file: !25, line: 52, baseType: !10, size: 32, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !308, file: !25, line: 53, baseType: !10, size: 32, offset: 608)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !308, file: !25, line: 55, baseType: !372, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !308, file: !25, line: 56, baseType: !10, size: 32, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !308, file: !25, line: 58, baseType: !74, size: 160, offset: 736)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !308, file: !25, line: 59, baseType: !74, size: 160, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !308, file: !25, line: 61, baseType: !74, size: 160, offset: 1056)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !308, file: !25, line: 62, baseType: !503, size: 96, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !9, line: 32, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !9, line: 37, size: 96, elements: !505)
!505 = !{!506, !507, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !504, file: !9, line: 38, baseType: !366, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !504, file: !9, line: 39, baseType: !366, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !504, file: !9, line: 40, baseType: !509, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !9, line: 34, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !366, !366, !366}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !308, file: !25, line: 63, baseType: !361, size: 160, offset: 1312)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !308, file: !25, line: 65, baseType: !515, size: 224, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !516, line: 31, baseType: !517)
!516 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 25, size: 224, elements: !518)
!518 = !{!519, !527, !528, !529, !530}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !517, file: !516, line: 26, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !516, line: 16, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !516, line: 18, size: 96, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !522, file: !516, line: 19, baseType: !18, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !522, file: !516, line: 20, baseType: !10, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !516, line: 21, baseType: !520, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !517, file: !516, line: 27, baseType: !521, size: 96, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !516, line: 28, baseType: !64, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !517, file: !516, line: 29, baseType: !10, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !517, file: !516, line: 30, baseType: !83, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !308, file: !25, line: 66, baseType: !515, size: 224, offset: 1696)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !308, file: !25, line: 68, baseType: !10, size: 32, offset: 1920)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !308, file: !25, line: 69, baseType: !10, size: 32, offset: 1952)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !308, file: !25, line: 71, baseType: !319, size: 32, offset: 1984)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !308, file: !25, line: 72, baseType: !326, size: 32, offset: 2016)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !308, file: !25, line: 73, baseType: !326, size: 32, offset: 2048)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !308, file: !25, line: 75, baseType: !306, size: 32, offset: 2080)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !308, file: !25, line: 77, baseType: !59, size: 64, offset: 2112)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !308, file: !25, line: 78, baseType: !59, size: 64, offset: 2176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !308, file: !25, line: 79, baseType: !59, size: 64, offset: 2240)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !308, file: !25, line: 80, baseType: !59, size: 64, offset: 2304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !308, file: !25, line: 81, baseType: !59, size: 64, offset: 2368)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !308, file: !25, line: 82, baseType: !59, size: 64, offset: 2432)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !300, file: !184, line: 121, baseType: !83, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !300, file: !184, line: 122, baseType: !83, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !300, file: !184, line: 123, baseType: !547, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !184, line: 103, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !184, line: 98, size: 1344, elements: !550)
!550 = !{!551, !552, !553, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !549, file: !184, line: 99, baseType: !120, size: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !549, file: !184, line: 100, baseType: !106, size: 32, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !549, file: !184, line: 101, baseType: !106, size: 32, offset: 1248)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !549, file: !184, line: 102, baseType: !10, size: 32, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !300, file: !184, line: 124, baseType: !174, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !300, file: !184, line: 126, baseType: !18, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !300, file: !184, line: 127, baseType: !10, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !300, file: !184, line: 128, baseType: !10, size: 32, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !300, file: !184, line: 130, baseType: !560, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !184, line: 112, baseType: !295)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !300, file: !184, line: 131, baseType: !50, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !290, file: !184, line: 81, baseType: !10, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !184, line: 82, baseType: !10, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !290, file: !184, line: 83, baseType: !18, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 236, baseType: !10, size: 32, offset: 288)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !276, file: !277, line: 238, baseType: !567, size: 32, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DISubroutineType(types: !569)
!569 = !{!35, !174}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !276, file: !277, line: 240, baseType: !571, size: 32, offset: 352)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!35, !306}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !276, file: !277, line: 242, baseType: !571, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !276, file: !277, line: 243, baseType: !571, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !276, file: !277, line: 244, baseType: !577, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !306}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !276, file: !277, line: 245, baseType: !577, size: 32, offset: 480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !276, file: !277, line: 247, baseType: !577, size: 32, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !276, file: !277, line: 249, baseType: !12, size: 32, offset: 544)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !276, file: !277, line: 250, baseType: !12, size: 32, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !276, file: !277, line: 251, baseType: !12, size: 32, offset: 608)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !276, file: !277, line: 252, baseType: !12, size: 32, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !276, file: !277, line: 253, baseType: !12, size: 32, offset: 672)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !276, file: !277, line: 254, baseType: !12, size: 32, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !276, file: !277, line: 255, baseType: !12, size: 32, offset: 736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !276, file: !277, line: 256, baseType: !12, size: 32, offset: 768)
!590 = !DIGlobalVariableExpression(var: !591)
!591 = distinct !DIGlobalVariable(name: "ngx_event_core_module", scope: !2, file: !3, line: 177, type: !275, isLocal: false, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593)
!593 = distinct !DIGlobalVariable(name: "ngx_timer_resolution", scope: !2, file: !3, line: 38, type: !10, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595)
!595 = distinct !DIGlobalVariable(name: "ngx_event_timer_alarm", scope: !2, file: !3, line: 39, type: !596, isLocal: false, isDefinition: true)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !597, line: 264, baseType: !15)
!597 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/signal.h", directory: "/home/sam/Projects/nginx-1.12.2")
!598 = !DIGlobalVariableExpression(var: !599)
!599 = distinct !DIGlobalVariable(name: "ngx_event_flags", scope: !2, file: !3, line: 43, type: !10, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601)
!601 = distinct !DIGlobalVariable(name: "ngx_event_actions", scope: !2, file: !3, line: 44, type: !602, isLocal: false, isDefinition: true)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_actions_t", file: !329, line: 194, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 177, size: 320, elements: !604)
!604 = !{!605, !609, !610, !611, !612, !616, !620, !624, !628, !632}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !603, file: !329, line: 178, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{!35, !326, !35, !10}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "del", scope: !603, file: !329, line: 179, baseType: !606, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !603, file: !329, line: 181, baseType: !606, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !603, file: !329, line: 182, baseType: !606, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "add_conn", scope: !603, file: !329, line: 184, baseType: !613, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{!35, !319}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "del_conn", scope: !603, file: !329, line: 185, baseType: !617, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!35, !319, !10}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !603, file: !329, line: 187, baseType: !621, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{!35, !354}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "process_events", scope: !603, file: !329, line: 189, baseType: !625, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DISubroutineType(types: !627)
!627 = !{!35, !306, !6, !10}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !603, file: !329, line: 192, baseType: !629, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{!35, !306, !6}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !603, file: !329, line: 193, baseType: !577, size: 32, offset: 288)
!633 = !DIGlobalVariableExpression(var: !634)
!634 = distinct !DIGlobalVariable(name: "ngx_accept_mutex_ptr", scope: !2, file: !3, line: 51, type: !250, isLocal: false, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636)
!636 = distinct !DIGlobalVariable(name: "ngx_accept_mutex", scope: !2, file: !3, line: 52, type: !637, isLocal: false, isDefinition: true)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !255, line: 37, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 24, size: 256, elements: !639)
!639 = !{!640, !641, !642, !643, !653}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !638, file: !255, line: 26, baseType: !250, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !638, file: !255, line: 28, baseType: !250, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !638, file: !255, line: 29, baseType: !10, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !638, file: !255, line: 30, baseType: !644, size: 128, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !645, line: 19, baseType: !646)
!645 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !645, line: 17, size: 128, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !646, file: !645, line: 18, baseType: !649, size: 128)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 128, elements: !651)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!651 = !{!652}
!652 = !DISubrange(count: 4)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !638, file: !255, line: 36, baseType: !10, size: 32, offset: 224)
!654 = !DIGlobalVariableExpression(var: !655)
!655 = distinct !DIGlobalVariable(name: "ngx_use_accept_mutex", scope: !2, file: !3, line: 53, type: !10, isLocal: false, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657)
!657 = distinct !DIGlobalVariable(name: "ngx_accept_events", scope: !2, file: !3, line: 54, type: !10, isLocal: false, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659)
!659 = distinct !DIGlobalVariable(name: "ngx_accept_mutex_held", scope: !2, file: !3, line: 55, type: !10, isLocal: false, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661)
!661 = distinct !DIGlobalVariable(name: "ngx_accept_mutex_delay", scope: !2, file: !3, line: 56, type: !6, isLocal: false, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663)
!663 = distinct !DIGlobalVariable(name: "ngx_accept_disabled", scope: !2, file: !3, line: 57, type: !35, isLocal: false, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665)
!665 = distinct !DIGlobalVariable(name: "ngx_events_module_ctx", scope: !2, file: !3, line: 94, type: !666, isLocal: true, isDefinition: true)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_module_t", file: !277, line: 264, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 260, size: 128, elements: !668)
!668 = !{!669, !670, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !277, line: 261, baseType: !59, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !667, file: !277, line: 262, baseType: !671, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DISubroutineType(types: !673)
!673 = !{!18, !306}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !667, file: !277, line: 263, baseType: !675, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = !DISubroutineType(types: !677)
!677 = !{!50, !306, !18}
!678 = !DIGlobalVariableExpression(var: !679)
!679 = distinct !DIGlobalVariable(name: "ngx_events_commands", scope: !2, file: !3, line: 81, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 448, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 2)
!683 = !DIGlobalVariableExpression(var: !684)
!684 = distinct !DIGlobalVariable(name: "ngx_event_max_module", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686)
!686 = distinct !DIGlobalVariable(name: "ngx_event_core_module_ctx", scope: !2, file: !3, line: 168, type: !687, isLocal: true, isDefinition: true)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_module_t", file: !329, line: 464, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 457, size: 416, elements: !689)
!689 = !{!690, !692, !693, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !688, file: !329, line: 458, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !688, file: !329, line: 460, baseType: !671, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !688, file: !329, line: 461, baseType: !675, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !688, file: !329, line: 463, baseType: !602, size: 320, offset: 96)
!695 = !DIGlobalVariableExpression(var: !696)
!696 = distinct !DIGlobalVariable(name: "event_core_name", scope: !2, file: !3, line: 117, type: !59, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698)
!698 = distinct !DIGlobalVariable(name: "ngx_event_core_commands", scope: !2, file: !3, line: 120, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 1568, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 7)
!702 = !{i32 2, !"Dwarf Version", i32 4}
!703 = !{i32 2, !"Debug Info Version", i32 3}
!704 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!705 = distinct !DISubprogram(name: "ngx_event_module_init", scope: !3, file: !3, line: 424, type: !572, isLocal: true, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !722, !723, !724, !735, !737}
!707 = !DILocalVariable(name: "cycle", arg: 1, scope: !705, file: !3, line: 424, type: !306)
!708 = !DILocalVariable(name: "cf", scope: !705, file: !3, line: 426, type: !312)
!709 = !DILocalVariable(name: "shared", scope: !705, file: !3, line: 427, type: !66)
!710 = !DILocalVariable(name: "size", scope: !705, file: !3, line: 428, type: !64)
!711 = !DILocalVariable(name: "cl", scope: !705, file: !3, line: 428, type: !64)
!712 = !DILocalVariable(name: "shm", scope: !705, file: !3, line: 429, type: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !714, line: 22, baseType: !715)
!714 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 16, size: 192, elements: !716)
!716 = !{!717, !718, !719, !720, !721}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !715, file: !714, line: 17, baseType: !66, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !715, file: !714, line: 18, baseType: !64, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !714, line: 19, baseType: !59, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !715, file: !714, line: 20, baseType: !174, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !715, file: !714, line: 21, baseType: !10, size: 32, offset: 160)
!722 = !DILocalVariable(name: "tp", scope: !705, file: !3, line: 430, type: !260)
!723 = !DILocalVariable(name: "ccf", scope: !705, file: !3, line: 431, type: !23)
!724 = !DILocalVariable(name: "ecf", scope: !705, file: !3, line: 432, type: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_conf_t", file: !329, line: 454, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 440, size: 192, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !727, file: !329, line: 441, baseType: !10, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !727, file: !329, line: 442, baseType: !10, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "multi_accept", scope: !727, file: !329, line: 444, baseType: !29, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex", scope: !727, file: !329, line: 445, baseType: !29, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex_delay", scope: !727, file: !329, line: 447, baseType: !6, size: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !329, line: 449, baseType: !66, size: 32, offset: 160)
!735 = !DILocalVariable(name: "limit", scope: !736, file: !3, line: 448, type: !35)
!736 = distinct !DILexicalBlock(scope: !705, file: !3, line: 447, column: 5)
!737 = !DILocalVariable(name: "rlmt", scope: !736, file: !3, line: 449, type: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !739, line: 22, size: 128, elements: !740)
!739 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/resource.h", directory: "/home/sam/Projects/nginx-1.12.2")
!740 = !{!741, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !738, file: !739, line: 23, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !739, line: 20, baseType: !48)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !738, file: !739, line: 24, baseType: !742, size: 64, offset: 64)
!744 = !{!745, !745, i64 0}
!745 = !{!"any pointer", !746, i64 0}
!746 = !{!"omnipotent char", !747, i64 0}
!747 = !{!"Simple C/C++ TBAA"}
!748 = !DIExpression()
!749 = !DILocation(line: 424, column: 36, scope: !705)
!750 = !DILocation(line: 426, column: 5, scope: !705)
!751 = !DILocation(line: 426, column: 26, scope: !705)
!752 = !DILocation(line: 427, column: 5, scope: !705)
!753 = !DILocation(line: 427, column: 26, scope: !705)
!754 = !DILocation(line: 428, column: 5, scope: !705)
!755 = !DILocation(line: 428, column: 26, scope: !705)
!756 = !DILocation(line: 428, column: 32, scope: !705)
!757 = !DILocation(line: 429, column: 5, scope: !705)
!758 = !DILocation(line: 429, column: 26, scope: !705)
!759 = !DILocation(line: 430, column: 5, scope: !705)
!760 = !DILocation(line: 430, column: 26, scope: !705)
!761 = !DILocation(line: 431, column: 5, scope: !705)
!762 = !DILocation(line: 431, column: 26, scope: !705)
!763 = !DILocation(line: 432, column: 5, scope: !705)
!764 = !DILocation(line: 432, column: 26, scope: !705)
!765 = !DILocation(line: 434, column: 10, scope: !705)
!766 = !{!767, !745, i64 0}
!767 = !{!"ngx_cycle_s", !745, i64 0, !745, i64 4, !745, i64 8, !768, i64 12, !769, i64 52, !745, i64 56, !745, i64 60, !769, i64 64, !745, i64 68, !769, i64 72, !769, i64 76, !771, i64 80, !769, i64 88, !772, i64 92, !772, i64 112, !772, i64 132, !773, i64 152, !774, i64 164, !775, i64 184, !775, i64 212, !769, i64 240, !769, i64 244, !745, i64 248, !745, i64 252, !745, i64 256, !745, i64 260, !777, i64 264, !777, i64 272, !777, i64 280, !777, i64 288, !777, i64 296, !777, i64 304}
!768 = !{!"ngx_log_s", !769, i64 0, !745, i64 4, !770, i64 8, !770, i64 12, !745, i64 16, !745, i64 20, !745, i64 24, !745, i64 28, !745, i64 32, !745, i64 36}
!769 = !{!"int", !746, i64 0}
!770 = !{!"long", !746, i64 0}
!771 = !{!"ngx_queue_s", !745, i64 0, !745, i64 4}
!772 = !{!"", !745, i64 0, !769, i64 4, !769, i64 8, !769, i64 12, !745, i64 16}
!773 = !{!"ngx_rbtree_s", !745, i64 0, !745, i64 4, !745, i64 8}
!774 = !{!"ngx_rbtree_node_s", !769, i64 0, !745, i64 4, !745, i64 8, !745, i64 12, !746, i64 16, !746, i64 17}
!775 = !{!"", !745, i64 0, !776, i64 4, !769, i64 16, !769, i64 20, !745, i64 24}
!776 = !{!"ngx_list_part_s", !745, i64 0, !769, i64 4, !745, i64 8}
!777 = !{!"", !769, i64 0, !745, i64 4}
!778 = !{!779, !769, i64 4}
!779 = !{!"ngx_module_s", !769, i64 0, !769, i64 4, !745, i64 8, !769, i64 12, !769, i64 16, !769, i64 20, !745, i64 24, !745, i64 28, !745, i64 32, !769, i64 36, !745, i64 40, !745, i64 44, !745, i64 48, !745, i64 52, !745, i64 56, !745, i64 60, !745, i64 64, !769, i64 68, !769, i64 72, !769, i64 76, !769, i64 80, !769, i64 84, !769, i64 88, !769, i64 92, !769, i64 96}
!780 = !DILocation(line: 434, column: 8, scope: !705)
!781 = !DILocation(line: 435, column: 13, scope: !705)
!782 = !DILocation(line: 435, column: 12, scope: !705)
!783 = !DILocation(line: 435, column: 39, scope: !705)
!784 = !{!779, !769, i64 0}
!785 = !DILocation(line: 435, column: 11, scope: !705)
!786 = !DILocation(line: 435, column: 9, scope: !705)
!787 = !DILocation(line: 437, column: 10, scope: !788)
!788 = distinct !DILexicalBlock(scope: !705, file: !3, line: 437, column: 9)
!789 = !{!769, !769, i64 0}
!790 = !DILocation(line: 437, column: 26, scope: !788)
!791 = !DILocation(line: 437, column: 29, scope: !788)
!792 = !DILocation(line: 437, column: 41, scope: !788)
!793 = !DILocation(line: 437, column: 9, scope: !705)
!794 = !DILocation(line: 438, column: 9, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 438, column: 9)
!796 = distinct !DILexicalBlock(scope: !788, file: !3, line: 437, column: 64)
!797 = !{!767, !745, i64 8}
!798 = !{!768, !769, i64 0}
!799 = !DILocation(line: 438, column: 9, scope: !796)
!800 = !{!801, !745, i64 20}
!801 = !{!"", !769, i64 0, !769, i64 4, !769, i64 8, !769, i64 12, !769, i64 16, !745, i64 20}
!802 = !DILocation(line: 440, column: 5, scope: !796)
!803 = !DILocation(line: 442, column: 31, scope: !705)
!804 = !DILocation(line: 442, column: 11, scope: !705)
!805 = !DILocation(line: 442, column: 9, scope: !705)
!806 = !DILocation(line: 444, column: 28, scope: !705)
!807 = !DILocation(line: 444, column: 33, scope: !705)
!808 = !{!809, !769, i64 8}
!809 = !{!"", !769, i64 0, !769, i64 4, !769, i64 8, !769, i64 12, !769, i64 16, !769, i64 20, !769, i64 24, !769, i64 28, !769, i64 32, !769, i64 36, !769, i64 40, !745, i64 44, !745, i64 48, !769, i64 52, !769, i64 56, !777, i64 60, !777, i64 68, !777, i64 76, !777, i64 84, !772, i64 92, !745, i64 112}
!810 = !DILocation(line: 444, column: 26, scope: !705)
!811 = !DILocation(line: 448, column: 5, scope: !736)
!812 = !DILocation(line: 448, column: 20, scope: !736)
!813 = !DILocation(line: 449, column: 5, scope: !736)
!814 = !DILocation(line: 449, column: 20, scope: !736)
!815 = !DILocation(line: 451, column: 9, scope: !816)
!816 = distinct !DILexicalBlock(scope: !736, file: !3, line: 451, column: 9)
!817 = !DILocation(line: 451, column: 41, scope: !816)
!818 = !DILocation(line: 451, column: 9, scope: !736)
!819 = !DILocation(line: 452, column: 9, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 452, column: 9)
!821 = distinct !DILexicalBlock(scope: !816, file: !3, line: 451, column: 48)
!822 = !DILocation(line: 452, column: 9, scope: !821)
!823 = !DILocation(line: 455, column: 5, scope: !821)
!824 = !DILocation(line: 456, column: 13, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 456, column: 13)
!826 = distinct !DILexicalBlock(scope: !816, file: !3, line: 455, column: 12)
!827 = !DILocation(line: 456, column: 18, scope: !825)
!828 = !{!801, !769, i64 0}
!829 = !DILocation(line: 456, column: 50, scope: !825)
!830 = !{!831, !832, i64 0}
!831 = !{!"rlimit", !832, i64 0, !832, i64 8}
!832 = !{!"long long", !746, i64 0}
!833 = !DILocation(line: 456, column: 32, scope: !825)
!834 = !DILocation(line: 456, column: 30, scope: !825)
!835 = !DILocation(line: 457, column: 13, scope: !825)
!836 = !DILocation(line: 457, column: 17, scope: !825)
!837 = !DILocation(line: 457, column: 22, scope: !825)
!838 = !{!809, !769, i64 24}
!839 = !DILocation(line: 457, column: 36, scope: !825)
!840 = !DILocation(line: 458, column: 17, scope: !825)
!841 = !DILocation(line: 458, column: 20, scope: !825)
!842 = !DILocation(line: 458, column: 25, scope: !825)
!843 = !DILocation(line: 458, column: 52, scope: !825)
!844 = !DILocation(line: 458, column: 57, scope: !825)
!845 = !DILocation(line: 458, column: 37, scope: !825)
!846 = !DILocation(line: 456, column: 13, scope: !826)
!847 = !DILocation(line: 460, column: 22, scope: !848)
!848 = distinct !DILexicalBlock(scope: !825, file: !3, line: 459, column: 9)
!849 = !DILocation(line: 460, column: 27, scope: !848)
!850 = !DILocation(line: 460, column: 41, scope: !848)
!851 = !DILocation(line: 460, column: 21, scope: !848)
!852 = !DILocation(line: 461, column: 43, scope: !848)
!853 = !DILocation(line: 461, column: 26, scope: !848)
!854 = !DILocation(line: 461, column: 54, scope: !848)
!855 = !DILocation(line: 461, column: 59, scope: !848)
!856 = !DILocation(line: 460, column: 19, scope: !848)
!857 = !DILocation(line: 463, column: 13, scope: !858)
!858 = distinct !DILexicalBlock(scope: !848, file: !3, line: 463, column: 13)
!859 = !DILocation(line: 463, column: 13, scope: !848)
!860 = !DILocation(line: 467, column: 9, scope: !848)
!861 = !DILocation(line: 469, column: 5, scope: !705)
!862 = !DILocation(line: 473, column: 9, scope: !863)
!863 = distinct !DILexicalBlock(scope: !705, file: !3, line: 473, column: 9)
!864 = !DILocation(line: 473, column: 14, scope: !863)
!865 = !{!809, !769, i64 4}
!866 = !DILocation(line: 473, column: 21, scope: !863)
!867 = !DILocation(line: 473, column: 9, scope: !705)
!868 = !DILocation(line: 474, column: 9, scope: !869)
!869 = distinct !DILexicalBlock(scope: !863, file: !3, line: 473, column: 27)
!870 = !DILocation(line: 477, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !705, file: !3, line: 477, column: 9)
!872 = !DILocation(line: 477, column: 9, scope: !705)
!873 = !DILocation(line: 478, column: 9, scope: !874)
!874 = distinct !DILexicalBlock(scope: !871, file: !3, line: 477, column: 31)
!875 = !DILocation(line: 484, column: 8, scope: !705)
!876 = !DILocation(line: 486, column: 12, scope: !705)
!877 = !DILocation(line: 487, column: 14, scope: !705)
!878 = !DILocation(line: 487, column: 12, scope: !705)
!879 = !DILocation(line: 488, column: 14, scope: !705)
!880 = !DILocation(line: 488, column: 12, scope: !705)
!881 = !DILocation(line: 486, column: 10, scope: !705)
!882 = !DILocation(line: 502, column: 16, scope: !705)
!883 = !DILocation(line: 502, column: 9, scope: !705)
!884 = !DILocation(line: 502, column: 14, scope: !705)
!885 = !{!886, !769, i64 4}
!886 = !{!"", !745, i64 0, !769, i64 4, !777, i64 8, !745, i64 16, !769, i64 20}
!887 = !DILocation(line: 503, column: 5, scope: !705)
!888 = !{!777, !769, i64 0}
!889 = !{!777, !745, i64 4}
!890 = !DILocation(line: 504, column: 15, scope: !705)
!891 = !DILocation(line: 504, column: 22, scope: !705)
!892 = !DILocation(line: 504, column: 9, scope: !705)
!893 = !DILocation(line: 504, column: 13, scope: !705)
!894 = !{!886, !745, i64 16}
!895 = !DILocation(line: 506, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !705, file: !3, line: 506, column: 9)
!897 = !DILocation(line: 506, column: 29, scope: !896)
!898 = !DILocation(line: 506, column: 9, scope: !705)
!899 = !DILocation(line: 507, column: 9, scope: !900)
!900 = distinct !DILexicalBlock(scope: !896, file: !3, line: 506, column: 40)
!901 = !DILocation(line: 510, column: 18, scope: !705)
!902 = !{!886, !745, i64 0}
!903 = !DILocation(line: 510, column: 12, scope: !705)
!904 = !DILocation(line: 512, column: 45, scope: !705)
!905 = !DILocation(line: 512, column: 28, scope: !705)
!906 = !DILocation(line: 512, column: 26, scope: !705)
!907 = !DILocation(line: 513, column: 27, scope: !705)
!908 = !{!909, !769, i64 28}
!909 = !{!"", !745, i64 0, !745, i64 4, !769, i64 8, !910, i64 12, !769, i64 28}
!910 = !{!"", !746, i64 0}
!911 = !DILocation(line: 515, column: 64, scope: !912)
!912 = distinct !DILexicalBlock(scope: !705, file: !3, line: 515, column: 9)
!913 = !DILocation(line: 515, column: 45, scope: !912)
!914 = !DILocation(line: 516, column: 26, scope: !912)
!915 = !DILocation(line: 516, column: 33, scope: !912)
!916 = !DILocation(line: 516, column: 43, scope: !912)
!917 = !{!767, !745, i64 300}
!918 = !DILocation(line: 515, column: 9, scope: !912)
!919 = !DILocation(line: 517, column: 9, scope: !912)
!920 = !DILocation(line: 515, column: 9, scope: !705)
!921 = !DILocation(line: 519, column: 9, scope: !922)
!922 = distinct !DILexicalBlock(scope: !912, file: !3, line: 518, column: 5)
!923 = !DILocation(line: 522, column: 48, scope: !705)
!924 = !DILocation(line: 522, column: 61, scope: !705)
!925 = !DILocation(line: 522, column: 59, scope: !705)
!926 = !DILocation(line: 522, column: 55, scope: !705)
!927 = !DILocation(line: 522, column: 30, scope: !705)
!928 = !DILocation(line: 522, column: 28, scope: !705)
!929 = !DILocation(line: 524, column: 12, scope: !705)
!930 = !DILocation(line: 530, column: 41, scope: !705)
!931 = !DILocation(line: 530, column: 54, scope: !705)
!932 = !DILocation(line: 530, column: 52, scope: !705)
!933 = !DILocation(line: 530, column: 48, scope: !705)
!934 = !DILocation(line: 530, column: 23, scope: !705)
!935 = !DILocation(line: 530, column: 21, scope: !705)
!936 = !DILocation(line: 532, column: 10, scope: !705)
!937 = !DILocation(line: 532, column: 8, scope: !705)
!938 = !DILocation(line: 534, column: 26, scope: !705)
!939 = !DILocation(line: 534, column: 30, scope: !705)
!940 = !{!941, !769, i64 4}
!941 = !{!"", !770, i64 0, !769, i64 4, !769, i64 8}
!942 = !DILocation(line: 534, column: 35, scope: !705)
!943 = !DILocation(line: 534, column: 44, scope: !705)
!944 = !DILocation(line: 534, column: 42, scope: !705)
!945 = !DILocation(line: 534, column: 23, scope: !705)
!946 = !{!770, !770, i64 0}
!947 = !DILocation(line: 548, column: 5, scope: !705)
!948 = !DILocation(line: 549, column: 1, scope: !705)
!949 = distinct !DISubprogram(name: "ngx_event_process_init", scope: !3, file: !3, line: 568, type: !572, isLocal: true, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !964, !1065, !1076}
!951 = !DILocalVariable(name: "cycle", arg: 1, scope: !949, file: !3, line: 568, type: !306)
!952 = !DILocalVariable(name: "m", scope: !949, file: !3, line: 570, type: !10)
!953 = !DILocalVariable(name: "i", scope: !949, file: !3, line: 570, type: !10)
!954 = !DILocalVariable(name: "rev", scope: !949, file: !3, line: 571, type: !326)
!955 = !DILocalVariable(name: "wev", scope: !949, file: !3, line: 571, type: !326)
!956 = !DILocalVariable(name: "ls", scope: !949, file: !3, line: 572, type: !401)
!957 = !DILocalVariable(name: "c", scope: !949, file: !3, line: 573, type: !319)
!958 = !DILocalVariable(name: "next", scope: !949, file: !3, line: 573, type: !319)
!959 = !DILocalVariable(name: "old", scope: !949, file: !3, line: 573, type: !319)
!960 = !DILocalVariable(name: "ccf", scope: !949, file: !3, line: 574, type: !23)
!961 = !DILocalVariable(name: "ecf", scope: !949, file: !3, line: 575, type: !725)
!962 = !DILocalVariable(name: "module", scope: !949, file: !3, line: 576, type: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!964 = !DILocalVariable(name: "sa", scope: !965, file: !3, line: 630, type: !967)
!965 = distinct !DILexicalBlock(scope: !966, file: !3, line: 629, column: 75)
!966 = distinct !DILexicalBlock(scope: !949, file: !3, line: 629, column: 9)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !597, line: 167, size: 1120, elements: !968)
!968 = !{!969, !1052, !1060, !1061}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !967, file: !597, line: 171, baseType: !970, size: 32)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !967, file: !597, line: 168, size: 32, elements: !971)
!971 = !{!972, !976}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !970, file: !597, line: 169, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !15}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !970, file: !597, line: 170, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !15, !980, !18}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !597, line: 145, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 97, size: 1024, elements: !983)
!983 = !{!984, !985, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !982, file: !597, line: 101, baseType: !15, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !982, file: !597, line: 101, baseType: !15, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !982, file: !597, line: 101, baseType: !15, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__si_fields", scope: !982, file: !597, line: 144, baseType: !988, size: 928, offset: 96)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !597, line: 103, size: 928, elements: !989)
!989 = !{!990, !994, !1026, !1041, !1046}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !988, file: !597, line: 104, baseType: !991, size: 928)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 928, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 116)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__si_common", scope: !988, file: !597, line: 123, baseType: !995, size: 160)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !988, file: !597, line: 105, size: 160, elements: !996)
!996 = !{!997, !1011}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__first", scope: !995, file: !597, line: 115, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !995, file: !597, line: 106, size: 64, elements: !999)
!999 = !{!1000, !1006}
