; ModuleID = 'src/event/ngx_event_posted.c'
source_filename = "src/event/ngx_event_posted.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_queue_s = type { %struct.ngx_queue_s*, %struct.ngx_queue_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_posted_accept_events", scope: !2, file: !3, line: 13, type: !117, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !124)
!3 = !DIFile(filename: "src/event/ngx_event_posted.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !71}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !8, line: 24, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !10, line: 30, size: 384, elements: !11)
!10 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !{!12, !14, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !41, !46, !103, !116}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !9, file: !10, line: 31, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !9, file: !10, line: 33, baseType: !15, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !9, file: !10, line: 35, baseType: !15, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !9, file: !10, line: 38, baseType: !15, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !9, file: !10, line: 44, baseType: !15, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !9, file: !10, line: 46, baseType: !15, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !9, file: !10, line: 49, baseType: !15, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !9, file: !10, line: 51, baseType: !15, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !9, file: !10, line: 54, baseType: !15, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !9, file: !10, line: 56, baseType: !15, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 57, baseType: !15, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !9, file: !10, line: 59, baseType: !15, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !9, file: !10, line: 60, baseType: !15, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !9, file: !10, line: 62, baseType: !15, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !9, file: !10, line: 64, baseType: !15, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !9, file: !10, line: 67, baseType: !15, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !9, file: !10, line: 69, baseType: !15, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !9, file: !10, line: 71, baseType: !15, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !9, file: !10, line: 74, baseType: !15, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !9, file: !10, line: 75, baseType: !15, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !9, file: !10, line: 77, baseType: !15, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !9, file: !10, line: 107, baseType: !15, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !9, file: !10, line: 110, baseType: !37, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !8, line: 31, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !6}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !9, file: !10, line: 117, baseType: !42, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !43, line: 79, baseType: !44)
!43 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !45, line: 125, baseType: !15)
!45 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !9, file: !10, line: 119, baseType: !47, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !8, line: 20, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !50, line: 50, size: 320, elements: !51)
!50 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!51 = !{!52, !53, !80, !84, !87, !92, !93, !98, !99, !102}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !49, file: !50, line: 51, baseType: !42, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !49, file: !50, line: 52, baseType: !54, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !8, line: 21, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !57, line: 89, size: 160, elements: !58)
!57 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !{!59, !63, !75, !79}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !56, file: !57, line: 90, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !61, line: 16, baseType: !62)
!61 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !57, line: 91, baseType: !64, size: 64, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !65, line: 19, baseType: !66)
!65 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 16, size: 64, elements: !67)
!67 = !{!68, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !65, line: 17, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 120, baseType: !15)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !65, line: 18, baseType: !71, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !73, line: 64, baseType: !74)
!73 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !56, file: !57, line: 93, baseType: !76, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !54, !47}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !57, line: 94, baseType: !13, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !49, file: !50, line: 54, baseType: !81, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !82, line: 98, baseType: !83)
!82 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !49, file: !50, line: 56, baseType: !85, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !45, line: 75, baseType: !86)
!86 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !49, file: !50, line: 58, baseType: !88, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !50, line: 45, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DISubroutineType(types: !91)
!91 = !{!71, !47, !71, !69}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !50, line: 59, baseType: !13, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !49, file: !50, line: 61, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !50, line: 46, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !47, !42, !71, !69}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !49, file: !50, line: 62, baseType: !13, size: 32, offset: 224)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !49, file: !50, line: 70, baseType: !100, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !50, line: 72, baseType: !47, size: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !9, file: !10, line: 121, baseType: !104, size: 160, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !105, line: 20, baseType: !106)
!105 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !105, line: 22, size: 160, elements: !107)
!107 = !{!108, !110, !112, !113, !114, !115}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !106, file: !105, line: 23, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !105, line: 16, baseType: !42)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !106, file: !105, line: 24, baseType: !111, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !106, file: !105, line: 25, baseType: !111, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !106, file: !105, line: 26, baseType: !111, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !106, file: !105, line: 27, baseType: !72, size: 8, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !105, line: 28, baseType: !72, size: 8, offset: 136)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !9, file: !10, line: 124, baseType: !117, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !118, line: 16, baseType: !119)
!118 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !118, line: 18, size: 64, elements: !120)
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !118, line: 19, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !118, line: 20, baseType: !122, size: 32, offset: 32)
!124 = !{!0, !125}
!125 = !DIGlobalVariableExpression(var: !126)
!126 = distinct !DIGlobalVariable(name: "ngx_posted_events", scope: !2, file: !3, line: 14, type: !117, isLocal: false, isDefinition: true)
!127 = !{i32 2, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!130 = distinct !DISubprogram(name: "ngx_event_process_posted", scope: !3, file: !3, line: 18, type: !131, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !539)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !122}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !8, line: 17, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !136, line: 38, size: 2496, elements: !137)
!136 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!137 = !{!138, !142, !268, !269, !270, !271, !395, !396, !397, !490, !491, !492, !493, !494, !495, !496, !497, !508, !509, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !135, file: !136, line: 39, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !135, file: !136, line: 40, baseType: !143, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !8, line: 18, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !146, line: 57, size: 320, elements: !147)
!146 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!147 = !{!148, !156, !157, !158, !248, !255, !267}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !145, file: !146, line: 58, baseType: !149, size: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !146, line: 54, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 49, size: 128, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !150, file: !146, line: 50, baseType: !71, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !150, file: !146, line: 51, baseType: !71, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 52, baseType: !143, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !150, file: !146, line: 53, baseType: !42, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !145, file: !146, line: 59, baseType: !69, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !145, file: !146, line: 60, baseType: !143, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !145, file: !146, line: 61, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !8, line: 19, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !162, line: 59, size: 64, elements: !163)
!162 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !{!164, !247}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !161, file: !162, line: 60, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !162, line: 18, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !162, line: 20, size: 352, elements: !168)
!168 = !{!169, !170, !171, !173, !174, !175, !176, !178, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !167, file: !162, line: 21, baseType: !71, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !167, file: !162, line: 22, baseType: !71, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !167, file: !162, line: 23, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !45, line: 222, baseType: !62)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !167, file: !162, line: 24, baseType: !172, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !167, file: !162, line: 26, baseType: !71, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !167, file: !162, line: 27, baseType: !71, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !167, file: !162, line: 28, baseType: !177, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !162, line: 16, baseType: !13)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !167, file: !162, line: 29, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !8, line: 23, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !182, line: 16, size: 1216, elements: !183)
!182 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!183 = !{!184, !185, !186, !229, !230, !231, !232, !233}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !181, file: !182, line: 17, baseType: !60, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !182, line: 18, baseType: !64, size: 64, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !181, file: !182, line: 19, baseType: !187, size: 960, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !61, line: 17, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !189, line: 4, size: 960, elements: !190)
!189 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !{!191, !193, !194, !196, !197, !199, !200, !202, !204, !206, !207, !208, !209, !210, !211, !213, !214, !216, !217, !222, !223, !224}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !188, file: !189, line: 6, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !45, line: 232, baseType: !15)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !188, file: !189, line: 7, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !188, file: !189, line: 8, baseType: !195, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !45, line: 227, baseType: !15)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !188, file: !189, line: 9, baseType: !195, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !188, file: !189, line: 10, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !45, line: 217, baseType: !15)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !188, file: !189, line: 11, baseType: !198, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !188, file: !189, line: 13, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !45, line: 212, baseType: !15)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !188, file: !189, line: 14, baseType: !203, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !45, line: 304, baseType: !15)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !188, file: !189, line: 15, baseType: !205, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !45, line: 309, baseType: !15)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !188, file: !189, line: 16, baseType: !15, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !188, file: !189, line: 17, baseType: !192, size: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !188, file: !189, line: 18, baseType: !192, size: 32, offset: 352)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !188, file: !189, line: 19, baseType: !172, size: 32, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !188, file: !189, line: 20, baseType: !172, size: 32, offset: 416)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !188, file: !189, line: 21, baseType: !212, size: 32, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !45, line: 237, baseType: !86)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !188, file: !189, line: 22, baseType: !212, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !188, file: !189, line: 23, baseType: !215, size: 32, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !45, line: 242, baseType: !62)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !188, file: !189, line: 24, baseType: !215, size: 32, offset: 544)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !188, file: !189, line: 26, baseType: !218, size: 64, offset: 576)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !45, line: 288, size: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !218, file: !45, line: 288, baseType: !85, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !218, file: !45, line: 288, baseType: !86, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !188, file: !189, line: 27, baseType: !218, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !188, file: !189, line: 28, baseType: !218, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !188, file: !189, line: 29, baseType: !225, size: 192, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 192, elements: !227)
!226 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !181, file: !182, line: 21, baseType: !172, size: 32, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !181, file: !182, line: 22, baseType: !172, size: 32, offset: 1120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !181, file: !182, line: 24, baseType: !47, size: 32, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !181, file: !182, line: 37, baseType: !15, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !181, file: !182, line: 38, baseType: !15, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !167, file: !162, line: 30, baseType: !165, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !167, file: !162, line: 34, baseType: !15, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !167, file: !162, line: 40, baseType: !15, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !167, file: !162, line: 43, baseType: !15, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !167, file: !162, line: 45, baseType: !15, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !167, file: !162, line: 46, baseType: !15, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !167, file: !162, line: 47, baseType: !15, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !167, file: !162, line: 48, baseType: !15, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !167, file: !162, line: 49, baseType: !15, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !167, file: !162, line: 50, baseType: !15, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !167, file: !162, line: 52, baseType: !15, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !167, file: !162, line: 53, baseType: !15, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !167, file: !162, line: 55, baseType: !62, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !162, line: 61, baseType: !159, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !145, file: !146, line: 62, baseType: !249, size: 32, offset: 224)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !146, line: 41, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !146, line: 43, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !146, line: 44, baseType: !249, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !251, file: !146, line: 45, baseType: !13, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !145, file: !146, line: 63, baseType: !256, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !146, line: 32, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !146, line: 34, size: 96, elements: !259)
!259 = !{!260, !265, !266}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !258, file: !146, line: 35, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !146, line: 30, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !13}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !146, line: 36, baseType: !13, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !146, line: 37, baseType: !256, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !145, file: !146, line: 64, baseType: !47, size: 32, offset: 288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !135, file: !136, line: 42, baseType: !47, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !135, file: !136, line: 43, baseType: !48, size: 320, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !135, file: !136, line: 45, baseType: !42, size: 32, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !135, file: !136, line: 47, baseType: !272, size: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !8, line: 26, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !276, line: 121, size: 896, elements: !277)
!276 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!277 = !{!278, !279, !280, !281, !284, !291, !293, !298, !303, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 122, baseType: !13, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !275, file: !276, line: 123, baseType: !6, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !275, file: !276, line: 124, baseType: !6, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !275, file: !276, line: 126, baseType: !282, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !283, line: 17, baseType: !62)
!283 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !275, file: !276, line: 128, baseType: !285, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !286, line: 19, baseType: !287)
!286 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !273, !71, !69}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !45, line: 135, baseType: !62)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !275, file: !276, line: 129, baseType: !292, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !286, line: 22, baseType: !287)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !275, file: !276, line: 130, baseType: !294, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !286, line: 20, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!290, !273, !159, !172}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !275, file: !276, line: 131, baseType: !299, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !286, line: 23, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DISubroutineType(types: !302)
!302 = !{!159, !273, !159, !172}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !275, file: !276, line: 133, baseType: !304, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !276, line: 16, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !276, line: 18, size: 960, elements: !307)
!307 = !{!308, !309, !321, !323, !324, !325, !326, !327, !328, !329, !334, !335, !336, !337, !338, !339, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !306, file: !276, line: 19, baseType: !282, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !306, file: !276, line: 21, baseType: !310, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !312, line: 297, size: 128, elements: !313)
!312 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!313 = !{!314, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !311, file: !312, line: 298, baseType: !315, size: 16)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !45, line: 409, baseType: !316)
!316 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !311, file: !312, line: 299, baseType: !318, size: 112, offset: 16)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !306, file: !276, line: 22, baseType: !322, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !45, line: 404, baseType: !15)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !306, file: !276, line: 23, baseType: !69, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !306, file: !276, line: 24, baseType: !64, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !276, line: 26, baseType: !62, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !306, file: !276, line: 28, baseType: !62, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !306, file: !276, line: 29, baseType: !62, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !306, file: !276, line: 30, baseType: !62, size: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !306, file: !276, line: 38, baseType: !330, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !8, line: 32, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !273}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !306, file: !276, line: 40, baseType: !13, size: 32, offset: 352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !306, file: !276, line: 42, baseType: !48, size: 320, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !306, file: !276, line: 43, baseType: !47, size: 32, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !306, file: !276, line: 45, baseType: !69, size: 32, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !306, file: !276, line: 47, baseType: !69, size: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !306, file: !276, line: 49, baseType: !340, size: 32, offset: 800)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !341, line: 16, baseType: !109)
!341 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !306, file: !276, line: 51, baseType: !304, size: 32, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !306, file: !276, line: 52, baseType: !273, size: 32, offset: 864)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !306, file: !276, line: 54, baseType: !42, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !306, file: !276, line: 56, baseType: !15, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !306, file: !276, line: 57, baseType: !15, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !306, file: !276, line: 58, baseType: !15, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !306, file: !276, line: 60, baseType: !15, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !306, file: !276, line: 61, baseType: !15, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !306, file: !276, line: 62, baseType: !15, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !306, file: !276, line: 63, baseType: !15, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !306, file: !276, line: 64, baseType: !15, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !306, file: !276, line: 65, baseType: !15, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !306, file: !276, line: 66, baseType: !15, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !306, file: !276, line: 67, baseType: !15, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !306, file: !276, line: 70, baseType: !15, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !306, file: !276, line: 72, baseType: !15, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !306, file: !276, line: 73, baseType: !15, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !306, file: !276, line: 74, baseType: !15, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !306, file: !276, line: 76, baseType: !15, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !306, file: !276, line: 77, baseType: !15, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !306, file: !276, line: 78, baseType: !15, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !275, file: !276, line: 135, baseType: !172, size: 32, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !275, file: !276, line: 137, baseType: !47, size: 32, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !275, file: !276, line: 139, baseType: !143, size: 32, offset: 352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !275, file: !276, line: 141, baseType: !62, size: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !275, file: !276, line: 143, baseType: !310, size: 32, offset: 416)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !275, file: !276, line: 144, baseType: !322, size: 32, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !275, file: !276, line: 145, baseType: !64, size: 64, offset: 480)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !275, file: !276, line: 147, baseType: !64, size: 64, offset: 544)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !275, file: !276, line: 148, baseType: !372, size: 16, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !373, line: 12, baseType: !374)
!373 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 186, baseType: !316)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !275, file: !276, line: 154, baseType: !310, size: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !275, file: !276, line: 155, baseType: !322, size: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !275, file: !276, line: 157, baseType: !165, size: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !275, file: !276, line: 159, baseType: !117, size: 64, offset: 736)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !275, file: !276, line: 161, baseType: !81, size: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !275, file: !276, line: 163, baseType: !42, size: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !275, file: !276, line: 165, baseType: !15, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !275, file: !276, line: 167, baseType: !15, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !275, file: !276, line: 169, baseType: !15, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !275, file: !276, line: 170, baseType: !15, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !275, file: !276, line: 171, baseType: !15, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !275, file: !276, line: 173, baseType: !15, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !275, file: !276, line: 174, baseType: !15, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !275, file: !276, line: 175, baseType: !15, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !275, file: !276, line: 176, baseType: !15, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !275, file: !276, line: 178, baseType: !15, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !275, file: !276, line: 179, baseType: !15, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !275, file: !276, line: 180, baseType: !15, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !275, file: !276, line: 181, baseType: !15, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !275, file: !276, line: 183, baseType: !15, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !135, file: !136, line: 48, baseType: !273, size: 32, offset: 480)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !135, file: !136, line: 49, baseType: !42, size: 32, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !135, file: !136, line: 51, baseType: !398, size: 32, offset: 544)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !8, line: 15, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !402, line: 222, size: 800, elements: !403)
!402 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!403 = !{!404, !405, !406, !407, !408, !409, !410, !413, !414, !463, !464, !470, !474, !475, !476, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !401, file: !402, line: 223, baseType: !42, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !401, file: !402, line: 224, baseType: !42, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !402, line: 226, baseType: !100, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !401, file: !402, line: 228, baseType: !42, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !401, file: !402, line: 229, baseType: !42, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !401, file: !402, line: 231, baseType: !42, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !401, file: !402, line: 232, baseType: !411, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !401, file: !402, line: 234, baseType: !13, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !401, file: !402, line: 235, baseType: !415, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !8, line: 22, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !57, line: 77, size: 224, elements: !418)
!418 = !{!419, !420, !421, !460, !461, !462}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !417, file: !57, line: 78, baseType: !64, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !57, line: 79, baseType: !42, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !417, file: !57, line: 80, baseType: !422, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DISubroutineType(types: !424)
!424 = !{!100, !425, !415, !13}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !8, line: 16, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !57, line: 116, size: 384, elements: !428)
!428 = !{!429, !430, !441, !442, !443, !444, !453, !454, !455, !456, !457, !459}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !57, line: 117, baseType: !100, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !427, file: !57, line: 118, baseType: !431, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !433, line: 22, baseType: !434)
!433 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 16, size: 160, elements: !435)
!435 = !{!436, !437, !438, !439, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !434, file: !433, line: 17, baseType: !13, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !434, file: !433, line: 18, baseType: !42, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !434, file: !433, line: 19, baseType: !69, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !434, file: !433, line: 20, baseType: !42, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !434, file: !433, line: 21, baseType: !143, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !427, file: !57, line: 120, baseType: !133, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !427, file: !57, line: 121, baseType: !143, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !427, file: !57, line: 122, baseType: !143, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !427, file: !57, line: 123, baseType: !445, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !57, line: 103, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 98, size: 1344, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !447, file: !57, line: 99, baseType: !180, size: 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !447, file: !57, line: 100, baseType: !165, size: 32, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !447, file: !57, line: 101, baseType: !165, size: 32, offset: 1248)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !447, file: !57, line: 102, baseType: !42, size: 32, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !427, file: !57, line: 124, baseType: !47, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !427, file: !57, line: 126, baseType: !13, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !427, file: !57, line: 127, baseType: !42, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !427, file: !57, line: 128, baseType: !42, size: 32, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !427, file: !57, line: 130, baseType: !458, size: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !57, line: 112, baseType: !422)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !427, file: !57, line: 131, baseType: !100, size: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !417, file: !57, line: 81, baseType: !42, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !417, file: !57, line: 82, baseType: !42, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !417, file: !57, line: 83, baseType: !13, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !401, file: !402, line: 236, baseType: !42, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !401, file: !402, line: 238, baseType: !465, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !47}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !43, line: 78, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !45, line: 140, baseType: !62)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !401, file: !402, line: 240, baseType: !471, size: 32, offset: 352)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!468, !133}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !401, file: !402, line: 242, baseType: !471, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !401, file: !402, line: 243, baseType: !471, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !401, file: !402, line: 244, baseType: !477, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !133}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !401, file: !402, line: 245, baseType: !477, size: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !401, file: !402, line: 247, baseType: !477, size: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !401, file: !402, line: 249, baseType: !44, size: 32, offset: 544)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !401, file: !402, line: 250, baseType: !44, size: 32, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !401, file: !402, line: 251, baseType: !44, size: 32, offset: 608)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !401, file: !402, line: 252, baseType: !44, size: 32, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !401, file: !402, line: 253, baseType: !44, size: 32, offset: 672)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !401, file: !402, line: 254, baseType: !44, size: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !401, file: !402, line: 255, baseType: !44, size: 32, offset: 736)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !401, file: !402, line: 256, baseType: !44, size: 32, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !135, file: !136, line: 52, baseType: !42, size: 32, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !135, file: !136, line: 53, baseType: !42, size: 32, offset: 608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !135, file: !136, line: 55, baseType: !117, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !135, file: !136, line: 56, baseType: !42, size: 32, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !135, file: !136, line: 58, baseType: !432, size: 160, offset: 736)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !135, file: !136, line: 59, baseType: !432, size: 160, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !135, file: !136, line: 61, baseType: !432, size: 160, offset: 1056)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !135, file: !136, line: 62, baseType: !498, size: 96, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !105, line: 32, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !105, line: 37, size: 96, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !499, file: !105, line: 38, baseType: !111, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !499, file: !105, line: 39, baseType: !111, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !499, file: !105, line: 40, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !105, line: 34, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !111, !111, !111}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !135, file: !136, line: 63, baseType: !104, size: 160, offset: 1312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !135, file: !136, line: 65, baseType: !510, size: 224, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !511, line: 31, baseType: !512)
!511 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 25, size: 224, elements: !513)
!513 = !{!514, !522, !523, !524, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !512, file: !511, line: 26, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !511, line: 16, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !511, line: 18, size: 96, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !517, file: !511, line: 19, baseType: !13, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !517, file: !511, line: 20, baseType: !42, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !511, line: 21, baseType: !515, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !512, file: !511, line: 27, baseType: !516, size: 96, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !511, line: 28, baseType: !69, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !512, file: !511, line: 29, baseType: !42, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !512, file: !511, line: 30, baseType: !143, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !135, file: !136, line: 66, baseType: !510, size: 224, offset: 1696)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !135, file: !136, line: 68, baseType: !42, size: 32, offset: 1920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !135, file: !136, line: 69, baseType: !42, size: 32, offset: 1952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !135, file: !136, line: 71, baseType: !273, size: 32, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !135, file: !136, line: 72, baseType: !6, size: 32, offset: 2016)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !135, file: !136, line: 73, baseType: !6, size: 32, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !135, file: !136, line: 75, baseType: !133, size: 32, offset: 2080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !135, file: !136, line: 77, baseType: !64, size: 64, offset: 2112)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !135, file: !136, line: 78, baseType: !64, size: 64, offset: 2176)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !135, file: !136, line: 79, baseType: !64, size: 64, offset: 2240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !135, file: !136, line: 80, baseType: !64, size: 64, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !135, file: !136, line: 81, baseType: !64, size: 64, offset: 2368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !135, file: !136, line: 82, baseType: !64, size: 64, offset: 2432)
!539 = !{!540, !541, !542, !543}
!540 = !DILocalVariable(name: "cycle", arg: 1, scope: !130, file: !3, line: 18, type: !133)
!541 = !DILocalVariable(name: "posted", arg: 2, scope: !130, file: !3, line: 18, type: !122)
!542 = !DILocalVariable(name: "q", scope: !130, file: !3, line: 20, type: !122)
!543 = !DILocalVariable(name: "ev", scope: !130, file: !3, line: 21, type: !6)
!544 = !{!545, !545, i64 0}
!545 = !{!"any pointer", !546, i64 0}
!546 = !{!"omnipotent char", !547, i64 0}
!547 = !{!"Simple C/C++ TBAA"}
!548 = !DIExpression()
!549 = !DILocation(line: 18, column: 39, scope: !130)
!550 = !DILocation(line: 18, column: 59, scope: !130)
!551 = !DILocation(line: 20, column: 5, scope: !130)
!552 = !DILocation(line: 20, column: 19, scope: !130)
!553 = !DILocation(line: 21, column: 5, scope: !130)
!554 = !DILocation(line: 21, column: 19, scope: !130)
!555 = !DILocation(line: 23, column: 5, scope: !130)
!556 = !DILocation(line: 23, column: 13, scope: !130)
!557 = !{!558, !545, i64 0}
!558 = !{!"ngx_queue_s", !545, i64 0, !545, i64 4}
!559 = !DILocation(line: 23, column: 12, scope: !130)
!560 = !DILocation(line: 25, column: 13, scope: !561)
!561 = distinct !DILexicalBlock(scope: !130, file: !3, line: 23, column: 38)
!562 = !{!558, !545, i64 4}
!563 = !DILocation(line: 25, column: 11, scope: !561)
!564 = !DILocation(line: 26, column: 14, scope: !561)
!565 = !DILocation(line: 26, column: 12, scope: !561)
!566 = !DILocation(line: 31, column: 9, scope: !561)
!567 = !DILocation(line: 33, column: 9, scope: !561)
!568 = !DILocation(line: 33, column: 13, scope: !561)
!569 = !{!570, !545, i64 8}
!570 = !{!"ngx_event_s", !545, i64 0, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 4, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 5, !571, i64 6, !571, i64 6, !571, i64 6, !571, i64 6, !571, i64 6, !545, i64 8, !571, i64 12, !545, i64 16, !572, i64 20, !558, i64 40}
!571 = !{!"int", !546, i64 0}
!572 = !{!"ngx_rbtree_node_s", !571, i64 0, !545, i64 4, !545, i64 8, !545, i64 12, !546, i64 16, !546, i64 17}
!573 = !DILocation(line: 33, column: 21, scope: !561)
!574 = distinct !{!574, !555, !575}
!575 = !DILocation(line: 34, column: 5, scope: !130)
!576 = !DILocation(line: 35, column: 1, scope: !130)
