; ModuleID = 'src/event/ngx_event_timer.c'
source_filename = "src/event/ngx_event_timer.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }
%struct.ngx_rbtree_s = type { %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, void (%struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*)* }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_event_s = type { i8*, i24, void (%struct.ngx_event_s*)*, i32, %struct.ngx_log_s*, %struct.ngx_rbtree_node_s, %struct.ngx_queue_s }
%struct.ngx_queue_s = type { %struct.ngx_queue_s*, %struct.ngx_queue_s* }

@ngx_event_timer_sentinel = internal global %struct.ngx_rbtree_node_s zeroinitializer, align 4, !dbg !0
@ngx_event_timer_rbtree = common global %struct.ngx_rbtree_s zeroinitializer, align 4, !dbg !131
@ngx_current_msec = external global i32, align 4

; Function Attrs: nounwind
define i32 @ngx_event_timer_init(%struct.ngx_log_s* %log) #0 !dbg !146 {
entry:
  %log.addr = alloca %struct.ngx_log_s*, align 4

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_event_timer_sentinel", scope: !2, file: !3, line: 14, type: !112, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !130)
!3 = !DIFile(filename: "src/event/ngx_event_timer.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !15, !20, !108}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !7, line: 16, baseType: !8)
!7 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !9, line: 16, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !11, line: 79, baseType: !12)
!11 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 125, baseType: !14)
!13 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !7, line: 17, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !9, line: 17, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !11, line: 78, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !13, line: 140, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !22, line: 24, baseType: !23)
!22 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !24, line: 30, size: 384, elements: !25)
!24 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !{!26, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !54, !55, !111, !122}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !23, file: !24, line: 31, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !23, file: !24, line: 33, baseType: !14, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !23, file: !24, line: 35, baseType: !14, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !23, file: !24, line: 38, baseType: !14, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !23, file: !24, line: 44, baseType: !14, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !23, file: !24, line: 46, baseType: !14, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !23, file: !24, line: 49, baseType: !14, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !23, file: !24, line: 51, baseType: !14, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !23, file: !24, line: 54, baseType: !14, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !23, file: !24, line: 56, baseType: !14, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !23, file: !24, line: 57, baseType: !14, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !23, file: !24, line: 59, baseType: !14, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !23, file: !24, line: 60, baseType: !14, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !23, file: !24, line: 62, baseType: !14, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !23, file: !24, line: 64, baseType: !14, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !23, file: !24, line: 67, baseType: !14, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !23, file: !24, line: 69, baseType: !14, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !23, file: !24, line: 71, baseType: !14, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !23, file: !24, line: 74, baseType: !14, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !23, file: !24, line: 75, baseType: !14, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !23, file: !24, line: 77, baseType: !14, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !23, file: !24, line: 107, baseType: !14, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !23, file: !24, line: 110, baseType: !50, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !22, line: 31, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !20}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !23, file: !24, line: 117, baseType: !10, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !23, file: !24, line: 119, baseType: !56, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !22, line: 20, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !59, line: 50, size: 320, elements: !60)
!59 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = !{!61, !62, !88, !92, !95, !100, !101, !106, !107, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !58, file: !59, line: 51, baseType: !10, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !58, file: !59, line: 52, baseType: !63, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !22, line: 21, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !66, line: 89, size: 160, elements: !67)
!66 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!67 = !{!68, !71, !83, !87}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !66, line: 90, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !70, line: 16, baseType: !19)
!70 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 91, baseType: !72, size: 64, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !73, line: 19, baseType: !74)
!73 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 16, size: 64, elements: !75)
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !73, line: 17, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 120, baseType: !14)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !73, line: 18, baseType: !79, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !81, line: 64, baseType: !82)
!81 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !65, file: !66, line: 93, baseType: !84, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !63, !56}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !66, line: 94, baseType: !27, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !58, file: !59, line: 54, baseType: !89, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !90, line: 98, baseType: !91)
!90 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !58, file: !59, line: 56, baseType: !93, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !13, line: 75, baseType: !94)
!94 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !58, file: !59, line: 58, baseType: !96, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !59, line: 45, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!79, !56, !79, !77}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !59, line: 59, baseType: !27, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !58, file: !59, line: 61, baseType: !102, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !59, line: 46, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !56, !10, !79, !77}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !58, file: !59, line: 62, baseType: !27, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !58, file: !59, line: 70, baseType: !108, size: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !59, line: 72, baseType: !56, size: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !23, file: !24, line: 121, baseType: !112, size: 160, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !9, line: 20, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !9, line: 22, size: 160, elements: !114)
!114 = !{!115, !116, !118, !119, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !9, line: 23, baseType: !8, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !113, file: !9, line: 24, baseType: !117, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !113, file: !9, line: 25, baseType: !117, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !113, file: !9, line: 26, baseType: !117, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !113, file: !9, line: 27, baseType: !80, size: 8, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !9, line: 28, baseType: !80, size: 8, offset: 136)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !23, file: !24, line: 124, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !124, line: 16, baseType: !125)
!124 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !124, line: 18, size: 64, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !124, line: 19, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !124, line: 20, baseType: !128, size: 32, offset: 32)
!130 = !{!131, !0}
!131 = !DIGlobalVariableExpression(var: !132)
!132 = distinct !DIGlobalVariable(name: "ngx_event_timer_rbtree", scope: !2, file: !3, line: 13, type: !133, isLocal: false, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !9, line: 32, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !9, line: 37, size: 96, elements: !135)
!135 = !{!136, !137, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !134, file: !9, line: 38, baseType: !117, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !134, file: !9, line: 39, baseType: !117, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !134, file: !9, line: 40, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !9, line: 34, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !117, !117, !117}
!143 = !{i32 2, !"Dwarf Version", i32 4}
!144 = !{i32 2, !"Debug Info Version", i32 3}
!145 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!146 = distinct !DISubprogram(name: "ngx_event_timer_init", scope: !3, file: !3, line: 23, type: !147, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !149)
!147 = !DISubroutineType(types: !148)
!148 = !{!17, !56}
!149 = !{!150}
!150 = !DILocalVariable(name: "log", arg: 1, scope: !146, file: !3, line: 23, type: !56)
!151 = !{!152, !152, i64 0}
!152 = !{!"any pointer", !153, i64 0}
!153 = !{!"omnipotent char", !154, i64 0}
!154 = !{!"Simple C/C++ TBAA"}
!155 = !DIExpression()
!156 = !DILocation(line: 23, column: 33, scope: !146)
!157 = !DILocation(line: 25, column: 5, scope: !146)
!158 = !{!159, !153, i64 16}
!159 = !{!"ngx_rbtree_node_s", !160, i64 0, !152, i64 4, !152, i64 8, !152, i64 12, !153, i64 16, !153, i64 17}
!160 = !{!"int", !153, i64 0}
!161 = !{!162, !152, i64 0}
!162 = !{!"ngx_rbtree_s", !152, i64 0, !152, i64 4, !152, i64 8}
!163 = !{!162, !152, i64 4}
!164 = !{!162, !152, i64 8}
!165 = !DILocation(line: 28, column: 5, scope: !146)
!166 = distinct !DISubprogram(name: "ngx_event_find_timer", scope: !3, file: !3, line: 33, type: !167, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!6}
!169 = !{!170, !171, !172, !173}
!170 = !DILocalVariable(name: "timer", scope: !166, file: !3, line: 35, type: !15)
!171 = !DILocalVariable(name: "node", scope: !166, file: !3, line: 36, type: !117)
!172 = !DILocalVariable(name: "root", scope: !166, file: !3, line: 36, type: !117)
!173 = !DILocalVariable(name: "sentinel", scope: !166, file: !3, line: 36, type: !117)
!174 = !DILocation(line: 35, column: 5, scope: !166)
!175 = !DILocation(line: 35, column: 25, scope: !166)
!176 = !DILocation(line: 36, column: 5, scope: !166)
!177 = !DILocation(line: 36, column: 25, scope: !166)
!178 = !DILocation(line: 36, column: 32, scope: !166)
!179 = !DILocation(line: 36, column: 39, scope: !166)
!180 = !DILocation(line: 38, column: 32, scope: !181)
!181 = distinct !DILexicalBlock(scope: !166, file: !3, line: 38, column: 9)
!182 = !DILocation(line: 38, column: 37, scope: !181)
!183 = !DILocation(line: 38, column: 9, scope: !166)
!184 = !DILocation(line: 39, column: 9, scope: !185)
!185 = distinct !DILexicalBlock(scope: !181, file: !3, line: 38, column: 67)
!186 = !DILocation(line: 42, column: 35, scope: !166)
!187 = !DILocation(line: 42, column: 10, scope: !166)
!188 = !DILocation(line: 43, column: 39, scope: !166)
!189 = !DILocation(line: 43, column: 14, scope: !166)
!190 = !DILocation(line: 45, column: 27, scope: !166)
!191 = !DILocation(line: 45, column: 33, scope: !166)
!192 = !DILocation(line: 45, column: 12, scope: !166)
!193 = !DILocation(line: 45, column: 10, scope: !166)
!194 = !DILocation(line: 47, column: 31, scope: !166)
!195 = !DILocation(line: 47, column: 37, scope: !166)
!196 = !{!159, !160, i64 0}
!197 = !DILocation(line: 47, column: 43, scope: !166)
!198 = !{!160, !160, i64 0}
!199 = !DILocation(line: 47, column: 41, scope: !166)
!200 = !DILocation(line: 47, column: 11, scope: !166)
!201 = !DILocation(line: 49, column: 26, scope: !166)
!202 = !DILocation(line: 49, column: 32, scope: !166)
!203 = !DILocation(line: 49, column: 38, scope: !166)
!204 = !DILocation(line: 49, column: 5, scope: !166)
!205 = !DILocation(line: 50, column: 1, scope: !166)
