; ModuleID = 'src/event/ngx_event_accept.c'
source_filename = "src/event/ngx_event_accept.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "buffer", scope: !2, file: !3, line: 338, type: !654, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ngx_event_recvmsg", scope: !3, file: !3, line: 326, type: !4, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: true, unit: !122, variables: !552)
!3 = !DIFile(filename: "src/event/ngx_event_accept.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !8, line: 24, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !10, line: 30, size: 384, elements: !11)
!10 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !{!12, !14, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !39, !44, !101, !114}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !9, file: !10, line: 31, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !9, file: !10, line: 33, baseType: !15, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !9, file: !10, line: 35, baseType: !15, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !9, file: !10, line: 38, baseType: !15, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !9, file: !10, line: 44, baseType: !15, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !9, file: !10, line: 46, baseType: !15, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !9, file: !10, line: 49, baseType: !15, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !9, file: !10, line: 51, baseType: !15, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !9, file: !10, line: 54, baseType: !15, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !9, file: !10, line: 56, baseType: !15, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !9, file: !10, line: 57, baseType: !15, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !9, file: !10, line: 59, baseType: !15, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !9, file: !10, line: 60, baseType: !15, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !9, file: !10, line: 62, baseType: !15, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !9, file: !10, line: 64, baseType: !15, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !9, file: !10, line: 67, baseType: !15, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !9, file: !10, line: 69, baseType: !15, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !9, file: !10, line: 71, baseType: !15, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !9, file: !10, line: 74, baseType: !15, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !9, file: !10, line: 75, baseType: !15, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !9, file: !10, line: 77, baseType: !15, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !9, file: !10, line: 107, baseType: !15, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !9, file: !10, line: 110, baseType: !37, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !8, line: 31, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !9, file: !10, line: 117, baseType: !40, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !41, line: 79, baseType: !42)
!41 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !43, line: 125, baseType: !15)
!43 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !9, file: !10, line: 119, baseType: !45, size: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !8, line: 20, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !48, line: 50, size: 320, elements: !49)
!48 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !{!50, !51, !78, !82, !85, !90, !91, !96, !97, !100}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !47, file: !48, line: 51, baseType: !40, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !47, file: !48, line: 52, baseType: !52, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !8, line: 21, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !55, line: 89, size: 160, elements: !56)
!55 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!56 = !{!57, !61, !73, !77}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !54, file: !55, line: 90, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !59, line: 16, baseType: !60)
!59 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 91, baseType: !62, size: 64, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !63, line: 19, baseType: !64)
!63 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 16, size: 64, elements: !65)
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, file: !63, line: 17, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 120, baseType: !15)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !63, line: 18, baseType: !69, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !71, line: 64, baseType: !72)
!71 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!72 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !54, file: !55, line: 93, baseType: !74, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !52, !45}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !55, line: 94, baseType: !13, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !47, file: !48, line: 54, baseType: !79, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !80, line: 98, baseType: !81)
!80 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !47, file: !48, line: 56, baseType: !83, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !43, line: 75, baseType: !84)
!84 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !47, file: !48, line: 58, baseType: !86, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !48, line: 45, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!69, !45, !69, !67}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !48, line: 59, baseType: !13, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !47, file: !48, line: 61, baseType: !92, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !48, line: 46, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !45, !40, !69, !67}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !47, file: !48, line: 62, baseType: !13, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !47, file: !48, line: 70, baseType: !98, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !48, line: 72, baseType: !45, size: 32, offset: 288)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !9, file: !10, line: 121, baseType: !102, size: 160, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !103, line: 20, baseType: !104)
!103 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !103, line: 22, size: 160, elements: !105)
!105 = !{!106, !108, !110, !111, !112, !113}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !104, file: !103, line: 23, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !103, line: 16, baseType: !40)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !104, file: !103, line: 24, baseType: !109, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !104, file: !103, line: 25, baseType: !109, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !104, file: !103, line: 26, baseType: !109, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !104, file: !103, line: 27, baseType: !70, size: 8, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !103, line: 28, baseType: !70, size: 8, offset: 136)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !9, file: !10, line: 124, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !116, line: 16, baseType: !117)
!116 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !116, line: 18, size: 64, elements: !118)
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !116, line: 19, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !116, line: 20, baseType: !120, size: 32, offset: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !123, retainedTypes: !135, globals: !551)
!123 = !{!124, !130}
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 109, size: 32, elements: !126)
!125 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "NGX_TCP_NOPUSH_UNSET", value: 0)
!128 = !DIEnumerator(name: "NGX_TCP_NOPUSH_SET", value: 1)
!129 = !DIEnumerator(name: "NGX_TCP_NOPUSH_DISABLED", value: 2)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 102, size: 32, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIEnumerator(name: "NGX_TCP_NODELAY_UNSET", value: 0)
!133 = !DIEnumerator(name: "NGX_TCP_NODELAY_SET", value: 1)
!134 = !DIEnumerator(name: "NGX_TCP_NODELAY_DISABLED", value: 2)
!135 = !{!136, !284, !13, !324, !67, !541, !84, !548, !69, !549}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !8, line: 17, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !139, line: 38, size: 2496, elements: !140)
!139 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!140 = !{!141, !145, !271, !272, !273, !274, !397, !398, !399, !492, !493, !494, !495, !496, !497, !498, !499, !510, !511, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !138, file: !139, line: 39, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !138, file: !139, line: 40, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !8, line: 18, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !149, line: 57, size: 320, elements: !150)
!149 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!150 = !{!151, !159, !160, !161, !251, !258, !270}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !148, file: !149, line: 58, baseType: !152, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !149, line: 54, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 49, size: 128, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !153, file: !149, line: 50, baseType: !69, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !153, file: !149, line: 51, baseType: !69, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !149, line: 52, baseType: !146, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !153, file: !149, line: 53, baseType: !40, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !148, file: !149, line: 59, baseType: !67, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !148, file: !149, line: 60, baseType: !146, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !148, file: !149, line: 61, baseType: !162, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !8, line: 19, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !165, line: 59, size: 64, elements: !166)
!165 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!166 = !{!167, !250}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !164, file: !165, line: 60, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !165, line: 18, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !165, line: 20, size: 352, elements: !171)
!171 = !{!172, !173, !174, !176, !177, !178, !179, !181, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !170, file: !165, line: 21, baseType: !69, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !170, file: !165, line: 22, baseType: !69, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !170, file: !165, line: 23, baseType: !175, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !43, line: 222, baseType: !60)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !170, file: !165, line: 24, baseType: !175, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !170, file: !165, line: 26, baseType: !69, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !170, file: !165, line: 27, baseType: !69, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !170, file: !165, line: 28, baseType: !180, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !165, line: 16, baseType: !13)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !170, file: !165, line: 29, baseType: !182, size: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !8, line: 23, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !185, line: 16, size: 1216, elements: !186)
!185 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !{!187, !188, !189, !232, !233, !234, !235, !236}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !184, file: !185, line: 17, baseType: !58, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !185, line: 18, baseType: !62, size: 64, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !184, file: !185, line: 19, baseType: !190, size: 960, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !59, line: 17, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !192, line: 4, size: 960, elements: !193)
!192 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!193 = !{!194, !196, !197, !199, !200, !202, !203, !205, !207, !209, !210, !211, !212, !213, !214, !216, !217, !219, !220, !225, !226, !227}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !191, file: !192, line: 6, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !43, line: 232, baseType: !15)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !191, file: !192, line: 7, baseType: !195, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !191, file: !192, line: 8, baseType: !198, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !43, line: 227, baseType: !15)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !191, file: !192, line: 9, baseType: !198, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !191, file: !192, line: 10, baseType: !201, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !43, line: 217, baseType: !15)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !191, file: !192, line: 11, baseType: !201, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !191, file: !192, line: 13, baseType: !204, size: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !43, line: 212, baseType: !15)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !191, file: !192, line: 14, baseType: !206, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !43, line: 304, baseType: !15)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !191, file: !192, line: 15, baseType: !208, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !43, line: 309, baseType: !15)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !191, file: !192, line: 16, baseType: !15, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !191, file: !192, line: 17, baseType: !195, size: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !191, file: !192, line: 18, baseType: !195, size: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !191, file: !192, line: 19, baseType: !175, size: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !191, file: !192, line: 20, baseType: !175, size: 32, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !191, file: !192, line: 21, baseType: !215, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !43, line: 237, baseType: !84)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !191, file: !192, line: 22, baseType: !215, size: 32, offset: 480)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !191, file: !192, line: 23, baseType: !218, size: 32, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !43, line: 242, baseType: !60)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !191, file: !192, line: 24, baseType: !218, size: 32, offset: 544)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !191, file: !192, line: 26, baseType: !221, size: 64, offset: 576)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !43, line: 288, size: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !221, file: !43, line: 288, baseType: !83, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !221, file: !43, line: 288, baseType: !84, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !191, file: !192, line: 27, baseType: !221, size: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !191, file: !192, line: 28, baseType: !221, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !191, file: !192, line: 29, baseType: !228, size: 192, offset: 768)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 192, elements: !230)
!229 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!230 = !{!231}
!231 = !DISubrange(count: 3)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !184, file: !185, line: 21, baseType: !175, size: 32, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !184, file: !185, line: 22, baseType: !175, size: 32, offset: 1120)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !184, file: !185, line: 24, baseType: !45, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !184, file: !185, line: 37, baseType: !15, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !184, file: !185, line: 38, baseType: !15, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !170, file: !165, line: 30, baseType: !168, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !170, file: !165, line: 34, baseType: !15, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !170, file: !165, line: 40, baseType: !15, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !170, file: !165, line: 43, baseType: !15, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !170, file: !165, line: 45, baseType: !15, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !170, file: !165, line: 46, baseType: !15, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !170, file: !165, line: 47, baseType: !15, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !170, file: !165, line: 48, baseType: !15, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !170, file: !165, line: 49, baseType: !15, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !170, file: !165, line: 50, baseType: !15, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !170, file: !165, line: 52, baseType: !15, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !170, file: !165, line: 53, baseType: !15, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !170, file: !165, line: 55, baseType: !60, size: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !165, line: 61, baseType: !162, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !148, file: !149, line: 62, baseType: !252, size: 32, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !149, line: 41, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !149, line: 43, size: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !149, line: 44, baseType: !252, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !254, file: !149, line: 45, baseType: !13, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !148, file: !149, line: 63, baseType: !259, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !149, line: 32, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !149, line: 34, size: 96, elements: !262)
!262 = !{!263, !268, !269}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !261, file: !149, line: 35, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !149, line: 30, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !13}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !149, line: 36, baseType: !13, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !149, line: 37, baseType: !259, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !148, file: !149, line: 64, baseType: !45, size: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !138, file: !139, line: 42, baseType: !45, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !138, file: !139, line: 43, baseType: !46, size: 320, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !138, file: !139, line: 45, baseType: !40, size: 32, offset: 416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !138, file: !139, line: 47, baseType: !275, size: 32, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !8, line: 26, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !125, line: 121, size: 896, elements: !279)
!279 = !{!280, !281, !282, !283, !286, !293, !295, !300, !305, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !125, line: 122, baseType: !13, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !278, file: !125, line: 123, baseType: !6, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !278, file: !125, line: 124, baseType: !6, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !278, file: !125, line: 126, baseType: !284, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !285, line: 17, baseType: !60)
!285 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !278, file: !125, line: 128, baseType: !287, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !288, line: 19, baseType: !289)
!288 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !276, !69, !67}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !43, line: 135, baseType: !60)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !278, file: !125, line: 129, baseType: !294, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !288, line: 22, baseType: !289)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !278, file: !125, line: 130, baseType: !296, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !288, line: 20, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{!292, !276, !162, !175}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !278, file: !125, line: 131, baseType: !301, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !288, line: 23, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!162, !276, !162, !175}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !278, file: !125, line: 133, baseType: !306, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !125, line: 16, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !125, line: 18, size: 960, elements: !309)
!309 = !{!310, !311, !323, !325, !326, !327, !328, !329, !330, !331, !336, !337, !338, !339, !340, !341, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !308, file: !125, line: 19, baseType: !284, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !308, file: !125, line: 21, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !314, line: 297, size: 128, elements: !315)
!314 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!315 = !{!316, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !313, file: !314, line: 298, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !43, line: 409, baseType: !318)
!318 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !313, file: !314, line: 299, baseType: !320, size: 112, offset: 16)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 112, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 14)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !308, file: !125, line: 22, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !43, line: 404, baseType: !15)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !308, file: !125, line: 23, baseType: !67, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !308, file: !125, line: 24, baseType: !62, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !125, line: 26, baseType: !60, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !308, file: !125, line: 28, baseType: !60, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !308, file: !125, line: 29, baseType: !60, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !308, file: !125, line: 30, baseType: !60, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !308, file: !125, line: 38, baseType: !332, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !8, line: 32, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !276}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !308, file: !125, line: 40, baseType: !13, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !308, file: !125, line: 42, baseType: !46, size: 320, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !308, file: !125, line: 43, baseType: !45, size: 32, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !308, file: !125, line: 45, baseType: !67, size: 32, offset: 736)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !308, file: !125, line: 47, baseType: !67, size: 32, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !308, file: !125, line: 49, baseType: !342, size: 32, offset: 800)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !343, line: 16, baseType: !107)
!343 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !308, file: !125, line: 51, baseType: !306, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !308, file: !125, line: 52, baseType: !276, size: 32, offset: 864)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !308, file: !125, line: 54, baseType: !40, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !308, file: !125, line: 56, baseType: !15, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !308, file: !125, line: 57, baseType: !15, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !308, file: !125, line: 58, baseType: !15, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !308, file: !125, line: 60, baseType: !15, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !308, file: !125, line: 61, baseType: !15, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !308, file: !125, line: 62, baseType: !15, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !308, file: !125, line: 63, baseType: !15, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !308, file: !125, line: 64, baseType: !15, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !308, file: !125, line: 65, baseType: !15, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !308, file: !125, line: 66, baseType: !15, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !308, file: !125, line: 67, baseType: !15, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !308, file: !125, line: 70, baseType: !15, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !308, file: !125, line: 72, baseType: !15, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !308, file: !125, line: 73, baseType: !15, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !308, file: !125, line: 74, baseType: !15, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !308, file: !125, line: 76, baseType: !15, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !308, file: !125, line: 77, baseType: !15, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !308, file: !125, line: 78, baseType: !15, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !278, file: !125, line: 135, baseType: !175, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !278, file: !125, line: 137, baseType: !45, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !278, file: !125, line: 139, baseType: !146, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !125, line: 141, baseType: !60, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !278, file: !125, line: 143, baseType: !312, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !278, file: !125, line: 144, baseType: !324, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !278, file: !125, line: 145, baseType: !62, size: 64, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !278, file: !125, line: 147, baseType: !62, size: 64, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !278, file: !125, line: 148, baseType: !374, size: 16, offset: 608)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !375, line: 12, baseType: !376)
!375 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 186, baseType: !318)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !278, file: !125, line: 154, baseType: !312, size: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !278, file: !125, line: 155, baseType: !324, size: 32, offset: 672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !278, file: !125, line: 157, baseType: !168, size: 32, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !278, file: !125, line: 159, baseType: !115, size: 64, offset: 736)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !278, file: !125, line: 161, baseType: !79, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !278, file: !125, line: 163, baseType: !40, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !278, file: !125, line: 165, baseType: !15, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !278, file: !125, line: 167, baseType: !15, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !278, file: !125, line: 169, baseType: !15, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !278, file: !125, line: 170, baseType: !15, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !278, file: !125, line: 171, baseType: !15, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !278, file: !125, line: 173, baseType: !15, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !278, file: !125, line: 174, baseType: !15, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !278, file: !125, line: 175, baseType: !15, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !278, file: !125, line: 176, baseType: !15, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !278, file: !125, line: 178, baseType: !15, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !278, file: !125, line: 179, baseType: !15, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !278, file: !125, line: 180, baseType: !15, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !278, file: !125, line: 181, baseType: !15, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !278, file: !125, line: 183, baseType: !15, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !138, file: !139, line: 48, baseType: !276, size: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !138, file: !139, line: 49, baseType: !40, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !138, file: !139, line: 51, baseType: !400, size: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !8, line: 15, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !404, line: 222, size: 800, elements: !405)
!404 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !415, !416, !465, !466, !472, !476, !477, !478, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !403, file: !404, line: 223, baseType: !40, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !403, file: !404, line: 224, baseType: !40, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !404, line: 226, baseType: !98, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !403, file: !404, line: 228, baseType: !40, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !403, file: !404, line: 229, baseType: !40, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !403, file: !404, line: 231, baseType: !40, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !403, file: !404, line: 232, baseType: !413, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !403, file: !404, line: 234, baseType: !13, size: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !403, file: !404, line: 235, baseType: !417, size: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !8, line: 22, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !55, line: 77, size: 224, elements: !420)
!420 = !{!421, !422, !423, !462, !463, !464}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !55, line: 78, baseType: !62, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !55, line: 79, baseType: !40, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !419, file: !55, line: 80, baseType: !424, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DISubroutineType(types: !426)
!426 = !{!98, !427, !417, !13}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !8, line: 16, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !55, line: 116, size: 384, elements: !430)
!430 = !{!431, !432, !443, !444, !445, !446, !455, !456, !457, !458, !459, !461}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !55, line: 117, baseType: !98, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !429, file: !55, line: 118, baseType: !433, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !435, line: 22, baseType: !436)
!435 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 16, size: 160, elements: !437)
!437 = !{!438, !439, !440, !441, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !436, file: !435, line: 17, baseType: !13, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !436, file: !435, line: 18, baseType: !40, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !435, line: 19, baseType: !67, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !436, file: !435, line: 20, baseType: !40, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !436, file: !435, line: 21, baseType: !146, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !429, file: !55, line: 120, baseType: !136, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !429, file: !55, line: 121, baseType: !146, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !429, file: !55, line: 122, baseType: !146, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !429, file: !55, line: 123, baseType: !447, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !55, line: 103, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 98, size: 1344, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !449, file: !55, line: 99, baseType: !183, size: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !449, file: !55, line: 100, baseType: !168, size: 32, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !449, file: !55, line: 101, baseType: !168, size: 32, offset: 1248)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !449, file: !55, line: 102, baseType: !40, size: 32, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !429, file: !55, line: 124, baseType: !45, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !429, file: !55, line: 126, baseType: !13, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !429, file: !55, line: 127, baseType: !40, size: 32, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !429, file: !55, line: 128, baseType: !40, size: 32, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !429, file: !55, line: 130, baseType: !460, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !55, line: 112, baseType: !424)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !429, file: !55, line: 131, baseType: !98, size: 32, offset: 352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !419, file: !55, line: 81, baseType: !40, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !419, file: !55, line: 82, baseType: !40, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !419, file: !55, line: 83, baseType: !13, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !404, line: 236, baseType: !40, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !403, file: !404, line: 238, baseType: !467, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !45}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !41, line: 78, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !43, line: 140, baseType: !60)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !403, file: !404, line: 240, baseType: !473, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DISubroutineType(types: !475)
!475 = !{!470, !136}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !403, file: !404, line: 242, baseType: !473, size: 32, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !403, file: !404, line: 243, baseType: !473, size: 32, offset: 416)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !403, file: !404, line: 244, baseType: !479, size: 32, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !136}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !403, file: !404, line: 245, baseType: !479, size: 32, offset: 480)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !403, file: !404, line: 247, baseType: !479, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !403, file: !404, line: 249, baseType: !42, size: 32, offset: 544)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !403, file: !404, line: 250, baseType: !42, size: 32, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !403, file: !404, line: 251, baseType: !42, size: 32, offset: 608)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !403, file: !404, line: 252, baseType: !42, size: 32, offset: 640)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !403, file: !404, line: 253, baseType: !42, size: 32, offset: 672)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !403, file: !404, line: 254, baseType: !42, size: 32, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !403, file: !404, line: 255, baseType: !42, size: 32, offset: 736)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !403, file: !404, line: 256, baseType: !42, size: 32, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !138, file: !139, line: 52, baseType: !40, size: 32, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !138, file: !139, line: 53, baseType: !40, size: 32, offset: 608)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !138, file: !139, line: 55, baseType: !115, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !138, file: !139, line: 56, baseType: !40, size: 32, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !138, file: !139, line: 58, baseType: !434, size: 160, offset: 736)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !138, file: !139, line: 59, baseType: !434, size: 160, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !138, file: !139, line: 61, baseType: !434, size: 160, offset: 1056)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !138, file: !139, line: 62, baseType: !500, size: 96, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !103, line: 32, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !103, line: 37, size: 96, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !501, file: !103, line: 38, baseType: !109, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !501, file: !103, line: 39, baseType: !109, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !501, file: !103, line: 40, baseType: !506, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !103, line: 34, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !109, !109, !109}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !138, file: !139, line: 63, baseType: !102, size: 160, offset: 1312)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !138, file: !139, line: 65, baseType: !512, size: 224, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !513, line: 31, baseType: !514)
!513 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 25, size: 224, elements: !515)
!515 = !{!516, !524, !525, !526, !527}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !514, file: !513, line: 26, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !513, line: 16, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !513, line: 18, size: 96, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !519, file: !513, line: 19, baseType: !13, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !519, file: !513, line: 20, baseType: !40, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !513, line: 21, baseType: !517, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !514, file: !513, line: 27, baseType: !518, size: 96, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !513, line: 28, baseType: !67, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !514, file: !513, line: 29, baseType: !40, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !514, file: !513, line: 30, baseType: !146, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !138, file: !139, line: 66, baseType: !512, size: 224, offset: 1696)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !138, file: !139, line: 68, baseType: !40, size: 32, offset: 1920)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !138, file: !139, line: 69, baseType: !40, size: 32, offset: 1952)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !138, file: !139, line: 71, baseType: !276, size: 32, offset: 1984)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !138, file: !139, line: 72, baseType: !6, size: 32, offset: 2016)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !138, file: !139, line: 73, baseType: !6, size: 32, offset: 2048)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !138, file: !139, line: 75, baseType: !136, size: 32, offset: 2080)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !138, file: !139, line: 77, baseType: !62, size: 64, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !138, file: !139, line: 78, baseType: !62, size: 64, offset: 2176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !138, file: !139, line: 79, baseType: !62, size: 64, offset: 2240)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !138, file: !139, line: 80, baseType: !62, size: 64, offset: 2304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !138, file: !139, line: 81, baseType: !62, size: 64, offset: 2368)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !138, file: !139, line: 82, baseType: !62, size: 64, offset: 2432)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !543, line: 12, size: 96, elements: !544)
!543 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !542, file: !543, line: 14, baseType: !324, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !542, file: !543, line: 15, baseType: !60, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !542, file: !543, line: 16, baseType: !60, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !343, line: 17, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !103, line: 17, baseType: !470)
!551 = !{!0}
!552 = !{!553, !554, !555, !556, !559, !560, !561, !569, !580, !634, !635, !647, !648, !649, !653}
!553 = !DILocalVariable(name: "ev", arg: 1, scope: !2, file: !3, line: 326, type: !6)
!554 = !DILocalVariable(name: "n", scope: !2, file: !3, line: 328, type: !292)
!555 = !DILocalVariable(name: "log", scope: !2, file: !3, line: 329, type: !45)
!556 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 330, type: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !558, line: 16, baseType: !60)
!558 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!559 = !DILocalVariable(name: "rev", scope: !2, file: !3, line: 331, type: !6)
!560 = !DILocalVariable(name: "wev", scope: !2, file: !3, line: 331, type: !6)
!561 = !DILocalVariable(name: "iov", scope: !2, file: !3, line: 332, type: !562)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 64, elements: !567)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !43, line: 398, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !563, file: !43, line: 398, baseType: !13, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !563, file: !43, line: 398, baseType: !67, size: 32, offset: 32)
!567 = !{!568}
!568 = !DISubrange(count: 1)
!569 = !DILocalVariable(name: "msg", scope: !2, file: !3, line: 333, type: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !543, line: 1, size: 224, elements: !571)
!571 = !{!572, !573, !574, !576, !577, !578, !579}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !570, file: !543, line: 3, baseType: !13, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !570, file: !543, line: 4, baseType: !324, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !570, file: !543, line: 5, baseType: !575, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !570, file: !543, line: 6, baseType: !60, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !570, file: !543, line: 7, baseType: !13, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !570, file: !543, line: 8, baseType: !324, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !570, file: !543, line: 9, baseType: !60, size: 32, offset: 192)
!580 = !DILocalVariable(name: "sa", scope: !2, file: !3, line: 334, type: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_sockaddr_t", file: !582, line: 44, baseType: !583)
!582 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !582, line: 35, size: 896, elements: !584)
!584 = !{!585, !586, !602, !625}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !583, file: !582, line: 36, baseType: !313, size: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in", scope: !583, file: !582, line: 37, baseType: !587, size: 128)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !375, line: 16, size: 128, elements: !588)
!588 = !{!589, !590, !591, !597}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !587, file: !375, line: 17, baseType: !317, size: 16)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !587, file: !375, line: 18, baseType: !374, size: 16, offset: 16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !587, file: !375, line: 19, baseType: !592, size: 32, offset: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !375, line: 14, size: 32, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !592, file: !375, line: 14, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !375, line: 13, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 191, baseType: !15)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !587, file: !375, line: 20, baseType: !598, size: 64, offset: 64)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 64, elements: !600)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 181, baseType: !72)
!600 = !{!601}
!601 = !DISubrange(count: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in6", scope: !583, file: !582, line: 39, baseType: !603, size: 224)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !375, line: 34, size: 224, elements: !604)
!604 = !{!605, !606, !607, !608, !624}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !603, file: !375, line: 35, baseType: !317, size: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !603, file: !375, line: 36, baseType: !374, size: 16, offset: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !603, file: !375, line: 37, baseType: !596, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !603, file: !375, line: 38, baseType: !609, size: 128, offset: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !375, line: 23, size: 128, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !609, file: !375, line: 28, baseType: !612, size: 128)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !609, file: !375, line: 24, size: 128, elements: !613)
!613 = !{!614, !618, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !612, file: !375, line: 25, baseType: !615, size: 128)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 128, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 16)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !612, file: !375, line: 26, baseType: !619, size: 128)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 128, elements: !600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !612, file: !375, line: 27, baseType: !621, size: 128)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 128, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 4)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !603, file: !375, line: 39, baseType: !596, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_un", scope: !583, file: !582, line: 42, baseType: !626, size: 880)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !627, line: 17, size: 880, elements: !628)
!627 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/un.h", directory: "/home/sam/Projects/nginx-1.12.2")
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !626, file: !627, line: 18, baseType: !317, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !626, file: !627, line: 19, baseType: !631, size: 864, offset: 16)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 864, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 108)
!634 = !DILocalVariable(name: "ls", scope: !2, file: !3, line: 335, type: !306)
!635 = !DILocalVariable(name: "ecf", scope: !2, file: !3, line: 336, type: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_conf_t", file: !10, line: 454, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 440, size: 192, elements: !639)
!639 = !{!640, !641, !642, !644, !645, !646}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !638, file: !10, line: 441, baseType: !40, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !638, file: !10, line: 442, baseType: !40, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "multi_accept", scope: !638, file: !10, line: 444, baseType: !643, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !41, line: 80, baseType: !471)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex", scope: !638, file: !10, line: 445, baseType: !643, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mutex_delay", scope: !638, file: !10, line: 447, baseType: !342, size: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !10, line: 449, baseType: !69, size: 32, offset: 160)
!647 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 337, type: !276)
!648 = !DILocalVariable(name: "lc", scope: !2, file: !3, line: 337, type: !276)
!649 = !DILocalVariable(name: "cmsg", scope: !650, file: !3, line: 490, type: !541)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 489, column: 27)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 489, column: 13)
!652 = distinct !DILexicalBlock(scope: !2, file: !3, line: 375, column: 8)
!653 = !DILocalVariable(name: "sockaddr", scope: !650, file: !3, line: 491, type: !312)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 524280, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 65535)
!657 = !{i32 2, !"Dwarf Version", i32 4}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!660 = distinct !DISubprogram(name: "ngx_event_accept", scope: !3, file: !3, line: 23, type: !4, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, unit: !122, variables: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!662 = !DILocalVariable(name: "ev", arg: 1, scope: !660, file: !3, line: 23, type: !6)
!663 = !DILocalVariable(name: "socklen", scope: !660, file: !3, line: 25, type: !324)
!664 = !DILocalVariable(name: "err", scope: !660, file: !3, line: 26, type: !557)
!665 = !DILocalVariable(name: "log", scope: !660, file: !3, line: 27, type: !45)
!666 = !DILocalVariable(name: "level", scope: !660, file: !3, line: 28, type: !40)
!667 = !DILocalVariable(name: "s", scope: !660, file: !3, line: 29, type: !284)
!668 = !DILocalVariable(name: "rev", scope: !660, file: !3, line: 30, type: !6)
!669 = !DILocalVariable(name: "wev", scope: !660, file: !3, line: 30, type: !6)
!670 = !DILocalVariable(name: "sa", scope: !660, file: !3, line: 31, type: !581)
!671 = !DILocalVariable(name: "ls", scope: !660, file: !3, line: 32, type: !306)
!672 = !DILocalVariable(name: "c", scope: !660, file: !3, line: 33, type: !276)
!673 = !DILocalVariable(name: "lc", scope: !660, file: !3, line: 33, type: !276)
!674 = !DILocalVariable(name: "ecf", scope: !660, file: !3, line: 34, type: !636)
!675 = !{!676, !676, i64 0}
!676 = !{!"any pointer", !677, i64 0}
!677 = !{!"omnipotent char", !678, i64 0}
!678 = !{!"Simple C/C++ TBAA"}
!679 = !DIExpression()
!680 = !DILocation(line: 23, column: 31, scope: !660)
!681 = !DILocation(line: 25, column: 5, scope: !660)
!682 = !DILocation(line: 25, column: 24, scope: !660)
!683 = !DILocation(line: 26, column: 5, scope: !660)
!684 = !DILocation(line: 26, column: 24, scope: !660)
!685 = !DILocation(line: 27, column: 5, scope: !660)
!686 = !DILocation(line: 27, column: 24, scope: !660)
!687 = !DILocation(line: 28, column: 5, scope: !660)
!688 = !DILocation(line: 28, column: 24, scope: !660)
!689 = !DILocation(line: 29, column: 5, scope: !660)
!690 = !DILocation(line: 29, column: 24, scope: !660)
!691 = !DILocation(line: 30, column: 5, scope: !660)
!692 = !DILocation(line: 30, column: 24, scope: !660)
!693 = !DILocation(line: 30, column: 30, scope: !660)
!694 = !DILocation(line: 31, column: 5, scope: !660)
!695 = !DILocation(line: 31, column: 24, scope: !660)
!696 = !DILocation(line: 32, column: 5, scope: !660)
!697 = !DILocation(line: 32, column: 24, scope: !660)
!698 = !DILocation(line: 33, column: 5, scope: !660)
!699 = !DILocation(line: 33, column: 24, scope: !660)
!700 = !DILocation(line: 33, column: 28, scope: !660)
!701 = !DILocation(line: 34, column: 5, scope: !660)
!702 = !DILocation(line: 34, column: 24, scope: !660)
!703 = !DILocation(line: 39, column: 9, scope: !704)
!704 = distinct !DILexicalBlock(scope: !660, file: !3, line: 39, column: 9)
!705 = !DILocation(line: 39, column: 13, scope: !704)
!706 = !DILocation(line: 39, column: 9, scope: !660)
