; ModuleID = 'src/event/ngx_event_connect.c'
source_filename = "src/event/ngx_event_connect.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_os_io_t = type { i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, %struct.ngx_chain_s* (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, %struct.ngx_chain_s* (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, i32 }
%struct.ngx_connection_s = type { i8*, %struct.ngx_event_s*, %struct.ngx_event_s*, i32, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, %struct.ngx_chain_s* (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, %struct.ngx_listening_s*, i32, %struct.ngx_log_s*, %struct.ngx_pool_s*, i32, %struct.sockaddr*, i32, %struct.ngx_str_t, %struct.ngx_str_t, i16, %struct.sockaddr*, i32, %struct.ngx_buf_s*, %struct.ngx_queue_s, i32, i32, i32 }
%struct.ngx_event_s = type { i8*, i24, void (%struct.ngx_event_s*)*, i32, %struct.ngx_log_s*, %struct.ngx_rbtree_node_s, %struct.ngx_queue_s }
%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14)
!1 = !DIFile(filename: "src/event/ngx_event_connect.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 109, size: 32, elements: !5)
!4 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "NGX_TCP_NOPUSH_UNSET", value: 0)
!7 = !DIEnumerator(name: "NGX_TCP_NOPUSH_SET", value: 1)
!8 = !DIEnumerator(name: "NGX_TCP_NOPUSH_DISABLED", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 102, size: 32, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "NGX_TCP_NODELAY_UNSET", value: 0)
!12 = !DIEnumerator(name: "NGX_TCP_NODELAY_SET", value: 1)
!13 = !DIEnumerator(name: "NGX_TCP_NODELAY_DISABLED", value: 2)
!14 = !{!15, !18, !19}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !16, line: 17, baseType: !17)
!16 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!24 = distinct !DISubprogram(name: "ngx_event_connect_peer", scope: !1, file: !1, line: 21, type: !25, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !429)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !31}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !29)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !30, line: 140, baseType: !17)
!30 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_peer_connection_t", file: !33, line: 22, baseType: !34)
!33 = !DIFile(filename: "src/event/ngx_event_connect.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_peer_connection_s", file: !33, line: 36, size: 480, elements: !35)
!35 = !{!36, !395, !396, !397, !399, !400, !401, !406, !411, !413, !414, !423, !424, !425, !426, !427, !428}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !34, file: !33, line: 37, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !39, line: 26, baseType: !40)
!39 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !4, line: 121, size: 896, elements: !41)
!41 = !{!42, !43, !157, !158, !159, !166, !168, !262, !267, !327, !328, !329, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !4, line: 122, baseType: !18, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !40, file: !4, line: 123, baseType: !44, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !39, line: 24, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !47, line: 30, size: 384, elements: !48)
!47 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !77, !80, !136, !149}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !47, line: 31, baseType: !18, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !46, file: !47, line: 33, baseType: !51, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!51 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !46, file: !47, line: 35, baseType: !51, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !46, file: !47, line: 38, baseType: !51, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !46, file: !47, line: 44, baseType: !51, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !46, file: !47, line: 46, baseType: !51, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !46, file: !47, line: 49, baseType: !51, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !46, file: !47, line: 51, baseType: !51, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !46, file: !47, line: 54, baseType: !51, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !46, file: !47, line: 56, baseType: !51, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !46, file: !47, line: 57, baseType: !51, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !46, file: !47, line: 59, baseType: !51, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !46, file: !47, line: 60, baseType: !51, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !46, file: !47, line: 62, baseType: !51, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !46, file: !47, line: 64, baseType: !51, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !46, file: !47, line: 67, baseType: !51, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !46, file: !47, line: 69, baseType: !51, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !46, file: !47, line: 71, baseType: !51, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !46, file: !47, line: 74, baseType: !51, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !46, file: !47, line: 75, baseType: !51, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !46, file: !47, line: 77, baseType: !51, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !46, file: !47, line: 107, baseType: !51, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !46, file: !47, line: 110, baseType: !73, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !39, line: 31, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !44}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !46, file: !47, line: 117, baseType: !78, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 125, baseType: !51)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !46, file: !47, line: 119, baseType: !81, size: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !39, line: 20, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !84, line: 50, size: 320, elements: !85)
!84 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = !{!86, !87, !113, !117, !120, !125, !126, !131, !132, !135}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !83, file: !84, line: 51, baseType: !78, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !83, file: !84, line: 52, baseType: !88, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !39, line: 21, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !91, line: 89, size: 160, elements: !92)
!91 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !{!93, !96, !108, !112}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !90, file: !91, line: 90, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !95, line: 16, baseType: !17)
!95 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !91, line: 91, baseType: !97, size: 64, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !98, line: 19, baseType: !99)
!98 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 16, size: 64, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, file: !98, line: 17, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 120, baseType: !51)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !98, line: 18, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !106, line: 64, baseType: !107)
!106 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!107 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !90, file: !91, line: 93, baseType: !109, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !88, !81}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !91, line: 94, baseType: !18, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !83, file: !84, line: 54, baseType: !114, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !115, line: 98, baseType: !116)
!115 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!116 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !83, file: !84, line: 56, baseType: !118, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !30, line: 75, baseType: !119)
!119 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !83, file: !84, line: 58, baseType: !121, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !84, line: 45, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = !DISubroutineType(types: !124)
!124 = !{!104, !81, !104, !102}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !84, line: 59, baseType: !18, size: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !83, file: !84, line: 61, baseType: !127, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !84, line: 46, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !81, !78, !104, !102}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !83, file: !84, line: 62, baseType: !18, size: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !83, file: !84, line: 70, baseType: !133, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !84, line: 72, baseType: !81, size: 32, offset: 288)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !46, file: !47, line: 121, baseType: !137, size: 160, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !138, line: 20, baseType: !139)
!138 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !138, line: 22, size: 160, elements: !140)
!140 = !{!141, !143, !145, !146, !147, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !139, file: !138, line: 23, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !138, line: 16, baseType: !78)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !139, file: !138, line: 24, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !139, file: !138, line: 25, baseType: !144, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !138, line: 26, baseType: !144, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !139, file: !138, line: 27, baseType: !105, size: 8, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !138, line: 28, baseType: !105, size: 8, offset: 136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !46, file: !47, line: 124, baseType: !150, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !151, line: 16, baseType: !152)
!151 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !151, line: 18, size: 64, elements: !153)
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !151, line: 19, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !151, line: 20, baseType: !155, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !40, file: !4, line: 124, baseType: !44, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !40, file: !4, line: 126, baseType: !15, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !40, file: !4, line: 128, baseType: !160, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !161, line: 19, baseType: !162)
!161 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !37, !104, !102}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !30, line: 135, baseType: !17)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !40, file: !4, line: 129, baseType: !167, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !161, line: 22, baseType: !162)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !40, file: !4, line: 130, baseType: !169, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !161, line: 20, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{!165, !37, !173, !186}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !39, line: 19, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !176, line: 59, size: 64, elements: !177)
!176 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!177 = !{!178, !261}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !176, line: 18, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !176, line: 20, size: 352, elements: !182)
!182 = !{!183, !184, !185, !187, !188, !189, !190, !192, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !181, file: !176, line: 21, baseType: !104, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !181, file: !176, line: 22, baseType: !104, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !181, file: !176, line: 23, baseType: !186, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !30, line: 222, baseType: !17)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !181, file: !176, line: 24, baseType: !186, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !181, file: !176, line: 26, baseType: !104, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !181, file: !176, line: 27, baseType: !104, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !181, file: !176, line: 28, baseType: !191, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !176, line: 16, baseType: !18)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !181, file: !176, line: 29, baseType: !193, size: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !39, line: 23, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !196, line: 16, size: 1216, elements: !197)
!196 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!197 = !{!198, !199, !200, !243, !244, !245, !246, !247}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !195, file: !196, line: 17, baseType: !94, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 18, baseType: !97, size: 64, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !195, file: !196, line: 19, baseType: !201, size: 960, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !95, line: 17, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !203, line: 4, size: 960, elements: !204)
!203 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!204 = !{!205, !207, !208, !210, !211, !213, !214, !216, !218, !220, !221, !222, !223, !224, !225, !227, !228, !230, !231, !236, !237, !238}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !202, file: !203, line: 6, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !30, line: 232, baseType: !51)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !202, file: !203, line: 7, baseType: !206, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !202, file: !203, line: 8, baseType: !209, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !30, line: 227, baseType: !51)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !202, file: !203, line: 9, baseType: !209, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !202, file: !203, line: 10, baseType: !212, size: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !30, line: 217, baseType: !51)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !202, file: !203, line: 11, baseType: !212, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !202, file: !203, line: 13, baseType: !215, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !30, line: 212, baseType: !51)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !202, file: !203, line: 14, baseType: !217, size: 32, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !30, line: 304, baseType: !51)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !202, file: !203, line: 15, baseType: !219, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !30, line: 309, baseType: !51)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !202, file: !203, line: 16, baseType: !51, size: 32, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !202, file: !203, line: 17, baseType: !206, size: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !202, file: !203, line: 18, baseType: !206, size: 32, offset: 352)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !202, file: !203, line: 19, baseType: !186, size: 32, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !202, file: !203, line: 20, baseType: !186, size: 32, offset: 416)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !202, file: !203, line: 21, baseType: !226, size: 32, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !30, line: 237, baseType: !119)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !202, file: !203, line: 22, baseType: !226, size: 32, offset: 480)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !202, file: !203, line: 23, baseType: !229, size: 32, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !30, line: 242, baseType: !17)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !202, file: !203, line: 24, baseType: !229, size: 32, offset: 544)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !202, file: !203, line: 26, baseType: !232, size: 64, offset: 576)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !30, line: 288, size: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !232, file: !30, line: 288, baseType: !118, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !232, file: !30, line: 288, baseType: !119, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !202, file: !203, line: 27, baseType: !232, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !202, file: !203, line: 28, baseType: !232, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !202, file: !203, line: 29, baseType: !239, size: 192, offset: 768)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 192, elements: !241)
!240 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !196, line: 21, baseType: !186, size: 32, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !195, file: !196, line: 22, baseType: !186, size: 32, offset: 1120)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !195, file: !196, line: 24, baseType: !81, size: 32, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !195, file: !196, line: 37, baseType: !51, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !195, file: !196, line: 38, baseType: !51, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !181, file: !176, line: 30, baseType: !179, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !181, file: !176, line: 34, baseType: !51, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !181, file: !176, line: 40, baseType: !51, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !181, file: !176, line: 43, baseType: !51, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !181, file: !176, line: 45, baseType: !51, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !181, file: !176, line: 46, baseType: !51, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !181, file: !176, line: 47, baseType: !51, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !181, file: !176, line: 48, baseType: !51, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !181, file: !176, line: 49, baseType: !51, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !181, file: !176, line: 50, baseType: !51, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !181, file: !176, line: 52, baseType: !51, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !181, file: !176, line: 53, baseType: !51, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !181, file: !176, line: 55, baseType: !17, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 61, baseType: !173, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !40, file: !4, line: 131, baseType: !263, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !161, line: 23, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!173, !37, !173, !186}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !40, file: !4, line: 133, baseType: !268, size: 32, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !4, line: 16, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !4, line: 18, size: 960, elements: !271)
!271 = !{!272, !273, !285, !287, !288, !289, !290, !291, !292, !293, !298, !299, !300, !301, !302, !303, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !270, file: !4, line: 19, baseType: !15, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !270, file: !4, line: 21, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !276, line: 297, size: 128, elements: !277)
!276 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!277 = !{!278, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !275, file: !276, line: 298, baseType: !279, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !30, line: 409, baseType: !280)
!280 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !275, file: !276, line: 299, baseType: !282, size: 112, offset: 16)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 112, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 14)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !270, file: !4, line: 22, baseType: !286, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !30, line: 404, baseType: !51)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !270, file: !4, line: 23, baseType: !102, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !270, file: !4, line: 24, baseType: !97, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !4, line: 26, baseType: !17, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !270, file: !4, line: 28, baseType: !17, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !270, file: !4, line: 29, baseType: !17, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !270, file: !4, line: 30, baseType: !17, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !270, file: !4, line: 38, baseType: !294, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !39, line: 32, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !37}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !270, file: !4, line: 40, baseType: !18, size: 32, offset: 352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !270, file: !4, line: 42, baseType: !82, size: 320, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !270, file: !4, line: 43, baseType: !81, size: 32, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !270, file: !4, line: 45, baseType: !102, size: 32, offset: 736)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !270, file: !4, line: 47, baseType: !102, size: 32, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !270, file: !4, line: 49, baseType: !304, size: 32, offset: 800)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !305, line: 16, baseType: !142)
!305 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !270, file: !4, line: 51, baseType: !268, size: 32, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !270, file: !4, line: 52, baseType: !37, size: 32, offset: 864)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !270, file: !4, line: 54, baseType: !78, size: 32, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !270, file: !4, line: 56, baseType: !51, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !270, file: !4, line: 57, baseType: !51, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !270, file: !4, line: 58, baseType: !51, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !270, file: !4, line: 60, baseType: !51, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !270, file: !4, line: 61, baseType: !51, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !270, file: !4, line: 62, baseType: !51, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !270, file: !4, line: 63, baseType: !51, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !270, file: !4, line: 64, baseType: !51, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !270, file: !4, line: 65, baseType: !51, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !270, file: !4, line: 66, baseType: !51, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !270, file: !4, line: 67, baseType: !51, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !270, file: !4, line: 70, baseType: !51, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !270, file: !4, line: 72, baseType: !51, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !270, file: !4, line: 73, baseType: !51, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !270, file: !4, line: 74, baseType: !51, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !270, file: !4, line: 76, baseType: !51, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !270, file: !4, line: 77, baseType: !51, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !270, file: !4, line: 78, baseType: !51, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !40, file: !4, line: 135, baseType: !186, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !40, file: !4, line: 137, baseType: !81, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !40, file: !4, line: 139, baseType: !330, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !39, line: 18, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !333, line: 57, size: 320, elements: !334)
!333 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!334 = !{!335, !343, !344, !345, !346, !353, !365}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !332, file: !333, line: 58, baseType: !336, size: 128)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !333, line: 54, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 49, size: 128, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !337, file: !333, line: 50, baseType: !104, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !337, file: !333, line: 51, baseType: !104, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !333, line: 52, baseType: !330, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !337, file: !333, line: 53, baseType: !78, size: 32, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !332, file: !333, line: 59, baseType: !102, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !332, file: !333, line: 60, baseType: !330, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !332, file: !333, line: 61, baseType: !173, size: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !332, file: !333, line: 62, baseType: !347, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !333, line: 41, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !333, line: 43, size: 64, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !333, line: 44, baseType: !347, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !349, file: !333, line: 45, baseType: !18, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !332, file: !333, line: 63, baseType: !354, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !333, line: 32, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !333, line: 34, size: 96, elements: !357)
!357 = !{!358, !363, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !356, file: !333, line: 35, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !333, line: 30, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !18}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !356, file: !333, line: 36, baseType: !18, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !333, line: 37, baseType: !354, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !332, file: !333, line: 64, baseType: !81, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !4, line: 141, baseType: !17, size: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !40, file: !4, line: 143, baseType: !274, size: 32, offset: 416)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !40, file: !4, line: 144, baseType: !286, size: 32, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !40, file: !4, line: 145, baseType: !97, size: 64, offset: 480)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !40, file: !4, line: 147, baseType: !97, size: 64, offset: 544)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !40, file: !4, line: 148, baseType: !372, size: 16, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !373, line: 12, baseType: !374)
!373 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 186, baseType: !280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !40, file: !4, line: 154, baseType: !274, size: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !40, file: !4, line: 155, baseType: !286, size: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !40, file: !4, line: 157, baseType: !179, size: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !40, file: !4, line: 159, baseType: !150, size: 64, offset: 736)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !40, file: !4, line: 161, baseType: !114, size: 32, offset: 800)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !40, file: !4, line: 163, baseType: !78, size: 32, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !40, file: !4, line: 165, baseType: !51, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !40, file: !4, line: 167, baseType: !51, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !40, file: !4, line: 169, baseType: !51, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !40, file: !4, line: 170, baseType: !51, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !40, file: !4, line: 171, baseType: !51, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !40, file: !4, line: 173, baseType: !51, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !40, file: !4, line: 174, baseType: !51, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !40, file: !4, line: 175, baseType: !51, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !40, file: !4, line: 176, baseType: !51, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !40, file: !4, line: 178, baseType: !51, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !40, file: !4, line: 179, baseType: !51, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !40, file: !4, line: 180, baseType: !51, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !40, file: !4, line: 181, baseType: !51, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !40, file: !4, line: 183, baseType: !51, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !34, file: !33, line: 39, baseType: !274, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !34, file: !33, line: 40, baseType: !286, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !33, line: 41, baseType: !398, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tries", scope: !34, file: !33, line: 43, baseType: !78, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !34, file: !33, line: 44, baseType: !304, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !34, file: !33, line: 46, baseType: !402, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_get_peer_pt", file: !33, line: 24, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DISubroutineType(types: !405)
!405 = !{!27, !31, !18}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !34, file: !33, line: 47, baseType: !407, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_free_peer_pt", file: !33, line: 26, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !31, !18, !78}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !34, file: !33, line: 48, baseType: !412, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_notify_peer_pt", file: !33, line: 28, baseType: !408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !33, line: 49, baseType: !18, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !34, file: !33, line: 56, baseType: !415, size: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !417, line: 78, baseType: !418)
!417 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 74, size: 128, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !418, file: !417, line: 75, baseType: !274, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !418, file: !417, line: 76, baseType: !286, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !418, file: !417, line: 77, baseType: !97, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !33, line: 58, baseType: !17, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !34, file: !33, line: 59, baseType: !17, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !34, file: !33, line: 61, baseType: !81, size: 32, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !34, file: !33, line: 63, baseType: !51, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !34, file: !33, line: 64, baseType: !51, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !34, file: !33, line: 67, baseType: !51, size: 2, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!429 = !{!430, !431, !432, !433, !434, !435, !438, !439, !440, !441, !442, !443}
!430 = !DILocalVariable(name: "pc", arg: 1, scope: !24, file: !1, line: 21, type: !31)
!431 = !DILocalVariable(name: "rc", scope: !24, file: !1, line: 23, type: !17)
!432 = !DILocalVariable(name: "type", scope: !24, file: !1, line: 23, type: !17)
!433 = !DILocalVariable(name: "port", scope: !24, file: !1, line: 25, type: !372)
!434 = !DILocalVariable(name: "event", scope: !24, file: !1, line: 27, type: !27)
!435 = !DILocalVariable(name: "err", scope: !24, file: !1, line: 28, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !437, line: 16, baseType: !17)
!437 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!438 = !DILocalVariable(name: "level", scope: !24, file: !1, line: 29, type: !78)
!439 = !DILocalVariable(name: "s", scope: !24, file: !1, line: 30, type: !15)
!440 = !DILocalVariable(name: "rev", scope: !24, file: !1, line: 31, type: !44)
!441 = !DILocalVariable(name: "wev", scope: !24, file: !1, line: 31, type: !44)
!442 = !DILocalVariable(name: "c", scope: !24, file: !1, line: 32, type: !37)
!443 = !DILocalVariable(name: "reuse_addr", scope: !444, file: !1, line: 126, type: !17)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 125, column: 50)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 125, column: 13)
!446 = distinct !DILexicalBlock(scope: !447, file: !1, line: 83, column: 20)
!447 = distinct !DILexicalBlock(scope: !24, file: !1, line: 83, column: 9)
!448 = !{!449, !449, i64 0}
!449 = !{!"any pointer", !450, i64 0}
!450 = !{!"omnipotent char", !451, i64 0}
!451 = !{!"Simple C/C++ TBAA"}
!452 = !DIExpression()
!453 = !DILocation(line: 21, column: 47, scope: !24)
!454 = !DILocation(line: 23, column: 5, scope: !24)
!455 = !DILocation(line: 23, column: 24, scope: !24)
!456 = !DILocation(line: 23, column: 28, scope: !24)
!457 = !DILocation(line: 25, column: 5, scope: !24)
!458 = !DILocation(line: 25, column: 24, scope: !24)
!459 = !DILocation(line: 27, column: 5, scope: !24)
!460 = !DILocation(line: 27, column: 24, scope: !24)
!461 = !DILocation(line: 28, column: 5, scope: !24)
!462 = !DILocation(line: 28, column: 24, scope: !24)
!463 = !DILocation(line: 29, column: 5, scope: !24)
!464 = !DILocation(line: 29, column: 24, scope: !24)
!465 = !DILocation(line: 30, column: 5, scope: !24)
!466 = !DILocation(line: 30, column: 24, scope: !24)
!467 = !DILocation(line: 31, column: 5, scope: !24)
!468 = !DILocation(line: 31, column: 24, scope: !24)
!469 = !DILocation(line: 31, column: 30, scope: !24)
!470 = !DILocation(line: 32, column: 5, scope: !24)
!471 = !DILocation(line: 32, column: 24, scope: !24)
!472 = !DILocation(line: 34, column: 10, scope: !24)
!473 = !DILocation(line: 34, column: 14, scope: !24)
!474 = !{!475, !449, i64 24}
!475 = !{!"ngx_peer_connection_s", !449, i64 0, !449, i64 4, !476, i64 8, !449, i64 12, !476, i64 16, !476, i64 20, !449, i64 24, !449, i64 28, !449, i64 32, !449, i64 36, !449, i64 40, !476, i64 44, !476, i64 48, !449, i64 52, !476, i64 56, !476, i64 56, !476, i64 56}
!476 = !{!"int", !450, i64 0}
!477 = !DILocation(line: 34, column: 18, scope: !24)
!478 = !DILocation(line: 34, column: 22, scope: !24)
!479 = !DILocation(line: 34, column: 26, scope: !24)
!480 = !{!475, !449, i64 36}
!481 = !DILocation(line: 34, column: 8, scope: !24)
!482 = !{!476, !476, i64 0}
!483 = !DILocation(line: 35, column: 9, scope: !484)
!484 = distinct !DILexicalBlock(scope: !24, file: !1, line: 35, column: 9)
!485 = !DILocation(line: 35, column: 12, scope: !484)
!486 = !DILocation(line: 35, column: 9, scope: !24)
!487 = !DILocation(line: 36, column: 16, scope: !488)
!488 = distinct !DILexicalBlock(scope: !484, file: !1, line: 35, column: 23)
!489 = !DILocation(line: 36, column: 9, scope: !488)
