; ModuleID = 'src/event/ngx_event_pipe.c'
source_filename = "src/event/ngx_event_pipe.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_rbtree_s = type { %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, void (%struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*)* }
%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }
%struct.ngx_time_t = type { i32, i32, i32 }
%struct.ngx_event_pipe_s = type { %struct.ngx_connection_s*, %struct.ngx_connection_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s**, %struct.ngx_chain_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s*, i32 (%struct.ngx_event_pipe_s*, %struct.ngx_buf_s*)*, i8*, i32 (i8*, %struct.ngx_chain_s*)*, i8*, i16, i32, %struct.ngx_bufs_t, i8*, i32, i32, i32, i32, i32, i32, i32, i32, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_chain_s*, i32, %struct.ngx_buf_s*, i32, i32, %struct.ngx_temp_file_t*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/event/ngx_event_pipe.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !7, !8, !16, !17, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !5, line: 17, baseType: !6)
!5 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !9, line: 17, baseType: !10)
!9 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !11, line: 17, baseType: !12)
!11 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !13, line: 78, baseType: !14)
!13 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !15, line: 140, baseType: !6)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !15, line: 222, baseType: !6)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !9, line: 16, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !11, line: 16, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !13, line: 79, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !15, line: 125, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 120, baseType: !21)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!26 = distinct !DISubprogram(name: "ngx_event_pipe", scope: !1, file: !1, line: 23, type: !27, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !477)
!27 = !DISubroutineType(types: !28)
!28 = !{!12, !29, !12}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_t", file: !31, line: 17, baseType: !32)
!31 = !DIFile(filename: "src/event/ngx_event_pipe.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_pipe_s", file: !31, line: 25, size: 1120, elements: !33)
!33 = !{!34, !385, !386, !387, !388, !390, !391, !392, !393, !394, !399, !400, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !476}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "upstream", scope: !32, file: !31, line: 26, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !37, line: 26, baseType: !38)
!37 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !39, line: 121, size: 896, elements: !40)
!39 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !{!41, !42, !150, !151, !152, !159, !161, !254, !259, !317, !318, !319, !356, !357, !358, !359, !360, !361, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !38, file: !39, line: 122, baseType: !7, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !38, file: !39, line: 123, baseType: !43, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !37, line: 24, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !46, line: 30, size: 384, elements: !47)
!46 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !75, !76, !131, !142}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !46, line: 31, baseType: !7, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !45, file: !46, line: 33, baseType: !21, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !45, file: !46, line: 35, baseType: !21, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !45, file: !46, line: 38, baseType: !21, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !45, file: !46, line: 44, baseType: !21, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !45, file: !46, line: 46, baseType: !21, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !45, file: !46, line: 49, baseType: !21, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !45, file: !46, line: 51, baseType: !21, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !45, file: !46, line: 54, baseType: !21, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !45, file: !46, line: 56, baseType: !21, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !45, file: !46, line: 57, baseType: !21, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !45, file: !46, line: 59, baseType: !21, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !45, file: !46, line: 60, baseType: !21, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !45, file: !46, line: 62, baseType: !21, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !45, file: !46, line: 64, baseType: !21, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !45, file: !46, line: 67, baseType: !21, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !45, file: !46, line: 69, baseType: !21, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !45, file: !46, line: 71, baseType: !21, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !45, file: !46, line: 74, baseType: !21, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !45, file: !46, line: 75, baseType: !21, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !45, file: !46, line: 77, baseType: !21, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !45, file: !46, line: 107, baseType: !21, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !45, file: !46, line: 110, baseType: !71, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !37, line: 31, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !43}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !45, file: !46, line: 117, baseType: !19, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !45, file: !46, line: 119, baseType: !77, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !37, line: 20, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !80, line: 50, size: 320, elements: !81)
!80 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = !{!82, !83, !108, !112, !115, !120, !121, !126, !127, !130}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !79, file: !80, line: 51, baseType: !19, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !79, file: !80, line: 52, baseType: !84, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !37, line: 21, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !87, line: 89, size: 160, elements: !88)
!87 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = !{!89, !92, !103, !107}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !86, file: !87, line: 90, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !91, line: 16, baseType: !6)
!91 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !87, line: 91, baseType: !93, size: 64, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !94, line: 19, baseType: !95)
!94 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 16, size: 64, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, file: !94, line: 17, baseType: !22, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !94, line: 18, baseType: !99, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !101, line: 64, baseType: !102)
!101 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !86, file: !87, line: 93, baseType: !104, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !84, !77}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !87, line: 94, baseType: !7, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !79, file: !80, line: 54, baseType: !109, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !110, line: 98, baseType: !111)
!110 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !79, file: !80, line: 56, baseType: !113, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !114)
!114 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !79, file: !80, line: 58, baseType: !116, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !80, line: 45, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!99, !77, !99, !22}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !80, line: 59, baseType: !7, size: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !79, file: !80, line: 61, baseType: !122, size: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !80, line: 46, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !77, !19, !99, !22}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !79, file: !80, line: 62, baseType: !7, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !79, file: !80, line: 70, baseType: !128, size: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !80, line: 72, baseType: !77, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !45, file: !46, line: 121, baseType: !132, size: 160, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !11, line: 20, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !11, line: 22, size: 160, elements: !134)
!134 = !{!135, !136, !138, !139, !140, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !133, file: !11, line: 23, baseType: !18, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !133, file: !11, line: 24, baseType: !137, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !133, file: !11, line: 25, baseType: !137, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !133, file: !11, line: 26, baseType: !137, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !133, file: !11, line: 27, baseType: !100, size: 8, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !11, line: 28, baseType: !100, size: 8, offset: 136)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !45, file: !46, line: 124, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !144, line: 16, baseType: !145)
!144 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !144, line: 18, size: 64, elements: !146)
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !144, line: 19, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !144, line: 20, baseType: !148, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !38, file: !39, line: 124, baseType: !43, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !38, file: !39, line: 126, baseType: !4, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !38, file: !39, line: 128, baseType: !153, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !154, line: 19, baseType: !155)
!154 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !35, !99, !22}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 135, baseType: !6)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !38, file: !39, line: 129, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !154, line: 22, baseType: !155)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !38, file: !39, line: 130, baseType: !162, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !154, line: 20, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{!158, !35, !166, !16}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !37, line: 19, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !169, line: 59, size: 64, elements: !170)
!169 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!170 = !{!171, !253}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !168, file: !169, line: 60, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !169, line: 18, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !169, line: 20, size: 352, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !184, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !169, line: 21, baseType: !99, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !174, file: !169, line: 22, baseType: !99, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !174, file: !169, line: 23, baseType: !16, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !174, file: !169, line: 24, baseType: !16, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !174, file: !169, line: 26, baseType: !99, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !174, file: !169, line: 27, baseType: !99, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !174, file: !169, line: 28, baseType: !183, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !169, line: 16, baseType: !7)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !174, file: !169, line: 29, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !37, line: 23, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !188, line: 16, size: 1216, elements: !189)
!188 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!189 = !{!190, !191, !192, !235, !236, !237, !238, !239}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !187, file: !188, line: 17, baseType: !90, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !188, line: 18, baseType: !93, size: 64, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !187, file: !188, line: 19, baseType: !193, size: 960, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !91, line: 17, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !195, line: 4, size: 960, elements: !196)
!195 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!196 = !{!197, !199, !200, !202, !203, !205, !206, !208, !210, !212, !213, !214, !215, !216, !217, !219, !220, !222, !223, !228, !229, !230}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !194, file: !195, line: 6, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !15, line: 232, baseType: !21)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !194, file: !195, line: 7, baseType: !198, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !194, file: !195, line: 8, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !15, line: 227, baseType: !21)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !194, file: !195, line: 9, baseType: !201, size: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !194, file: !195, line: 10, baseType: !204, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !15, line: 217, baseType: !21)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !194, file: !195, line: 11, baseType: !204, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !194, file: !195, line: 13, baseType: !207, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !15, line: 212, baseType: !21)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !194, file: !195, line: 14, baseType: !209, size: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 304, baseType: !21)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !194, file: !195, line: 15, baseType: !211, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 309, baseType: !21)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !194, file: !195, line: 16, baseType: !21, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !194, file: !195, line: 17, baseType: !198, size: 32, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !194, file: !195, line: 18, baseType: !198, size: 32, offset: 352)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !194, file: !195, line: 19, baseType: !16, size: 32, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !194, file: !195, line: 20, baseType: !16, size: 32, offset: 416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !194, file: !195, line: 21, baseType: !218, size: 32, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !15, line: 237, baseType: !114)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !194, file: !195, line: 22, baseType: !218, size: 32, offset: 480)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !194, file: !195, line: 23, baseType: !221, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !15, line: 242, baseType: !6)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !194, file: !195, line: 24, baseType: !221, size: 32, offset: 544)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !194, file: !195, line: 26, baseType: !224, size: 64, offset: 576)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !15, line: 288, size: 64, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !224, file: !15, line: 288, baseType: !113, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !224, file: !15, line: 288, baseType: !114, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !194, file: !195, line: 27, baseType: !224, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !194, file: !195, line: 28, baseType: !224, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !194, file: !195, line: 29, baseType: !231, size: 192, offset: 768)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 192, elements: !233)
!232 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!233 = !{!234}
!234 = !DISubrange(count: 3)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !187, file: !188, line: 21, baseType: !16, size: 32, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !187, file: !188, line: 22, baseType: !16, size: 32, offset: 1120)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !187, file: !188, line: 24, baseType: !77, size: 32, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !187, file: !188, line: 37, baseType: !21, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !187, file: !188, line: 38, baseType: !21, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !174, file: !169, line: 30, baseType: !172, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !174, file: !169, line: 34, baseType: !21, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !174, file: !169, line: 40, baseType: !21, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !174, file: !169, line: 43, baseType: !21, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !174, file: !169, line: 45, baseType: !21, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !174, file: !169, line: 46, baseType: !21, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !174, file: !169, line: 47, baseType: !21, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !174, file: !169, line: 48, baseType: !21, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !174, file: !169, line: 49, baseType: !21, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !174, file: !169, line: 50, baseType: !21, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !174, file: !169, line: 52, baseType: !21, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !174, file: !169, line: 53, baseType: !21, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !174, file: !169, line: 55, baseType: !6, size: 32, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !169, line: 61, baseType: !166, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !38, file: !39, line: 131, baseType: !255, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !154, line: 23, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!166, !35, !166, !16}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !38, file: !39, line: 133, baseType: !260, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !39, line: 16, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !39, line: 18, size: 960, elements: !263)
!263 = !{!264, !265, !277, !279, !280, !281, !282, !283, !284, !285, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !262, file: !39, line: 19, baseType: !4, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !262, file: !39, line: 21, baseType: !266, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !268, line: 297, size: 128, elements: !269)
!268 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!269 = !{!270, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !267, file: !268, line: 298, baseType: !271, size: 16)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !15, line: 409, baseType: !272)
!272 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !267, file: !268, line: 299, baseType: !274, size: 112, offset: 16)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 112, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 14)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !262, file: !39, line: 22, baseType: !278, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !15, line: 404, baseType: !21)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !262, file: !39, line: 23, baseType: !22, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !262, file: !39, line: 24, baseType: !93, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !262, file: !39, line: 26, baseType: !6, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !262, file: !39, line: 28, baseType: !6, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !262, file: !39, line: 29, baseType: !6, size: 32, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !262, file: !39, line: 30, baseType: !6, size: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !262, file: !39, line: 38, baseType: !286, size: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !37, line: 32, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !35}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !262, file: !39, line: 40, baseType: !7, size: 32, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !262, file: !39, line: 42, baseType: !78, size: 320, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !262, file: !39, line: 43, baseType: !77, size: 32, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !262, file: !39, line: 45, baseType: !22, size: 32, offset: 736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !262, file: !39, line: 47, baseType: !22, size: 32, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !262, file: !39, line: 49, baseType: !17, size: 32, offset: 800)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !262, file: !39, line: 51, baseType: !260, size: 32, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !262, file: !39, line: 52, baseType: !35, size: 32, offset: 864)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !262, file: !39, line: 54, baseType: !19, size: 32, offset: 896)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !262, file: !39, line: 56, baseType: !21, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !262, file: !39, line: 57, baseType: !21, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !262, file: !39, line: 58, baseType: !21, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !262, file: !39, line: 60, baseType: !21, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !262, file: !39, line: 61, baseType: !21, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !262, file: !39, line: 62, baseType: !21, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !262, file: !39, line: 63, baseType: !21, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !262, file: !39, line: 64, baseType: !21, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !262, file: !39, line: 65, baseType: !21, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !262, file: !39, line: 66, baseType: !21, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !262, file: !39, line: 67, baseType: !21, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !262, file: !39, line: 70, baseType: !21, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !262, file: !39, line: 72, baseType: !21, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !262, file: !39, line: 73, baseType: !21, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !262, file: !39, line: 74, baseType: !21, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !262, file: !39, line: 76, baseType: !21, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !262, file: !39, line: 77, baseType: !21, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !262, file: !39, line: 78, baseType: !21, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !38, file: !39, line: 135, baseType: !16, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !38, file: !39, line: 137, baseType: !77, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !38, file: !39, line: 139, baseType: !320, size: 32, offset: 352)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !37, line: 18, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !323, line: 57, size: 320, elements: !324)
!323 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!324 = !{!325, !333, !334, !335, !336, !343, !355}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !322, file: !323, line: 58, baseType: !326, size: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !323, line: 54, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 49, size: 128, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !327, file: !323, line: 50, baseType: !99, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !327, file: !323, line: 51, baseType: !99, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !323, line: 52, baseType: !320, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !327, file: !323, line: 53, baseType: !19, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !322, file: !323, line: 59, baseType: !22, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !322, file: !323, line: 60, baseType: !320, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !322, file: !323, line: 61, baseType: !166, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !322, file: !323, line: 62, baseType: !337, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !323, line: 41, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !323, line: 43, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !323, line: 44, baseType: !337, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !339, file: !323, line: 45, baseType: !7, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !322, file: !323, line: 63, baseType: !344, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !323, line: 32, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !323, line: 34, size: 96, elements: !347)
!347 = !{!348, !353, !354}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !346, file: !323, line: 35, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !323, line: 30, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !7}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !323, line: 36, baseType: !7, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !323, line: 37, baseType: !344, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !322, file: !323, line: 64, baseType: !77, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !39, line: 141, baseType: !6, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !38, file: !39, line: 143, baseType: !266, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !38, file: !39, line: 144, baseType: !278, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !38, file: !39, line: 145, baseType: !93, size: 64, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !38, file: !39, line: 147, baseType: !93, size: 64, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !38, file: !39, line: 148, baseType: !362, size: 16, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !363, line: 12, baseType: !364)
!363 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 186, baseType: !272)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !38, file: !39, line: 154, baseType: !266, size: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !38, file: !39, line: 155, baseType: !278, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !38, file: !39, line: 157, baseType: !172, size: 32, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !38, file: !39, line: 159, baseType: !143, size: 64, offset: 736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !38, file: !39, line: 161, baseType: !109, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !38, file: !39, line: 163, baseType: !19, size: 32, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !38, file: !39, line: 165, baseType: !21, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !38, file: !39, line: 167, baseType: !21, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !38, file: !39, line: 169, baseType: !21, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !38, file: !39, line: 170, baseType: !21, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !38, file: !39, line: 171, baseType: !21, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !38, file: !39, line: 173, baseType: !21, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !38, file: !39, line: 174, baseType: !21, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !38, file: !39, line: 175, baseType: !21, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !38, file: !39, line: 176, baseType: !21, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !38, file: !39, line: 178, baseType: !21, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !38, file: !39, line: 179, baseType: !21, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !38, file: !39, line: 180, baseType: !21, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !38, file: !39, line: 181, baseType: !21, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !38, file: !39, line: 183, baseType: !21, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "downstream", scope: !32, file: !31, line: 27, baseType: !35, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "free_raw_bufs", scope: !32, file: !31, line: 29, baseType: !166, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !32, file: !31, line: 30, baseType: !166, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last_in", scope: !32, file: !31, line: 31, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !32, file: !31, line: 33, baseType: !166, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !32, file: !31, line: 35, baseType: !166, size: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !32, file: !31, line: 36, baseType: !166, size: 32, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !32, file: !31, line: 37, baseType: !166, size: 32, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "input_filter", scope: !32, file: !31, line: 44, baseType: !395, size: 32, offset: 288)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_input_filter_pt", file: !31, line: 19, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DISubroutineType(types: !398)
!398 = !{!12, !29, !172}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "input_ctx", scope: !32, file: !31, line: 45, baseType: !7, size: 32, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !32, file: !31, line: 47, baseType: !401, size: 32, offset: 352)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_pipe_output_filter_pt", file: !31, line: 21, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DISubroutineType(types: !404)
!404 = !{!12, !7, !166}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "output_ctx", scope: !32, file: !31, line: 48, baseType: !7, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !32, file: !31, line: 57, baseType: !21, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cacheable", scope: !32, file: !31, line: 58, baseType: !21, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "single_buf", scope: !32, file: !31, line: 59, baseType: !21, size: 1, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "free_bufs", scope: !32, file: !31, line: 60, baseType: !21, size: 1, offset: 419, flags: DIFlagBitField, extraData: i64 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_done", scope: !32, file: !31, line: 61, baseType: !21, size: 1, offset: 420, flags: DIFlagBitField, extraData: i64 416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_error", scope: !32, file: !31, line: 62, baseType: !21, size: 1, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_eof", scope: !32, file: !31, line: 63, baseType: !21, size: 1, offset: 422, flags: DIFlagBitField, extraData: i64 416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "upstream_blocked", scope: !32, file: !31, line: 64, baseType: !21, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_done", scope: !32, file: !31, line: 65, baseType: !21, size: 1, offset: 424, flags: DIFlagBitField, extraData: i64 416)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "downstream_error", scope: !32, file: !31, line: 66, baseType: !21, size: 1, offset: 425, flags: DIFlagBitField, extraData: i64 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_temp_file", scope: !32, file: !31, line: 67, baseType: !21, size: 1, offset: 426, flags: DIFlagBitField, extraData: i64 416)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !32, file: !31, line: 68, baseType: !21, size: 1, offset: 427, flags: DIFlagBitField, extraData: i64 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !32, file: !31, line: 70, baseType: !12, size: 32, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !32, file: !31, line: 71, baseType: !420, size: 64, offset: 480)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !169, line: 68, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 65, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !421, file: !169, line: 66, baseType: !12, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !421, file: !169, line: 67, baseType: !22, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !32, file: !31, line: 72, baseType: !183, size: 32, offset: 544)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "busy_size", scope: !32, file: !31, line: 74, baseType: !158, size: 32, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "read_length", scope: !32, file: !31, line: 76, baseType: !16, size: 32, offset: 608)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !32, file: !31, line: 77, baseType: !16, size: 32, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "max_temp_file_size", scope: !32, file: !31, line: 79, baseType: !16, size: 32, offset: 672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file_write_size", scope: !32, file: !31, line: 80, baseType: !158, size: 32, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !32, file: !31, line: 82, baseType: !17, size: 32, offset: 736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "send_timeout", scope: !32, file: !31, line: 83, baseType: !17, size: 32, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "send_lowat", scope: !32, file: !31, line: 84, baseType: !158, size: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !32, file: !31, line: 86, baseType: !320, size: 32, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !32, file: !31, line: 87, baseType: !77, size: 32, offset: 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "preread_bufs", scope: !32, file: !31, line: 89, baseType: !166, size: 32, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "preread_size", scope: !32, file: !31, line: 90, baseType: !22, size: 32, offset: 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "buf_to_file", scope: !32, file: !31, line: 91, baseType: !172, size: 32, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "limit_rate", scope: !32, file: !31, line: 93, baseType: !22, size: 32, offset: 992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "start_sec", scope: !32, file: !31, line: 94, baseType: !113, size: 32, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !32, file: !31, line: 96, baseType: !442, size: 32, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !188, line: 84, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 71, size: 1408, elements: !445)
!445 = !{!446, !447, !448, !469, !470, !471, !472, !473, !474, !475}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !444, file: !188, line: 72, baseType: !186, size: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !444, file: !188, line: 73, baseType: !16, size: 32, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !444, file: !188, line: 74, baseType: !449, size: 32, offset: 1248)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !188, line: 62, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 50, size: 384, elements: !452)
!452 = !{!453, !454, !455, !457, !462, !464, !466, !467, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !451, file: !188, line: 51, baseType: !93, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !451, file: !188, line: 52, baseType: !22, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !451, file: !188, line: 53, baseType: !456, size: 96, offset: 96)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, elements: !233)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !451, file: !188, line: 55, baseType: !458, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !188, line: 45, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{!17, !7}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !451, file: !188, line: 56, baseType: !463, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !188, line: 46, baseType: !459)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !451, file: !188, line: 57, baseType: !465, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !188, line: 47, baseType: !350)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !451, file: !188, line: 58, baseType: !7, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !451, file: !188, line: 60, baseType: !99, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !451, file: !188, line: 61, baseType: !19, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !444, file: !188, line: 75, baseType: !320, size: 32, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !444, file: !188, line: 76, baseType: !128, size: 32, offset: 1312)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !444, file: !188, line: 78, baseType: !19, size: 32, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !444, file: !188, line: 80, baseType: !21, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !444, file: !188, line: 81, baseType: !21, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !444, file: !188, line: 82, baseType: !21, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !444, file: !188, line: 83, baseType: !21, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !32, file: !31, line: 98, baseType: !6, size: 32, offset: 1088)
!477 = !{!478, !479, !480, !481, !482, !483}
!478 = !DILocalVariable(name: "p", arg: 1, scope: !26, file: !1, line: 23, type: !29)
!479 = !DILocalVariable(name: "do_write", arg: 2, scope: !26, file: !1, line: 23, type: !12)
!480 = !DILocalVariable(name: "rc", scope: !26, file: !1, line: 25, type: !12)
!481 = !DILocalVariable(name: "flags", scope: !26, file: !1, line: 26, type: !19)
!482 = !DILocalVariable(name: "rev", scope: !26, file: !1, line: 27, type: !43)
!483 = !DILocalVariable(name: "wev", scope: !26, file: !1, line: 27, type: !43)
!484 = !{!485, !485, i64 0}
!485 = !{!"any pointer", !486, i64 0}
!486 = !{!"omnipotent char", !487, i64 0}
!487 = !{!"Simple C/C++ TBAA"}
!488 = !DIExpression()
!489 = !DILocation(line: 23, column: 34, scope: !26)
!490 = !{!491, !491, i64 0}
!491 = !{!"int", !486, i64 0}
!492 = !DILocation(line: 23, column: 47, scope: !26)
!493 = !DILocation(line: 25, column: 5, scope: !26)
!494 = !DILocation(line: 25, column: 19, scope: !26)
!495 = !DILocation(line: 26, column: 5, scope: !26)
!496 = !DILocation(line: 26, column: 19, scope: !26)
!497 = !DILocation(line: 27, column: 5, scope: !26)
!498 = !DILocation(line: 27, column: 19, scope: !26)
!499 = !DILocation(line: 27, column: 25, scope: !26)
!500 = !DILocation(line: 29, column: 5, scope: !26)
!501 = !DILocation(line: 30, column: 13, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 30, column: 13)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 29, column: 16)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 29, column: 5)
!505 = distinct !DILexicalBlock(scope: !26, file: !1, line: 29, column: 5)
!506 = !DILocation(line: 30, column: 13, scope: !503)
!507 = !DILocation(line: 31, column: 13, scope: !508)
!508 = distinct !DILexicalBlock(scope: !502, file: !1, line: 30, column: 23)
!509 = !DILocation(line: 31, column: 16, scope: !508)
!510 = !{!511, !485, i64 108}
!511 = !{!"ngx_event_pipe_s", !485, i64 0, !485, i64 4, !485, i64 8, !485, i64 12, !485, i64 16, !485, i64 20, !485, i64 24, !485, i64 28, !485, i64 32, !485, i64 36, !485, i64 40, !485, i64 44, !485, i64 48, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 52, !491, i64 53, !491, i64 53, !491, i64 53, !491, i64 53, !491, i64 56, !512, i64 60, !485, i64 68, !491, i64 72, !491, i64 76, !491, i64 80, !491, i64 84, !491, i64 88, !491, i64 92, !491, i64 96, !491, i64 100, !485, i64 104, !485, i64 108, !485, i64 112, !491, i64 116, !485, i64 120, !491, i64 124, !513, i64 128, !485, i64 132, !491, i64 136}
!512 = !{!"", !491, i64 0, !491, i64 4}
!513 = !{!"long", !486, i64 0}
!514 = !DILocation(line: 31, column: 21, scope: !508)
!515 = !DILocation(line: 31, column: 28, scope: !508)
!516 = !{!517, !485, i64 32}
!517 = !{!"ngx_log_s", !491, i64 0, !485, i64 4, !513, i64 8, !513, i64 12, !485, i64 16, !485, i64 20, !485, i64 24, !485, i64 28, !485, i64 32, !485, i64 36}
!518 = !DILocation(line: 33, column: 53, scope: !508)
!519 = !DILocation(line: 33, column: 18, scope: !508)
!520 = !DILocation(line: 33, column: 16, scope: !508)
!521 = !DILocation(line: 35, column: 17, scope: !522)
!522 = distinct !DILexicalBlock(scope: !508, file: !1, line: 35, column: 17)
!523 = !DILocation(line: 35, column: 20, scope: !522)
!524 = !DILocation(line: 35, column: 17, scope: !508)
!525 = !DILocation(line: 36, column: 17, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !1, line: 35, column: 34)
!527 = !DILocation(line: 39, column: 17, scope: !528)
!528 = distinct !DILexicalBlock(scope: !508, file: !1, line: 39, column: 17)
!529 = !DILocation(line: 39, column: 20, scope: !528)
!530 = !DILocation(line: 39, column: 17, scope: !508)
!531 = !DILocation(line: 40, column: 17, scope: !532)
!532 = distinct !DILexicalBlock(scope: !528, file: !1, line: 39, column: 33)
