; ModuleID = 'objs/ngx_modules.c'
source_filename = "objs/ngx_modules.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, {}*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_modules", scope: !2, file: !3, line: 52, type: !13, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "objs/ngx_modules.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7)
!7 = distinct !DIGlobalVariable(name: "ngx_module_names", scope: !2, file: !3, line: 100, type: !8, isLocal: false, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1440, elements: !11)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !{!12}
!12 = !DISubrange(count: 45)
!13 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 1440, elements: !11)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !16, line: 15, baseType: !17)
!16 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !18, line: 222, size: 800, elements: !19)
!18 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = !{!20, !26, !27, !28, !29, !30, !31, !34, !36, !476, !477, !483, !487, !488, !489, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !17, file: !18, line: 223, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !22, line: 79, baseType: !23)
!22 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !24, line: 125, baseType: !25)
!24 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !17, file: !18, line: 224, baseType: !21, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !18, line: 226, baseType: !9, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !17, file: !18, line: 228, baseType: !21, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !17, file: !18, line: 229, baseType: !21, size: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !17, file: !18, line: 231, baseType: !21, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !17, file: !18, line: 232, baseType: !32, size: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !17, file: !18, line: 234, baseType: !35, size: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !17, file: !18, line: 235, baseType: !37, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !16, line: 22, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !40, line: 77, size: 224, elements: !41)
!40 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !{!42, !54, !55, !473, !474, !475}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 78, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !44, line: 19, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 16, size: 64, elements: !46)
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !44, line: 17, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 120, baseType: !25)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !44, line: 18, baseType: !50, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !52, line: 64, baseType: !53)
!52 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !40, line: 79, baseType: !21, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !39, file: !40, line: 80, baseType: !56, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DISubroutineType(types: !58)
!58 = !{!9, !59, !37, !35}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !16, line: 16, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !40, line: 116, size: 384, elements: !62)
!62 = !{!63, !64, !242, !455, !456, !457, !466, !467, !468, !469, !470, !472}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !40, line: 117, baseType: !9, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !61, file: !40, line: 118, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !67, line: 22, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 16, size: 160, elements: !69)
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !68, file: !67, line: 17, baseType: !35, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !68, file: !67, line: 18, baseType: !21, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !67, line: 19, baseType: !48, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !68, file: !67, line: 20, baseType: !21, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !68, file: !67, line: 21, baseType: !75, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !16, line: 18, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !78, line: 57, size: 320, elements: !79)
!78 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = !{!80, !88, !89, !90, !222, !229, !241}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !77, file: !78, line: 58, baseType: !81, size: 128)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !78, line: 54, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 49, size: 128, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !82, file: !78, line: 50, baseType: !50, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !82, file: !78, line: 51, baseType: !50, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !78, line: 52, baseType: !75, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !82, file: !78, line: 53, baseType: !21, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !77, file: !78, line: 59, baseType: !48, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !77, file: !78, line: 60, baseType: !75, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !77, file: !78, line: 61, baseType: !91, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !16, line: 19, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !94, line: 59, size: 64, elements: !95)
!94 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !{!96, !221}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !93, file: !94, line: 60, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !94, line: 18, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !94, line: 20, size: 352, elements: !100)
!100 = !{!101, !102, !103, !106, !107, !108, !109, !111, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !99, file: !94, line: 21, baseType: !50, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !94, line: 22, baseType: !50, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !99, file: !94, line: 23, baseType: !104, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !24, line: 222, baseType: !105)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !99, file: !94, line: 24, baseType: !104, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !99, file: !94, line: 26, baseType: !50, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !99, file: !94, line: 27, baseType: !50, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !94, line: 28, baseType: !110, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !94, line: 16, baseType: !35)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !99, file: !94, line: 29, baseType: !112, size: 32, offset: 224)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !16, line: 23, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !115, line: 16, size: 1216, elements: !116)
!115 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!116 = !{!117, !120, !121, !166, !167, !168, !206, !207}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !114, file: !115, line: 17, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !119, line: 16, baseType: !105)
!119 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !115, line: 18, baseType: !43, size: 64, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !114, file: !115, line: 19, baseType: !122, size: 960, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !119, line: 17, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !124, line: 4, size: 960, elements: !125)
!124 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!125 = !{!126, !128, !129, !131, !132, !134, !135, !137, !139, !141, !142, !143, !144, !145, !146, !149, !150, !152, !153, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !123, file: !124, line: 6, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !24, line: 232, baseType: !25)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !123, file: !124, line: 7, baseType: !127, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !123, file: !124, line: 8, baseType: !130, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !24, line: 227, baseType: !25)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !123, file: !124, line: 9, baseType: !130, size: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !123, file: !124, line: 10, baseType: !133, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !24, line: 217, baseType: !25)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !123, file: !124, line: 11, baseType: !133, size: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !123, file: !124, line: 13, baseType: !136, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !24, line: 212, baseType: !25)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !123, file: !124, line: 14, baseType: !138, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !24, line: 304, baseType: !25)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !123, file: !124, line: 15, baseType: !140, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !24, line: 309, baseType: !25)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !123, file: !124, line: 16, baseType: !25, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !123, file: !124, line: 17, baseType: !127, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !123, file: !124, line: 18, baseType: !127, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !123, file: !124, line: 19, baseType: !104, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !123, file: !124, line: 20, baseType: !104, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !123, file: !124, line: 21, baseType: !147, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !24, line: 237, baseType: !148)
!148 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !123, file: !124, line: 22, baseType: !147, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !123, file: !124, line: 23, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !24, line: 242, baseType: !105)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !123, file: !124, line: 24, baseType: !151, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !123, file: !124, line: 26, baseType: !154, size: 64, offset: 576)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !24, line: 288, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !154, file: !24, line: 288, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !24, line: 75, baseType: !148)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !154, file: !24, line: 288, baseType: !148, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !123, file: !124, line: 27, baseType: !154, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !123, file: !124, line: 28, baseType: !154, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !123, file: !124, line: 29, baseType: !162, size: 192, offset: 768)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !164)
!163 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !114, file: !115, line: 21, baseType: !104, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !114, file: !115, line: 22, baseType: !104, size: 32, offset: 1120)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !114, file: !115, line: 24, baseType: !169, size: 32, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !16, line: 20, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !172, line: 50, size: 320, elements: !173)
!172 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !187, !191, !192, !197, !198, !203, !204, !205}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !171, file: !172, line: 51, baseType: !21, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !171, file: !172, line: 52, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !16, line: 21, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !40, line: 89, size: 160, elements: !179)
!179 = !{!180, !181, !182, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !178, file: !40, line: 90, baseType: !118, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !40, line: 91, baseType: !43, size: 64, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !178, file: !40, line: 93, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !176, !169}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !40, line: 94, baseType: !35, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !171, file: !172, line: 54, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !189, line: 98, baseType: !190)
!189 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !171, file: !172, line: 56, baseType: !157, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 58, baseType: !193, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !172, line: 45, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{!50, !169, !50, !48}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 59, baseType: !35, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !171, file: !172, line: 61, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !172, line: 46, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !169, !21, !50, !48}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !171, file: !172, line: 62, baseType: !35, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !171, file: !172, line: 70, baseType: !9, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 72, baseType: !169, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !114, file: !115, line: 37, baseType: !25, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !114, file: !115, line: 38, baseType: !25, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !99, file: !94, line: 30, baseType: !97, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !99, file: !94, line: 34, baseType: !25, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !99, file: !94, line: 40, baseType: !25, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !99, file: !94, line: 43, baseType: !25, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !99, file: !94, line: 45, baseType: !25, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !99, file: !94, line: 46, baseType: !25, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !99, file: !94, line: 47, baseType: !25, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !99, file: !94, line: 48, baseType: !25, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !99, file: !94, line: 49, baseType: !25, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !99, file: !94, line: 50, baseType: !25, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !99, file: !94, line: 52, baseType: !25, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !99, file: !94, line: 53, baseType: !25, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !99, file: !94, line: 55, baseType: !105, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !94, line: 61, baseType: !91, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !77, file: !78, line: 62, baseType: !223, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !78, line: 41, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !78, line: 43, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !78, line: 44, baseType: !223, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !225, file: !78, line: 45, baseType: !35, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !77, file: !78, line: 63, baseType: !230, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !78, line: 32, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !78, line: 34, size: 96, elements: !233)
!233 = !{!234, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !232, file: !78, line: 35, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !78, line: 30, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !35}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !78, line: 36, baseType: !35, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !78, line: 37, baseType: !230, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !77, file: !78, line: 64, baseType: !169, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !61, file: !40, line: 120, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !16, line: 17, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !246, line: 38, size: 2496, elements: !247)
!246 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!247 = !{!248, !252, !253, !254, !255, !256, !392, !393, !394, !396, !397, !398, !399, !400, !401, !402, !403, !424, !425, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !245, file: !246, line: 39, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !245, file: !246, line: 40, baseType: !75, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !245, file: !246, line: 42, baseType: !169, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !245, file: !246, line: 43, baseType: !170, size: 320, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !245, file: !246, line: 45, baseType: !21, size: 32, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !245, file: !246, line: 47, baseType: !257, size: 32, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !16, line: 26, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !261, line: 121, size: 896, elements: !262)
!261 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!262 = !{!263, !264, !268, !269, !272, !279, !281, !286, !291, !353, !354, !355, !356, !357, !358, !359, !360, !361, !365, !366, !367, !368, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !261, line: 122, baseType: !35, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !260, file: !261, line: 123, baseType: !265, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !16, line: 24, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !16, line: 24, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !260, file: !261, line: 124, baseType: !265, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !260, file: !261, line: 126, baseType: !270, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !271, line: 17, baseType: !105)
!271 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !260, file: !261, line: 128, baseType: !273, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !274, line: 19, baseType: !275)
!274 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !258, !50, !48}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 135, baseType: !105)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !260, file: !261, line: 129, baseType: !280, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !274, line: 22, baseType: !275)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !260, file: !261, line: 130, baseType: !282, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !274, line: 20, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!278, !258, !91, !104}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !260, file: !261, line: 131, baseType: !287, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !274, line: 23, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{!91, !258, !91, !104}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !260, file: !261, line: 133, baseType: !292, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !261, line: 16, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !261, line: 18, size: 960, elements: !295)
!295 = !{!296, !297, !309, !311, !312, !313, !314, !315, !316, !317, !322, !323, !324, !325, !326, !327, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !294, file: !261, line: 19, baseType: !270, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !294, file: !261, line: 21, baseType: !298, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !300, line: 297, size: 128, elements: !301)
!300 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!301 = !{!302, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !299, file: !300, line: 298, baseType: !303, size: 16)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !24, line: 409, baseType: !304)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !299, file: !300, line: 299, baseType: !306, size: 112, offset: 16)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 14)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !294, file: !261, line: 22, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !24, line: 404, baseType: !25)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !294, file: !261, line: 23, baseType: !48, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !294, file: !261, line: 24, baseType: !43, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !294, file: !261, line: 26, baseType: !105, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !294, file: !261, line: 28, baseType: !105, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !294, file: !261, line: 29, baseType: !105, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !294, file: !261, line: 30, baseType: !105, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !294, file: !261, line: 38, baseType: !318, size: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !16, line: 32, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !258}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !294, file: !261, line: 40, baseType: !35, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !294, file: !261, line: 42, baseType: !170, size: 320, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !294, file: !261, line: 43, baseType: !169, size: 32, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !294, file: !261, line: 45, baseType: !48, size: 32, offset: 736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !294, file: !261, line: 47, baseType: !48, size: 32, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !294, file: !261, line: 49, baseType: !328, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !329, line: 16, baseType: !330)
!329 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !331, line: 16, baseType: !21)
!331 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!332 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !294, file: !261, line: 51, baseType: !292, size: 32, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !294, file: !261, line: 52, baseType: !258, size: 32, offset: 864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !294, file: !261, line: 54, baseType: !21, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !294, file: !261, line: 56, baseType: !25, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !294, file: !261, line: 57, baseType: !25, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !294, file: !261, line: 58, baseType: !25, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !294, file: !261, line: 60, baseType: !25, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !294, file: !261, line: 61, baseType: !25, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !294, file: !261, line: 62, baseType: !25, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !294, file: !261, line: 63, baseType: !25, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !294, file: !261, line: 64, baseType: !25, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !294, file: !261, line: 65, baseType: !25, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !294, file: !261, line: 66, baseType: !25, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !294, file: !261, line: 67, baseType: !25, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !294, file: !261, line: 70, baseType: !25, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !294, file: !261, line: 72, baseType: !25, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !294, file: !261, line: 73, baseType: !25, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !294, file: !261, line: 74, baseType: !25, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !294, file: !261, line: 76, baseType: !25, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !294, file: !261, line: 77, baseType: !25, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !294, file: !261, line: 78, baseType: !25, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !260, file: !261, line: 135, baseType: !104, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !260, file: !261, line: 137, baseType: !169, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !260, file: !261, line: 139, baseType: !75, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !261, line: 141, baseType: !105, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !260, file: !261, line: 143, baseType: !298, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !260, file: !261, line: 144, baseType: !310, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !260, file: !261, line: 145, baseType: !43, size: 64, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !260, file: !261, line: 147, baseType: !43, size: 64, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !260, file: !261, line: 148, baseType: !362, size: 16, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !363, line: 12, baseType: !364)
!363 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !24, line: 186, baseType: !304)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !260, file: !261, line: 154, baseType: !298, size: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !260, file: !261, line: 155, baseType: !310, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !260, file: !261, line: 157, baseType: !97, size: 32, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !260, file: !261, line: 159, baseType: !369, size: 64, offset: 736)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !370, line: 16, baseType: !371)
!370 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !370, line: 18, size: 64, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !370, line: 19, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !370, line: 20, baseType: !374, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !260, file: !261, line: 161, baseType: !188, size: 32, offset: 800)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !260, file: !261, line: 163, baseType: !21, size: 32, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !260, file: !261, line: 165, baseType: !25, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !260, file: !261, line: 167, baseType: !25, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !260, file: !261, line: 169, baseType: !25, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !260, file: !261, line: 170, baseType: !25, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !260, file: !261, line: 171, baseType: !25, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !260, file: !261, line: 173, baseType: !25, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !260, file: !261, line: 174, baseType: !25, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !260, file: !261, line: 175, baseType: !25, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !260, file: !261, line: 176, baseType: !25, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !260, file: !261, line: 178, baseType: !25, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !260, file: !261, line: 179, baseType: !25, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !260, file: !261, line: 180, baseType: !25, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !260, file: !261, line: 181, baseType: !25, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !260, file: !261, line: 183, baseType: !25, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !245, file: !246, line: 48, baseType: !258, size: 32, offset: 480)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !245, file: !246, line: 49, baseType: !21, size: 32, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !245, file: !246, line: 51, baseType: !395, size: 32, offset: 544)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !245, file: !246, line: 52, baseType: !21, size: 32, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !245, file: !246, line: 53, baseType: !21, size: 32, offset: 608)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !245, file: !246, line: 55, baseType: !369, size: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !245, file: !246, line: 56, baseType: !21, size: 32, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !245, file: !246, line: 58, baseType: !66, size: 160, offset: 736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !245, file: !246, line: 59, baseType: !66, size: 160, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !245, file: !246, line: 61, baseType: !66, size: 160, offset: 1056)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !245, file: !246, line: 62, baseType: !404, size: 96, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !331, line: 32, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !331, line: 37, size: 96, elements: !406)
!406 = !{!407, !418, !419}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !405, file: !331, line: 38, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !331, line: 20, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !331, line: 22, size: 160, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !410, file: !331, line: 23, baseType: !330, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !410, file: !331, line: 24, baseType: !408, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !410, file: !331, line: 25, baseType: !408, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !410, file: !331, line: 26, baseType: !408, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !410, file: !331, line: 27, baseType: !51, size: 8, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !331, line: 28, baseType: !51, size: 8, offset: 136)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !405, file: !331, line: 39, baseType: !408, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !405, file: !331, line: 40, baseType: !420, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !331, line: 34, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !408, !408, !408}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !245, file: !246, line: 63, baseType: !409, size: 160, offset: 1312)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !245, file: !246, line: 65, baseType: !426, size: 224, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !427, line: 31, baseType: !428)
!427 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 25, size: 224, elements: !429)
!429 = !{!430, !438, !439, !440, !441}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !428, file: !427, line: 26, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !427, line: 16, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !427, line: 18, size: 96, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !433, file: !427, line: 19, baseType: !35, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !433, file: !427, line: 20, baseType: !21, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !427, line: 21, baseType: !431, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !428, file: !427, line: 27, baseType: !432, size: 96, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !427, line: 28, baseType: !48, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !428, file: !427, line: 29, baseType: !21, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !428, file: !427, line: 30, baseType: !75, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !245, file: !246, line: 66, baseType: !426, size: 224, offset: 1696)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !245, file: !246, line: 68, baseType: !21, size: 32, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !245, file: !246, line: 69, baseType: !21, size: 32, offset: 1952)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !245, file: !246, line: 71, baseType: !258, size: 32, offset: 1984)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !245, file: !246, line: 72, baseType: !265, size: 32, offset: 2016)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !245, file: !246, line: 73, baseType: !265, size: 32, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !245, file: !246, line: 75, baseType: !243, size: 32, offset: 2080)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !245, file: !246, line: 77, baseType: !43, size: 64, offset: 2112)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !245, file: !246, line: 78, baseType: !43, size: 64, offset: 2176)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !245, file: !246, line: 79, baseType: !43, size: 64, offset: 2240)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !245, file: !246, line: 80, baseType: !43, size: 64, offset: 2304)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !245, file: !246, line: 81, baseType: !43, size: 64, offset: 2368)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !245, file: !246, line: 82, baseType: !43, size: 64, offset: 2432)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !61, file: !40, line: 121, baseType: !75, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !61, file: !40, line: 122, baseType: !75, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !61, file: !40, line: 123, baseType: !458, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !40, line: 103, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 98, size: 1344, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !460, file: !40, line: 99, baseType: !113, size: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !460, file: !40, line: 100, baseType: !97, size: 32, offset: 1216)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !460, file: !40, line: 101, baseType: !97, size: 32, offset: 1248)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !460, file: !40, line: 102, baseType: !21, size: 32, offset: 1280)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !61, file: !40, line: 124, baseType: !169, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !61, file: !40, line: 126, baseType: !35, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !61, file: !40, line: 127, baseType: !21, size: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !61, file: !40, line: 128, baseType: !21, size: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !61, file: !40, line: 130, baseType: !471, size: 32, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !40, line: 112, baseType: !56)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !61, file: !40, line: 131, baseType: !9, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !39, file: !40, line: 81, baseType: !21, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !39, file: !40, line: 82, baseType: !21, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !39, file: !40, line: 83, baseType: !35, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !18, line: 236, baseType: !21, size: 32, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !17, file: !18, line: 238, baseType: !478, size: 32, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !169}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !22, line: 78, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !24, line: 140, baseType: !105)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !17, file: !18, line: 240, baseType: !484, size: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DISubroutineType(types: !486)
!486 = !{!481, !243}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !17, file: !18, line: 242, baseType: !484, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !17, file: !18, line: 243, baseType: !484, size: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !17, file: !18, line: 244, baseType: !490, size: 32, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !243}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !17, file: !18, line: 245, baseType: !490, size: 32, offset: 480)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !17, file: !18, line: 247, baseType: !490, size: 32, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !17, file: !18, line: 249, baseType: !23, size: 32, offset: 544)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !17, file: !18, line: 250, baseType: !23, size: 32, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !17, file: !18, line: 251, baseType: !23, size: 32, offset: 608)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !17, file: !18, line: 252, baseType: !23, size: 32, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !17, file: !18, line: 253, baseType: !23, size: 32, offset: 672)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !17, file: !18, line: 254, baseType: !23, size: 32, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !17, file: !18, line: 255, baseType: !23, size: 32, offset: 736)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !17, file: !18, line: 256, baseType: !23, size: 32, offset: 768)
!503 = !{i32 2, !"Dwarf Version", i32 4}
!504 = !{i32 2, !"Debug Info Version", i32 3}
!505 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
