; ModuleID = 'src/os/unix/ngx_writev_chain.c'
source_filename = "src/os/unix/ngx_writev_chain.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_connection_s = type { i8*, %struct.ngx_event_s*, %struct.ngx_event_s*, i32, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, {}*, %struct.ngx_listening_s*, i32, %struct.ngx_log_s*, %struct.ngx_pool_s*, i32, %struct.sockaddr*, i32, %struct.ngx_str_t, %struct.ngx_str_t, i16, %struct.sockaddr*, i32, %struct.ngx_buf_s*, %struct.ngx_queue_s, i32, i32, i32 }
%struct.ngx_event_s = type { i8*, i24, void (%struct.ngx_event_s*)*, i32, %struct.ngx_log_s*, %struct.ngx_rbtree_node_s, %struct.ngx_queue_s }
%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }
%struct.ngx_listening_s = type { i32, %struct.sockaddr*, i32, i32, %struct.ngx_str_t, i32, i32, i32, i32, void (%struct.ngx_connection_s*)*, i8*, %struct.ngx_log_s, %struct.ngx_log_s*, i32, i32, i32, %struct.ngx_listening_s*, %struct.ngx_connection_s*, i32, i24 }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/os/unix/ngx_writev_chain.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !7, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !5, line: 222, baseType: !6)
!5 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !9, line: 19, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !11, line: 59, size: 64, elements: !12)
!11 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !{!13, !155}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !10, file: !11, line: 60, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !11, line: 18, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !11, line: 20, size: 352, elements: !17)
!17 = !{!18, !23, !24, !25, !26, !27, !28, !31, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !16, file: !11, line: 21, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !21, line: 64, baseType: !22)
!21 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !16, file: !11, line: 22, baseType: !19, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !16, file: !11, line: 23, baseType: !4, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !16, file: !11, line: 24, baseType: !4, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !16, file: !11, line: 26, baseType: !19, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !16, file: !11, line: 27, baseType: !19, size: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !16, file: !11, line: 28, baseType: !29, size: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !11, line: 16, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !16, file: !11, line: 29, baseType: !32, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !9, line: 23, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !35, line: 16, size: 1216, elements: !36)
!35 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = !{!37, !40, !49, !94, !95, !96, !140, !141}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !34, file: !35, line: 17, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !39, line: 16, baseType: !6)
!39 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !35, line: 18, baseType: !41, size: 64, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !42, line: 19, baseType: !43)
!42 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 16, size: 64, elements: !44)
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !42, line: 17, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 120, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !42, line: 18, baseType: !19, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !34, file: !35, line: 19, baseType: !50, size: 960, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !39, line: 17, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !52, line: 4, size: 960, elements: !53)
!52 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !{!54, !56, !57, !59, !60, !62, !63, !65, !67, !69, !70, !71, !72, !73, !74, !77, !78, !80, !81, !87, !88, !89}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !51, file: !52, line: 6, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !5, line: 232, baseType: !47)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !51, file: !52, line: 7, baseType: !55, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !51, file: !52, line: 8, baseType: !58, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !5, line: 227, baseType: !47)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !51, file: !52, line: 9, baseType: !58, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !51, file: !52, line: 10, baseType: !61, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !5, line: 217, baseType: !47)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !51, file: !52, line: 11, baseType: !61, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !51, file: !52, line: 13, baseType: !64, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !5, line: 212, baseType: !47)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !51, file: !52, line: 14, baseType: !66, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !5, line: 304, baseType: !47)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !51, file: !52, line: 15, baseType: !68, size: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !5, line: 309, baseType: !47)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !51, file: !52, line: 16, baseType: !47, size: 32, offset: 288)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !51, file: !52, line: 17, baseType: !55, size: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !51, file: !52, line: 18, baseType: !55, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !51, file: !52, line: 19, baseType: !4, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !51, file: !52, line: 20, baseType: !4, size: 32, offset: 416)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !51, file: !52, line: 21, baseType: !75, size: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !5, line: 237, baseType: !76)
!76 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !51, file: !52, line: 22, baseType: !75, size: 32, offset: 480)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !51, file: !52, line: 23, baseType: !79, size: 32, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !5, line: 242, baseType: !6)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !51, file: !52, line: 24, baseType: !79, size: 32, offset: 544)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !51, file: !52, line: 26, baseType: !82, size: 64, offset: 576)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !5, line: 288, size: 64, elements: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !82, file: !5, line: 288, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !5, line: 75, baseType: !76)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !82, file: !5, line: 288, baseType: !76, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !51, file: !52, line: 27, baseType: !82, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !51, file: !52, line: 28, baseType: !82, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !51, file: !52, line: 29, baseType: !90, size: 192, offset: 768)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, elements: !92)
!91 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !34, file: !35, line: 21, baseType: !4, size: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !34, file: !35, line: 22, baseType: !4, size: 32, offset: 1120)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !34, file: !35, line: 24, baseType: !97, size: 32, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !9, line: 20, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !100, line: 50, size: 320, elements: !101)
!100 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = !{!102, !106, !119, !123, !124, !129, !130, !135, !136, !139}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !99, file: !100, line: 51, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !104, line: 79, baseType: !105)
!104 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !5, line: 125, baseType: !47)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !99, file: !100, line: 52, baseType: !107, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !9, line: 21, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !110, line: 89, size: 160, elements: !111)
!110 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !{!112, !113, !114, !118}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !109, file: !110, line: 90, baseType: !38, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 91, baseType: !41, size: 64, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !109, file: !110, line: 93, baseType: !115, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !107, !97}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 94, baseType: !30, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !99, file: !100, line: 54, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !121, line: 98, baseType: !122)
!121 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !99, file: !100, line: 56, baseType: !85, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !99, file: !100, line: 58, baseType: !125, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !100, line: 45, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!19, !97, !19, !46}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !100, line: 59, baseType: !30, size: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !99, file: !100, line: 61, baseType: !131, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !100, line: 46, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !97, !103, !19, !46}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !99, file: !100, line: 62, baseType: !30, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !99, file: !100, line: 70, baseType: !137, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 72, baseType: !97, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !34, file: !35, line: 37, baseType: !47, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !34, file: !35, line: 38, baseType: !47, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !16, file: !11, line: 30, baseType: !14, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !16, file: !11, line: 34, baseType: !47, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !16, file: !11, line: 40, baseType: !47, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !16, file: !11, line: 43, baseType: !47, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !16, file: !11, line: 45, baseType: !47, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !16, file: !11, line: 46, baseType: !47, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !16, file: !11, line: 47, baseType: !47, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !16, file: !11, line: 48, baseType: !47, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !16, file: !11, line: 49, baseType: !47, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !16, file: !11, line: 50, baseType: !47, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !16, file: !11, line: 52, baseType: !47, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !16, file: !11, line: 53, baseType: !47, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !16, file: !11, line: 55, baseType: !6, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !10, file: !11, line: 61, baseType: !7, size: 32, offset: 32)
!156 = !{i32 2, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!159 = distinct !DISubprogram(name: "ngx_writev_chain", scope: !1, file: !1, line: 14, type: !160, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !373)
!160 = !DISubroutineType(types: !161)
!161 = !{!7, !162, !7, !4}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !9, line: 26, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !165, line: 121, size: 896, elements: !166)
!165 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!166 = !{!167, !168, !224, !225, !228, !235, !237, !242, !245, !305, !306, !307, !344, !345, !346, !347, !348, !349, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 122, baseType: !30, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !164, file: !165, line: 123, baseType: !169, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !9, line: 24, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !172, line: 30, size: 384, elements: !173)
!172 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !201, !202, !203, !216}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 31, baseType: !30, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !171, file: !172, line: 33, baseType: !47, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !171, file: !172, line: 35, baseType: !47, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !171, file: !172, line: 38, baseType: !47, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !171, file: !172, line: 44, baseType: !47, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !171, file: !172, line: 46, baseType: !47, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !171, file: !172, line: 49, baseType: !47, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !171, file: !172, line: 51, baseType: !47, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !171, file: !172, line: 54, baseType: !47, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !171, file: !172, line: 56, baseType: !47, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !171, file: !172, line: 57, baseType: !47, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !171, file: !172, line: 59, baseType: !47, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !171, file: !172, line: 60, baseType: !47, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !171, file: !172, line: 62, baseType: !47, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !171, file: !172, line: 64, baseType: !47, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !171, file: !172, line: 67, baseType: !47, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !171, file: !172, line: 69, baseType: !47, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !171, file: !172, line: 71, baseType: !47, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !171, file: !172, line: 74, baseType: !47, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !171, file: !172, line: 75, baseType: !47, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !171, file: !172, line: 77, baseType: !47, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !171, file: !172, line: 107, baseType: !47, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 110, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !9, line: 31, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !169}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !171, file: !172, line: 117, baseType: !103, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !171, file: !172, line: 119, baseType: !97, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !171, file: !172, line: 121, baseType: !204, size: 160, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !205, line: 20, baseType: !206)
!205 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !205, line: 22, size: 160, elements: !207)
!207 = !{!208, !210, !212, !213, !214, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !206, file: !205, line: 23, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !205, line: 16, baseType: !103)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !206, file: !205, line: 24, baseType: !211, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !206, file: !205, line: 25, baseType: !211, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !206, file: !205, line: 26, baseType: !211, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !206, file: !205, line: 27, baseType: !20, size: 8, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !205, line: 28, baseType: !20, size: 8, offset: 136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !171, file: !172, line: 124, baseType: !217, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !218, line: 16, baseType: !219)
!218 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !218, line: 18, size: 64, elements: !220)
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !219, file: !218, line: 19, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !218, line: 20, baseType: !222, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !164, file: !165, line: 124, baseType: !169, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !164, file: !165, line: 126, baseType: !226, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !227, line: 17, baseType: !6)
!227 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !164, file: !165, line: 128, baseType: !229, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !230, line: 19, baseType: !231)
!230 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !162, !19, !46}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !5, line: 135, baseType: !6)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !164, file: !165, line: 129, baseType: !236, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !230, line: 22, baseType: !231)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !164, file: !165, line: 130, baseType: !238, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !230, line: 20, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!234, !162, !7, !4}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !164, file: !165, line: 131, baseType: !243, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !230, line: 23, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !164, file: !165, line: 133, baseType: !246, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !165, line: 16, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !165, line: 18, size: 960, elements: !249)
!249 = !{!250, !251, !263, !265, !266, !267, !268, !269, !270, !271, !276, !277, !278, !279, !280, !281, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !248, file: !165, line: 19, baseType: !226, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !248, file: !165, line: 21, baseType: !252, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !254, line: 297, size: 128, elements: !255)
!254 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!255 = !{!256, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !253, file: !254, line: 298, baseType: !257, size: 16)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !5, line: 409, baseType: !258)
!258 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !253, file: !254, line: 299, baseType: !260, size: 112, offset: 16)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 112, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 14)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !248, file: !165, line: 22, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !5, line: 404, baseType: !47)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !248, file: !165, line: 23, baseType: !46, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !248, file: !165, line: 24, baseType: !41, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !165, line: 26, baseType: !6, size: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !248, file: !165, line: 28, baseType: !6, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !248, file: !165, line: 29, baseType: !6, size: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !248, file: !165, line: 30, baseType: !6, size: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !248, file: !165, line: 38, baseType: !272, size: 32, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !9, line: 32, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !162}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !248, file: !165, line: 40, baseType: !30, size: 32, offset: 352)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !248, file: !165, line: 42, baseType: !98, size: 320, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !248, file: !165, line: 43, baseType: !97, size: 32, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !248, file: !165, line: 45, baseType: !46, size: 32, offset: 736)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !248, file: !165, line: 47, baseType: !46, size: 32, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !248, file: !165, line: 49, baseType: !282, size: 32, offset: 800)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !283, line: 16, baseType: !209)
!283 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !248, file: !165, line: 51, baseType: !246, size: 32, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !248, file: !165, line: 52, baseType: !162, size: 32, offset: 864)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !248, file: !165, line: 54, baseType: !103, size: 32, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !248, file: !165, line: 56, baseType: !47, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !248, file: !165, line: 57, baseType: !47, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !248, file: !165, line: 58, baseType: !47, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !248, file: !165, line: 60, baseType: !47, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !248, file: !165, line: 61, baseType: !47, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !248, file: !165, line: 62, baseType: !47, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !248, file: !165, line: 63, baseType: !47, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !248, file: !165, line: 64, baseType: !47, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !248, file: !165, line: 65, baseType: !47, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !248, file: !165, line: 66, baseType: !47, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !248, file: !165, line: 67, baseType: !47, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !248, file: !165, line: 70, baseType: !47, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !248, file: !165, line: 72, baseType: !47, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !248, file: !165, line: 73, baseType: !47, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !248, file: !165, line: 74, baseType: !47, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !248, file: !165, line: 76, baseType: !47, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !248, file: !165, line: 77, baseType: !47, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !248, file: !165, line: 78, baseType: !47, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !164, file: !165, line: 135, baseType: !4, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !164, file: !165, line: 137, baseType: !97, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !164, file: !165, line: 139, baseType: !308, size: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !9, line: 18, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !311, line: 57, size: 320, elements: !312)
!311 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!312 = !{!313, !321, !322, !323, !324, !331, !343}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !310, file: !311, line: 58, baseType: !314, size: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !311, line: 54, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 49, size: 128, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !315, file: !311, line: 50, baseType: !19, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !315, file: !311, line: 51, baseType: !19, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !311, line: 52, baseType: !308, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !315, file: !311, line: 53, baseType: !103, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !310, file: !311, line: 59, baseType: !46, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !310, file: !311, line: 60, baseType: !308, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !310, file: !311, line: 61, baseType: !7, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !310, file: !311, line: 62, baseType: !325, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !311, line: 41, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !311, line: 43, size: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !311, line: 44, baseType: !325, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !327, file: !311, line: 45, baseType: !30, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !310, file: !311, line: 63, baseType: !332, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !311, line: 32, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !311, line: 34, size: 96, elements: !335)
!335 = !{!336, !341, !342}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !334, file: !311, line: 35, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !311, line: 30, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !30}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !311, line: 36, baseType: !30, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !311, line: 37, baseType: !332, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !310, file: !311, line: 64, baseType: !97, size: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 141, baseType: !6, size: 32, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !164, file: !165, line: 143, baseType: !252, size: 32, offset: 416)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !164, file: !165, line: 144, baseType: !264, size: 32, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !164, file: !165, line: 145, baseType: !41, size: 64, offset: 480)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !164, file: !165, line: 147, baseType: !41, size: 64, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !164, file: !165, line: 148, baseType: !350, size: 16, offset: 608)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !351, line: 12, baseType: !352)
!351 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 186, baseType: !258)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !164, file: !165, line: 154, baseType: !252, size: 32, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !164, file: !165, line: 155, baseType: !264, size: 32, offset: 672)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !164, file: !165, line: 157, baseType: !14, size: 32, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !164, file: !165, line: 159, baseType: !217, size: 64, offset: 736)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !164, file: !165, line: 161, baseType: !120, size: 32, offset: 800)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !164, file: !165, line: 163, baseType: !103, size: 32, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !164, file: !165, line: 165, baseType: !47, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !164, file: !165, line: 167, baseType: !47, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !164, file: !165, line: 169, baseType: !47, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !164, file: !165, line: 170, baseType: !47, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !164, file: !165, line: 171, baseType: !47, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !164, file: !165, line: 173, baseType: !47, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !164, file: !165, line: 174, baseType: !47, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !164, file: !165, line: 175, baseType: !47, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !164, file: !165, line: 176, baseType: !47, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !164, file: !165, line: 178, baseType: !47, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !164, file: !165, line: 179, baseType: !47, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !164, file: !165, line: 180, baseType: !47, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !164, file: !165, line: 181, baseType: !47, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !164, file: !165, line: 183, baseType: !47, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !396}
!374 = !DILocalVariable(name: "c", arg: 1, scope: !159, file: !1, line: 14, type: !162)
!375 = !DILocalVariable(name: "in", arg: 2, scope: !159, file: !1, line: 14, type: !7)
!376 = !DILocalVariable(name: "limit", arg: 3, scope: !159, file: !1, line: 14, type: !4)
!377 = !DILocalVariable(name: "n", scope: !159, file: !1, line: 16, type: !234)
!378 = !DILocalVariable(name: "sent", scope: !159, file: !1, line: 16, type: !234)
!379 = !DILocalVariable(name: "send", scope: !159, file: !1, line: 17, type: !4)
!380 = !DILocalVariable(name: "prev_send", scope: !159, file: !1, line: 17, type: !4)
!381 = !DILocalVariable(name: "cl", scope: !159, file: !1, line: 18, type: !7)
!382 = !DILocalVariable(name: "wev", scope: !159, file: !1, line: 19, type: !169)
!383 = !DILocalVariable(name: "vec", scope: !159, file: !1, line: 20, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_iovec_t", file: !230, line: 69, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 64, size: 128, elements: !386)
!386 = !{!387, !393, !394, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "iovs", scope: !385, file: !230, line: 65, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !5, line: 398, size: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !389, file: !5, line: 398, baseType: !30, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !389, file: !5, line: 398, baseType: !46, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !385, file: !230, line: 66, baseType: !103, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !385, file: !230, line: 67, baseType: !46, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !385, file: !230, line: 68, baseType: !103, size: 32, offset: 96)
!396 = !DILocalVariable(name: "iovs", scope: !159, file: !1, line: 21, type: !397)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 4096, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 64)
!400 = !{!401, !401, i64 0}
!401 = !{!"any pointer", !402, i64 0}
!402 = !{!"omnipotent char", !403, i64 0}
!403 = !{!"Simple C/C++ TBAA"}
!404 = !DIExpression()
!405 = !DILocation(line: 14, column: 36, scope: !159)
!406 = !DILocation(line: 14, column: 52, scope: !159)
!407 = !{!408, !408, i64 0}
!408 = !{!"int", !402, i64 0}
!409 = !DILocation(line: 14, column: 62, scope: !159)
!410 = !DILocation(line: 16, column: 5, scope: !159)
!411 = !DILocation(line: 16, column: 20, scope: !159)
!412 = !DILocation(line: 16, column: 23, scope: !159)
!413 = !DILocation(line: 17, column: 5, scope: !159)
!414 = !DILocation(line: 17, column: 20, scope: !159)
!415 = !DILocation(line: 17, column: 26, scope: !159)
!416 = !DILocation(line: 18, column: 5, scope: !159)
!417 = !DILocation(line: 18, column: 20, scope: !159)
!418 = !DILocation(line: 19, column: 5, scope: !159)
!419 = !DILocation(line: 19, column: 20, scope: !159)
!420 = !DILocation(line: 20, column: 5, scope: !159)
!421 = !DILocation(line: 20, column: 20, scope: !159)
!422 = !DILocation(line: 21, column: 5, scope: !159)
!423 = !DILocation(line: 21, column: 20, scope: !159)
!424 = !DILocation(line: 23, column: 11, scope: !159)
!425 = !DILocation(line: 23, column: 14, scope: !159)
!426 = !{!427, !401, i64 8}
!427 = !{!"ngx_connection_s", !401, i64 0, !401, i64 4, !401, i64 8, !408, i64 12, !401, i64 16, !401, i64 20, !401, i64 24, !401, i64 28, !401, i64 32, !408, i64 36, !401, i64 40, !401, i64 44, !408, i64 48, !401, i64 52, !408, i64 56, !428, i64 60, !428, i64 68, !429, i64 76, !401, i64 80, !408, i64 84, !401, i64 88, !430, i64 92, !431, i64 100, !408, i64 104, !408, i64 108, !408, i64 109, !408, i64 109, !408, i64 109, !408, i64 109, !408, i64 109, !408, i64 109, !408, i64 110, !408, i64 110, !408, i64 110, !408, i64 110, !408, i64 110, !408, i64 110, !408, i64 111}
!428 = !{!"", !408, i64 0, !401, i64 4}
!429 = !{!"short", !402, i64 0}
!430 = !{!"ngx_queue_s", !401, i64 0, !401, i64 4}
!431 = !{!"long", !402, i64 0}
!432 = !DILocation(line: 23, column: 9, scope: !159)
!433 = !DILocation(line: 25, column: 10, scope: !434)
!434 = distinct !DILexicalBlock(scope: !159, file: !1, line: 25, column: 9)
!435 = !DILocation(line: 25, column: 15, scope: !434)
!436 = !DILocation(line: 25, column: 9, scope: !159)
!437 = !DILocation(line: 26, column: 16, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !1, line: 25, column: 22)
!439 = !DILocation(line: 26, column: 9, scope: !438)
!440 = !DILocation(line: 42, column: 9, scope: !441)
!441 = distinct !DILexicalBlock(scope: !159, file: !1, line: 42, column: 9)
!442 = !DILocation(line: 42, column: 15, scope: !441)
!443 = !DILocation(line: 42, column: 20, scope: !441)
!444 = !DILocation(line: 42, column: 23, scope: !441)
!445 = !DILocation(line: 42, column: 63, scope: !441)
!446 = !DILocation(line: 42, column: 61, scope: !441)
!447 = !DILocation(line: 42, column: 29, scope: !441)
!448 = !DILocation(line: 42, column: 9, scope: !159)
!449 = !DILocation(line: 43, column: 40, scope: !450)
!450 = distinct !DILexicalBlock(scope: !441, file: !1, line: 42, column: 78)
!451 = !DILocation(line: 43, column: 38, scope: !450)
!452 = !DILocation(line: 43, column: 15, scope: !450)
!453 = !DILocation(line: 44, column: 5, scope: !450)
!454 = !DILocation(line: 46, column: 10, scope: !159)
!455 = !DILocation(line: 48, column: 16, scope: !159)
!456 = !DILocation(line: 48, column: 9, scope: !159)
!457 = !DILocation(line: 48, column: 14, scope: !159)
!458 = !{!459, !401, i64 0}
!459 = !{!"", !401, i64 0, !408, i64 4, !408, i64 8, !408, i64 12}
!460 = !DILocation(line: 49, column: 9, scope: !159)
