; ModuleID = 'src/os/unix/ngx_process.c'
source_filename = "src/os/unix/ngx_process.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_signal_t = type { i32, i8*, i8*, void (i32)* }
%struct.ngx_process_t = type { i32, i32, [2 x i32], void (%struct.ngx_cycle_s*, i8*)*, i8*, i8*, i8 }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "signals", scope: !2, file: !3, line: 39, type: !669, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !317)
!3 = !DIFile(filename: "src/os/unix/ngx_process.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !245, !247, !73, !255}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_conf_t", file: !8, line: 117, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 86, size: 928, elements: !10)
!10 = !{!11, !17, !18, !26, !27, !29, !30, !31, !33, !34, !35, !36, !42, !45, !49, !52, !64, !65, !66, !67, !243}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !9, file: !8, line: 87, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !13, line: 80, baseType: !14)
!13 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !15, line: 140, baseType: !16)
!15 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !9, file: !8, line: 88, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "timer_resolution", scope: !9, file: !8, line: 90, baseType: !19, size: 32, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !20, line: 16, baseType: !21)
!20 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !22, line: 16, baseType: !23)
!22 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !13, line: 79, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !15, line: 125, baseType: !25)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timeout", scope: !9, file: !8, line: 91, baseType: !19, size: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "worker_processes", scope: !9, file: !8, line: 93, baseType: !28, size: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !13, line: 78, baseType: !14)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "debug_points", scope: !9, file: !8, line: 94, baseType: !28, size: 32, offset: 160)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_nofile", scope: !9, file: !8, line: 96, baseType: !28, size: 32, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_core", scope: !9, file: !8, line: 97, baseType: !32, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !15, line: 222, baseType: !16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !9, file: !8, line: 99, baseType: !16, size: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_auto", scope: !9, file: !8, line: 101, baseType: !23, size: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_n", scope: !9, file: !8, line: 102, baseType: !23, size: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity", scope: !9, file: !8, line: 103, baseType: !37, size: 32, offset: 352)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cpuset_t", file: !39, line: 32, baseType: !40)
!39 = !DIFile(filename: "src/os/unix/ngx_setaffinity.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 196, baseType: !41)
!41 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !9, file: !8, line: 105, baseType: !43, size: 32, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !9, file: !8, line: 106, baseType: !46, size: 32, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !47, line: 16, baseType: !48)
!47 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 304, baseType: !25)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !9, file: !8, line: 107, baseType: !50, size: 32, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_gid_t", file: !47, line: 17, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 309, baseType: !25)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "working_directory", scope: !9, file: !8, line: 109, baseType: !53, size: 64, offset: 480)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !54, line: 19, baseType: !55)
!54 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 16, size: 64, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !54, line: 17, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 120, baseType: !25)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !54, line: 18, baseType: !60, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !62, line: 64, baseType: !63)
!62 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !9, file: !8, line: 110, baseType: !53, size: 64, offset: 544)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !9, file: !8, line: 112, baseType: !53, size: 64, offset: 608)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "oldpid", scope: !9, file: !8, line: 113, baseType: !53, size: 64, offset: 672)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !9, file: !8, line: 115, baseType: !68, size: 160, offset: 736)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !69, line: 22, baseType: !70)
!69 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 16, size: 160, elements: !71)
!71 = !{!72, !74, !75, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !70, file: !69, line: 17, baseType: !73, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !70, file: !69, line: 18, baseType: !23, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !69, line: 19, baseType: !58, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !70, file: !69, line: 20, baseType: !23, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !70, file: !69, line: 21, baseType: !78, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !80, line: 18, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !82, line: 57, size: 320, elements: !83)
!82 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !{!84, !92, !93, !94, !223, !230, !242}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !81, file: !82, line: 58, baseType: !85, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !82, line: 54, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 49, size: 128, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !86, file: !82, line: 50, baseType: !60, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !86, file: !82, line: 51, baseType: !60, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !82, line: 52, baseType: !78, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !86, file: !82, line: 53, baseType: !23, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !81, file: !82, line: 59, baseType: !58, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !81, file: !82, line: 60, baseType: !78, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !81, file: !82, line: 61, baseType: !95, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !80, line: 19, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !98, line: 59, size: 64, elements: !99)
!98 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = !{!100, !222}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !97, file: !98, line: 60, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !98, line: 18, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !98, line: 20, size: 352, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !113, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !103, file: !98, line: 21, baseType: !60, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !103, file: !98, line: 22, baseType: !60, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !103, file: !98, line: 23, baseType: !32, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !103, file: !98, line: 24, baseType: !32, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !103, file: !98, line: 26, baseType: !60, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !103, file: !98, line: 27, baseType: !60, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !103, file: !98, line: 28, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !98, line: 16, baseType: !73)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !103, file: !98, line: 29, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !80, line: 23, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !117, line: 16, size: 1216, elements: !118)
!117 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !{!119, !122, !123, !166, !167, !168, !207, !208}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !116, file: !117, line: 17, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !121, line: 16, baseType: !16)
!121 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 18, baseType: !53, size: 64, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !116, file: !117, line: 19, baseType: !124, size: 960, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !121, line: 17, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !126, line: 4, size: 960, elements: !127)
!126 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = !{!128, !130, !131, !133, !134, !136, !137, !139, !140, !141, !142, !143, !144, !145, !146, !149, !150, !152, !153, !159, !160, !161}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !125, file: !126, line: 6, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !15, line: 232, baseType: !25)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !125, file: !126, line: 7, baseType: !129, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !125, file: !126, line: 8, baseType: !132, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !15, line: 227, baseType: !25)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !125, file: !126, line: 9, baseType: !132, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !125, file: !126, line: 10, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !15, line: 217, baseType: !25)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !125, file: !126, line: 11, baseType: !135, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !125, file: !126, line: 13, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !15, line: 212, baseType: !25)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !125, file: !126, line: 14, baseType: !48, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !125, file: !126, line: 15, baseType: !51, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !125, file: !126, line: 16, baseType: !25, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !125, file: !126, line: 17, baseType: !129, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !125, file: !126, line: 18, baseType: !129, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !125, file: !126, line: 19, baseType: !32, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !125, file: !126, line: 20, baseType: !32, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !125, file: !126, line: 21, baseType: !147, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !15, line: 237, baseType: !148)
!148 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !125, file: !126, line: 22, baseType: !147, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !125, file: !126, line: 23, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !15, line: 242, baseType: !16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !125, file: !126, line: 24, baseType: !151, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !125, file: !126, line: 26, baseType: !154, size: 64, offset: 576)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !15, line: 288, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !154, file: !15, line: 288, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !15, line: 75, baseType: !148)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !154, file: !15, line: 288, baseType: !148, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !125, file: !126, line: 27, baseType: !154, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !125, file: !126, line: 28, baseType: !154, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !125, file: !126, line: 29, baseType: !162, size: 192, offset: 768)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !164)
!163 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !116, file: !117, line: 21, baseType: !32, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !116, file: !117, line: 22, baseType: !32, size: 32, offset: 1120)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !116, file: !117, line: 24, baseType: !169, size: 32, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !80, line: 20, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !172, line: 50, size: 320, elements: !173)
!172 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !188, !192, !193, !198, !199, !204, !205, !206}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !171, file: !172, line: 51, baseType: !23, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !171, file: !172, line: 52, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !80, line: 21, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !179, line: 89, size: 160, elements: !180)
!179 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!180 = !{!181, !182, !183, !187}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !178, file: !179, line: 90, baseType: !120, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 91, baseType: !53, size: 64, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !178, file: !179, line: 93, baseType: !184, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !176, !169}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !179, line: 94, baseType: !73, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !171, file: !172, line: 54, baseType: !189, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !190, line: 98, baseType: !191)
!190 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!191 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !171, file: !172, line: 56, baseType: !157, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 58, baseType: !194, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !172, line: 45, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{!60, !169, !60, !58}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 59, baseType: !73, size: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !171, file: !172, line: 61, baseType: !200, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !172, line: 46, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !169, !23, !60, !58}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !171, file: !172, line: 62, baseType: !73, size: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !171, file: !172, line: 70, baseType: !43, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 72, baseType: !169, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !116, file: !117, line: 37, baseType: !25, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !116, file: !117, line: 38, baseType: !25, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !103, file: !98, line: 30, baseType: !101, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !103, file: !98, line: 34, baseType: !25, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !103, file: !98, line: 40, baseType: !25, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !103, file: !98, line: 43, baseType: !25, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !103, file: !98, line: 45, baseType: !25, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !103, file: !98, line: 46, baseType: !25, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !103, file: !98, line: 47, baseType: !25, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !103, file: !98, line: 48, baseType: !25, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !103, file: !98, line: 49, baseType: !25, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !103, file: !98, line: 50, baseType: !25, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !103, file: !98, line: 52, baseType: !25, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !103, file: !98, line: 53, baseType: !25, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !103, file: !98, line: 55, baseType: !16, size: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !98, line: 61, baseType: !95, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !81, file: !82, line: 62, baseType: !224, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !82, line: 41, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !82, line: 43, size: 64, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !82, line: 44, baseType: !224, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !226, file: !82, line: 45, baseType: !73, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !81, file: !82, line: 63, baseType: !231, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !82, line: 32, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !82, line: 34, size: 96, elements: !234)
!234 = !{!235, !240, !241}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !233, file: !82, line: 35, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !82, line: 30, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !73}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !82, line: 36, baseType: !73, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !82, line: 37, baseType: !231, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !81, file: !82, line: 64, baseType: !169, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "environment", scope: !9, file: !8, line: 116, baseType: !244, size: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !249, line: 16, baseType: !250)
!249 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !249, line: 18, size: 96, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !250, file: !249, line: 19, baseType: !73, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !250, file: !249, line: 20, baseType: !23, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !249, line: 21, baseType: !247, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !257, line: 59, baseType: !258)
!257 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 34, size: 800, elements: !259)
!259 = !{!260, !269, !270, !271, !279, !280, !281, !290, !291, !292, !293, !312, !313, !314, !315, !316}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !258, file: !257, line: 35, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !262, line: 21, baseType: !263)
!262 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 16, size: 64, elements: !264)
!264 = !{!265, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !263, file: !262, line: 17, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !190, line: 106, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !189)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !263, file: !262, line: 19, baseType: !266, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !258, file: !257, line: 37, baseType: !58, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !258, file: !257, line: 38, baseType: !58, size: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !258, file: !257, line: 40, baseType: !272, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !257, line: 16, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !257, line: 18, size: 96, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !274, file: !257, line: 19, baseType: !24, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !257, line: 20, baseType: !272, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !257, line: 21, baseType: !24, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !258, file: !257, line: 41, baseType: !272, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !258, file: !257, line: 42, baseType: !273, size: 96, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !258, file: !257, line: 44, baseType: !282, size: 32, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !257, line: 31, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 25, size: 128, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !284, file: !257, line: 26, baseType: !23, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !284, file: !257, line: 27, baseType: !23, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !284, file: !257, line: 29, baseType: !23, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !284, file: !257, line: 30, baseType: !23, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !258, file: !257, line: 45, baseType: !23, size: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !258, file: !257, line: 47, baseType: !60, size: 32, offset: 352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !258, file: !257, line: 48, baseType: !60, size: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !258, file: !257, line: 50, baseType: !294, size: 256, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !262, line: 37, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 24, size: 256, elements: !296)
!296 = !{!297, !299, !300, !301, !311}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !295, file: !262, line: 26, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !295, file: !262, line: 28, baseType: !298, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !295, file: !262, line: 29, baseType: !23, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !295, file: !262, line: 30, baseType: !302, size: 128, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !303, line: 19, baseType: !304)
!303 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 17, size: 128, elements: !305)
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !304, file: !303, line: 18, baseType: !307, size: 128)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 128, elements: !309)
!308 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !16)
!309 = !{!310}
!310 = !DISubrange(count: 4)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !295, file: !262, line: 36, baseType: !23, size: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !258, file: !257, line: 52, baseType: !60, size: 32, offset: 672)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !258, file: !257, line: 53, baseType: !61, size: 8, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !258, file: !257, line: 55, baseType: !25, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !257, line: 57, baseType: !73, size: 32, offset: 736)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !258, file: !257, line: 58, baseType: !73, size: 32, offset: 768)
!317 = !{!0, !318, !320, !322, !324, !326, !330, !332}
!318 = !DIGlobalVariableExpression(var: !319)
!319 = distinct !DIGlobalVariable(name: "ngx_argc", scope: !2, file: !3, line: 29, type: !16, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321)
!321 = distinct !DIGlobalVariable(name: "ngx_argv", scope: !2, file: !3, line: 30, type: !244, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323)
!323 = distinct !DIGlobalVariable(name: "ngx_os_argv", scope: !2, file: !3, line: 31, type: !244, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325)
!325 = distinct !DIGlobalVariable(name: "ngx_process_slot", scope: !2, file: !3, line: 33, type: !28, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327)
!327 = distinct !DIGlobalVariable(name: "ngx_channel", scope: !2, file: !3, line: 34, type: !328, isLocal: false, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !329, line: 17, baseType: !16)
!329 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!330 = !DIGlobalVariableExpression(var: !331)
!331 = distinct !DIGlobalVariable(name: "ngx_last_process", scope: !2, file: !3, line: 35, type: !28, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333)
!333 = distinct !DIGlobalVariable(name: "ngx_processes", scope: !2, file: !3, line: 36, type: !334, isLocal: false, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 262144, elements: !667)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_process_t", file: !336, line: 36, baseType: !337)
!336 = !DIFile(filename: "src/os/unix/ngx_process.h", directory: "/home/sam/Projects/nginx-1.12.2")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 22, size: 256, elements: !338)
!338 = !{!339, !342, !343, !347, !660, !661, !662, !663, !664, !665, !666}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !337, file: !336, line: 23, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pid_t", file: !336, line: 16, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !15, line: 294, baseType: !16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !337, file: !336, line: 24, baseType: !16, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !337, file: !336, line: 25, baseType: !344, size: 64, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 2)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !337, file: !336, line: 27, baseType: !348, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_spawn_proc_pt", file: !336, line: 20, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !352, !73}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !80, line: 17, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !8, line: 38, size: 2496, elements: !355)
!355 = !{!356, !360, !361, !362, !363, !364, !537, !538, !539, !619, !620, !621, !622, !623, !624, !625, !626, !637, !638, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !354, file: !8, line: 39, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !354, file: !8, line: 40, baseType: !78, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !354, file: !8, line: 42, baseType: !169, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !354, file: !8, line: 43, baseType: !170, size: 320, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !354, file: !8, line: 45, baseType: !23, size: 32, offset: 416)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !354, file: !8, line: 47, baseType: !365, size: 32, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !80, line: 26, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !369, line: 121, size: 896, elements: !370)
!369 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!370 = !{!371, !372, !426, !427, !428, !435, !437, !442, !447, !505, !506, !507, !508, !509, !510, !511, !512, !513, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !369, line: 122, baseType: !73, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !368, file: !369, line: 123, baseType: !373, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !80, line: 24, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !376, line: 30, size: 384, elements: !377)
!376 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !405, !406, !407, !418}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !375, file: !376, line: 31, baseType: !73, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !375, file: !376, line: 33, baseType: !25, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !375, file: !376, line: 35, baseType: !25, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !375, file: !376, line: 38, baseType: !25, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !375, file: !376, line: 44, baseType: !25, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !375, file: !376, line: 46, baseType: !25, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !375, file: !376, line: 49, baseType: !25, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !375, file: !376, line: 51, baseType: !25, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !375, file: !376, line: 54, baseType: !25, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !375, file: !376, line: 56, baseType: !25, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !375, file: !376, line: 57, baseType: !25, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !375, file: !376, line: 59, baseType: !25, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !375, file: !376, line: 60, baseType: !25, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !375, file: !376, line: 62, baseType: !25, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !375, file: !376, line: 64, baseType: !25, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !375, file: !376, line: 67, baseType: !25, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !375, file: !376, line: 69, baseType: !25, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !375, file: !376, line: 71, baseType: !25, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !375, file: !376, line: 74, baseType: !25, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !375, file: !376, line: 75, baseType: !25, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !375, file: !376, line: 77, baseType: !25, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !375, file: !376, line: 107, baseType: !25, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !375, file: !376, line: 110, baseType: !401, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !80, line: 31, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !373}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !375, file: !376, line: 117, baseType: !23, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !375, file: !376, line: 119, baseType: !169, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !375, file: !376, line: 121, baseType: !408, size: 160, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !22, line: 20, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !22, line: 22, size: 160, elements: !410)
!410 = !{!411, !412, !414, !415, !416, !417}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !409, file: !22, line: 23, baseType: !21, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !409, file: !22, line: 24, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !409, file: !22, line: 25, baseType: !413, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !409, file: !22, line: 26, baseType: !413, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !409, file: !22, line: 27, baseType: !61, size: 8, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !22, line: 28, baseType: !61, size: 8, offset: 136)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !375, file: !376, line: 124, baseType: !419, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !420, line: 16, baseType: !421)
!420 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !420, line: 18, size: 64, elements: !422)
!422 = !{!423, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !420, line: 19, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !420, line: 20, baseType: !424, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !368, file: !369, line: 124, baseType: !373, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !368, file: !369, line: 126, baseType: !328, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !368, file: !369, line: 128, baseType: !429, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !430, line: 19, baseType: !431)
!430 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !366, !60, !58}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 135, baseType: !16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !368, file: !369, line: 129, baseType: !436, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !430, line: 22, baseType: !431)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !368, file: !369, line: 130, baseType: !438, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !430, line: 20, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DISubroutineType(types: !441)
!441 = !{!434, !366, !95, !32}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !368, file: !369, line: 131, baseType: !443, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !430, line: 23, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{!95, !366, !95, !32}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !368, file: !369, line: 133, baseType: !448, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !369, line: 16, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !369, line: 18, size: 960, elements: !451)
!451 = !{!452, !453, !465, !467, !468, !469, !470, !471, !472, !473, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !450, file: !369, line: 19, baseType: !328, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !450, file: !369, line: 21, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !456, line: 297, size: 128, elements: !457)
!456 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!457 = !{!458, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !455, file: !456, line: 298, baseType: !459, size: 16)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !15, line: 409, baseType: !460)
!460 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !455, file: !456, line: 299, baseType: !462, size: 112, offset: 16)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 112, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 14)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !450, file: !369, line: 22, baseType: !466, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !15, line: 404, baseType: !25)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !450, file: !369, line: 23, baseType: !58, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !450, file: !369, line: 24, baseType: !53, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !369, line: 26, baseType: !16, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !450, file: !369, line: 28, baseType: !16, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !450, file: !369, line: 29, baseType: !16, size: 32, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !450, file: !369, line: 30, baseType: !16, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !450, file: !369, line: 38, baseType: !474, size: 32, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !80, line: 32, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !366}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !450, file: !369, line: 40, baseType: !73, size: 32, offset: 352)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !450, file: !369, line: 42, baseType: !170, size: 320, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !450, file: !369, line: 43, baseType: !169, size: 32, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !450, file: !369, line: 45, baseType: !58, size: 32, offset: 736)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !450, file: !369, line: 47, baseType: !58, size: 32, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !450, file: !369, line: 49, baseType: !19, size: 32, offset: 800)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !450, file: !369, line: 51, baseType: !448, size: 32, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !450, file: !369, line: 52, baseType: !366, size: 32, offset: 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !450, file: !369, line: 54, baseType: !23, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !450, file: !369, line: 56, baseType: !25, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !450, file: !369, line: 57, baseType: !25, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !450, file: !369, line: 58, baseType: !25, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !450, file: !369, line: 60, baseType: !25, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !450, file: !369, line: 61, baseType: !25, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !450, file: !369, line: 62, baseType: !25, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !450, file: !369, line: 63, baseType: !25, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !450, file: !369, line: 64, baseType: !25, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !450, file: !369, line: 65, baseType: !25, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !450, file: !369, line: 66, baseType: !25, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !450, file: !369, line: 67, baseType: !25, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !450, file: !369, line: 70, baseType: !25, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !450, file: !369, line: 72, baseType: !25, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !450, file: !369, line: 73, baseType: !25, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !450, file: !369, line: 74, baseType: !25, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !450, file: !369, line: 76, baseType: !25, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !450, file: !369, line: 77, baseType: !25, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !450, file: !369, line: 78, baseType: !25, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !368, file: !369, line: 135, baseType: !32, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !368, file: !369, line: 137, baseType: !169, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !368, file: !369, line: 139, baseType: !78, size: 32, offset: 352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !369, line: 141, baseType: !16, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !368, file: !369, line: 143, baseType: !454, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !368, file: !369, line: 144, baseType: !466, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !368, file: !369, line: 145, baseType: !53, size: 64, offset: 480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !368, file: !369, line: 147, baseType: !53, size: 64, offset: 544)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !368, file: !369, line: 148, baseType: !514, size: 16, offset: 608)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !515, line: 12, baseType: !516)
!515 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 186, baseType: !460)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !368, file: !369, line: 154, baseType: !454, size: 32, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !368, file: !369, line: 155, baseType: !466, size: 32, offset: 672)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !368, file: !369, line: 157, baseType: !101, size: 32, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !368, file: !369, line: 159, baseType: !419, size: 64, offset: 736)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !368, file: !369, line: 161, baseType: !189, size: 32, offset: 800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !368, file: !369, line: 163, baseType: !23, size: 32, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !368, file: !369, line: 165, baseType: !25, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !368, file: !369, line: 167, baseType: !25, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !368, file: !369, line: 169, baseType: !25, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !368, file: !369, line: 170, baseType: !25, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !368, file: !369, line: 171, baseType: !25, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !368, file: !369, line: 173, baseType: !25, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !368, file: !369, line: 174, baseType: !25, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !368, file: !369, line: 175, baseType: !25, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !368, file: !369, line: 176, baseType: !25, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !368, file: !369, line: 178, baseType: !25, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !368, file: !369, line: 179, baseType: !25, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !368, file: !369, line: 180, baseType: !25, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !368, file: !369, line: 181, baseType: !25, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !368, file: !369, line: 183, baseType: !25, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !354, file: !8, line: 48, baseType: !366, size: 32, offset: 480)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !354, file: !8, line: 49, baseType: !23, size: 32, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !354, file: !8, line: 51, baseType: !540, size: 32, offset: 544)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !80, line: 15, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !544, line: 222, size: 800, elements: !545)
!544 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !594, !595, !599, !603, !604, !605, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !543, file: !544, line: 223, baseType: !23, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !543, file: !544, line: 224, baseType: !23, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !543, file: !544, line: 226, baseType: !43, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !543, file: !544, line: 228, baseType: !23, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !543, file: !544, line: 229, baseType: !23, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !543, file: !544, line: 231, baseType: !23, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !543, file: !544, line: 232, baseType: !245, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !543, file: !544, line: 234, baseType: !73, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !543, file: !544, line: 235, baseType: !555, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !80, line: 22, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !179, line: 77, size: 224, elements: !558)
!558 = !{!559, !560, !561, !591, !592, !593}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !179, line: 78, baseType: !53, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !557, file: !179, line: 79, baseType: !23, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !557, file: !179, line: 80, baseType: !562, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{!43, !565, !555, !73}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !80, line: 16, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !179, line: 116, size: 384, elements: !568)
!568 = !{!569, !570, !572, !573, !574, !575, !584, !585, !586, !587, !588, !590}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !179, line: 117, baseType: !43, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !567, file: !179, line: 118, baseType: !571, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !567, file: !179, line: 120, baseType: !352, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !567, file: !179, line: 121, baseType: !78, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !567, file: !179, line: 122, baseType: !78, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !567, file: !179, line: 123, baseType: !576, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !179, line: 103, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 98, size: 1344, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !578, file: !179, line: 99, baseType: !115, size: 1216)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !578, file: !179, line: 100, baseType: !101, size: 32, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !578, file: !179, line: 101, baseType: !101, size: 32, offset: 1248)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !578, file: !179, line: 102, baseType: !23, size: 32, offset: 1280)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !567, file: !179, line: 124, baseType: !169, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !567, file: !179, line: 126, baseType: !73, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !567, file: !179, line: 127, baseType: !23, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !567, file: !179, line: 128, baseType: !23, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !567, file: !179, line: 130, baseType: !589, size: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !179, line: 112, baseType: !562)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !567, file: !179, line: 131, baseType: !43, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !557, file: !179, line: 81, baseType: !23, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !557, file: !179, line: 82, baseType: !23, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !557, file: !179, line: 83, baseType: !73, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !543, file: !544, line: 236, baseType: !23, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !543, file: !544, line: 238, baseType: !596, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{!28, !169}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !543, file: !544, line: 240, baseType: !600, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DISubroutineType(types: !602)
!602 = !{!28, !352}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !543, file: !544, line: 242, baseType: !600, size: 32, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !543, file: !544, line: 243, baseType: !600, size: 32, offset: 416)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !543, file: !544, line: 244, baseType: !606, size: 32, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !352}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !543, file: !544, line: 245, baseType: !606, size: 32, offset: 480)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !543, file: !544, line: 247, baseType: !606, size: 32, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !543, file: !544, line: 249, baseType: !24, size: 32, offset: 544)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !543, file: !544, line: 250, baseType: !24, size: 32, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !543, file: !544, line: 251, baseType: !24, size: 32, offset: 608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !543, file: !544, line: 252, baseType: !24, size: 32, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !543, file: !544, line: 253, baseType: !24, size: 32, offset: 672)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !543, file: !544, line: 254, baseType: !24, size: 32, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !543, file: !544, line: 255, baseType: !24, size: 32, offset: 736)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !543, file: !544, line: 256, baseType: !24, size: 32, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !354, file: !8, line: 52, baseType: !23, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !354, file: !8, line: 53, baseType: !23, size: 32, offset: 608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !354, file: !8, line: 55, baseType: !419, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !354, file: !8, line: 56, baseType: !23, size: 32, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !354, file: !8, line: 58, baseType: !68, size: 160, offset: 736)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !354, file: !8, line: 59, baseType: !68, size: 160, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !354, file: !8, line: 61, baseType: !68, size: 160, offset: 1056)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !354, file: !8, line: 62, baseType: !627, size: 96, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !22, line: 32, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !22, line: 37, size: 96, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !628, file: !22, line: 38, baseType: !413, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !628, file: !22, line: 39, baseType: !413, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !628, file: !22, line: 40, baseType: !633, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !22, line: 34, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !413, !413, !413}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !354, file: !8, line: 63, baseType: !408, size: 160, offset: 1312)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !354, file: !8, line: 65, baseType: !639, size: 224, offset: 1472)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !249, line: 31, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 25, size: 224, elements: !641)
!641 = !{!642, !643, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !640, file: !249, line: 26, baseType: !247, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !640, file: !249, line: 27, baseType: !248, size: 96, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !640, file: !249, line: 28, baseType: !58, size: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !640, file: !249, line: 29, baseType: !23, size: 32, offset: 160)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !640, file: !249, line: 30, baseType: !78, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !354, file: !8, line: 66, baseType: !639, size: 224, offset: 1696)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !354, file: !8, line: 68, baseType: !23, size: 32, offset: 1920)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !354, file: !8, line: 69, baseType: !23, size: 32, offset: 1952)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !354, file: !8, line: 71, baseType: !366, size: 32, offset: 1984)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !354, file: !8, line: 72, baseType: !373, size: 32, offset: 2016)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !354, file: !8, line: 73, baseType: !373, size: 32, offset: 2048)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !354, file: !8, line: 75, baseType: !352, size: 32, offset: 2080)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !354, file: !8, line: 77, baseType: !53, size: 64, offset: 2112)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !354, file: !8, line: 78, baseType: !53, size: 64, offset: 2176)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !354, file: !8, line: 79, baseType: !53, size: 64, offset: 2240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !354, file: !8, line: 80, baseType: !53, size: 64, offset: 2304)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !354, file: !8, line: 81, baseType: !53, size: 64, offset: 2368)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !354, file: !8, line: 82, baseType: !53, size: 64, offset: 2432)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !336, line: 28, baseType: !73, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !336, line: 29, baseType: !43, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "respawn", scope: !337, file: !336, line: 31, baseType: !25, size: 1, offset: 224, flags: DIFlagBitField, extraData: i64 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "just_spawn", scope: !337, file: !336, line: 32, baseType: !25, size: 1, offset: 225, flags: DIFlagBitField, extraData: i64 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !337, file: !336, line: 33, baseType: !25, size: 1, offset: 226, flags: DIFlagBitField, extraData: i64 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "exiting", scope: !337, file: !336, line: 34, baseType: !25, size: 1, offset: 227, flags: DIFlagBitField, extraData: i64 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "exited", scope: !337, file: !336, line: 35, baseType: !25, size: 1, offset: 228, flags: DIFlagBitField, extraData: i64 224)
!667 = !{!668}
!668 = !DISubrange(count: 1024)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 1664, elements: !680)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_signal_t", file: !3, line: 19, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 14, size: 128, elements: !672)
!672 = !{!673, !674, !675, !676}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "signo", scope: !671, file: !3, line: 15, baseType: !16, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !671, file: !3, line: 16, baseType: !43, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !3, line: 17, baseType: !43, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !671, file: !3, line: 18, baseType: !677, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !16}
!680 = !{!681}
!681 = !DISubrange(count: 13)
!682 = !{i32 2, !"Dwarf Version", i32 4}
!683 = !{i32 2, !"Debug Info Version", i32 3}
!684 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!685 = distinct !DISubprogram(name: "ngx_signal_handler", scope: !3, file: !3, line: 310, type: !678, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !686)
!686 = !{!687, !688, !689, !690, !693}
!687 = !DILocalVariable(name: "signo", arg: 1, scope: !685, file: !3, line: 310, type: !16)
!688 = !DILocalVariable(name: "action", scope: !685, file: !3, line: 312, type: !43)
!689 = !DILocalVariable(name: "ignore", scope: !685, file: !3, line: 313, type: !28)
!690 = !DILocalVariable(name: "err", scope: !685, file: !3, line: 314, type: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !692, line: 16, baseType: !16)
!692 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!693 = !DILocalVariable(name: "sig", scope: !685, file: !3, line: 315, type: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!695 = !{!696, !696, i64 0}
!696 = !{!"int", !697, i64 0}
!697 = !{!"omnipotent char", !698, i64 0}
!698 = !{!"Simple C/C++ TBAA"}
!699 = !DIExpression()
!700 = !DILocation(line: 310, column: 24, scope: !685)
!701 = !DILocation(line: 312, column: 5, scope: !685)
!702 = !DILocation(line: 312, column: 22, scope: !685)
!703 = !DILocation(line: 313, column: 5, scope: !685)
!704 = !DILocation(line: 313, column: 22, scope: !685)
!705 = !DILocation(line: 314, column: 5, scope: !685)
!706 = !DILocation(line: 314, column: 22, scope: !685)
!707 = !DILocation(line: 315, column: 5, scope: !685)
!708 = !DILocation(line: 315, column: 22, scope: !685)
!709 = !DILocation(line: 317, column: 12, scope: !685)
!710 = !DILocation(line: 319, column: 11, scope: !685)
!711 = !DILocation(line: 319, column: 9, scope: !685)
!712 = !DILocation(line: 321, column: 14, scope: !713)
!713 = distinct !DILexicalBlock(scope: !685, file: !3, line: 321, column: 5)
!714 = !{!715, !715, i64 0}
!715 = !{!"any pointer", !697, i64 0}
!716 = !DILocation(line: 321, column: 10, scope: !713)
!717 = !DILocation(line: 321, column: 25, scope: !718)
!718 = distinct !DILexicalBlock(scope: !713, file: !3, line: 321, column: 5)
!719 = !DILocation(line: 321, column: 30, scope: !718)
!720 = !{!721, !696, i64 0}
!721 = !{!"", !696, i64 0, !715, i64 4, !715, i64 8, !715, i64 12}
!722 = !DILocation(line: 321, column: 36, scope: !718)
!723 = !DILocation(line: 321, column: 5, scope: !713)
!724 = !DILocation(line: 322, column: 13, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 322, column: 13)
!726 = distinct !DILexicalBlock(scope: !718, file: !3, line: 321, column: 49)
!727 = !DILocation(line: 322, column: 18, scope: !725)
!728 = !DILocation(line: 322, column: 27, scope: !725)
!729 = !DILocation(line: 322, column: 24, scope: !725)
!730 = !DILocation(line: 322, column: 13, scope: !726)
!731 = !DILocation(line: 323, column: 13, scope: !732)
!732 = distinct !DILexicalBlock(scope: !725, file: !3, line: 322, column: 34)
!733 = !DILocation(line: 325, column: 5, scope: !726)
!734 = !DILocation(line: 321, column: 45, scope: !718)
!735 = !DILocation(line: 321, column: 5, scope: !718)
!736 = distinct !{!736, !723, !737}
!737 = !DILocation(line: 325, column: 5, scope: !713)
!738 = !DILocation(line: 327, column: 5, scope: !685)
!739 = !DILocation(line: 329, column: 12, scope: !685)
!740 = !DILocation(line: 331, column: 13, scope: !685)
!741 = !DILocation(line: 331, column: 5, scope: !685)
!742 = !DILocation(line: 335, column: 17, scope: !743)
!743 = distinct !DILexicalBlock(scope: !685, file: !3, line: 331, column: 26)
!744 = !DILocation(line: 335, column: 9, scope: !743)
!745 = !DILocation(line: 338, column: 22, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !3, line: 335, column: 24)
!747 = !DILocation(line: 339, column: 20, scope: !746)
!748 = !DILocation(line: 340, column: 13, scope: !746)
!749 = !DILocation(line: 344, column: 27, scope: !746)
!750 = !DILocation(line: 345, column: 20, scope: !746)
!751 = !DILocation(line: 346, column: 13, scope: !746)
!752 = !DILocation(line: 349, column: 17, scope: !753)
!753 = distinct !DILexicalBlock(scope: !746, file: !3, line: 349, column: 17)
!754 = !DILocation(line: 349, column: 17, scope: !746)
!755 = !DILocation(line: 350, column: 30, scope: !756)
!756 = distinct !DILexicalBlock(scope: !753, file: !3, line: 349, column: 33)
!757 = !DILocation(line: 351, column: 24, scope: !756)
!758 = !DILocation(line: 352, column: 13, scope: !756)
!759 = !DILocation(line: 353, column: 13, scope: !746)
!760 = !DILocation(line: 356, column: 29, scope: !746)
!761 = !DILocation(line: 357, column: 20, scope: !746)
!762 = !DILocation(line: 358, column: 13, scope: !746)
!763 = !DILocation(line: 361, column: 24, scope: !746)
!764 = !DILocation(line: 362, column: 20, scope: !746)
!765 = !DILocation(line: 363, column: 13, scope: !746)
!766 = !DILocation(line: 366, column: 17, scope: !767)
!767 = distinct !DILexicalBlock(scope: !746, file: !3, line: 366, column: 17)
!768 = !DILocation(line: 366, column: 27, scope: !767)
!769 = !DILocation(line: 366, column: 31, scope: !767)
!770 = !DILocation(line: 366, column: 34, scope: !767)
!771 = !DILocation(line: 366, column: 49, scope: !767)
!772 = !DILocation(line: 366, column: 17, scope: !746)
!773 = !DILocation(line: 375, column: 24, scope: !774)
!774 = distinct !DILexicalBlock(scope: !767, file: !3, line: 366, column: 54)
!775 = !DILocation(line: 376, column: 24, scope: !774)
!776 = !DILocation(line: 377, column: 17, scope: !774)
!777 = !DILocation(line: 380, column: 31, scope: !746)
!778 = !DILocation(line: 381, column: 20, scope: !746)
!779 = !DILocation(line: 382, column: 13, scope: !746)
!780 = !DILocation(line: 385, column: 25, scope: !746)
!781 = !DILocation(line: 386, column: 13, scope: !746)
!782 = !DILocation(line: 389, column: 23, scope: !746)
!783 = !DILocation(line: 390, column: 13, scope: !746)
!784 = !DILocation(line: 393, column: 22, scope: !746)
!785 = !DILocation(line: 394, column: 13, scope: !746)
!786 = !DILocation(line: 397, column: 9, scope: !743)
!787 = !DILocation(line: 401, column: 17, scope: !743)
!788 = !DILocation(line: 401, column: 9, scope: !743)
!789 = !DILocation(line: 404, column: 18, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 404, column: 17)
!791 = distinct !DILexicalBlock(scope: !743, file: !3, line: 401, column: 24)
!792 = !DILocation(line: 404, column: 17, scope: !791)
!793 = !DILocation(line: 405, column: 17, scope: !794)
!794 = distinct !DILexicalBlock(scope: !790, file: !3, line: 404, column: 34)
!795 = !DILocation(line: 407, column: 28, scope: !791)
!796 = !DILocation(line: 407, column: 13, scope: !791)
!797 = !DILocation(line: 410, column: 22, scope: !791)
!798 = !DILocation(line: 411, column: 20, scope: !791)
!799 = !DILocation(line: 412, column: 13, scope: !791)
!800 = !DILocation(line: 416, column: 27, scope: !791)
!801 = !DILocation(line: 417, column: 20, scope: !791)
!802 = !DILocation(line: 418, column: 13, scope: !791)
!803 = !DILocation(line: 421, column: 24, scope: !791)
!804 = !DILocation(line: 422, column: 20, scope: !791)
!805 = !DILocation(line: 423, column: 13, scope: !791)
!806 = !DILocation(line: 428, column: 20, scope: !791)
!807 = !DILocation(line: 429, column: 13, scope: !791)
!808 = !DILocation(line: 432, column: 9, scope: !743)
!809 = !DILocation(line: 435, column: 5, scope: !810)
!810 = distinct !DILexicalBlock(scope: !685, file: !3, line: 435, column: 5)
!811 = !{!812, !715, i64 8}
!812 = !{!"ngx_cycle_s", !715, i64 0, !715, i64 4, !715, i64 8, !813, i64 12, !696, i64 52, !715, i64 56, !715, i64 60, !696, i64 64, !715, i64 68, !696, i64 72, !696, i64 76, !815, i64 80, !696, i64 88, !816, i64 92, !816, i64 112, !816, i64 132, !817, i64 152, !818, i64 164, !819, i64 184, !819, i64 212, !696, i64 240, !696, i64 244, !715, i64 248, !715, i64 252, !715, i64 256, !715, i64 260, !821, i64 264, !821, i64 272, !821, i64 280, !821, i64 288, !821, i64 296, !821, i64 304}
!813 = !{!"ngx_log_s", !696, i64 0, !715, i64 4, !814, i64 8, !814, i64 12, !715, i64 16, !715, i64 20, !715, i64 24, !715, i64 28, !715, i64 32, !715, i64 36}
!814 = !{!"long", !697, i64 0}
!815 = !{!"ngx_queue_s", !715, i64 0, !715, i64 4}
!816 = !{!"", !715, i64 0, !696, i64 4, !696, i64 8, !696, i64 12, !715, i64 16}
!817 = !{!"ngx_rbtree_s", !715, i64 0, !715, i64 4, !715, i64 8}
!818 = !{!"ngx_rbtree_node_s", !696, i64 0, !715, i64 4, !715, i64 8, !715, i64 12, !697, i64 16, !697, i64 17}
!819 = !{!"", !715, i64 0, !820, i64 4, !696, i64 16, !696, i64 20, !715, i64 24}
!820 = !{!"ngx_list_part_s", !715, i64 0, !696, i64 4, !715, i64 8}
!821 = !{!"", !696, i64 0, !715, i64 4}
!822 = !{!813, !696, i64 0}
!823 = !DILocation(line: 435, column: 5, scope: !685)
!824 = !{!721, !715, i64 4}
!825 = !DILocation(line: 438, column: 9, scope: !826)
!826 = distinct !DILexicalBlock(scope: !685, file: !3, line: 438, column: 9)
!827 = !DILocation(line: 438, column: 9, scope: !685)
!828 = !DILocation(line: 439, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 439, column: 9)
!830 = distinct !DILexicalBlock(scope: !826, file: !3, line: 438, column: 17)
!831 = !DILocation(line: 439, column: 9, scope: !830)
!832 = !DILocation(line: 443, column: 5, scope: !830)
!833 = !DILocation(line: 445, column: 9, scope: !834)
!834 = distinct !DILexicalBlock(scope: !685, file: !3, line: 445, column: 9)
!835 = !DILocation(line: 445, column: 15, scope: !834)
!836 = !DILocation(line: 445, column: 9, scope: !685)
!837 = !DILocation(line: 446, column: 9, scope: !838)
!838 = distinct !DILexicalBlock(scope: !834, file: !3, line: 445, column: 27)
!839 = !DILocation(line: 447, column: 5, scope: !838)
!840 = !DILocation(line: 449, column: 5, scope: !685)
!841 = !DILocation(line: 450, column: 1, scope: !685)
!842 = distinct !DISubprogram(name: "ngx_spawn_process", scope: !3, file: !3, line: 87, type: !843, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !845)
!843 = !DISubroutineType(types: !844)
!844 = !{!340, !352, !348, !73, !43, !28}
!845 = !{!846, !847, !848, !849, !850, !851, !853, !854}
!846 = !DILocalVariable(name: "cycle", arg: 1, scope: !842, file: !3, line: 87, type: !352)
!847 = !DILocalVariable(name: "proc", arg: 2, scope: !842, file: !3, line: 87, type: !348)
!848 = !DILocalVariable(name: "data", arg: 3, scope: !842, file: !3, line: 87, type: !73)
!849 = !DILocalVariable(name: "name", arg: 4, scope: !842, file: !3, line: 88, type: !43)
!850 = !DILocalVariable(name: "respawn", arg: 5, scope: !842, file: !3, line: 88, type: !28)
!851 = !DILocalVariable(name: "on", scope: !842, file: !3, line: 90, type: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !62, line: 67, baseType: !191)
!853 = !DILocalVariable(name: "pid", scope: !842, file: !3, line: 91, type: !340)
!854 = !DILocalVariable(name: "s", scope: !842, file: !3, line: 92, type: !28)
!855 = !DILocation(line: 87, column: 32, scope: !842)
!856 = !DILocation(line: 87, column: 57, scope: !842)
!857 = !DILocation(line: 87, column: 69, scope: !842)
!858 = !DILocation(line: 88, column: 11, scope: !842)
!859 = !DILocation(line: 88, column: 27, scope: !842)
!860 = !DILocation(line: 90, column: 5, scope: !842)
!861 = !DILocation(line: 90, column: 16, scope: !842)
!862 = !DILocation(line: 91, column: 5, scope: !842)
!863 = !DILocation(line: 91, column: 16, scope: !842)
!864 = !DILocation(line: 92, column: 5, scope: !842)
!865 = !DILocation(line: 92, column: 16, scope: !842)
!866 = !DILocation(line: 94, column: 9, scope: !867)
!867 = distinct !DILexicalBlock(scope: !842, file: !3, line: 94, column: 9)
!868 = !DILocation(line: 94, column: 17, scope: !867)
!869 = !DILocation(line: 94, column: 9, scope: !842)
!870 = !DILocation(line: 95, column: 13, scope: !871)
!871 = distinct !DILexicalBlock(scope: !867, file: !3, line: 94, column: 23)
!872 = !DILocation(line: 95, column: 11, scope: !871)
!873 = !DILocation(line: 97, column: 5, scope: !871)
!874 = !DILocation(line: 98, column: 16, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 98, column: 9)
!876 = distinct !DILexicalBlock(scope: !867, file: !3, line: 97, column: 12)
!877 = !DILocation(line: 98, column: 14, scope: !875)
!878 = !DILocation(line: 98, column: 21, scope: !879)
!879 = distinct !DILexicalBlock(scope: !875, file: !3, line: 98, column: 9)
!880 = !DILocation(line: 98, column: 25, scope: !879)
!881 = !DILocation(line: 98, column: 23, scope: !879)
!882 = !DILocation(line: 98, column: 9, scope: !875)
!883 = !DILocation(line: 99, column: 31, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 99, column: 17)
!885 = distinct !DILexicalBlock(scope: !879, file: !3, line: 98, column: 48)
!886 = !DILocation(line: 99, column: 17, scope: !884)
!887 = !DILocation(line: 99, column: 34, scope: !884)
!888 = !{!889, !696, i64 0}
!889 = !{!"", !696, i64 0, !696, i64 4, !697, i64 8, !715, i64 16, !715, i64 20, !715, i64 24, !696, i64 28, !696, i64 28, !696, i64 28, !696, i64 28, !696, i64 28}
!890 = !DILocation(line: 99, column: 38, scope: !884)
!891 = !DILocation(line: 99, column: 17, scope: !885)
!892 = !DILocation(line: 100, column: 17, scope: !893)
!893 = distinct !DILexicalBlock(scope: !884, file: !3, line: 99, column: 45)
!894 = !DILocation(line: 102, column: 9, scope: !885)
!895 = !DILocation(line: 98, column: 44, scope: !879)
!896 = !DILocation(line: 98, column: 9, scope: !879)
!897 = distinct !{!897, !882, !898}
!898 = !DILocation(line: 102, column: 9, scope: !875)
!899 = !DILocation(line: 104, column: 13, scope: !900)
!900 = distinct !DILexicalBlock(scope: !876, file: !3, line: 104, column: 13)
!901 = !DILocation(line: 104, column: 15, scope: !900)
!902 = !DILocation(line: 104, column: 13, scope: !876)
!903 = !DILocation(line: 105, column: 13, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 105, column: 13)
!905 = distinct !DILexicalBlock(scope: !900, file: !3, line: 104, column: 37)
!906 = !DILocation(line: 105, column: 13, scope: !905)
!907 = !DILocation(line: 108, column: 13, scope: !905)
!908 = !DILocation(line: 113, column: 9, scope: !909)
!909 = distinct !DILexicalBlock(scope: !842, file: !3, line: 113, column: 9)
!910 = !DILocation(line: 113, column: 17, scope: !909)
!911 = !DILocation(line: 113, column: 9, scope: !842)
!912 = !DILocation(line: 117, column: 63, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 117, column: 13)
!914 = distinct !DILexicalBlock(scope: !909, file: !3, line: 113, column: 42)
!915 = !DILocation(line: 117, column: 49, scope: !913)
!916 = !DILocation(line: 117, column: 66, scope: !913)
!917 = !DILocation(line: 117, column: 13, scope: !913)
!918 = !DILocation(line: 117, column: 75, scope: !913)
!919 = !DILocation(line: 117, column: 13, scope: !914)
!920 = !DILocation(line: 119, column: 13, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !3, line: 119, column: 13)
!922 = distinct !DILexicalBlock(scope: !913, file: !3, line: 118, column: 9)
!923 = !DILocation(line: 119, column: 13, scope: !922)
!924 = !DILocation(line: 121, column: 13, scope: !922)
!925 = !DILocation(line: 129, column: 43, scope: !926)
!926 = distinct !DILexicalBlock(scope: !914, file: !3, line: 129, column: 13)
!927 = !DILocation(line: 129, column: 29, scope: !926)
!928 = !DILocation(line: 129, column: 46, scope: !926)
!929 = !DILocation(line: 129, column: 13, scope: !926)
!930 = !DILocation(line: 129, column: 58, scope: !926)
!931 = !DILocation(line: 129, column: 13, scope: !914)
!932 = !DILocation(line: 130, column: 13, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 130, column: 13)
!934 = distinct !DILexicalBlock(scope: !926, file: !3, line: 129, column: 65)
!935 = !DILocation(line: 130, column: 13, scope: !934)
!936 = !DILocation(line: 133, column: 45, scope: !934)
!937 = !DILocation(line: 133, column: 31, scope: !934)
!938 = !DILocation(line: 133, column: 48, scope: !934)
!939 = !DILocation(line: 133, column: 57, scope: !934)
!940 = !DILocation(line: 133, column: 64, scope: !934)
!941 = !DILocation(line: 133, column: 13, scope: !934)
!942 = !DILocation(line: 134, column: 13, scope: !934)
!943 = !DILocation(line: 137, column: 43, scope: !944)
!944 = distinct !DILexicalBlock(scope: !914, file: !3, line: 137, column: 13)
!945 = !DILocation(line: 137, column: 29, scope: !944)
!946 = !DILocation(line: 137, column: 46, scope: !944)
!947 = !DILocation(line: 137, column: 13, scope: !944)
!948 = !DILocation(line: 137, column: 58, scope: !944)
!949 = !DILocation(line: 137, column: 13, scope: !914)
!950 = !DILocation(line: 138, column: 13, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 138, column: 13)
!952 = distinct !DILexicalBlock(scope: !944, file: !3, line: 137, column: 65)
!953 = !DILocation(line: 138, column: 13, scope: !952)
!954 = !DILocation(line: 141, column: 45, scope: !952)
!955 = !DILocation(line: 141, column: 31, scope: !952)
!956 = !DILocation(line: 141, column: 48, scope: !952)
!957 = !DILocation(line: 141, column: 57, scope: !952)
!958 = !DILocation(line: 141, column: 64, scope: !952)
!959 = !DILocation(line: 141, column: 13, scope: !952)
!960 = !DILocation(line: 142, column: 13, scope: !952)
!961 = !DILocation(line: 145, column: 12, scope: !914)
!962 = !{!814, !814, i64 0}
!963 = !DILocation(line: 146, column: 33, scope: !964)
!964 = distinct !DILexicalBlock(scope: !914, file: !3, line: 146, column: 13)
!965 = !DILocation(line: 146, column: 19, scope: !964)
!966 = !DILocation(line: 146, column: 36, scope: !964)
!967 = !DILocation(line: 146, column: 13, scope: !964)
!968 = !DILocation(line: 146, column: 63, scope: !964)
!969 = !DILocation(line: 146, column: 13, scope: !914)
!970 = !DILocation(line: 147, column: 13, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !3, line: 147, column: 13)
!972 = distinct !DILexicalBlock(scope: !964, file: !3, line: 146, column: 70)
!973 = !DILocation(line: 147, column: 13, scope: !972)
!974 = !DILocation(line: 149, column: 45, scope: !972)
!975 = !DILocation(line: 149, column: 31, scope: !972)
!976 = !DILocation(line: 149, column: 48, scope: !972)
!977 = !DILocation(line: 149, column: 57, scope: !972)
!978 = !DILocation(line: 149, column: 64, scope: !972)
!979 = !DILocation(line: 149, column: 13, scope: !972)
!980 = !DILocation(line: 150, column: 13, scope: !972)
!981 = !DILocation(line: 153, column: 33, scope: !982)
!982 = distinct !DILexicalBlock(scope: !914, file: !3, line: 153, column: 13)
!983 = !DILocation(line: 153, column: 19, scope: !982)
!984 = !DILocation(line: 153, column: 36, scope: !982)
!985 = !DILocation(line: 153, column: 58, scope: !982)
!986 = !DILocation(line: 153, column: 13, scope: !982)
!987 = !DILocation(line: 153, column: 67, scope: !982)
!988 = !DILocation(line: 153, column: 13, scope: !914)
!989 = !DILocation(line: 154, column: 13, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !3, line: 154, column: 13)
!991 = distinct !DILexicalBlock(scope: !982, file: !3, line: 153, column: 74)
!992 = !DILocation(line: 154, column: 13, scope: !991)
!993 = !DILocation(line: 156, column: 45, scope: !991)
!994 = !DILocation(line: 156, column: 31, scope: !991)
!995 = !DILocation(line: 156, column: 48, scope: !991)
!996 = !DILocation(line: 156, column: 57, scope: !991)
!997 = !DILocation(line: 156, column: 64, scope: !991)
!998 = !DILocation(line: 156, column: 13, scope: !991)
!999 = !DILocation(line: 157, column: 13, scope: !991)
!1000 = !DILocation(line: 160, column: 33, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !914, file: !3, line: 160, column: 13)
!1002 = !DILocation(line: 160, column: 19, scope: !1001)
!1003 = !DILocation(line: 160, column: 36, scope: !1001)
!1004 = !DILocation(line: 160, column: 13, scope: !1001)
!1005 = !DILocation(line: 160, column: 69, scope: !1001)
!1006 = !DILocation(line: 160, column: 13, scope: !914)
!1007 = !DILocation(line: 161, column: 13, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 161, column: 13)
!1009 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 160, column: 76)
!1010 = !DILocation(line: 161, column: 13, scope: !1009)
!1011 = !DILocation(line: 164, column: 45, scope: !1009)
!1012 = !DILocation(line: 164, column: 31, scope: !1009)
!1013 = !DILocation(line: 164, column: 48, scope: !1009)
!1014 = !DILocation(line: 164, column: 57, scope: !1009)
!1015 = !DILocation(line: 164, column: 64, scope: !1009)
!1016 = !DILocation(line: 164, column: 13, scope: !1009)
!1017 = !DILocation(line: 165, column: 13, scope: !1009)
!1018 = !DILocation(line: 168, column: 33, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !914, file: !3, line: 168, column: 13)
!1020 = !DILocation(line: 168, column: 19, scope: !1019)
!1021 = !DILocation(line: 168, column: 36, scope: !1019)
!1022 = !DILocation(line: 168, column: 13, scope: !1019)
!1023 = !DILocation(line: 168, column: 69, scope: !1019)
!1024 = !DILocation(line: 168, column: 13, scope: !914)
!1025 = !DILocation(line: 169, column: 13, scope: !1026)
