; ModuleID = 'src/os/unix/ngx_setproctitle.c'
source_filename = "src/os/unix/ngx_setproctitle.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_str_t = type { i32, i8* }

@environ = external global i8**, align 4
@ngx_os_argv = external global i8**, align 4
@ngx_os_argv_last = internal global i8* null, align 4, !dbg !0
@.str = private unnamed_addr constant [8 x i8] c"nginx: \00", align 1

; Function Attrs: nounwind
define i32 @ngx_init_setproctitle(%struct.ngx_log_s* %log) #0 !dbg !19 {
entry:
  %retval = alloca i32, align 4
  %log.addr = alloca %struct.ngx_log_s*, align 4
  %p = alloca i8*, align 4
  %size = alloca i32, align 4
  %i = alloca i32, align 4
  %cleanup.dest.slot = alloca i32
  store %struct.ngx_log_s* %log, %struct.ngx_log_s** %log.addr, align 4, !tbaa !85
  call void @llvm.dbg.declare(metadata %struct.ngx_log_s** %log.addr, metadata !81, metadata !89), !dbg !90
  %0 = bitcast i8** %p to i8*, !dbg !91
  call void @llvm.lifetime.start(i64 4, i8* %0) #4, !dbg !91
  call void @llvm.dbg.declare(metadata i8** %p, metadata !82, metadata !89), !dbg !92
  %1 = bitcast i32* %size to i8*, !dbg !93

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_os_argv_last", scope: !2, file: !3, line: 32, type: !14, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15)
!3 = !DIFile(filename: "src/os/unix/ngx_setproctitle.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !9, !10, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !12, line: 64, baseType: !13)
!12 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!15 = !{!0}
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!19 = distinct !DISubprogram(name: "ngx_init_setproctitle", scope: !3, file: !3, line: 35, type: !20, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !80)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !27}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !23, line: 78, baseType: !24)
!23 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 140, baseType: !26)
!25 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !29, line: 20, baseType: !30)
!29 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !31, line: 50, size: 320, elements: !32)
!31 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !{!33, !37, !59, !63, !66, !71, !72, !77, !78, !79}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !30, file: !31, line: 51, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !23, line: 79, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 125, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !30, file: !31, line: 52, baseType: !38, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !29, line: 21, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !41, line: 89, size: 160, elements: !42)
!41 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = !{!43, !46, !54, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !40, file: !41, line: 90, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !45, line: 16, baseType: !26)
!45 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 91, baseType: !47, size: 64, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !48, line: 19, baseType: !49)
!48 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 16, size: 64, elements: !50)
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !48, line: 17, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 120, baseType: !36)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !48, line: 18, baseType: !10, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !40, file: !41, line: 93, baseType: !55, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !38, !27}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !41, line: 94, baseType: !9, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !30, file: !31, line: 54, baseType: !60, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !61, line: 98, baseType: !62)
!61 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !30, file: !31, line: 56, baseType: !64, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !25, line: 75, baseType: !65)
!65 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !30, file: !31, line: 58, baseType: !67, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !31, line: 45, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DISubroutineType(types: !70)
!70 = !{!10, !27, !10, !52}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !31, line: 59, baseType: !9, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !30, file: !31, line: 61, baseType: !73, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !31, line: 46, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !27, !34, !10, !52}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !30, file: !31, line: 62, baseType: !9, size: 32, offset: 224)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !30, file: !31, line: 70, baseType: !14, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !31, line: 72, baseType: !27, size: 32, offset: 288)
!80 = !{!81, !82, !83, !84}
!81 = !DILocalVariable(name: "log", arg: 1, scope: !19, file: !3, line: 35, type: !27)
!82 = !DILocalVariable(name: "p", scope: !19, file: !3, line: 37, type: !10)
!83 = !DILocalVariable(name: "size", scope: !19, file: !3, line: 38, type: !52)
!84 = !DILocalVariable(name: "i", scope: !19, file: !3, line: 39, type: !34)
!85 = !{!86, !86, i64 0}
!86 = !{!"any pointer", !87, i64 0}
!87 = !{!"omnipotent char", !88, i64 0}
!88 = !{!"Simple C/C++ TBAA"}
!89 = !DIExpression()
!90 = !DILocation(line: 35, column: 34, scope: !19)
!91 = !DILocation(line: 37, column: 5, scope: !19)
!92 = !DILocation(line: 37, column: 18, scope: !19)
!93 = !DILocation(line: 38, column: 5, scope: !19)
!94 = !DILocation(line: 38, column: 18, scope: !19)
!95 = !DILocation(line: 39, column: 5, scope: !19)
!96 = !DILocation(line: 39, column: 18, scope: !19)
!97 = !DILocation(line: 41, column: 10, scope: !19)
!98 = !{!99, !99, i64 0}
!99 = !{!"int", !87, i64 0}
!100 = !DILocation(line: 43, column: 12, scope: !101)
!101 = distinct !DILexicalBlock(scope: !19, file: !3, line: 43, column: 5)
!102 = !DILocation(line: 43, column: 10, scope: !101)
!103 = !DILocation(line: 43, column: 17, scope: !104)
!104 = distinct !DILexicalBlock(scope: !101, file: !3, line: 43, column: 5)
!105 = !DILocation(line: 43, column: 25, scope: !104)
!106 = !DILocation(line: 43, column: 5, scope: !101)
!107 = !DILocation(line: 44, column: 17, scope: !108)
!108 = distinct !DILexicalBlock(scope: !104, file: !3, line: 43, column: 34)
!109 = !DILocation(line: 44, column: 40, scope: !108)
!110 = !DILocation(line: 44, column: 14, scope: !108)
!111 = !DILocation(line: 45, column: 5, scope: !108)
!112 = !DILocation(line: 43, column: 30, scope: !104)
!113 = !DILocation(line: 43, column: 5, scope: !104)
!114 = distinct !{!114, !106, !115}
!115 = !DILocation(line: 45, column: 5, scope: !101)
!116 = !DILocation(line: 47, column: 19, scope: !19)
!117 = !DILocation(line: 47, column: 25, scope: !19)
!118 = !DILocation(line: 47, column: 9, scope: !19)
!119 = !DILocation(line: 47, column: 7, scope: !19)
!120 = !DILocation(line: 48, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !19, file: !3, line: 48, column: 9)
!122 = !DILocation(line: 48, column: 11, scope: !121)
!123 = !DILocation(line: 48, column: 9, scope: !19)
!124 = !DILocation(line: 49, column: 9, scope: !125)
!125 = distinct !DILexicalBlock(scope: !121, file: !3, line: 48, column: 20)
!126 = !DILocation(line: 52, column: 24, scope: !19)
!127 = !DILocation(line: 52, column: 22, scope: !19)
!128 = !DILocation(line: 54, column: 12, scope: !129)
!129 = distinct !DILexicalBlock(scope: !19, file: !3, line: 54, column: 5)
!130 = !DILocation(line: 54, column: 10, scope: !129)
!131 = !DILocation(line: 54, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !129, file: !3, line: 54, column: 5)
!133 = !DILocation(line: 54, column: 29, scope: !132)
!134 = !DILocation(line: 54, column: 5, scope: !129)
!135 = !DILocation(line: 55, column: 13, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 55, column: 13)
!137 = distinct !DILexicalBlock(scope: !132, file: !3, line: 54, column: 38)
!138 = !DILocation(line: 55, column: 33, scope: !136)
!139 = !DILocation(line: 55, column: 45, scope: !136)
!140 = !DILocation(line: 55, column: 30, scope: !136)
!141 = !DILocation(line: 55, column: 13, scope: !137)
!142 = !DILocation(line: 56, column: 32, scope: !143)
!143 = distinct !DILexicalBlock(scope: !136, file: !3, line: 55, column: 49)
!144 = !DILocation(line: 56, column: 44, scope: !143)
!145 = !DILocation(line: 56, column: 49, scope: !143)
!146 = !DILocation(line: 56, column: 47, scope: !143)
!147 = !DILocation(line: 56, column: 76, scope: !143)
!148 = !DILocation(line: 56, column: 30, scope: !143)
!149 = !DILocation(line: 57, column: 9, scope: !143)
