; ModuleID = 'src/os/unix/ngx_process_cycle.c'
source_filename = "src/os/unix/ngx_process_cycle.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, {}*, {}*, {}*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, {}*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "master_process", scope: !2, file: !3, line: 55, type: !638, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !577)
!3 = !DIFile(filename: "src/os/unix/ngx_process_cycle.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !9, !10, !14, !247, !53, !22, !565, !51, !567, !33, !575}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !12, line: 64, baseType: !13)
!12 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_conf_t", file: !16, line: 117, baseType: !17)
!16 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 86, size: 928, elements: !18)
!18 = !{!19, !25, !26, !34, !35, !37, !38, !39, !41, !42, !43, !44, !50, !52, !56, !59, !67, !68, !69, !70, !245}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !17, file: !16, line: 87, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !21, line: 80, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 140, baseType: !24)
!23 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !17, file: !16, line: 88, baseType: !20, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "timer_resolution", scope: !17, file: !16, line: 90, baseType: !27, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !28, line: 16, baseType: !29)
!28 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !30, line: 16, baseType: !31)
!30 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !21, line: 79, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 125, baseType: !33)
!33 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timeout", scope: !17, file: !16, line: 91, baseType: !27, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "worker_processes", scope: !17, file: !16, line: 93, baseType: !36, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !21, line: 78, baseType: !22)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "debug_points", scope: !17, file: !16, line: 94, baseType: !36, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_nofile", scope: !17, file: !16, line: 96, baseType: !36, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_core", scope: !17, file: !16, line: 97, baseType: !40, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !23, line: 222, baseType: !24)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !17, file: !16, line: 99, baseType: !24, size: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_auto", scope: !17, file: !16, line: 101, baseType: !31, size: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_n", scope: !17, file: !16, line: 102, baseType: !31, size: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity", scope: !17, file: !16, line: 103, baseType: !45, size: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cpuset_t", file: !47, line: 32, baseType: !48)
!47 = !DIFile(filename: "src/os/unix/ngx_setaffinity.h", directory: "/home/sam/Projects/nginx-1.12.2")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 196, baseType: !49)
!49 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !17, file: !16, line: 105, baseType: !51, size: 32, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !17, file: !16, line: 106, baseType: !53, size: 32, offset: 416)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !54, line: 16, baseType: !55)
!54 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !23, line: 304, baseType: !33)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !17, file: !16, line: 107, baseType: !57, size: 32, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_gid_t", file: !54, line: 17, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !23, line: 309, baseType: !33)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "working_directory", scope: !17, file: !16, line: 109, baseType: !60, size: 64, offset: 480)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !61, line: 19, baseType: !62)
!61 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 16, size: 64, elements: !63)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !62, file: !61, line: 17, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 120, baseType: !33)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !61, line: 18, baseType: !10, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !17, file: !16, line: 110, baseType: !60, size: 64, offset: 544)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !17, file: !16, line: 112, baseType: !60, size: 64, offset: 608)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "oldpid", scope: !17, file: !16, line: 113, baseType: !60, size: 64, offset: 672)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !17, file: !16, line: 115, baseType: !71, size: 160, offset: 736)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !72, line: 22, baseType: !73)
!72 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 16, size: 160, elements: !74)
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !73, file: !72, line: 17, baseType: !9, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !73, file: !72, line: 18, baseType: !31, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !72, line: 19, baseType: !65, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !73, file: !72, line: 20, baseType: !31, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !73, file: !72, line: 21, baseType: !80, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !82, line: 18, baseType: !83)
!82 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !84, line: 57, size: 320, elements: !85)
!84 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = !{!86, !94, !95, !96, !225, !232, !244}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !83, file: !84, line: 58, baseType: !87, size: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !84, line: 54, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 49, size: 128, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !88, file: !84, line: 50, baseType: !10, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !88, file: !84, line: 51, baseType: !10, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !84, line: 52, baseType: !80, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !88, file: !84, line: 53, baseType: !31, size: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !83, file: !84, line: 59, baseType: !65, size: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !83, file: !84, line: 60, baseType: !80, size: 32, offset: 160)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !83, file: !84, line: 61, baseType: !97, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !82, line: 19, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !100, line: 59, size: 64, elements: !101)
!100 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = !{!102, !224}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !99, file: !100, line: 60, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !100, line: 18, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !100, line: 20, size: 352, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !115, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !105, file: !100, line: 21, baseType: !10, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !105, file: !100, line: 22, baseType: !10, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !105, file: !100, line: 23, baseType: !40, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !105, file: !100, line: 24, baseType: !40, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !105, file: !100, line: 26, baseType: !10, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !105, file: !100, line: 27, baseType: !10, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !105, file: !100, line: 28, baseType: !114, size: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !100, line: 16, baseType: !9)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !105, file: !100, line: 29, baseType: !116, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !82, line: 23, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !119, line: 16, size: 1216, elements: !120)
!119 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!120 = !{!121, !124, !125, !168, !169, !170, !209, !210}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !118, file: !119, line: 17, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !123, line: 16, baseType: !24)
!123 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !119, line: 18, baseType: !60, size: 64, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !118, file: !119, line: 19, baseType: !126, size: 960, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !123, line: 17, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !128, line: 4, size: 960, elements: !129)
!128 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!129 = !{!130, !132, !133, !135, !136, !138, !139, !141, !142, !143, !144, !145, !146, !147, !148, !151, !152, !154, !155, !161, !162, !163}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !127, file: !128, line: 6, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !23, line: 232, baseType: !33)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !127, file: !128, line: 7, baseType: !131, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !127, file: !128, line: 8, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !23, line: 227, baseType: !33)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !127, file: !128, line: 9, baseType: !134, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !127, file: !128, line: 10, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !23, line: 217, baseType: !33)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !127, file: !128, line: 11, baseType: !137, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !127, file: !128, line: 13, baseType: !140, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !23, line: 212, baseType: !33)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !127, file: !128, line: 14, baseType: !55, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !127, file: !128, line: 15, baseType: !58, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !127, file: !128, line: 16, baseType: !33, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !127, file: !128, line: 17, baseType: !131, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !127, file: !128, line: 18, baseType: !131, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !127, file: !128, line: 19, baseType: !40, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !127, file: !128, line: 20, baseType: !40, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !127, file: !128, line: 21, baseType: !149, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !23, line: 237, baseType: !150)
!150 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !127, file: !128, line: 22, baseType: !149, size: 32, offset: 480)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !127, file: !128, line: 23, baseType: !153, size: 32, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !23, line: 242, baseType: !24)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !127, file: !128, line: 24, baseType: !153, size: 32, offset: 544)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !127, file: !128, line: 26, baseType: !156, size: 64, offset: 576)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !23, line: 288, size: 64, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !156, file: !23, line: 288, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !23, line: 75, baseType: !150)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !156, file: !23, line: 288, baseType: !150, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !127, file: !128, line: 27, baseType: !156, size: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !127, file: !128, line: 28, baseType: !156, size: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !127, file: !128, line: 29, baseType: !164, size: 192, offset: 768)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 192, elements: !166)
!165 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !118, file: !119, line: 21, baseType: !40, size: 32, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !118, file: !119, line: 22, baseType: !40, size: 32, offset: 1120)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !118, file: !119, line: 24, baseType: !171, size: 32, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !82, line: 20, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !174, line: 50, size: 320, elements: !175)
!174 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!175 = !{!176, !177, !190, !194, !195, !200, !201, !206, !207, !208}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !173, file: !174, line: 51, baseType: !31, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !173, file: !174, line: 52, baseType: !178, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !82, line: 21, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !181, line: 89, size: 160, elements: !182)
!181 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!182 = !{!183, !184, !185, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !180, file: !181, line: 90, baseType: !122, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !181, line: 91, baseType: !60, size: 64, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !180, file: !181, line: 93, baseType: !186, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !178, !171}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !180, file: !181, line: 94, baseType: !9, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !173, file: !174, line: 54, baseType: !191, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !192, line: 98, baseType: !193)
!192 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!193 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !173, file: !174, line: 56, baseType: !159, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !173, file: !174, line: 58, baseType: !196, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !174, line: 45, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!10, !171, !10, !65}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !174, line: 59, baseType: !9, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !173, file: !174, line: 61, baseType: !202, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !174, line: 46, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !171, !31, !10, !65}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !173, file: !174, line: 62, baseType: !9, size: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !173, file: !174, line: 70, baseType: !51, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !174, line: 72, baseType: !171, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !118, file: !119, line: 37, baseType: !33, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !118, file: !119, line: 38, baseType: !33, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !105, file: !100, line: 30, baseType: !103, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !105, file: !100, line: 34, baseType: !33, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !105, file: !100, line: 40, baseType: !33, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !105, file: !100, line: 43, baseType: !33, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !105, file: !100, line: 45, baseType: !33, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !105, file: !100, line: 46, baseType: !33, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !105, file: !100, line: 47, baseType: !33, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !105, file: !100, line: 48, baseType: !33, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !105, file: !100, line: 49, baseType: !33, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !105, file: !100, line: 50, baseType: !33, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !105, file: !100, line: 52, baseType: !33, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !105, file: !100, line: 53, baseType: !33, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !105, file: !100, line: 55, baseType: !24, size: 32, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 61, baseType: !97, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !83, file: !84, line: 62, baseType: !226, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !84, line: 41, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !84, line: 43, size: 64, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !84, line: 44, baseType: !226, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !228, file: !84, line: 45, baseType: !9, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !83, file: !84, line: 63, baseType: !233, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !84, line: 32, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !84, line: 34, size: 96, elements: !236)
!236 = !{!237, !242, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !235, file: !84, line: 35, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !84, line: 30, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !9}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !84, line: 36, baseType: !9, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !84, line: 37, baseType: !233, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !83, file: !84, line: 64, baseType: !171, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "environment", scope: !17, file: !16, line: 116, baseType: !246, size: 32, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !82, line: 17, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !16, line: 38, size: 2496, elements: !250)
!250 = !{!251, !255, !256, !257, !258, !259, !434, !435, !436, !516, !517, !518, !519, !520, !521, !522, !523, !534, !535, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !249, file: !16, line: 39, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !249, file: !16, line: 40, baseType: !80, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !249, file: !16, line: 42, baseType: !171, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !249, file: !16, line: 43, baseType: !172, size: 320, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !249, file: !16, line: 45, baseType: !31, size: 32, offset: 416)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !249, file: !16, line: 47, baseType: !260, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !82, line: 26, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !264, line: 121, size: 896, elements: !265)
!264 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!265 = !{!266, !267, !321, !322, !325, !332, !334, !339, !344, !402, !403, !404, !405, !406, !407, !408, !409, !410, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !264, line: 122, baseType: !9, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !263, file: !264, line: 123, baseType: !268, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !82, line: 24, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !271, line: 30, size: 384, elements: !272)
!271 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !300, !301, !302, !313}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !270, file: !271, line: 31, baseType: !9, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !270, file: !271, line: 33, baseType: !33, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !270, file: !271, line: 35, baseType: !33, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !270, file: !271, line: 38, baseType: !33, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !270, file: !271, line: 44, baseType: !33, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !270, file: !271, line: 46, baseType: !33, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !270, file: !271, line: 49, baseType: !33, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !270, file: !271, line: 51, baseType: !33, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !270, file: !271, line: 54, baseType: !33, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !270, file: !271, line: 56, baseType: !33, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !270, file: !271, line: 57, baseType: !33, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !270, file: !271, line: 59, baseType: !33, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !270, file: !271, line: 60, baseType: !33, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !270, file: !271, line: 62, baseType: !33, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !270, file: !271, line: 64, baseType: !33, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !270, file: !271, line: 67, baseType: !33, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !270, file: !271, line: 69, baseType: !33, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !270, file: !271, line: 71, baseType: !33, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !270, file: !271, line: 74, baseType: !33, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !270, file: !271, line: 75, baseType: !33, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !270, file: !271, line: 77, baseType: !33, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !270, file: !271, line: 107, baseType: !33, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !270, file: !271, line: 110, baseType: !296, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !82, line: 31, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !268}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !270, file: !271, line: 117, baseType: !31, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !270, file: !271, line: 119, baseType: !171, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !270, file: !271, line: 121, baseType: !303, size: 160, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !30, line: 20, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !30, line: 22, size: 160, elements: !305)
!305 = !{!306, !307, !309, !310, !311, !312}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !304, file: !30, line: 23, baseType: !29, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !304, file: !30, line: 24, baseType: !308, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !304, file: !30, line: 25, baseType: !308, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !304, file: !30, line: 26, baseType: !308, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !304, file: !30, line: 27, baseType: !11, size: 8, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !30, line: 28, baseType: !11, size: 8, offset: 136)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !270, file: !271, line: 124, baseType: !314, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !315, line: 16, baseType: !316)
!315 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !315, line: 18, size: 64, elements: !317)
!317 = !{!318, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !316, file: !315, line: 19, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !315, line: 20, baseType: !319, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !263, file: !264, line: 124, baseType: !268, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !263, file: !264, line: 126, baseType: !323, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !324, line: 17, baseType: !24)
!324 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !263, file: !264, line: 128, baseType: !326, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !327, line: 19, baseType: !328)
!327 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !261, !10, !65}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !23, line: 135, baseType: !24)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !263, file: !264, line: 129, baseType: !333, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !327, line: 22, baseType: !328)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !263, file: !264, line: 130, baseType: !335, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !327, line: 20, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{!331, !261, !97, !40}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !263, file: !264, line: 131, baseType: !340, size: 32, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !327, line: 23, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!97, !261, !97, !40}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !263, file: !264, line: 133, baseType: !345, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !264, line: 16, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !264, line: 18, size: 960, elements: !348)
!348 = !{!349, !350, !362, !364, !365, !366, !367, !368, !369, !370, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !347, file: !264, line: 19, baseType: !323, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !347, file: !264, line: 21, baseType: !351, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !353, line: 297, size: 128, elements: !354)
!353 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!354 = !{!355, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !352, file: !353, line: 298, baseType: !356, size: 16)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !23, line: 409, baseType: !357)
!357 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !352, file: !353, line: 299, baseType: !359, size: 112, offset: 16)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 112, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 14)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !347, file: !264, line: 22, baseType: !363, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !23, line: 404, baseType: !33)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !347, file: !264, line: 23, baseType: !65, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !347, file: !264, line: 24, baseType: !60, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !347, file: !264, line: 26, baseType: !24, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !347, file: !264, line: 28, baseType: !24, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !347, file: !264, line: 29, baseType: !24, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !347, file: !264, line: 30, baseType: !24, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !347, file: !264, line: 38, baseType: !371, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !82, line: 32, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !261}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !347, file: !264, line: 40, baseType: !9, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !347, file: !264, line: 42, baseType: !172, size: 320, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !347, file: !264, line: 43, baseType: !171, size: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !347, file: !264, line: 45, baseType: !65, size: 32, offset: 736)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !347, file: !264, line: 47, baseType: !65, size: 32, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !347, file: !264, line: 49, baseType: !27, size: 32, offset: 800)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !347, file: !264, line: 51, baseType: !345, size: 32, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !347, file: !264, line: 52, baseType: !261, size: 32, offset: 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !347, file: !264, line: 54, baseType: !31, size: 32, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !347, file: !264, line: 56, baseType: !33, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !347, file: !264, line: 57, baseType: !33, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !347, file: !264, line: 58, baseType: !33, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !347, file: !264, line: 60, baseType: !33, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !347, file: !264, line: 61, baseType: !33, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !347, file: !264, line: 62, baseType: !33, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !347, file: !264, line: 63, baseType: !33, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !347, file: !264, line: 64, baseType: !33, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !347, file: !264, line: 65, baseType: !33, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !347, file: !264, line: 66, baseType: !33, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !347, file: !264, line: 67, baseType: !33, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !347, file: !264, line: 70, baseType: !33, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !347, file: !264, line: 72, baseType: !33, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !347, file: !264, line: 73, baseType: !33, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !347, file: !264, line: 74, baseType: !33, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !347, file: !264, line: 76, baseType: !33, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !347, file: !264, line: 77, baseType: !33, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !347, file: !264, line: 78, baseType: !33, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !263, file: !264, line: 135, baseType: !40, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !263, file: !264, line: 137, baseType: !171, size: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !263, file: !264, line: 139, baseType: !80, size: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !264, line: 141, baseType: !24, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !263, file: !264, line: 143, baseType: !351, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !263, file: !264, line: 144, baseType: !363, size: 32, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !263, file: !264, line: 145, baseType: !60, size: 64, offset: 480)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !263, file: !264, line: 147, baseType: !60, size: 64, offset: 544)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !263, file: !264, line: 148, baseType: !411, size: 16, offset: 608)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !412, line: 12, baseType: !413)
!412 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 186, baseType: !357)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !263, file: !264, line: 154, baseType: !351, size: 32, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !263, file: !264, line: 155, baseType: !363, size: 32, offset: 672)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !263, file: !264, line: 157, baseType: !103, size: 32, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !264, line: 159, baseType: !314, size: 64, offset: 736)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !263, file: !264, line: 161, baseType: !191, size: 32, offset: 800)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !263, file: !264, line: 163, baseType: !31, size: 32, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !263, file: !264, line: 165, baseType: !33, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !263, file: !264, line: 167, baseType: !33, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !263, file: !264, line: 169, baseType: !33, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !263, file: !264, line: 170, baseType: !33, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !263, file: !264, line: 171, baseType: !33, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !263, file: !264, line: 173, baseType: !33, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !263, file: !264, line: 174, baseType: !33, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !263, file: !264, line: 175, baseType: !33, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !263, file: !264, line: 176, baseType: !33, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !263, file: !264, line: 178, baseType: !33, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !263, file: !264, line: 179, baseType: !33, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !263, file: !264, line: 180, baseType: !33, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !263, file: !264, line: 181, baseType: !33, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !263, file: !264, line: 183, baseType: !33, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !249, file: !16, line: 48, baseType: !261, size: 32, offset: 480)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !249, file: !16, line: 49, baseType: !31, size: 32, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !249, file: !16, line: 51, baseType: !437, size: 32, offset: 544)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !82, line: 15, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !441, line: 222, size: 800, elements: !442)
!441 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !491, !492, !496, !500, !501, !502, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !440, file: !441, line: 223, baseType: !31, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !440, file: !441, line: 224, baseType: !31, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !440, file: !441, line: 226, baseType: !51, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !440, file: !441, line: 228, baseType: !31, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !440, file: !441, line: 229, baseType: !31, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !440, file: !441, line: 231, baseType: !31, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !440, file: !441, line: 232, baseType: !6, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !440, file: !441, line: 234, baseType: !9, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !440, file: !441, line: 235, baseType: !452, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !82, line: 22, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !181, line: 77, size: 224, elements: !455)
!455 = !{!456, !457, !458, !488, !489, !490}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !181, line: 78, baseType: !60, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !454, file: !181, line: 79, baseType: !31, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !454, file: !181, line: 80, baseType: !459, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{!51, !462, !452, !9}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !82, line: 16, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !181, line: 116, size: 384, elements: !465)
!465 = !{!466, !467, !469, !470, !471, !472, !481, !482, !483, !484, !485, !487}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !464, file: !181, line: 117, baseType: !51, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !464, file: !181, line: 118, baseType: !468, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !464, file: !181, line: 120, baseType: !247, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !464, file: !181, line: 121, baseType: !80, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !464, file: !181, line: 122, baseType: !80, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !464, file: !181, line: 123, baseType: !473, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !181, line: 103, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 98, size: 1344, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !475, file: !181, line: 99, baseType: !117, size: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !475, file: !181, line: 100, baseType: !103, size: 32, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !475, file: !181, line: 101, baseType: !103, size: 32, offset: 1248)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !475, file: !181, line: 102, baseType: !31, size: 32, offset: 1280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !464, file: !181, line: 124, baseType: !171, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !464, file: !181, line: 126, baseType: !9, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !464, file: !181, line: 127, baseType: !31, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !464, file: !181, line: 128, baseType: !31, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !464, file: !181, line: 130, baseType: !486, size: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !181, line: 112, baseType: !459)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !464, file: !181, line: 131, baseType: !51, size: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !454, file: !181, line: 81, baseType: !31, size: 32, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !454, file: !181, line: 82, baseType: !31, size: 32, offset: 160)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !454, file: !181, line: 83, baseType: !9, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !441, line: 236, baseType: !31, size: 32, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !440, file: !441, line: 238, baseType: !493, size: 32, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{!36, !171}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !440, file: !441, line: 240, baseType: !497, size: 32, offset: 352)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{!36, !247}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !440, file: !441, line: 242, baseType: !497, size: 32, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !440, file: !441, line: 243, baseType: !497, size: 32, offset: 416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !440, file: !441, line: 244, baseType: !503, size: 32, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !247}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !440, file: !441, line: 245, baseType: !503, size: 32, offset: 480)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !440, file: !441, line: 247, baseType: !503, size: 32, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !440, file: !441, line: 249, baseType: !32, size: 32, offset: 544)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !440, file: !441, line: 250, baseType: !32, size: 32, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !440, file: !441, line: 251, baseType: !32, size: 32, offset: 608)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !440, file: !441, line: 252, baseType: !32, size: 32, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !440, file: !441, line: 253, baseType: !32, size: 32, offset: 672)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !440, file: !441, line: 254, baseType: !32, size: 32, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !440, file: !441, line: 255, baseType: !32, size: 32, offset: 736)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !440, file: !441, line: 256, baseType: !32, size: 32, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !249, file: !16, line: 52, baseType: !31, size: 32, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !249, file: !16, line: 53, baseType: !31, size: 32, offset: 608)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !249, file: !16, line: 55, baseType: !314, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !249, file: !16, line: 56, baseType: !31, size: 32, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !249, file: !16, line: 58, baseType: !71, size: 160, offset: 736)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !249, file: !16, line: 59, baseType: !71, size: 160, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !249, file: !16, line: 61, baseType: !71, size: 160, offset: 1056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !249, file: !16, line: 62, baseType: !524, size: 96, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !30, line: 32, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !30, line: 37, size: 96, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !525, file: !30, line: 38, baseType: !308, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !525, file: !30, line: 39, baseType: !308, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !525, file: !30, line: 40, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !30, line: 34, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !308, !308, !308}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !249, file: !16, line: 63, baseType: !303, size: 160, offset: 1312)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !249, file: !16, line: 65, baseType: !536, size: 224, offset: 1472)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !537, line: 31, baseType: !538)
!537 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 25, size: 224, elements: !539)
!539 = !{!540, !548, !549, !550, !551}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !538, file: !537, line: 26, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !537, line: 16, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !537, line: 18, size: 96, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !543, file: !537, line: 19, baseType: !9, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !543, file: !537, line: 20, baseType: !31, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !537, line: 21, baseType: !541, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !538, file: !537, line: 27, baseType: !542, size: 96, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !537, line: 28, baseType: !65, size: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !538, file: !537, line: 29, baseType: !31, size: 32, offset: 160)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !538, file: !537, line: 30, baseType: !80, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !249, file: !16, line: 66, baseType: !536, size: 224, offset: 1696)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !249, file: !16, line: 68, baseType: !31, size: 32, offset: 1920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !249, file: !16, line: 69, baseType: !31, size: 32, offset: 1952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !249, file: !16, line: 71, baseType: !261, size: 32, offset: 1984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !249, file: !16, line: 72, baseType: !268, size: 32, offset: 2016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !249, file: !16, line: 73, baseType: !268, size: 32, offset: 2048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !249, file: !16, line: 75, baseType: !247, size: 32, offset: 2080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !249, file: !16, line: 77, baseType: !60, size: 64, offset: 2112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !249, file: !16, line: 78, baseType: !60, size: 64, offset: 2176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !249, file: !16, line: 79, baseType: !60, size: 64, offset: 2240)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !249, file: !16, line: 80, baseType: !60, size: 64, offset: 2304)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !249, file: !16, line: 81, baseType: !60, size: 64, offset: 2368)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !249, file: !16, line: 82, baseType: !60, size: 64, offset: 2432)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !566, line: 20, baseType: !49)
!566 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/resource.h", directory: "/home/sam/Projects/nginx-1.12.2")
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !569, line: 20, baseType: !570)
!569 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 16, size: 96, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !570, file: !569, line: 17, baseType: !159, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !570, file: !569, line: 18, baseType: !31, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !570, file: !569, line: 19, baseType: !36, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !28, line: 17, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !30, line: 17, baseType: !36)
!577 = !{!578, !580, !582, !587, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609, !611, !613, !615, !617, !619, !0, !621, !623, !625, !627, !636}
!578 = !DIGlobalVariableExpression(var: !579)
!579 = distinct !DIGlobalVariable(name: "ngx_process", scope: !2, file: !3, line: 31, type: !31, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581)
!581 = distinct !DIGlobalVariable(name: "ngx_worker", scope: !2, file: !3, line: 32, type: !31, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583)
!583 = distinct !DIGlobalVariable(name: "ngx_pid", scope: !2, file: !3, line: 33, type: !584, isLocal: false, isDefinition: true)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pid_t", file: !585, line: 16, baseType: !586)
!585 = !DIFile(filename: "src/os/unix/ngx_process.h", directory: "/home/sam/Projects/nginx-1.12.2")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !23, line: 294, baseType: !24)
!587 = !DIGlobalVariableExpression(var: !588)
!588 = distinct !DIGlobalVariable(name: "ngx_reap", scope: !2, file: !3, line: 35, type: !589, isLocal: false, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !590, line: 264, baseType: !24)
!590 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/signal.h", directory: "/home/sam/Projects/nginx-1.12.2")
!591 = !DIGlobalVariableExpression(var: !592)
!592 = distinct !DIGlobalVariable(name: "ngx_sigio", scope: !2, file: !3, line: 36, type: !589, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594)
!594 = distinct !DIGlobalVariable(name: "ngx_sigalrm", scope: !2, file: !3, line: 37, type: !589, isLocal: false, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596)
!596 = distinct !DIGlobalVariable(name: "ngx_terminate", scope: !2, file: !3, line: 38, type: !589, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598)
!598 = distinct !DIGlobalVariable(name: "ngx_quit", scope: !2, file: !3, line: 39, type: !589, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600)
!600 = distinct !DIGlobalVariable(name: "ngx_debug_quit", scope: !2, file: !3, line: 40, type: !589, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602)
!602 = distinct !DIGlobalVariable(name: "ngx_exiting", scope: !2, file: !3, line: 41, type: !31, isLocal: false, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604)
!604 = distinct !DIGlobalVariable(name: "ngx_reconfigure", scope: !2, file: !3, line: 42, type: !589, isLocal: false, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606)
!606 = distinct !DIGlobalVariable(name: "ngx_reopen", scope: !2, file: !3, line: 43, type: !589, isLocal: false, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608)
!608 = distinct !DIGlobalVariable(name: "ngx_change_binary", scope: !2, file: !3, line: 45, type: !589, isLocal: false, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610)
!610 = distinct !DIGlobalVariable(name: "ngx_new_binary", scope: !2, file: !3, line: 46, type: !584, isLocal: false, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612)
!612 = distinct !DIGlobalVariable(name: "ngx_inherited", scope: !2, file: !3, line: 47, type: !31, isLocal: false, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614)
!614 = distinct !DIGlobalVariable(name: "ngx_daemonized", scope: !2, file: !3, line: 48, type: !31, isLocal: false, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616)
!616 = distinct !DIGlobalVariable(name: "ngx_noaccept", scope: !2, file: !3, line: 50, type: !589, isLocal: false, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618)
!618 = distinct !DIGlobalVariable(name: "ngx_noaccepting", scope: !2, file: !3, line: 51, type: !31, isLocal: false, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620)
!620 = distinct !DIGlobalVariable(name: "ngx_restart", scope: !2, file: !3, line: 52, type: !31, isLocal: false, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622)
!622 = distinct !DIGlobalVariable(name: "ngx_exit_log", scope: !2, file: !3, line: 68, type: !172, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624)
!624 = distinct !DIGlobalVariable(name: "ngx_exit_log_file", scope: !2, file: !3, line: 69, type: !179, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626)
!626 = distinct !DIGlobalVariable(name: "ngx_exit_cycle", scope: !2, file: !3, line: 67, type: !248, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628)
!628 = distinct !DIGlobalVariable(name: "ngx_cache_manager_ctx", scope: !2, file: !3, line: 58, type: !629, isLocal: true, isDefinition: true)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cache_manager_ctx_t", file: !630, line: 34, baseType: !631)
!630 = !DIFile(filename: "src/os/unix/ngx_process_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !630, line: 30, size: 96, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !631, file: !630, line: 31, baseType: !296, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !630, line: 32, baseType: !51, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !631, file: !630, line: 33, baseType: !27, size: 32, offset: 64)
!636 = !DIGlobalVariableExpression(var: !637)
!637 = distinct !DIGlobalVariable(name: "ngx_cache_loader_ctx", scope: !2, file: !3, line: 62, type: !629, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 120, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 15)
!641 = !{i32 2, !"Dwarf Version", i32 4}
!642 = !{i32 2, !"Debug Info Version", i32 3}
!643 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!644 = distinct !DISubprogram(name: "ngx_master_process_cycle", scope: !3, file: !3, line: 73, type: !504, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !661, !672, !673, !674, !675}
!646 = !DILocalVariable(name: "cycle", arg: 1, scope: !644, file: !3, line: 73, type: !247)
!647 = !DILocalVariable(name: "title", scope: !644, file: !3, line: 75, type: !51)
!648 = !DILocalVariable(name: "p", scope: !644, file: !3, line: 76, type: !10)
!649 = !DILocalVariable(name: "size", scope: !644, file: !3, line: 77, type: !65)
!650 = !DILocalVariable(name: "i", scope: !644, file: !3, line: 78, type: !36)
!651 = !DILocalVariable(name: "n", scope: !644, file: !3, line: 79, type: !31)
!652 = !DILocalVariable(name: "sigio", scope: !644, file: !3, line: 79, type: !31)
!653 = !DILocalVariable(name: "set", scope: !644, file: !3, line: 80, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !23, line: 392, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sigset_t", file: !23, line: 392, size: 1024, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__bits", scope: !655, file: !23, line: 392, baseType: !658, size: 1024)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 1024, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 32)
!661 = !DILocalVariable(name: "itv", scope: !644, file: !3, line: 81, type: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", file: !663, line: 20, size: 128, elements: !664)
!663 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!664 = !{!665, !671}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !662, file: !663, line: 21, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !23, line: 283, size: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !666, file: !23, line: 283, baseType: !159, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !666, file: !23, line: 283, baseType: !670, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !23, line: 80, baseType: !150)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !662, file: !663, line: 22, baseType: !666, size: 64, offset: 64)
!672 = !DILocalVariable(name: "live", scope: !644, file: !3, line: 82, type: !31)
!673 = !DILocalVariable(name: "delay", scope: !644, file: !3, line: 83, type: !27)
!674 = !DILocalVariable(name: "ls", scope: !644, file: !3, line: 84, type: !345)
!675 = !DILocalVariable(name: "ccf", scope: !644, file: !3, line: 85, type: !14)
!676 = !{!677, !677, i64 0}
!677 = !{!"any pointer", !678, i64 0}
!678 = !{!"omnipotent char", !679, i64 0}
!679 = !{!"Simple C/C++ TBAA"}
!680 = !DIExpression()
!681 = !DILocation(line: 73, column: 39, scope: !644)
!682 = !DILocation(line: 75, column: 5, scope: !644)
!683 = !DILocation(line: 75, column: 24, scope: !644)
!684 = !DILocation(line: 76, column: 5, scope: !644)
!685 = !DILocation(line: 76, column: 24, scope: !644)
!686 = !DILocation(line: 77, column: 5, scope: !644)
!687 = !DILocation(line: 77, column: 24, scope: !644)
!688 = !DILocation(line: 78, column: 5, scope: !644)
!689 = !DILocation(line: 78, column: 24, scope: !644)
!690 = !DILocation(line: 79, column: 5, scope: !644)
!691 = !DILocation(line: 79, column: 24, scope: !644)
!692 = !DILocation(line: 79, column: 27, scope: !644)
!693 = !DILocation(line: 80, column: 5, scope: !644)
!694 = !DILocation(line: 80, column: 24, scope: !644)
!695 = !DILocation(line: 81, column: 5, scope: !644)
!696 = !DILocation(line: 81, column: 24, scope: !644)
!697 = !DILocation(line: 82, column: 5, scope: !644)
!698 = !DILocation(line: 82, column: 24, scope: !644)
!699 = !DILocation(line: 83, column: 5, scope: !644)
!700 = !DILocation(line: 83, column: 24, scope: !644)
!701 = !DILocation(line: 84, column: 5, scope: !644)
!702 = !DILocation(line: 84, column: 24, scope: !644)
!703 = !DILocation(line: 85, column: 5, scope: !644)
!704 = !DILocation(line: 85, column: 24, scope: !644)
!705 = !DILocation(line: 87, column: 5, scope: !644)
!706 = !DILocation(line: 88, column: 5, scope: !644)
!707 = !DILocation(line: 89, column: 5, scope: !644)
!708 = !DILocation(line: 90, column: 5, scope: !644)
!709 = !DILocation(line: 91, column: 5, scope: !644)
!710 = !DILocation(line: 92, column: 5, scope: !644)
!711 = !DILocation(line: 93, column: 5, scope: !644)
!712 = !DILocation(line: 94, column: 5, scope: !644)
!713 = !DILocation(line: 95, column: 5, scope: !644)
!714 = !DILocation(line: 96, column: 5, scope: !644)
!715 = !DILocation(line: 97, column: 5, scope: !644)
!716 = !DILocation(line: 99, column: 9, scope: !717)
!717 = distinct !DILexicalBlock(scope: !644, file: !3, line: 99, column: 9)
!718 = !DILocation(line: 99, column: 44, scope: !717)
!719 = !DILocation(line: 99, column: 9, scope: !644)
!720 = !DILocation(line: 100, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !3, line: 100, column: 9)
!722 = distinct !DILexicalBlock(scope: !717, file: !3, line: 99, column: 51)
!723 = !{!724, !677, i64 8}
!724 = !{!"ngx_cycle_s", !677, i64 0, !677, i64 4, !677, i64 8, !725, i64 12, !726, i64 52, !677, i64 56, !677, i64 60, !726, i64 64, !677, i64 68, !726, i64 72, !726, i64 76, !728, i64 80, !726, i64 88, !729, i64 92, !729, i64 112, !729, i64 132, !730, i64 152, !731, i64 164, !732, i64 184, !732, i64 212, !726, i64 240, !726, i64 244, !677, i64 248, !677, i64 252, !677, i64 256, !677, i64 260, !734, i64 264, !734, i64 272, !734, i64 280, !734, i64 288, !734, i64 296, !734, i64 304}
!725 = !{!"ngx_log_s", !726, i64 0, !677, i64 4, !727, i64 8, !727, i64 12, !677, i64 16, !677, i64 20, !677, i64 24, !677, i64 28, !677, i64 32, !677, i64 36}
!726 = !{!"int", !678, i64 0}
!727 = !{!"long", !678, i64 0}
!728 = !{!"ngx_queue_s", !677, i64 0, !677, i64 4}
!729 = !{!"", !677, i64 0, !726, i64 4, !726, i64 8, !726, i64 12, !677, i64 16}
!730 = !{!"ngx_rbtree_s", !677, i64 0, !677, i64 4, !677, i64 8}
!731 = !{!"ngx_rbtree_node_s", !726, i64 0, !677, i64 4, !677, i64 8, !677, i64 12, !678, i64 16, !678, i64 17}
!732 = !{!"", !677, i64 0, !733, i64 4, !726, i64 16, !726, i64 20, !677, i64 24}
!733 = !{!"ngx_list_part_s", !677, i64 0, !726, i64 4, !677, i64 8}
!734 = !{!"", !726, i64 0, !677, i64 4}
!735 = !{!725, !726, i64 0}
!736 = !DILocation(line: 100, column: 9, scope: !722)
!737 = !{!726, !726, i64 0}
!738 = !DILocation(line: 102, column: 5, scope: !722)
!739 = !DILocation(line: 104, column: 5, scope: !644)
!740 = !DILocation(line: 107, column: 10, scope: !644)
!741 = !DILocation(line: 109, column: 12, scope: !742)
!742 = distinct !DILexicalBlock(scope: !644, file: !3, line: 109, column: 5)
!743 = !DILocation(line: 109, column: 10, scope: !742)
!744 = !DILocation(line: 109, column: 17, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !3, line: 109, column: 5)
!746 = !DILocation(line: 109, column: 21, scope: !745)
!747 = !DILocation(line: 109, column: 19, scope: !745)
!748 = !DILocation(line: 109, column: 5, scope: !742)
!749 = !DILocation(line: 110, column: 17, scope: !750)
!750 = distinct !DILexicalBlock(scope: !745, file: !3, line: 109, column: 36)
!751 = !DILocation(line: 110, column: 41, scope: !750)
!752 = !DILocation(line: 110, column: 14, scope: !750)
!753 = !DILocation(line: 111, column: 5, scope: !750)
!754 = !DILocation(line: 109, column: 32, scope: !745)
!755 = !DILocation(line: 109, column: 5, scope: !745)
!756 = distinct !{!756, !748, !757}
!757 = !DILocation(line: 111, column: 5, scope: !742)
!758 = !DILocation(line: 113, column: 25, scope: !644)
!759 = !DILocation(line: 113, column: 32, scope: !644)
!760 = !{!724, !677, i64 4}
!761 = !DILocation(line: 113, column: 38, scope: !644)
!762 = !DILocation(line: 113, column: 13, scope: !644)
!763 = !DILocation(line: 113, column: 11, scope: !644)
!764 = !DILocation(line: 114, column: 9, scope: !765)
!765 = distinct !DILexicalBlock(scope: !644, file: !3, line: 114, column: 9)
!766 = !DILocation(line: 114, column: 15, scope: !765)
!767 = !DILocation(line: 114, column: 9, scope: !644)
!768 = !DILocation(line: 116, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !3, line: 114, column: 24)
!770 = !DILocation(line: 119, column: 9, scope: !644)
!771 = !DILocation(line: 119, column: 7, scope: !644)
!772 = !DILocation(line: 120, column: 12, scope: !773)
!773 = distinct !DILexicalBlock(scope: !644, file: !3, line: 120, column: 5)
!774 = !DILocation(line: 120, column: 10, scope: !773)
!775 = !DILocation(line: 120, column: 17, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !3, line: 120, column: 5)
!777 = !DILocation(line: 120, column: 21, scope: !776)
!778 = !DILocation(line: 120, column: 19, scope: !776)
!779 = !DILocation(line: 120, column: 5, scope: !773)
!780 = !DILocation(line: 121, column: 11, scope: !781)
!781 = distinct !DILexicalBlock(scope: !776, file: !3, line: 120, column: 36)
!782 = !DILocation(line: 121, column: 14, scope: !781)
!783 = !{!678, !678, i64 0}
!784 = !DILocation(line: 122, column: 25, scope: !781)
!785 = !DILocation(line: 122, column: 39, scope: !781)
!786 = !DILocation(line: 122, column: 48, scope: !781)
!787 = !DILocation(line: 122, column: 52, scope: !781)
!788 = !DILocation(line: 122, column: 13, scope: !781)
!789 = !DILocation(line: 122, column: 11, scope: !781)
!790 = !DILocation(line: 123, column: 5, scope: !781)
!791 = !DILocation(line: 120, column: 32, scope: !776)
!792 = !DILocation(line: 120, column: 5, scope: !776)
!793 = distinct !{!793, !779, !794}
!794 = !DILocation(line: 123, column: 5, scope: !773)
!795 = !DILocation(line: 125, column: 22, scope: !644)
!796 = !DILocation(line: 125, column: 5, scope: !644)
!797 = !DILocation(line: 128, column: 31, scope: !644)
!798 = !{!724, !677, i64 0}
!799 = !{!800, !726, i64 4}
!800 = !{!"ngx_module_s", !726, i64 0, !726, i64 4, !677, i64 8, !726, i64 12, !726, i64 16, !726, i64 20, !677, i64 24, !677, i64 28, !677, i64 32, !726, i64 36, !677, i64 40, !677, i64 44, !677, i64 48, !677, i64 52, !677, i64 56, !677, i64 60, !677, i64 64, !726, i64 68, !726, i64 72, !726, i64 76, !726, i64 80, !726, i64 84, !726, i64 88, !726, i64 92, !726, i64 96}
!801 = !DILocation(line: 128, column: 11, scope: !644)
!802 = !DILocation(line: 128, column: 9, scope: !644)
!803 = !DILocation(line: 130, column: 32, scope: !644)
!804 = !DILocation(line: 130, column: 39, scope: !644)
!805 = !DILocation(line: 130, column: 44, scope: !644)
!806 = !{!807, !726, i64 16}
!807 = !{!"", !726, i64 0, !726, i64 4, !726, i64 8, !726, i64 12, !726, i64 16, !726, i64 20, !726, i64 24, !726, i64 28, !726, i64 32, !726, i64 36, !726, i64 40, !677, i64 44, !677, i64 48, !726, i64 52, !726, i64 56, !734, i64 60, !734, i64 68, !734, i64 76, !734, i64 84, !729, i64 92, !677, i64 112}
!808 = !DILocation(line: 130, column: 5, scope: !644)
!809 = !DILocation(line: 132, column: 39, scope: !644)
!810 = !DILocation(line: 132, column: 5, scope: !644)
!811 = !DILocation(line: 134, column: 20, scope: !644)
!812 = !DILocation(line: 135, column: 11, scope: !644)
!813 = !DILocation(line: 136, column: 11, scope: !644)
!814 = !DILocation(line: 137, column: 10, scope: !644)
!815 = !DILocation(line: 139, column: 5, scope: !644)
!816 = !DILocation(line: 140, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 140, column: 13)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 139, column: 16)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 139, column: 5)
!820 = distinct !DILexicalBlock(scope: !644, file: !3, line: 139, column: 5)
!821 = !DILocation(line: 140, column: 13, scope: !818)
!822 = !DILocation(line: 141, column: 17, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 141, column: 17)
!824 = distinct !DILexicalBlock(scope: !817, file: !3, line: 140, column: 20)
!825 = !DILocation(line: 141, column: 17, scope: !824)
!826 = !DILocation(line: 142, column: 23, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !3, line: 141, column: 30)
!828 = !DILocation(line: 143, column: 23, scope: !827)
!829 = !DILocation(line: 144, column: 29, scope: !827)
!830 = !DILocation(line: 145, column: 13, scope: !827)
!831 = !DILocation(line: 150, column: 17, scope: !824)
!832 = !DILocation(line: 150, column: 29, scope: !824)
!833 = !DILocation(line: 150, column: 36, scope: !824)
!834 = !{!835, !727, i64 0}
!835 = !{!"itimerval", !836, i64 0, !836, i64 8}
!836 = !{!"timeval", !727, i64 0, !727, i64 4}
!837 = !DILocation(line: 151, column: 17, scope: !824)
!838 = !DILocation(line: 151, column: 29, scope: !824)
!839 = !DILocation(line: 151, column: 37, scope: !824)
!840 = !{!835, !727, i64 4}
!841 = !DILocation(line: 152, column: 35, scope: !824)
!842 = !DILocation(line: 152, column: 41, scope: !824)
!843 = !DILocation(line: 152, column: 17, scope: !824)
!844 = !DILocation(line: 152, column: 26, scope: !824)
!845 = !DILocation(line: 152, column: 33, scope: !824)
!846 = !{!835, !727, i64 8}
!847 = !DILocation(line: 153, column: 37, scope: !824)
!848 = !DILocation(line: 153, column: 43, scope: !824)
!849 = !DILocation(line: 153, column: 52, scope: !824)
!850 = !DILocation(line: 153, column: 17, scope: !824)
!851 = !DILocation(line: 153, column: 26, scope: !824)
!852 = !DILocation(line: 153, column: 34, scope: !824)
!853 = !{!835, !727, i64 12}
!854 = !DILocation(line: 155, column: 17, scope: !855)
!855 = distinct !DILexicalBlock(scope: !824, file: !3, line: 155, column: 17)
!856 = !DILocation(line: 155, column: 52, scope: !855)
!857 = !DILocation(line: 155, column: 17, scope: !824)
!858 = !DILocation(line: 156, column: 17, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !3, line: 156, column: 17)
!860 = distinct !DILexicalBlock(scope: !855, file: !3, line: 155, column: 59)
!861 = !DILocation(line: 156, column: 17, scope: !860)
!862 = !DILocation(line: 158, column: 13, scope: !860)
!863 = !DILocation(line: 159, column: 9, scope: !824)
!864 = !DILocation(line: 163, column: 9, scope: !818)
!865 = !DILocation(line: 165, column: 9, scope: !818)
!866 = !DILocation(line: 170, column: 13, scope: !867)
!867 = distinct !DILexicalBlock(scope: !818, file: !3, line: 170, column: 13)
!868 = !DILocation(line: 170, column: 13, scope: !818)
!869 = !DILocation(line: 171, column: 22, scope: !870)
!870 = distinct !DILexicalBlock(scope: !867, file: !3, line: 170, column: 23)
!871 = !DILocation(line: 174, column: 38, scope: !870)
!872 = !DILocation(line: 174, column: 20, scope: !870)
!873 = !DILocation(line: 174, column: 18, scope: !870)
!874 = !DILocation(line: 175, column: 9, scope: !870)
!875 = !DILocation(line: 177, column: 14, scope: !876)
!876 = distinct !DILexicalBlock(scope: !818, file: !3, line: 177, column: 13)
!877 = !DILocation(line: 177, column: 19, scope: !876)
!878 = !DILocation(line: 177, column: 23, scope: !876)
!879 = !DILocation(line: 177, column: 37, scope: !876)
!880 = !DILocation(line: 177, column: 40, scope: !876)
!881 = !DILocation(line: 177, column: 13, scope: !818)
!882 = !DILocation(line: 178, column: 37, scope: !883)
!883 = distinct !DILexicalBlock(scope: !876, file: !3, line: 177, column: 51)
!884 = !DILocation(line: 178, column: 13, scope: !883)
!885 = !DILocation(line: 179, column: 9, scope: !883)
!886 = !DILocation(line: 181, column: 13, scope: !887)
!887 = distinct !DILexicalBlock(scope: !818, file: !3, line: 181, column: 13)
!888 = !DILocation(line: 181, column: 13, scope: !818)
!889 = !DILocation(line: 182, column: 17, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !3, line: 182, column: 17)
!891 = distinct !DILexicalBlock(scope: !887, file: !3, line: 181, column: 28)
!892 = !DILocation(line: 182, column: 23, scope: !890)
!893 = !DILocation(line: 182, column: 17, scope: !891)
!894 = !DILocation(line: 183, column: 23, scope: !895)
!895 = distinct !DILexicalBlock(scope: !890, file: !3, line: 182, column: 29)
!896 = !DILocation(line: 184, column: 13, scope: !895)
!897 = !DILocation(line: 186, column: 17, scope: !898)
!898 = distinct !DILexicalBlock(scope: !891, file: !3, line: 186, column: 17)
!899 = !DILocation(line: 186, column: 17, scope: !891)
!900 = !DILocation(line: 187, column: 22, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !3, line: 186, column: 24)
!902 = !DILocation(line: 188, column: 17, scope: !901)
!903 = distinct !{!903, !904, !905}
!904 = !DILocation(line: 139, column: 5, scope: !820)
!905 = !DILocation(line: 283, column: 5, scope: !820)
!906 = !DILocation(line: 191, column: 21, scope: !891)
!907 = !DILocation(line: 191, column: 26, scope: !891)
!908 = !DILocation(line: 191, column: 43, scope: !891)
!909 = !DILocation(line: 191, column: 19, scope: !891)
!910 = !DILocation(line: 193, column: 17, scope: !911)
!911 = distinct !DILexicalBlock(scope: !891, file: !3, line: 193, column: 17)
!912 = !DILocation(line: 193, column: 23, scope: !911)
!913 = !DILocation(line: 193, column: 17, scope: !891)
!914 = !DILocation(line: 194, column: 45, scope: !915)
!915 = distinct !DILexicalBlock(scope: !911, file: !3, line: 193, column: 31)
!916 = !DILocation(line: 194, column: 17, scope: !915)
!917 = !DILocation(line: 195, column: 13, scope: !915)
!918 = !DILocation(line: 196, column: 45, scope: !919)
!919 = distinct !DILexicalBlock(scope: !911, file: !3, line: 195, column: 20)
!920 = !DILocation(line: 196, column: 17, scope: !919)
!921 = !DILocation(line: 200, column: 13, scope: !891)
!922 = !DILocation(line: 203, column: 13, scope: !923)
!923 = distinct !DILexicalBlock(scope: !818, file: !3, line: 203, column: 13)
!924 = !DILocation(line: 203, column: 13, scope: !818)
!925 = !DILocation(line: 204, column: 41, scope: !926)
!926 = distinct !DILexicalBlock(scope: !923, file: !3, line: 203, column: 23)
!927 = !DILocation(line: 204, column: 13, scope: !926)
!928 = !DILocation(line: 207, column: 18, scope: !926)
!929 = !DILocation(line: 207, column: 25, scope: !926)
!930 = !DILocation(line: 207, column: 35, scope: !926)
!931 = !{!724, !677, i64 92}
!932 = !DILocation(line: 207, column: 16, scope: !926)
!933 = !DILocation(line: 208, column: 20, scope: !934)
!934 = distinct !DILexicalBlock(scope: !926, file: !3, line: 208, column: 13)
!935 = !DILocation(line: 208, column: 18, scope: !934)
!936 = !DILocation(line: 208, column: 25, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !3, line: 208, column: 13)
!938 = !DILocation(line: 208, column: 29, scope: !937)
!939 = !DILocation(line: 208, column: 36, scope: !937)
!940 = !DILocation(line: 208, column: 46, scope: !937)
!941 = !{!724, !726, i64 96}
!942 = !DILocation(line: 208, column: 27, scope: !937)
!943 = !DILocation(line: 208, column: 13, scope: !934)
!944 = !DILocation(line: 209, column: 38, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !3, line: 209, column: 21)
!946 = distinct !DILexicalBlock(scope: !937, file: !3, line: 208, column: 58)
!947 = !DILocation(line: 209, column: 41, scope: !945)
!948 = !DILocation(line: 209, column: 44, scope: !945)
!949 = !{!950, !726, i64 0}
!950 = !{!"ngx_listening_s", !726, i64 0, !677, i64 4, !726, i64 8, !726, i64 12, !734, i64 16, !726, i64 24, !726, i64 28, !726, i64 32, !726, i64 36, !677, i64 40, !677, i64 44, !725, i64 48, !677, i64 88, !726, i64 92, !726, i64 96, !726, i64 100, !677, i64 104, !677, i64 108, !726, i64 112, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 116, !726, i64 117, !726, i64 117, !726, i64 117, !726, i64 117, !726, i64 117, !726, i64 117, !726, i64 117, !726, i64 118, !726, i64 118, !726, i64 118}
!951 = !DILocation(line: 209, column: 21, scope: !945)
!952 = !DILocation(line: 209, column: 48, scope: !945)
!953 = !DILocation(line: 209, column: 21, scope: !946)
!954 = !DILocation(line: 210, column: 21, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 210, column: 21)
!956 = distinct !DILexicalBlock(scope: !945, file: !3, line: 209, column: 55)
!957 = !DILocation(line: 210, column: 21, scope: !956)
!958 = !DILocation(line: 213, column: 17, scope: !956)
!959 = !DILocation(line: 214, column: 13, scope: !946)
!960 = !DILocation(line: 208, column: 54, scope: !937)
!961 = !DILocation(line: 208, column: 13, scope: !937)
!962 = distinct !{!962, !943, !963}
!963 = !DILocation(line: 214, column: 13, scope: !934)
!964 = !DILocation(line: 215, column: 13, scope: !926)
!965 = !DILocation(line: 215, column: 20, scope: !926)
!966 = !DILocation(line: 215, column: 30, scope: !926)
!967 = !DILocation(line: 215, column: 36, scope: !926)
!968 = !DILocation(line: 217, column: 13, scope: !926)
!969 = !DILocation(line: 220, column: 13, scope: !970)
!970 = distinct !DILexicalBlock(scope: !818, file: !3, line: 220, column: 13)
!971 = !DILocation(line: 220, column: 13, scope: !818)
!972 = !DILocation(line: 221, column: 29, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !3, line: 220, column: 30)
!974 = !DILocation(line: 223, column: 17, scope: !975)
!975 = distinct !DILexicalBlock(scope: !973, file: !3, line: 223, column: 17)
!976 = !DILocation(line: 223, column: 17, scope: !973)
!977 = !DILocation(line: 224, column: 44, scope: !978)
!978 = distinct !DILexicalBlock(scope: !975, file: !3, line: 223, column: 33)
!979 = !DILocation(line: 224, column: 51, scope: !978)
!980 = !DILocation(line: 224, column: 56, scope: !978)
!981 = !DILocation(line: 224, column: 17, scope: !978)
!982 = !DILocation(line: 226, column: 51, scope: !978)
!983 = !DILocation(line: 226, column: 17, scope: !978)
!984 = !DILocation(line: 227, column: 33, scope: !978)
!985 = !DILocation(line: 229, column: 17, scope: !978)
!986 = !DILocation(line: 232, column: 13, scope: !987)
!987 = distinct !DILexicalBlock(scope: !973, file: !3, line: 232, column: 13)
!988 = !DILocation(line: 232, column: 13, scope: !973)
!989 = !DILocation(line: 234, column: 36, scope: !973)
!990 = !DILocation(line: 234, column: 21, scope: !973)
!991 = !DILocation(line: 234, column: 19, scope: !973)
!992 = !DILocation(line: 235, column: 17, scope: !993)
!993 = distinct !DILexicalBlock(scope: !973, file: !3, line: 235, column: 17)
!994 = !DILocation(line: 235, column: 23, scope: !993)
!995 = !DILocation(line: 235, column: 17, scope: !973)
!996 = !DILocation(line: 236, column: 41, scope: !997)
!997 = distinct !DILexicalBlock(scope: !993, file: !3, line: 235, column: 32)
!998 = !DILocation(line: 236, column: 23, scope: !997)
!999 = !DILocation(line: 237, column: 17, scope: !997)
!1000 = !DILocation(line: 240, column: 25, scope: !973)
!1001 = !DILocation(line: 240, column: 23, scope: !973)
!1002 = !DILocation(line: 241, column: 39, scope: !973)
!1003 = !DILocation(line: 241, column: 19, scope: !973)
!1004 = !DILocation(line: 241, column: 17, scope: !973)
!1005 = !DILocation(line: 243, column: 40, scope: !973)
!1006 = !DILocation(line: 243, column: 47, scope: !973)
!1007 = !DILocation(line: 243, column: 52, scope: !973)
!1008 = !DILocation(line: 243, column: 13, scope: !973)
!1009 = !DILocation(line: 245, column: 47, scope: !973)
!1010 = !DILocation(line: 245, column: 13, scope: !973)
!1011 = !DILocation(line: 248, column: 13, scope: !973)
!1012 = !DILocation(line: 250, column: 18, scope: !973)
!1013 = !DILocation(line: 251, column: 41, scope: !973)
!1014 = !DILocation(line: 251, column: 13, scope: !973)
!1015 = !DILocation(line: 253, column: 9, scope: !973)
!1016 = !DILocation(line: 255, column: 13, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !818, file: !3, line: 255, column: 13)
!1018 = !DILocation(line: 255, column: 13, scope: !818)
!1019 = !DILocation(line: 256, column: 25, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 255, column: 26)
!1021 = !DILocation(line: 257, column: 40, scope: !1020)
!1022 = !DILocation(line: 257, column: 47, scope: !1020)
!1023 = !DILocation(line: 257, column: 52, scope: !1020)
!1024 = !DILocation(line: 257, column: 13, scope: !1020)
!1025 = !DILocation(line: 259, column: 47, scope: !1020)
!1026 = !DILocation(line: 259, column: 13, scope: !1020)
!1027 = !DILocation(line: 260, column: 18, scope: !1020)
!1028 = !DILocation(line: 261, column: 9, scope: !1020)
!1029 = !DILocation(line: 263, column: 13, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !818, file: !3, line: 263, column: 13)
!1031 = !DILocation(line: 263, column: 13, scope: !818)
!1032 = !DILocation(line: 264, column: 24, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 263, column: 25)
!1034 = !DILocation(line: 265, column: 13, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 265, column: 13)
!1036 = !DILocation(line: 265, column: 13, scope: !1033)
!1037 = !DILocation(line: 266, column: 30, scope: !1033)
!1038 = !DILocation(line: 266, column: 37, scope: !1033)
!1039 = !DILocation(line: 266, column: 42, scope: !1033)
!1040 = !{!807, !726, i64 52}
!1041 = !DILocation(line: 266, column: 13, scope: !1033)
!1042 = !DILocation(line: 267, column: 41, scope: !1033)
!1043 = !DILocation(line: 267, column: 13, scope: !1033)
!1044 = !DILocation(line: 269, column: 9, scope: !1033)
