; ModuleID = 'src/core/nginx.c'
source_filename = "src/core/nginx.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_core_module_t = type { %struct.ngx_str_t, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_core_module_ctx", scope: !2, file: !3, line: 159, type: !566, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !251)
!3 = !DIFile(filename: "src/core/nginx.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !245, !61, !44, !247, !20, !47, !24, !51, !49, !249, !244}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_conf_t", file: !9, line: 117, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 86, size: 928, elements: !11)
!11 = !{!12, !18, !19, !27, !28, !30, !31, !32, !34, !35, !36, !37, !43, !46, !50, !53, !65, !66, !67, !68, !243}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !10, file: !9, line: 87, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !14, line: 80, baseType: !15)
!14 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !16, line: 140, baseType: !17)
!16 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !10, file: !9, line: 88, baseType: !13, size: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "timer_resolution", scope: !10, file: !9, line: 90, baseType: !20, size: 32, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !21, line: 16, baseType: !22)
!21 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !23, line: 16, baseType: !24)
!23 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !14, line: 79, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !16, line: 125, baseType: !26)
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timeout", scope: !10, file: !9, line: 91, baseType: !20, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "worker_processes", scope: !10, file: !9, line: 93, baseType: !29, size: 32, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !14, line: 78, baseType: !15)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "debug_points", scope: !10, file: !9, line: 94, baseType: !29, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_nofile", scope: !10, file: !9, line: 96, baseType: !29, size: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_core", scope: !10, file: !9, line: 97, baseType: !33, size: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !16, line: 222, baseType: !17)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !10, file: !9, line: 99, baseType: !17, size: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_auto", scope: !10, file: !9, line: 101, baseType: !24, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_n", scope: !10, file: !9, line: 102, baseType: !24, size: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity", scope: !10, file: !9, line: 103, baseType: !38, size: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cpuset_t", file: !40, line: 32, baseType: !41)
!40 = !DIFile(filename: "src/os/unix/ngx_setaffinity.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 196, baseType: !42)
!42 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !10, file: !9, line: 105, baseType: !44, size: 32, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !10, file: !9, line: 106, baseType: !47, size: 32, offset: 416)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !48, line: 16, baseType: !49)
!48 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !16, line: 304, baseType: !26)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !10, file: !9, line: 107, baseType: !51, size: 32, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_gid_t", file: !48, line: 17, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !16, line: 309, baseType: !26)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "working_directory", scope: !10, file: !9, line: 109, baseType: !54, size: 64, offset: 480)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !55, line: 19, baseType: !56)
!55 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 16, size: 64, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !55, line: 17, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 120, baseType: !26)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !55, line: 18, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !63, line: 64, baseType: !64)
!63 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !10, file: !9, line: 110, baseType: !54, size: 64, offset: 544)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !10, file: !9, line: 112, baseType: !54, size: 64, offset: 608)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "oldpid", scope: !10, file: !9, line: 113, baseType: !54, size: 64, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !10, file: !9, line: 115, baseType: !69, size: 160, offset: 736)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !70, line: 22, baseType: !71)
!70 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 16, size: 160, elements: !72)
!72 = !{!73, !74, !75, !76, !77}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !71, file: !70, line: 17, baseType: !6, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !71, file: !70, line: 18, baseType: !24, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !70, line: 19, baseType: !59, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !71, file: !70, line: 20, baseType: !24, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !71, file: !70, line: 21, baseType: !78, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !80, line: 18, baseType: !81)
!80 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !82, line: 57, size: 320, elements: !83)
!82 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !{!84, !92, !93, !94, !223, !230, !242}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !81, file: !82, line: 58, baseType: !85, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !82, line: 54, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 49, size: 128, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !86, file: !82, line: 50, baseType: !61, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !86, file: !82, line: 51, baseType: !61, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !82, line: 52, baseType: !78, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !86, file: !82, line: 53, baseType: !24, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !81, file: !82, line: 59, baseType: !59, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !81, file: !82, line: 60, baseType: !78, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !81, file: !82, line: 61, baseType: !95, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !80, line: 19, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !98, line: 59, size: 64, elements: !99)
!98 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = !{!100, !222}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !97, file: !98, line: 60, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !98, line: 18, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !98, line: 20, size: 352, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111, !113, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !103, file: !98, line: 21, baseType: !61, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !103, file: !98, line: 22, baseType: !61, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !103, file: !98, line: 23, baseType: !33, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !103, file: !98, line: 24, baseType: !33, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !103, file: !98, line: 26, baseType: !61, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !103, file: !98, line: 27, baseType: !61, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !103, file: !98, line: 28, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !98, line: 16, baseType: !6)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !103, file: !98, line: 29, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !80, line: 23, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !117, line: 16, size: 1216, elements: !118)
!117 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = !{!119, !122, !123, !166, !167, !168, !207, !208}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !116, file: !117, line: 17, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !121, line: 16, baseType: !17)
!121 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 18, baseType: !54, size: 64, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !116, file: !117, line: 19, baseType: !124, size: 960, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !121, line: 17, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !126, line: 4, size: 960, elements: !127)
!126 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!127 = !{!128, !130, !131, !133, !134, !136, !137, !139, !140, !141, !142, !143, !144, !145, !146, !149, !150, !152, !153, !159, !160, !161}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !125, file: !126, line: 6, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !16, line: 232, baseType: !26)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !125, file: !126, line: 7, baseType: !129, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !125, file: !126, line: 8, baseType: !132, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !16, line: 227, baseType: !26)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !125, file: !126, line: 9, baseType: !132, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !125, file: !126, line: 10, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !16, line: 217, baseType: !26)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !125, file: !126, line: 11, baseType: !135, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !125, file: !126, line: 13, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !16, line: 212, baseType: !26)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !125, file: !126, line: 14, baseType: !49, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !125, file: !126, line: 15, baseType: !52, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !125, file: !126, line: 16, baseType: !26, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !125, file: !126, line: 17, baseType: !129, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !125, file: !126, line: 18, baseType: !129, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !125, file: !126, line: 19, baseType: !33, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !125, file: !126, line: 20, baseType: !33, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !125, file: !126, line: 21, baseType: !147, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !16, line: 237, baseType: !148)
!148 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !125, file: !126, line: 22, baseType: !147, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !125, file: !126, line: 23, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !16, line: 242, baseType: !17)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !125, file: !126, line: 24, baseType: !151, size: 32, offset: 544)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !125, file: !126, line: 26, baseType: !154, size: 64, offset: 576)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !16, line: 288, size: 64, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !154, file: !16, line: 288, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !16, line: 75, baseType: !148)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !154, file: !16, line: 288, baseType: !148, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !125, file: !126, line: 27, baseType: !154, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !125, file: !126, line: 28, baseType: !154, size: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !125, file: !126, line: 29, baseType: !162, size: 192, offset: 768)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !164)
!163 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !116, file: !117, line: 21, baseType: !33, size: 32, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !116, file: !117, line: 22, baseType: !33, size: 32, offset: 1120)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !116, file: !117, line: 24, baseType: !169, size: 32, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !80, line: 20, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !172, line: 50, size: 320, elements: !173)
!172 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !188, !192, !193, !198, !199, !204, !205, !206}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !171, file: !172, line: 51, baseType: !24, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !171, file: !172, line: 52, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !80, line: 21, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !179, line: 89, size: 160, elements: !180)
!179 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!180 = !{!181, !182, !183, !187}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !178, file: !179, line: 90, baseType: !120, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 91, baseType: !54, size: 64, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !178, file: !179, line: 93, baseType: !184, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !176, !169}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !179, line: 94, baseType: !6, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !171, file: !172, line: 54, baseType: !189, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !190, line: 98, baseType: !191)
!190 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!191 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !171, file: !172, line: 56, baseType: !157, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 58, baseType: !194, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !172, line: 45, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{!61, !169, !61, !59}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 59, baseType: !6, size: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !171, file: !172, line: 61, baseType: !200, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !172, line: 46, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !169, !24, !61, !59}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !171, file: !172, line: 62, baseType: !6, size: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !171, file: !172, line: 70, baseType: !44, size: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 72, baseType: !169, size: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !116, file: !117, line: 37, baseType: !26, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !116, file: !117, line: 38, baseType: !26, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !103, file: !98, line: 30, baseType: !101, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !103, file: !98, line: 34, baseType: !26, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !103, file: !98, line: 40, baseType: !26, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !103, file: !98, line: 43, baseType: !26, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !103, file: !98, line: 45, baseType: !26, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !103, file: !98, line: 46, baseType: !26, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !103, file: !98, line: 47, baseType: !26, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !103, file: !98, line: 48, baseType: !26, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !103, file: !98, line: 49, baseType: !26, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !103, file: !98, line: 50, baseType: !26, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !103, file: !98, line: 52, baseType: !26, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !103, file: !98, line: 53, baseType: !26, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !103, file: !98, line: 55, baseType: !17, size: 32, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !98, line: 61, baseType: !95, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !81, file: !82, line: 62, baseType: !224, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !82, line: 41, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !82, line: 43, size: 64, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !82, line: 44, baseType: !224, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !226, file: !82, line: 45, baseType: !6, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !81, file: !82, line: 63, baseType: !231, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !82, line: 32, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !82, line: 34, size: 96, elements: !234)
!234 = !{!235, !240, !241}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !233, file: !82, line: 35, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !82, line: 30, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !6}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !82, line: 36, baseType: !6, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !82, line: 37, baseType: !231, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !81, file: !82, line: 64, baseType: !169, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "environment", scope: !10, file: !9, line: 116, baseType: !244, size: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !250, line: 17, baseType: !17)
!250 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!251 = !{!252, !537, !539, !541, !543, !0, !545, !550, !558, !560, !562, !564}
!252 = !DIGlobalVariableExpression(var: !253)
!253 = distinct !DIGlobalVariable(name: "ngx_core_module", scope: !2, file: !3, line: 166, type: !254, isLocal: false, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !80, line: 15, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !256, line: 222, size: 800, elements: !257)
!256 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !512, !513, !517, !521, !522, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !255, file: !256, line: 223, baseType: !24, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !255, file: !256, line: 224, baseType: !24, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !256, line: 226, baseType: !44, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !255, file: !256, line: 228, baseType: !24, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !255, file: !256, line: 229, baseType: !24, size: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !255, file: !256, line: 231, baseType: !24, size: 32, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !255, file: !256, line: 232, baseType: !245, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !255, file: !256, line: 234, baseType: !6, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !255, file: !256, line: 235, baseType: !267, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !80, line: 22, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !179, line: 77, size: 224, elements: !270)
!270 = !{!271, !272, !273, !509, !510, !511}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !179, line: 78, baseType: !54, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !179, line: 79, baseType: !24, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !269, file: !179, line: 80, baseType: !274, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!44, !277, !267, !6}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !80, line: 16, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !179, line: 116, size: 384, elements: !280)
!280 = !{!281, !282, !284, !491, !492, !493, !502, !503, !504, !505, !506, !508}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !279, file: !179, line: 117, baseType: !44, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !279, file: !179, line: 118, baseType: !283, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !279, file: !179, line: 120, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !80, line: 17, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !9, line: 38, size: 2496, elements: !288)
!288 = !{!289, !293, !294, !295, !296, !297, !427, !428, !429, !432, !433, !434, !435, !436, !437, !438, !439, !460, !461, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !287, file: !9, line: 39, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !287, file: !9, line: 40, baseType: !78, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !287, file: !9, line: 42, baseType: !169, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !287, file: !9, line: 43, baseType: !170, size: 320, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !287, file: !9, line: 45, baseType: !24, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !287, file: !9, line: 47, baseType: !298, size: 32, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !80, line: 26, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !302, line: 121, size: 896, elements: !303)
!302 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!303 = !{!304, !305, !309, !310, !311, !318, !320, !325, !330, !388, !389, !390, !391, !392, !393, !394, !395, !396, !400, !401, !402, !403, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 122, baseType: !6, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !301, file: !302, line: 123, baseType: !306, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !80, line: 24, baseType: !308)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !80, line: 24, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !301, file: !302, line: 124, baseType: !306, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !301, file: !302, line: 126, baseType: !249, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !301, file: !302, line: 128, baseType: !312, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !313, line: 19, baseType: !314)
!313 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !299, !61, !59}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !16, line: 135, baseType: !17)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !301, file: !302, line: 129, baseType: !319, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !313, line: 22, baseType: !314)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !301, file: !302, line: 130, baseType: !321, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !313, line: 20, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!317, !299, !95, !33}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !301, file: !302, line: 131, baseType: !326, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !313, line: 23, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{!95, !299, !95, !33}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !301, file: !302, line: 133, baseType: !331, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !302, line: 16, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !302, line: 18, size: 960, elements: !334)
!334 = !{!335, !336, !348, !350, !351, !352, !353, !354, !355, !356, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !333, file: !302, line: 19, baseType: !249, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !333, file: !302, line: 21, baseType: !337, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !339, line: 297, size: 128, elements: !340)
!339 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!340 = !{!341, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !338, file: !339, line: 298, baseType: !342, size: 16)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !16, line: 409, baseType: !343)
!343 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !338, file: !339, line: 299, baseType: !345, size: 112, offset: 16)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 112, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 14)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !333, file: !302, line: 22, baseType: !349, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !16, line: 404, baseType: !26)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !333, file: !302, line: 23, baseType: !59, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !333, file: !302, line: 24, baseType: !54, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !302, line: 26, baseType: !17, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !333, file: !302, line: 28, baseType: !17, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !333, file: !302, line: 29, baseType: !17, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !333, file: !302, line: 30, baseType: !17, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !333, file: !302, line: 38, baseType: !357, size: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !80, line: 32, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !299}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !333, file: !302, line: 40, baseType: !6, size: 32, offset: 352)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !333, file: !302, line: 42, baseType: !170, size: 320, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !333, file: !302, line: 43, baseType: !169, size: 32, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !333, file: !302, line: 45, baseType: !59, size: 32, offset: 736)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !333, file: !302, line: 47, baseType: !59, size: 32, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !333, file: !302, line: 49, baseType: !20, size: 32, offset: 800)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !333, file: !302, line: 51, baseType: !331, size: 32, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !333, file: !302, line: 52, baseType: !299, size: 32, offset: 864)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !333, file: !302, line: 54, baseType: !24, size: 32, offset: 896)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !333, file: !302, line: 56, baseType: !26, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !333, file: !302, line: 57, baseType: !26, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !333, file: !302, line: 58, baseType: !26, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !333, file: !302, line: 60, baseType: !26, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !333, file: !302, line: 61, baseType: !26, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !333, file: !302, line: 62, baseType: !26, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !333, file: !302, line: 63, baseType: !26, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !333, file: !302, line: 64, baseType: !26, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !333, file: !302, line: 65, baseType: !26, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !333, file: !302, line: 66, baseType: !26, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !333, file: !302, line: 67, baseType: !26, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !333, file: !302, line: 70, baseType: !26, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !333, file: !302, line: 72, baseType: !26, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !333, file: !302, line: 73, baseType: !26, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !333, file: !302, line: 74, baseType: !26, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !333, file: !302, line: 76, baseType: !26, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !333, file: !302, line: 77, baseType: !26, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !333, file: !302, line: 78, baseType: !26, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !301, file: !302, line: 135, baseType: !33, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !301, file: !302, line: 137, baseType: !169, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !301, file: !302, line: 139, baseType: !78, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !302, line: 141, baseType: !17, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !301, file: !302, line: 143, baseType: !337, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !301, file: !302, line: 144, baseType: !349, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !301, file: !302, line: 145, baseType: !54, size: 64, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !301, file: !302, line: 147, baseType: !54, size: 64, offset: 544)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !301, file: !302, line: 148, baseType: !397, size: 16, offset: 608)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !398, line: 12, baseType: !399)
!398 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !16, line: 186, baseType: !343)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !301, file: !302, line: 154, baseType: !337, size: 32, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !301, file: !302, line: 155, baseType: !349, size: 32, offset: 672)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !301, file: !302, line: 157, baseType: !101, size: 32, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !301, file: !302, line: 159, baseType: !404, size: 64, offset: 736)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !405, line: 16, baseType: !406)
!405 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !405, line: 18, size: 64, elements: !407)
!407 = !{!408, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !406, file: !405, line: 19, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !405, line: 20, baseType: !409, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !301, file: !302, line: 161, baseType: !189, size: 32, offset: 800)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !301, file: !302, line: 163, baseType: !24, size: 32, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !301, file: !302, line: 165, baseType: !26, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !301, file: !302, line: 167, baseType: !26, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !301, file: !302, line: 169, baseType: !26, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !301, file: !302, line: 170, baseType: !26, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !301, file: !302, line: 171, baseType: !26, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !301, file: !302, line: 173, baseType: !26, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !301, file: !302, line: 174, baseType: !26, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !301, file: !302, line: 175, baseType: !26, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !301, file: !302, line: 176, baseType: !26, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !301, file: !302, line: 178, baseType: !26, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !301, file: !302, line: 179, baseType: !26, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !301, file: !302, line: 180, baseType: !26, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !301, file: !302, line: 181, baseType: !26, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !301, file: !302, line: 183, baseType: !26, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !287, file: !9, line: 48, baseType: !299, size: 32, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !287, file: !9, line: 49, baseType: !24, size: 32, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !287, file: !9, line: 51, baseType: !430, size: 32, offset: 544)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !287, file: !9, line: 52, baseType: !24, size: 32, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !287, file: !9, line: 53, baseType: !24, size: 32, offset: 608)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !287, file: !9, line: 55, baseType: !404, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !287, file: !9, line: 56, baseType: !24, size: 32, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !287, file: !9, line: 58, baseType: !69, size: 160, offset: 736)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !287, file: !9, line: 59, baseType: !69, size: 160, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !287, file: !9, line: 61, baseType: !69, size: 160, offset: 1056)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !287, file: !9, line: 62, baseType: !440, size: 96, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !23, line: 32, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !23, line: 37, size: 96, elements: !442)
!442 = !{!443, !454, !455}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !441, file: !23, line: 38, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !23, line: 20, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !23, line: 22, size: 160, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !446, file: !23, line: 23, baseType: !22, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !446, file: !23, line: 24, baseType: !444, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !446, file: !23, line: 25, baseType: !444, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !446, file: !23, line: 26, baseType: !444, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !446, file: !23, line: 27, baseType: !62, size: 8, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !23, line: 28, baseType: !62, size: 8, offset: 136)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !441, file: !23, line: 39, baseType: !444, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !441, file: !23, line: 40, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !23, line: 34, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !444, !444, !444}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !287, file: !9, line: 63, baseType: !445, size: 160, offset: 1312)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !287, file: !9, line: 65, baseType: !462, size: 224, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !463, line: 31, baseType: !464)
!463 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 25, size: 224, elements: !465)
!465 = !{!466, !474, !475, !476, !477}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !464, file: !463, line: 26, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !463, line: 16, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !463, line: 18, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !469, file: !463, line: 19, baseType: !6, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !469, file: !463, line: 20, baseType: !24, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !463, line: 21, baseType: !467, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !464, file: !463, line: 27, baseType: !468, size: 96, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !463, line: 28, baseType: !59, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !464, file: !463, line: 29, baseType: !24, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !464, file: !463, line: 30, baseType: !78, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !287, file: !9, line: 66, baseType: !462, size: 224, offset: 1696)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !287, file: !9, line: 68, baseType: !24, size: 32, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !287, file: !9, line: 69, baseType: !24, size: 32, offset: 1952)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !287, file: !9, line: 71, baseType: !299, size: 32, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !287, file: !9, line: 72, baseType: !306, size: 32, offset: 2016)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !287, file: !9, line: 73, baseType: !306, size: 32, offset: 2048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !287, file: !9, line: 75, baseType: !285, size: 32, offset: 2080)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !287, file: !9, line: 77, baseType: !54, size: 64, offset: 2112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !287, file: !9, line: 78, baseType: !54, size: 64, offset: 2176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !287, file: !9, line: 79, baseType: !54, size: 64, offset: 2240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !287, file: !9, line: 80, baseType: !54, size: 64, offset: 2304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !287, file: !9, line: 81, baseType: !54, size: 64, offset: 2368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !287, file: !9, line: 82, baseType: !54, size: 64, offset: 2432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !279, file: !179, line: 121, baseType: !78, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !279, file: !179, line: 122, baseType: !78, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !279, file: !179, line: 123, baseType: !494, size: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !179, line: 103, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 98, size: 1344, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !496, file: !179, line: 99, baseType: !115, size: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !496, file: !179, line: 100, baseType: !101, size: 32, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !496, file: !179, line: 101, baseType: !101, size: 32, offset: 1248)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !496, file: !179, line: 102, baseType: !24, size: 32, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !279, file: !179, line: 124, baseType: !169, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !279, file: !179, line: 126, baseType: !6, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !279, file: !179, line: 127, baseType: !24, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !279, file: !179, line: 128, baseType: !24, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !279, file: !179, line: 130, baseType: !507, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !179, line: 112, baseType: !274)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !279, file: !179, line: 131, baseType: !44, size: 32, offset: 352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !269, file: !179, line: 81, baseType: !24, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !269, file: !179, line: 82, baseType: !24, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !269, file: !179, line: 83, baseType: !6, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !256, line: 236, baseType: !24, size: 32, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !255, file: !256, line: 238, baseType: !514, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DISubroutineType(types: !516)
!516 = !{!29, !169}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !255, file: !256, line: 240, baseType: !518, size: 32, offset: 352)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{!29, !285}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !255, file: !256, line: 242, baseType: !518, size: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !255, file: !256, line: 243, baseType: !518, size: 32, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !255, file: !256, line: 244, baseType: !524, size: 32, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !285}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !255, file: !256, line: 245, baseType: !524, size: 32, offset: 480)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !255, file: !256, line: 247, baseType: !524, size: 32, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !255, file: !256, line: 249, baseType: !25, size: 32, offset: 544)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !255, file: !256, line: 250, baseType: !25, size: 32, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !255, file: !256, line: 251, baseType: !25, size: 32, offset: 608)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !255, file: !256, line: 252, baseType: !25, size: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !255, file: !256, line: 253, baseType: !25, size: 32, offset: 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !255, file: !256, line: 254, baseType: !25, size: 32, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !255, file: !256, line: 255, baseType: !25, size: 32, offset: 736)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !255, file: !256, line: 256, baseType: !25, size: 32, offset: 768)
!537 = !DIGlobalVariableExpression(var: !538)
!538 = distinct !DIGlobalVariable(name: "ngx_show_version", scope: !2, file: !3, line: 183, type: !24, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540)
!540 = distinct !DIGlobalVariable(name: "ngx_prefix", scope: !2, file: !3, line: 185, type: !61, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542)
!542 = distinct !DIGlobalVariable(name: "ngx_signal", scope: !2, file: !3, line: 188, type: !44, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544)
!544 = distinct !DIGlobalVariable(name: "ngx_os_environ", scope: !2, file: !3, line: 191, type: !244, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546)
!546 = distinct !DIGlobalVariable(name: "ngx_core_commands", scope: !2, file: !3, line: 41, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 3808, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 17)
!550 = !DIGlobalVariableExpression(var: !551)
!551 = distinct !DIGlobalVariable(name: "ngx_debug_points", scope: !2, file: !3, line: 34, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 288, elements: !164)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_enum_t", file: !179, line: 160, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 157, size: 96, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !179, line: 158, baseType: !54, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !554, file: !179, line: 159, baseType: !24, size: 32, offset: 64)
!558 = !DIGlobalVariableExpression(var: !559)
!559 = distinct !DIGlobalVariable(name: "ngx_show_help", scope: !2, file: !3, line: 182, type: !24, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561)
!561 = distinct !DIGlobalVariable(name: "ngx_show_configure", scope: !2, file: !3, line: 184, type: !24, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563)
!563 = distinct !DIGlobalVariable(name: "ngx_conf_file", scope: !2, file: !3, line: 186, type: !61, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565)
!565 = distinct !DIGlobalVariable(name: "ngx_conf_params", scope: !2, file: !3, line: 187, type: !61, isLocal: true, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_module_t", file: !256, line: 264, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 260, size: 128, elements: !568)
!568 = !{!569, !570, !574}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !567, file: !256, line: 261, baseType: !54, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !567, file: !256, line: 262, baseType: !571, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!6, !285}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !567, file: !256, line: 263, baseType: !575, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DISubroutineType(types: !577)
!577 = !{!44, !285, !6}
!578 = !{i32 2, !"Dwarf Version", i32 4}
!579 = !{i32 2, !"Debug Info Version", i32 3}
!580 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!581 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 195, type: !582, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!17, !17, !247}
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !599}
!585 = !DILocalVariable(name: "argc", arg: 1, scope: !581, file: !3, line: 195, type: !17)
!586 = !DILocalVariable(name: "argv", arg: 2, scope: !581, file: !3, line: 195, type: !247)
!587 = !DILocalVariable(name: "b", scope: !581, file: !3, line: 197, type: !101)
!588 = !DILocalVariable(name: "log", scope: !581, file: !3, line: 198, type: !169)
!589 = !DILocalVariable(name: "i", scope: !581, file: !3, line: 199, type: !24)
!590 = !DILocalVariable(name: "cycle", scope: !581, file: !3, line: 200, type: !285)
!591 = !DILocalVariable(name: "init_cycle", scope: !581, file: !3, line: 200, type: !286)
!592 = !DILocalVariable(name: "cd", scope: !581, file: !3, line: 201, type: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_dump_t", file: !179, line: 109, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 106, size: 96, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !595, file: !179, line: 107, baseType: !54, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !595, file: !179, line: 108, baseType: !101, size: 32, offset: 64)
!599 = !DILocalVariable(name: "ccf", scope: !581, file: !3, line: 202, type: !7)
!600 = !{!601, !601, i64 0}
!601 = !{!"int", !602, i64 0}
!602 = !{!"omnipotent char", !603, i64 0}
!603 = !{!"Simple C/C++ TBAA"}
!604 = !DIExpression()
!605 = !DILocation(line: 195, column: 10, scope: !581)
!606 = !{!607, !607, i64 0}
!607 = !{!"any pointer", !602, i64 0}
!608 = !DILocation(line: 195, column: 29, scope: !581)
!609 = !DILocation(line: 197, column: 5, scope: !581)
!610 = !DILocation(line: 197, column: 23, scope: !581)
!611 = !DILocation(line: 198, column: 5, scope: !581)
!612 = !DILocation(line: 198, column: 23, scope: !581)
!613 = !DILocation(line: 199, column: 5, scope: !581)
!614 = !DILocation(line: 199, column: 23, scope: !581)
!615 = !DILocation(line: 200, column: 5, scope: !581)
!616 = !DILocation(line: 200, column: 23, scope: !581)
!617 = !DILocation(line: 200, column: 30, scope: !581)
!618 = !DILocation(line: 201, column: 5, scope: !581)
!619 = !DILocation(line: 201, column: 23, scope: !581)
!620 = !DILocation(line: 202, column: 5, scope: !581)
!621 = !DILocation(line: 202, column: 23, scope: !581)
!622 = !DILocation(line: 206, column: 9, scope: !623)
!623 = distinct !DILexicalBlock(scope: !581, file: !3, line: 206, column: 9)
!624 = !DILocation(line: 206, column: 29, scope: !623)
!625 = !DILocation(line: 206, column: 9, scope: !581)
!626 = !DILocation(line: 207, column: 9, scope: !627)
!627 = distinct !DILexicalBlock(scope: !623, file: !3, line: 206, column: 40)
!628 = !DILocation(line: 210, column: 25, scope: !629)
!629 = distinct !DILexicalBlock(scope: !581, file: !3, line: 210, column: 9)
!630 = !DILocation(line: 210, column: 31, scope: !629)
!631 = !DILocation(line: 210, column: 9, scope: !629)
!632 = !DILocation(line: 210, column: 37, scope: !629)
!633 = !DILocation(line: 210, column: 9, scope: !581)
!634 = !DILocation(line: 211, column: 9, scope: !635)
!635 = distinct !DILexicalBlock(scope: !629, file: !3, line: 210, column: 48)
!636 = !DILocation(line: 214, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !581, file: !3, line: 214, column: 9)
!638 = !DILocation(line: 214, column: 9, scope: !581)
!639 = !DILocation(line: 215, column: 9, scope: !640)
!640 = distinct !DILexicalBlock(scope: !637, file: !3, line: 214, column: 27)
!641 = !DILocation(line: 217, column: 14, scope: !642)
!642 = distinct !DILexicalBlock(scope: !640, file: !3, line: 217, column: 13)
!643 = !DILocation(line: 217, column: 13, scope: !640)
!644 = !DILocation(line: 218, column: 13, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !3, line: 217, column: 31)
!646 = !DILocation(line: 220, column: 5, scope: !640)
!647 = !DILocation(line: 222, column: 32, scope: !581)
!648 = !DILocation(line: 224, column: 5, scope: !581)
!649 = !DILocation(line: 230, column: 15, scope: !581)
!650 = !DILocation(line: 230, column: 13, scope: !581)
!651 = !DILocation(line: 232, column: 24, scope: !581)
!652 = !DILocation(line: 232, column: 11, scope: !581)
!653 = !DILocation(line: 232, column: 9, scope: !581)
!654 = !DILocation(line: 233, column: 9, scope: !655)
!655 = distinct !DILexicalBlock(scope: !581, file: !3, line: 233, column: 9)
!656 = !DILocation(line: 233, column: 13, scope: !655)
!657 = !DILocation(line: 233, column: 9, scope: !581)
!658 = !DILocation(line: 234, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !655, file: !3, line: 233, column: 22)
!660 = !DILocation(line: 247, column: 5, scope: !581)
!661 = !DILocation(line: 248, column: 22, scope: !581)
!662 = !DILocation(line: 248, column: 16, scope: !581)
!663 = !DILocation(line: 248, column: 20, scope: !581)
!664 = !{!665, !607, i64 8}
!665 = !{!"ngx_cycle_s", !607, i64 0, !607, i64 4, !607, i64 8, !666, i64 12, !601, i64 52, !607, i64 56, !607, i64 60, !601, i64 64, !607, i64 68, !601, i64 72, !601, i64 76, !668, i64 80, !601, i64 88, !669, i64 92, !669, i64 112, !669, i64 132, !670, i64 152, !671, i64 164, !672, i64 184, !672, i64 212, !601, i64 240, !601, i64 244, !607, i64 248, !607, i64 252, !607, i64 256, !607, i64 260, !674, i64 264, !674, i64 272, !674, i64 280, !674, i64 288, !674, i64 296, !674, i64 304}
!666 = !{!"ngx_log_s", !601, i64 0, !607, i64 4, !667, i64 8, !667, i64 12, !607, i64 16, !607, i64 20, !607, i64 24, !607, i64 28, !607, i64 32, !607, i64 36}
!667 = !{!"long", !602, i64 0}
!668 = !{!"ngx_queue_s", !607, i64 0, !607, i64 4}
!669 = !{!"", !607, i64 0, !601, i64 4, !601, i64 8, !601, i64 12, !607, i64 16}
!670 = !{!"ngx_rbtree_s", !607, i64 0, !607, i64 4, !607, i64 8}
!671 = !{!"ngx_rbtree_node_s", !601, i64 0, !607, i64 4, !607, i64 8, !607, i64 12, !602, i64 16, !602, i64 17}
!672 = !{!"", !607, i64 0, !673, i64 4, !601, i64 16, !601, i64 20, !607, i64 24}
!673 = !{!"ngx_list_part_s", !607, i64 0, !601, i64 4, !607, i64 8}
!674 = !{!"", !601, i64 0, !607, i64 4}
!675 = !DILocation(line: 249, column: 15, scope: !581)
!676 = !DILocation(line: 251, column: 45, scope: !581)
!677 = !DILocation(line: 251, column: 23, scope: !581)
!678 = !DILocation(line: 251, column: 16, scope: !581)
!679 = !DILocation(line: 251, column: 21, scope: !581)
!680 = !{!665, !607, i64 4}
!681 = !DILocation(line: 252, column: 20, scope: !682)
!682 = distinct !DILexicalBlock(scope: !581, file: !3, line: 252, column: 9)
!683 = !DILocation(line: 252, column: 25, scope: !682)
!684 = !DILocation(line: 252, column: 9, scope: !581)
!685 = !DILocation(line: 253, column: 9, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !3, line: 252, column: 34)
!687 = !DILocation(line: 256, column: 36, scope: !688)
!688 = distinct !DILexicalBlock(scope: !581, file: !3, line: 256, column: 9)
!689 = !DILocation(line: 256, column: 42, scope: !688)
!690 = !DILocation(line: 256, column: 9, scope: !688)
!691 = !DILocation(line: 256, column: 48, scope: !688)
!692 = !DILocation(line: 256, column: 9, scope: !581)
!693 = !DILocation(line: 257, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !688, file: !3, line: 256, column: 59)
!695 = !DILocation(line: 260, column: 9, scope: !696)
!696 = distinct !DILexicalBlock(scope: !581, file: !3, line: 260, column: 9)
!697 = !DILocation(line: 260, column: 42, scope: !696)
!698 = !DILocation(line: 260, column: 9, scope: !581)
!699 = !DILocation(line: 261, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !3, line: 260, column: 53)
!701 = !DILocation(line: 264, column: 21, scope: !702)
!702 = distinct !DILexicalBlock(scope: !581, file: !3, line: 264, column: 9)
!703 = !DILocation(line: 264, column: 9, scope: !702)
!704 = !DILocation(line: 264, column: 26, scope: !702)
!705 = !DILocation(line: 264, column: 9, scope: !581)
!706 = !DILocation(line: 265, column: 9, scope: !707)
!707 = distinct !DILexicalBlock(scope: !702, file: !3, line: 264, column: 37)
!708 = !DILocation(line: 272, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !581, file: !3, line: 272, column: 9)
!710 = !DILocation(line: 272, column: 32, scope: !709)
!711 = !DILocation(line: 272, column: 9, scope: !581)
!712 = !DILocation(line: 273, column: 9, scope: !713)
!713 = distinct !DILexicalBlock(scope: !709, file: !3, line: 272, column: 43)
!714 = !DILocation(line: 276, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !581, file: !3, line: 276, column: 9)
!716 = !DILocation(line: 276, column: 48, scope: !715)
!717 = !DILocation(line: 276, column: 9, scope: !581)
!718 = !DILocation(line: 277, column: 9, scope: !719)
!719 = distinct !DILexicalBlock(scope: !715, file: !3, line: 276, column: 59)
!720 = !DILocation(line: 280, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !581, file: !3, line: 280, column: 9)
!722 = !DILocation(line: 280, column: 31, scope: !721)
!723 = !DILocation(line: 280, column: 9, scope: !581)
!724 = !DILocation(line: 281, column: 9, scope: !725)
!725 = distinct !DILexicalBlock(scope: !721, file: !3, line: 280, column: 42)
!726 = !DILocation(line: 284, column: 13, scope: !581)
!727 = !DILocation(line: 284, column: 11, scope: !581)
!728 = !DILocation(line: 285, column: 9, scope: !729)
!729 = distinct !DILexicalBlock(scope: !581, file: !3, line: 285, column: 9)
!730 = !DILocation(line: 285, column: 15, scope: !729)
!731 = !DILocation(line: 285, column: 9, scope: !581)
!732 = !DILocation(line: 286, column: 13, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !3, line: 286, column: 13)
!734 = distinct !DILexicalBlock(scope: !729, file: !3, line: 285, column: 24)
!735 = !DILocation(line: 286, column: 13, scope: !734)
!736 = !DILocation(line: 288, column: 39, scope: !737)
!737 = distinct !DILexicalBlock(scope: !733, file: !3, line: 286, column: 30)
!738 = !DILocation(line: 288, column: 49, scope: !737)
!739 = !{!665, !607, i64 268}
!740 = !DILocation(line: 287, column: 13, scope: !737)
!741 = !DILocation(line: 289, column: 9, scope: !737)
!742 = !DILocation(line: 291, column: 9, scope: !734)
!743 = !DILocation(line: 294, column: 9, scope: !744)
!744 = distinct !DILexicalBlock(scope: !581, file: !3, line: 294, column: 9)
!745 = !DILocation(line: 294, column: 9, scope: !581)
!746 = !DILocation(line: 295, column: 14, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !3, line: 295, column: 13)
!748 = distinct !DILexicalBlock(scope: !744, file: !3, line: 294, column: 26)
!749 = !DILocation(line: 295, column: 13, scope: !748)
!750 = !DILocation(line: 297, column: 28, scope: !751)
!751 = distinct !DILexicalBlock(scope: !747, file: !3, line: 295, column: 30)
!752 = !DILocation(line: 297, column: 35, scope: !751)
!753 = !DILocation(line: 297, column: 45, scope: !751)
!754 = !DILocation(line: 296, column: 13, scope: !751)
!755 = !DILocation(line: 298, column: 9, scope: !751)
!756 = !DILocation(line: 300, column: 13, scope: !757)
!757 = distinct !DILexicalBlock(scope: !748, file: !3, line: 300, column: 13)
!758 = !DILocation(line: 300, column: 13, scope: !748)
!759 = !DILocation(line: 301, column: 18, scope: !760)
!760 = distinct !DILexicalBlock(scope: !757, file: !3, line: 300, column: 30)
!761 = !DILocation(line: 301, column: 25, scope: !760)
!762 = !DILocation(line: 301, column: 37, scope: !760)
!763 = !{!665, !607, i64 132}
!764 = !DILocation(line: 301, column: 16, scope: !760)
!765 = !DILocation(line: 303, column: 20, scope: !766)
!766 = distinct !DILexicalBlock(scope: !760, file: !3, line: 303, column: 13)
!767 = !DILocation(line: 303, column: 18, scope: !766)
!768 = !DILocation(line: 303, column: 25, scope: !769)
!769 = distinct !DILexicalBlock(scope: !766, file: !3, line: 303, column: 13)
!770 = !DILocation(line: 303, column: 29, scope: !769)
!771 = !DILocation(line: 303, column: 36, scope: !769)
!772 = !DILocation(line: 303, column: 48, scope: !769)
!773 = !{!665, !601, i64 136}
!774 = !DILocation(line: 303, column: 27, scope: !769)
!775 = !DILocation(line: 303, column: 13, scope: !766)
!776 = !DILocation(line: 305, column: 17, scope: !777)
!777 = distinct !DILexicalBlock(scope: !769, file: !3, line: 303, column: 60)
!778 = !DILocation(line: 306, column: 49, scope: !777)
!779 = !DILocation(line: 306, column: 52, scope: !777)
!780 = !DILocation(line: 306, column: 55, scope: !777)
!781 = !DILocation(line: 306, column: 60, scope: !777)
!782 = !{!783, !607, i64 4}
!783 = !{!"", !674, i64 0, !607, i64 8}
!784 = !DILocation(line: 307, column: 37, scope: !777)
!785 = !DILocation(line: 307, column: 40, scope: !777)
!786 = !DILocation(line: 307, column: 43, scope: !777)
!787 = !DILocation(line: 307, column: 48, scope: !777)
!788 = !{!783, !601, i64 0}
!789 = !DILocation(line: 306, column: 24, scope: !777)
!790 = !DILocation(line: 308, column: 17, scope: !777)
!791 = !DILocation(line: 310, column: 21, scope: !777)
!792 = !DILocation(line: 310, column: 24, scope: !777)
!793 = !DILocation(line: 310, column: 27, scope: !777)
!794 = !{!783, !607, i64 8}
!795 = !DILocation(line: 310, column: 19, scope: !777)
!796 = !DILocation(line: 312, column: 49, scope: !777)
!797 = !DILocation(line: 312, column: 52, scope: !777)
!798 = !{!799, !607, i64 0}
!799 = !{!"ngx_buf_s", !607, i64 0, !607, i64 4, !601, i64 8, !601, i64 12, !607, i64 16, !607, i64 20, !607, i64 24, !607, i64 28, !607, i64 32, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 36, !601, i64 37, !601, i64 37, !601, i64 37, !601, i64 40}
!800 = !DILocation(line: 312, column: 57, scope: !777)
!801 = !DILocation(line: 312, column: 60, scope: !777)
!802 = !{!799, !607, i64 4}
!803 = !DILocation(line: 312, column: 67, scope: !777)
!804 = !DILocation(line: 312, column: 70, scope: !777)
!805 = !DILocation(line: 312, column: 65, scope: !777)
!806 = !DILocation(line: 312, column: 24, scope: !777)
!807 = !DILocation(line: 313, column: 17, scope: !777)
!808 = !DILocation(line: 314, column: 13, scope: !777)
!809 = !DILocation(line: 303, column: 56, scope: !769)
!810 = !DILocation(line: 303, column: 13, scope: !769)
!811 = distinct !{!811, !775, !812}
!812 = !DILocation(line: 314, column: 13, scope: !766)
!813 = !DILocation(line: 315, column: 9, scope: !760)
!814 = !DILocation(line: 317, column: 9, scope: !748)
!815 = !DILocation(line: 320, column: 9, scope: !816)
!816 = distinct !DILexicalBlock(scope: !581, file: !3, line: 320, column: 9)
!817 = !DILocation(line: 320, column: 9, scope: !581)
!818 = !DILocation(line: 321, column: 35, scope: !819)
!819 = distinct !DILexicalBlock(scope: !816, file: !3, line: 320, column: 21)
!820 = !DILocation(line: 321, column: 42, scope: !819)
!821 = !DILocation(line: 321, column: 16, scope: !819)
!822 = !DILocation(line: 321, column: 9, scope: !819)
!823 = !DILocation(line: 324, column: 19, scope: !581)
!824 = !DILocation(line: 324, column: 26, scope: !581)
!825 = !DILocation(line: 324, column: 5, scope: !581)
!826 = !DILocation(line: 326, column: 17, scope: !581)
!827 = !DILocation(line: 326, column: 15, scope: !581)
!828 = !DILocation(line: 328, column: 31, scope: !581)
!829 = !{!665, !607, i64 0}
!830 = !{!831, !601, i64 4}
!831 = !{!"ngx_module_s", !601, i64 0, !601, i64 4, !607, i64 8, !601, i64 12, !601, i64 16, !601, i64 20, !607, i64 24, !607, i64 28, !607, i64 32, !601, i64 36, !607, i64 40, !607, i64 44, !607, i64 48, !607, i64 52, !607, i64 56, !607, i64 60, !607, i64 64, !601, i64 68, !601, i64 72, !601, i64 76, !601, i64 80, !601, i64 84, !601, i64 88, !601, i64 92, !601, i64 96}
!832 = !DILocation(line: 328, column: 11, scope: !581)
!833 = !DILocation(line: 328, column: 9, scope: !581)
!834 = !DILocation(line: 330, column: 9, scope: !835)
!835 = distinct !DILexicalBlock(scope: !581, file: !3, line: 330, column: 9)
!836 = !DILocation(line: 330, column: 14, scope: !835)
!837 = !{!838, !601, i64 4}
!838 = !{!"", !601, i64 0, !601, i64 4, !601, i64 8, !601, i64 12, !601, i64 16, !601, i64 20, !601, i64 24, !601, i64 28, !601, i64 32, !601, i64 36, !601, i64 40, !607, i64 44, !607, i64 48, !601, i64 52, !601, i64 56, !674, i64 60, !674, i64 68, !674, i64 76, !674, i64 84, !669, i64 92, !607, i64 112}
!839 = !DILocation(line: 330, column: 21, scope: !835)
!840 = !DILocation(line: 330, column: 24, scope: !835)
!841 = !DILocation(line: 330, column: 36, scope: !835)
!842 = !DILocation(line: 330, column: 9, scope: !581)
!843 = !DILocation(line: 331, column: 21, scope: !844)
!844 = distinct !DILexicalBlock(scope: !835, file: !3, line: 330, column: 59)
!845 = !DILocation(line: 332, column: 5, scope: !844)
!846 = !DILocation(line: 336, column: 26, scope: !847)
!847 = distinct !DILexicalBlock(scope: !581, file: !3, line: 336, column: 9)
!848 = !DILocation(line: 336, column: 33, scope: !847)
!849 = !DILocation(line: 336, column: 9, scope: !847)
!850 = !DILocation(line: 336, column: 38, scope: !847)
!851 = !DILocation(line: 336, column: 9, scope: !581)
!852 = !DILocation(line: 337, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !847, file: !3, line: 336, column: 49)
!854 = !DILocation(line: 340, column: 10, scope: !855)
!855 = distinct !DILexicalBlock(scope: !581, file: !3, line: 340, column: 9)
!856 = !DILocation(line: 340, column: 24, scope: !855)
!857 = !DILocation(line: 340, column: 27, scope: !855)
!858 = !DILocation(line: 340, column: 32, scope: !855)
!859 = !{!838, !601, i64 0}
!860 = !DILocation(line: 340, column: 9, scope: !581)
!861 = !DILocation(line: 341, column: 24, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !3, line: 341, column: 13)
!863 = distinct !DILexicalBlock(scope: !855, file: !3, line: 340, column: 40)
!864 = !DILocation(line: 341, column: 31, scope: !862)
!865 = !DILocation(line: 341, column: 13, scope: !862)
!866 = !DILocation(line: 341, column: 36, scope: !862)
!867 = !DILocation(line: 341, column: 13, scope: !863)
!868 = !DILocation(line: 342, column: 13, scope: !869)
!869 = distinct !DILexicalBlock(scope: !862, file: !3, line: 341, column: 47)
!870 = !DILocation(line: 345, column: 24, scope: !863)
!871 = !DILocation(line: 346, column: 5, scope: !863)
!872 = !DILocation(line: 348, column: 9, scope: !873)
!873 = distinct !DILexicalBlock(scope: !581, file: !3, line: 348, column: 9)
!874 = !DILocation(line: 348, column: 9, scope: !581)
!875 = !DILocation(line: 349, column: 24, scope: !876)
!876 = distinct !DILexicalBlock(scope: !873, file: !3, line: 348, column: 24)
!877 = !DILocation(line: 350, column: 5, scope: !876)
!878 = !DILocation(line: 354, column: 29, scope: !879)
!879 = distinct !DILexicalBlock(scope: !581, file: !3, line: 354, column: 9)
!880 = !DILocation(line: 354, column: 34, scope: !879)
!881 = !DILocation(line: 354, column: 39, scope: !879)
!882 = !DILocation(line: 354, column: 46, scope: !879)
!883 = !DILocation(line: 354, column: 9, scope: !879)
!884 = !DILocation(line: 354, column: 51, scope: !879)
!885 = !DILocation(line: 354, column: 9, scope: !581)
!886 = !DILocation(line: 355, column: 9, scope: !887)
!887 = distinct !DILexicalBlock(scope: !879, file: !3, line: 354, column: 62)
!888 = !DILocation(line: 358, column: 33, scope: !889)
!889 = distinct !DILexicalBlock(scope: !581, file: !3, line: 358, column: 9)
!890 = !DILocation(line: 358, column: 9, scope: !889)
!891 = !DILocation(line: 358, column: 40, scope: !889)
!892 = !DILocation(line: 358, column: 9, scope: !581)
!893 = !DILocation(line: 359, column: 9, scope: !894)
!894 = distinct !DILexicalBlock(scope: !889, file: !3, line: 358, column: 51)
!895 = !DILocation(line: 362, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !581, file: !3, line: 362, column: 9)
!897 = !DILocation(line: 362, column: 14, scope: !896)
!898 = !{!666, !607, i64 4}
!899 = !DILocation(line: 362, column: 20, scope: !896)
!900 = !{!901, !601, i64 0}
!901 = !{!"ngx_open_file_s", !601, i64 0, !674, i64 4, !607, i64 12, !607, i64 16}
!902 = !DILocation(line: 362, column: 23, scope: !896)
!903 = !DILocation(line: 362, column: 9, scope: !581)
!904 = !DILocation(line: 363, column: 28, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 363, column: 13)
!906 = distinct !DILexicalBlock(scope: !896, file: !3, line: 362, column: 38)
!907 = !DILocation(line: 363, column: 33, scope: !905)
!908 = !DILocation(line: 363, column: 39, scope: !905)
!909 = !DILocation(line: 363, column: 13, scope: !905)
!910 = !DILocation(line: 363, column: 43, scope: !905)
!911 = !DILocation(line: 363, column: 13, scope: !906)
!912 = !DILocation(line: 364, column: 13, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 364, column: 13)
!914 = distinct !DILexicalBlock(scope: !905, file: !3, line: 363, column: 62)
!915 = !{!666, !601, i64 0}
!916 = !DILocation(line: 364, column: 13, scope: !914)
!917 = !DILocation(line: 366, column: 9, scope: !914)
!918 = !DILocation(line: 367, column: 5, scope: !906)
!919 = !DILocation(line: 369, column: 20, scope: !581)
!920 = !DILocation(line: 371, column: 9, scope: !921)
!921 = distinct !DILexicalBlock(scope: !581, file: !3, line: 371, column: 9)
!922 = !DILocation(line: 371, column: 21, scope: !921)
!923 = !DILocation(line: 371, column: 9, scope: !581)
!924 = !DILocation(line: 372, column: 34, scope: !925)
!925 = distinct !DILexicalBlock(scope: !921, file: !3, line: 371, column: 44)
!926 = !DILocation(line: 372, column: 9, scope: !925)
!927 = !DILocation(line: 374, column: 5, scope: !925)
!928 = !DILocation(line: 375, column: 34, scope: !929)
!929 = distinct !DILexicalBlock(scope: !921, file: !3, line: 374, column: 12)
!930 = !DILocation(line: 375, column: 9, scope: !929)
!931 = !DILocation(line: 378, column: 5, scope: !581)
!932 = !DILocation(line: 379, column: 1, scope: !581)
!933 = distinct !DISubprogram(name: "ngx_get_options", scope: !3, file: !3, line: 735, type: !934, isLocal: true, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!29, !17, !247}
!936 = !{!937, !938, !939, !940}
!937 = !DILocalVariable(name: "argc", arg: 1, scope: !933, file: !3, line: 735, type: !17)
!938 = !DILocalVariable(name: "argv", arg: 2, scope: !933, file: !3, line: 735, type: !247)
!939 = !DILocalVariable(name: "p", scope: !933, file: !3, line: 737, type: !61)
!940 = !DILocalVariable(name: "i", scope: !933, file: !3, line: 738, type: !29)
!941 = !DILocation(line: 735, column: 21, scope: !933)
!942 = !DILocation(line: 735, column: 40, scope: !933)
!943 = !DILocation(line: 737, column: 5, scope: !933)
!944 = !DILocation(line: 737, column: 17, scope: !933)
!945 = !DILocation(line: 738, column: 5, scope: !933)
!946 = !DILocation(line: 738, column: 17, scope: !933)
!947 = !DILocation(line: 740, column: 12, scope: !948)
!948 = distinct !DILexicalBlock(scope: !933, file: !3, line: 740, column: 5)
!949 = !DILocation(line: 740, column: 10, scope: !948)
!950 = !DILocation(line: 740, column: 17, scope: !951)
!951 = distinct !DILexicalBlock(scope: !948, file: !3, line: 740, column: 5)
!952 = !DILocation(line: 740, column: 21, scope: !951)
!953 = !DILocation(line: 740, column: 19, scope: !951)
!954 = !DILocation(line: 740, column: 5, scope: !948)
!955 = !DILocation(line: 742, column: 24, scope: !956)
!956 = distinct !DILexicalBlock(scope: !951, file: !3, line: 740, column: 32)
!957 = !DILocation(line: 742, column: 29, scope: !956)
!958 = !DILocation(line: 742, column: 11, scope: !956)
!959 = !DILocation(line: 744, column: 15, scope: !960)
!960 = distinct !DILexicalBlock(scope: !956, file: !3, line: 744, column: 13)
!961 = !DILocation(line: 744, column: 13, scope: !960)
!962 = !{!602, !602, i64 0}
!963 = !DILocation(line: 744, column: 18, scope: !960)
!964 = !DILocation(line: 744, column: 13, scope: !956)
!965 = !DILocation(line: 745, column: 57, scope: !966)
!966 = distinct !DILexicalBlock(scope: !960, file: !3, line: 744, column: 26)
!967 = !DILocation(line: 745, column: 62, scope: !966)
!968 = !DILocation(line: 745, column: 13, scope: !966)
!969 = !DILocation(line: 746, column: 13, scope: !966)
!970 = !DILocation(line: 749, column: 9, scope: !956)
!971 = !DILocation(line: 749, column: 17, scope: !956)
!972 = !DILocation(line: 749, column: 16, scope: !956)
!973 = !DILocation(line: 751, column: 23, scope: !974)
!974 = distinct !DILexicalBlock(scope: !956, file: !3, line: 749, column: 20)
!975 = !DILocation(line: 751, column: 21, scope: !974)
!976 = !DILocation(line: 751, column: 13, scope: !974)
!977 = !DILocation(line: 755, column: 34, scope: !978)
!978 = distinct !DILexicalBlock(scope: !974, file: !3, line: 751, column: 27)
!979 = !DILocation(line: 756, column: 31, scope: !978)
!980 = !DILocation(line: 757, column: 17, scope: !978)
!981 = !DILocation(line: 760, column: 34, scope: !978)
!982 = !DILocation(line: 761, column: 17, scope: !978)
!983 = !DILocation(line: 764, column: 34, scope: !978)
!984 = !DILocation(line: 765, column: 36, scope: !978)
!985 = !DILocation(line: 766, column: 17, scope: !978)
!986 = !DILocation(line: 769, column: 33, scope: !978)
!987 = !DILocation(line: 770, column: 17, scope: !978)
!988 = !DILocation(line: 773, column: 33, scope: !978)
!989 = !DILocation(line: 774, column: 33, scope: !978)
!990 = !DILocation(line: 775, column: 17, scope: !978)
!991 = !DILocation(line: 778, column: 32, scope: !978)
!992 = !DILocation(line: 779, column: 17, scope: !978)
!993 = !DILocation(line: 782, column: 22, scope: !994)
!994 = distinct !DILexicalBlock(scope: !978, file: !3, line: 782, column: 21)
!995 = !DILocation(line: 782, column: 21, scope: !994)
!996 = !DILocation(line: 782, column: 21, scope: !978)
!997 = !DILocation(line: 783, column: 34, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !3, line: 782, column: 25)
!999 = !DILocation(line: 783, column: 32, scope: !998)
!1000 = !DILocation(line: 784, column: 21, scope: !998)
!1001 = !DILocation(line: 787, column: 21, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !978, file: !3, line: 787, column: 21)
!1003 = !DILocation(line: 787, column: 26, scope: !1002)
!1004 = !DILocation(line: 787, column: 21, scope: !978)
!1005 = !DILocation(line: 788, column: 45, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 787, column: 32)
!1007 = !DILocation(line: 788, column: 50, scope: !1006)
!1008 = !DILocation(line: 788, column: 32, scope: !1006)
!1009 = !DILocation(line: 789, column: 21, scope: !1006)
!1010 = !DILocation(line: 792, column: 17, scope: !978)
!1011 = !DILocation(line: 793, column: 17, scope: !978)
!1012 = !DILocation(line: 796, column: 22, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !978, file: !3, line: 796, column: 21)
!1014 = !DILocation(line: 796, column: 21, scope: !1013)
!1015 = !DILocation(line: 796, column: 21, scope: !978)
!1016 = !DILocation(line: 797, column: 37, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 796, column: 25)
!1018 = !DILocation(line: 797, column: 35, scope: !1017)
!1019 = !DILocation(line: 798, column: 21, scope: !1017)
!1020 = !DILocation(line: 801, column: 21, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !978, file: !3, line: 801, column: 21)
!1022 = !DILocation(line: 801, column: 26, scope: !1021)
!1023 = !DILocation(line: 801, column: 21, scope: !978)
!1024 = !DILocation(line: 802, column: 48, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 801, column: 32)
!1026 = !DILocation(line: 802, column: 53, scope: !1025)
!1027 = !DILocation(line: 802, column: 35, scope: !1025)
!1028 = !DILocation(line: 803, column: 21, scope: !1025)
!1029 = !DILocation(line: 806, column: 17, scope: !978)
!1030 = !DILocation(line: 807, column: 17, scope: !978)
!1031 = !DILocation(line: 810, column: 22, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !978, file: !3, line: 810, column: 21)
!1033 = !DILocation(line: 810, column: 21, scope: !1032)
!1034 = !DILocation(line: 810, column: 21, scope: !978)
!1035 = !DILocation(line: 811, column: 39, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 810, column: 25)
!1037 = !DILocation(line: 811, column: 37, scope: !1036)
!1038 = !DILocation(line: 812, column: 21, scope: !1036)
!1039 = !DILocation(line: 815, column: 21, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !978, file: !3, line: 815, column: 21)
!1041 = !DILocation(line: 815, column: 26, scope: !1040)
!1042 = !DILocation(line: 815, column: 21, scope: !978)
!1043 = !DILocation(line: 816, column: 50, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 815, column: 32)
!1045 = !DILocation(line: 816, column: 55, scope: !1044)
!1046 = !DILocation(line: 816, column: 37, scope: !1044)
!1047 = !DILocation(line: 817, column: 21, scope: !1044)
!1048 = !DILocation(line: 820, column: 17, scope: !978)
!1049 = !DILocation(line: 821, column: 17, scope: !978)
!1050 = !DILocation(line: 824, column: 22, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !978, file: !3, line: 824, column: 21)
!1052 = !DILocation(line: 824, column: 21, scope: !1051)
!1053 = !DILocation(line: 824, column: 21, scope: !978)
!1054 = !DILocation(line: 825, column: 43, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 824, column: 25)
!1056 = !DILocation(line: 825, column: 32, scope: !1055)
!1057 = !DILocation(line: 827, column: 17, scope: !1055)
!1058 = !DILocation(line: 827, column: 28, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 827, column: 28)
!1060 = !DILocation(line: 827, column: 33, scope: !1059)
!1061 = !DILocation(line: 827, column: 28, scope: !1051)
!1062 = !DILocation(line: 828, column: 34, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 827, column: 39)
!1064 = !DILocation(line: 828, column: 39, scope: !1063)
!1065 = !DILocation(line: 828, column: 32, scope: !1063)
!1066 = !DILocation(line: 830, column: 17, scope: !1063)
!1067 = !DILocation(line: 831, column: 21, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 830, column: 24)
!1069 = !DILocation(line: 832, column: 21, scope: !1068)
!1070 = !DILocation(line: 835, column: 21, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !978, file: !3, line: 835, column: 21)
!1072 = !DILocation(line: 835, column: 52, scope: !1071)
!1073 = !DILocation(line: 836, column: 21, scope: !1071)
!1074 = !DILocation(line: 836, column: 24, scope: !1071)
!1075 = !DILocation(line: 836, column: 55, scope: !1071)
!1076 = !DILocation(line: 837, column: 21, scope: !1071)
!1077 = !DILocation(line: 837, column: 24, scope: !1071)
!1078 = !DILocation(line: 837, column: 57, scope: !1071)
!1079 = !DILocation(line: 838, column: 21, scope: !1071)
!1080 = !DILocation(line: 838, column: 24, scope: !1071)
!1081 = !DILocation(line: 838, column: 57, scope: !1071)
!1082 = !DILocation(line: 835, column: 21, scope: !978)
!1083 = !DILocation(line: 840, column: 33, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 839, column: 17)
!1085 = !DILocation(line: 841, column: 21, scope: !1084)
!1086 = !DILocation(line: 844, column: 64, scope: !978)
!1087 = !DILocation(line: 844, column: 17, scope: !978)
!1088 = !DILocation(line: 845, column: 17, scope: !978)
!1089 = !DILocation(line: 848, column: 63, scope: !978)
!1090 = !DILocation(line: 848, column: 65, scope: !978)
!1091 = !DILocation(line: 848, column: 61, scope: !978)
!1092 = !DILocation(line: 848, column: 17, scope: !978)
!1093 = !DILocation(line: 849, column: 17, scope: !978)
!1094 = distinct !{!1094, !970, !1095}
!1095 = !DILocation(line: 851, column: 9, scope: !956)
!1096 = !DILocation(line: 855, column: 9, scope: !956)
!1097 = !DILocation(line: 740, column: 28, scope: !951)
!1098 = !DILocation(line: 740, column: 5, scope: !951)
!1099 = distinct !{!1099, !954, !1100}
!1100 = !DILocation(line: 856, column: 5, scope: !948)
!1101 = !DILocation(line: 858, column: 5, scope: !933)
!1102 = !DILocation(line: 859, column: 1, scope: !933)
!1103 = distinct !DISubprogram(name: "ngx_show_version_info", scope: !3, file: !3, line: 383, type: !1104, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !4)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{null}
!1106 = !DILocation(line: 385, column: 5, scope: !1103)
!1107 = !DILocation(line: 387, column: 9, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 387, column: 9)
!1109 = !DILocation(line: 387, column: 9, scope: !1103)
!1110 = !DILocation(line: 388, column: 9, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 387, column: 24)
!1112 = !DILocation(line: 415, column: 5, scope: !1111)
!1113 = !DILocation(line: 417, column: 9, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 417, column: 9)
!1115 = !DILocation(line: 417, column: 9, scope: !1103)
!1116 = !DILocation(line: 420, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 417, column: 29)
!1118 = !DILocation(line: 439, column: 9, scope: !1117)
!1119 = !DILocation(line: 440, column: 5, scope: !1117)
!1120 = !DILocation(line: 441, column: 1, scope: !1103)
!1121 = distinct !DISubprogram(name: "ngx_save_argv", scope: !3, file: !3, line: 863, type: !1122, isLocal: true, isDefinition: true, scopeLine: 864, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1124)
!1122 = !DISubroutineType(types: !1123)
