; ModuleID = 'src/core/ngx_hash.c'
source_filename = "src/core/ngx_hash.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_hash_t = type { %struct.ngx_hash_elt_t**, i32 }
%struct.ngx_hash_elt_t = type { i8*, i16, [1 x i8] }
%struct.ngx_hash_wildcard_t = type { %struct.ngx_hash_t, i8* }
%struct.ngx_hash_combined_t = type { %struct.ngx_hash_t, %struct.ngx_hash_wildcard_t*, %struct.ngx_hash_wildcard_t* }
%struct.ngx_hash_init_t = type { %struct.ngx_hash_t*, i32 (i8*, i32)*, i32, i32, i8*, %struct.ngx_pool_s*, %struct.ngx_pool_s* }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_hash.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !8, !24, !25, !26, !28, !15, !37, !40, !43, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_elt_t", file: !10, line: 20, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_hash.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 16, size: 64, elements: !12)
!12 = !{!13, !14, !18}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !11, file: !10, line: 17, baseType: !4, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, file: !10, line: 18, baseType: !15, size: 16, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !16, line: 65, baseType: !17)
!16 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !10, line: 19, baseType: !19, size: 8, offset: 48)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !22)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !16, line: 64, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !{!23}
!23 = !DISubrange(count: 1)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !7)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !27, line: 79, baseType: !25)
!27 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_wildcard_t", file: !10, line: 32, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 29, size: 96, elements: !31)
!31 = !{!32, !39}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !30, file: !10, line: 30, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_t", file: !10, line: 26, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 23, size: 64, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !34, file: !10, line: 24, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !34, file: !10, line: 25, baseType: !26, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !10, line: 31, baseType: !4, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_t", file: !10, line: 39, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 35, size: 128, elements: !46)
!46 = !{!47, !54, !55}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !45, file: !10, line: 36, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !49, line: 19, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 16, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !49, line: 17, baseType: !5, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !49, line: 18, baseType: !24, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !45, file: !10, line: 37, baseType: !26, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !45, file: !10, line: 38, baseType: !4, size: 32, offset: 96)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!59 = distinct !DISubprogram(name: "ngx_hash_find", scope: !1, file: !1, line: 13, type: !60, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !63)
!60 = !DISubroutineType(types: !61)
!61 = !{!4, !62, !26, !24, !5}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DILocalVariable(name: "hash", arg: 1, scope: !59, file: !1, line: 13, type: !62)
!65 = !DILocalVariable(name: "key", arg: 2, scope: !59, file: !1, line: 13, type: !26)
!66 = !DILocalVariable(name: "name", arg: 3, scope: !59, file: !1, line: 13, type: !24)
!67 = !DILocalVariable(name: "len", arg: 4, scope: !59, file: !1, line: 13, type: !5)
!68 = !DILocalVariable(name: "i", scope: !59, file: !1, line: 15, type: !26)
!69 = !DILocalVariable(name: "elt", scope: !59, file: !1, line: 16, type: !8)
!70 = !{!71, !71, i64 0}
!71 = !{!"any pointer", !72, i64 0}
!72 = !{!"omnipotent char", !73, i64 0}
!73 = !{!"Simple C/C++ TBAA"}
!74 = !DIExpression()
!75 = !DILocation(line: 13, column: 27, scope: !59)
!76 = !{!77, !77, i64 0}
!77 = !{!"int", !72, i64 0}
!78 = !DILocation(line: 13, column: 44, scope: !59)
!79 = !DILocation(line: 13, column: 57, scope: !59)
!80 = !DILocation(line: 13, column: 70, scope: !59)
!81 = !DILocation(line: 15, column: 5, scope: !59)
!82 = !DILocation(line: 15, column: 22, scope: !59)
!83 = !DILocation(line: 16, column: 5, scope: !59)
!84 = !DILocation(line: 16, column: 22, scope: !59)
!85 = !DILocation(line: 22, column: 11, scope: !59)
!86 = !DILocation(line: 22, column: 17, scope: !59)
!87 = !{!88, !71, i64 0}
!88 = !{!"", !71, i64 0, !77, i64 4}
!89 = !DILocation(line: 22, column: 25, scope: !59)
!90 = !DILocation(line: 22, column: 31, scope: !59)
!91 = !DILocation(line: 22, column: 37, scope: !59)
!92 = !{!88, !77, i64 4}
!93 = !DILocation(line: 22, column: 29, scope: !59)
!94 = !DILocation(line: 22, column: 9, scope: !59)
!95 = !DILocation(line: 24, column: 9, scope: !96)
!96 = distinct !DILexicalBlock(scope: !59, file: !1, line: 24, column: 9)
!97 = !DILocation(line: 24, column: 13, scope: !96)
!98 = !DILocation(line: 24, column: 9, scope: !59)
!99 = !DILocation(line: 25, column: 9, scope: !100)
!100 = distinct !DILexicalBlock(scope: !96, file: !1, line: 24, column: 22)
!101 = !DILocation(line: 28, column: 5, scope: !59)
!102 = !DILocation(line: 28, column: 12, scope: !59)
!103 = !DILocation(line: 28, column: 17, scope: !59)
!104 = !{!105, !71, i64 0}
!105 = !{!"", !71, i64 0, !106, i64 4, !72, i64 6}
!106 = !{!"short", !72, i64 0}
!107 = !DILocation(line: 29, column: 13, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !1, line: 29, column: 13)
!109 = distinct !DILexicalBlock(scope: !59, file: !1, line: 28, column: 24)
!110 = !DILocation(line: 29, column: 29, scope: !108)
!111 = !DILocation(line: 29, column: 34, scope: !108)
!112 = !{!105, !106, i64 4}
!113 = !DILocation(line: 29, column: 20, scope: !108)
!114 = !DILocation(line: 29, column: 17, scope: !108)
!115 = !DILocation(line: 29, column: 13, scope: !109)
!116 = !DILocation(line: 30, column: 13, scope: !117)
!117 = distinct !DILexicalBlock(scope: !108, file: !1, line: 29, column: 39)
!118 = !DILocation(line: 33, column: 16, scope: !119)
!119 = distinct !DILexicalBlock(scope: !109, file: !1, line: 33, column: 9)
!120 = !DILocation(line: 33, column: 14, scope: !119)
!121 = !DILocation(line: 33, column: 21, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !1, line: 33, column: 9)
!123 = !DILocation(line: 33, column: 25, scope: !122)
!124 = !DILocation(line: 33, column: 23, scope: !122)
!125 = !DILocation(line: 33, column: 9, scope: !119)
!126 = !DILocation(line: 34, column: 17, scope: !127)
!127 = distinct !DILexicalBlock(scope: !128, file: !1, line: 34, column: 17)
!128 = distinct !DILexicalBlock(scope: !122, file: !1, line: 33, column: 35)
!129 = !DILocation(line: 34, column: 22, scope: !127)
!130 = !{!72, !72, i64 0}
!131 = !DILocation(line: 34, column: 28, scope: !127)
!132 = !DILocation(line: 34, column: 33, scope: !127)
!133 = !DILocation(line: 34, column: 38, scope: !127)
!134 = !DILocation(line: 34, column: 25, scope: !127)
!135 = !DILocation(line: 34, column: 17, scope: !128)
!136 = !DILocation(line: 35, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !127, file: !1, line: 34, column: 42)
!138 = !DILocation(line: 37, column: 9, scope: !128)
!139 = !DILocation(line: 33, column: 31, scope: !122)
!140 = !DILocation(line: 33, column: 9, scope: !122)
!141 = distinct !{!141, !125, !142}
!142 = !DILocation(line: 37, column: 9, scope: !119)
!143 = !DILocation(line: 39, column: 16, scope: !109)
!144 = !DILocation(line: 39, column: 21, scope: !109)
!145 = !DILocation(line: 39, column: 9, scope: !109)
!146 = !DILocation(line: 43, column: 34, scope: !109)
!147 = !DILocation(line: 43, column: 15, scope: !109)
!148 = !DILocation(line: 43, column: 13, scope: !109)
!149 = !DILocation(line: 45, column: 9, scope: !109)
!150 = distinct !{!150, !101, !151}
!151 = !DILocation(line: 46, column: 5, scope: !59)
!152 = !DILocation(line: 48, column: 5, scope: !59)
!153 = !DILocation(line: 49, column: 1, scope: !59)
!154 = distinct !DISubprogram(name: "ngx_hash_find_wc_head", scope: !1, file: !1, line: 53, type: !155, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!4, !28, !24, !5}
!157 = !{!158, !159, !160, !161, !162, !163, !164}
!158 = !DILocalVariable(name: "hwc", arg: 1, scope: !154, file: !1, line: 53, type: !28)
!159 = !DILocalVariable(name: "name", arg: 2, scope: !154, file: !1, line: 53, type: !24)
!160 = !DILocalVariable(name: "len", arg: 3, scope: !154, file: !1, line: 53, type: !5)
!161 = !DILocalVariable(name: "value", scope: !154, file: !1, line: 55, type: !4)
!162 = !DILocalVariable(name: "i", scope: !154, file: !1, line: 56, type: !26)
!163 = !DILocalVariable(name: "n", scope: !154, file: !1, line: 56, type: !26)
!164 = !DILocalVariable(name: "key", scope: !154, file: !1, line: 56, type: !26)
!165 = !DILocation(line: 53, column: 44, scope: !154)
!166 = !DILocation(line: 53, column: 57, scope: !154)
!167 = !DILocation(line: 53, column: 70, scope: !154)
!168 = !DILocation(line: 55, column: 5, scope: !154)
!169 = !DILocation(line: 55, column: 18, scope: !154)
!170 = !DILocation(line: 56, column: 5, scope: !154)
!171 = !DILocation(line: 56, column: 18, scope: !154)
!172 = !DILocation(line: 56, column: 21, scope: !154)
!173 = !DILocation(line: 56, column: 24, scope: !154)
!174 = !DILocation(line: 62, column: 9, scope: !154)
!175 = !DILocation(line: 62, column: 7, scope: !154)
!176 = !DILocation(line: 64, column: 5, scope: !154)
!177 = !DILocation(line: 64, column: 12, scope: !154)
!178 = !DILocation(line: 65, column: 13, scope: !179)
!179 = distinct !DILexicalBlock(scope: !180, file: !1, line: 65, column: 13)
!180 = distinct !DILexicalBlock(scope: !154, file: !1, line: 64, column: 15)
!181 = !DILocation(line: 65, column: 18, scope: !179)
!182 = !DILocation(line: 65, column: 20, scope: !179)
!183 = !DILocation(line: 65, column: 25, scope: !179)
!184 = !DILocation(line: 65, column: 13, scope: !180)
!185 = !DILocation(line: 66, column: 13, scope: !186)
!186 = distinct !DILexicalBlock(scope: !179, file: !1, line: 65, column: 33)
!187 = !DILocation(line: 69, column: 10, scope: !180)
!188 = distinct !{!188, !176, !189}
!189 = !DILocation(line: 70, column: 5, scope: !154)
!190 = !DILocation(line: 72, column: 9, scope: !154)
!191 = !DILocation(line: 74, column: 14, scope: !192)
!192 = distinct !DILexicalBlock(scope: !154, file: !1, line: 74, column: 5)
!193 = !DILocation(line: 74, column: 12, scope: !192)
!194 = !DILocation(line: 74, column: 10, scope: !192)
!195 = !DILocation(line: 74, column: 17, scope: !196)
!196 = distinct !DILexicalBlock(scope: !192, file: !1, line: 74, column: 5)
!197 = !DILocation(line: 74, column: 21, scope: !196)
!198 = !DILocation(line: 74, column: 19, scope: !196)
!199 = !DILocation(line: 74, column: 5, scope: !192)
!200 = !DILocation(line: 75, column: 15, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !1, line: 74, column: 31)
!202 = !DILocation(line: 75, column: 13, scope: !201)
!203 = !DILocation(line: 76, column: 5, scope: !201)
!204 = !DILocation(line: 74, column: 27, scope: !196)
!205 = !DILocation(line: 74, column: 5, scope: !196)
!206 = distinct !{!206, !199, !207}
!207 = !DILocation(line: 76, column: 5, scope: !192)
!208 = !DILocation(line: 82, column: 28, scope: !154)
!209 = !DILocation(line: 82, column: 33, scope: !154)
!210 = !DILocation(line: 82, column: 39, scope: !154)
!211 = !DILocation(line: 82, column: 45, scope: !154)
!212 = !DILocation(line: 82, column: 50, scope: !154)
!213 = !DILocation(line: 82, column: 54, scope: !154)
!214 = !DILocation(line: 82, column: 60, scope: !154)
!215 = !DILocation(line: 82, column: 58, scope: !154)
!216 = !DILocation(line: 82, column: 13, scope: !154)
!217 = !DILocation(line: 82, column: 11, scope: !154)
!218 = !DILocation(line: 88, column: 9, scope: !219)
!219 = distinct !DILexicalBlock(scope: !154, file: !1, line: 88, column: 9)
!220 = !DILocation(line: 88, column: 9, scope: !154)
!221 = !DILocation(line: 101, column: 25, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !1, line: 101, column: 13)
!223 = distinct !DILexicalBlock(scope: !219, file: !1, line: 88, column: 16)
!224 = !DILocation(line: 101, column: 13, scope: !222)
!225 = !DILocation(line: 101, column: 31, scope: !222)
!226 = !DILocation(line: 101, column: 13, scope: !223)
!227 = !DILocation(line: 103, column: 17, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !1, line: 103, column: 17)
!229 = distinct !DILexicalBlock(scope: !222, file: !1, line: 101, column: 36)
!230 = !DILocation(line: 103, column: 19, scope: !228)
!231 = !DILocation(line: 103, column: 17, scope: !229)
!232 = !DILocation(line: 107, column: 33, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !1, line: 107, column: 21)
!234 = distinct !DILexicalBlock(scope: !228, file: !1, line: 103, column: 25)
!235 = !DILocation(line: 107, column: 21, scope: !233)
!236 = !DILocation(line: 107, column: 39, scope: !233)
!237 = !DILocation(line: 107, column: 21, scope: !234)
!238 = !DILocation(line: 108, column: 21, scope: !239)
!239 = distinct !DILexicalBlock(scope: !233, file: !1, line: 107, column: 44)
!240 = !DILocation(line: 112, column: 56, scope: !234)
!241 = !DILocation(line: 112, column: 44, scope: !234)
!242 = !DILocation(line: 112, column: 62, scope: !234)
!243 = !DILocation(line: 111, column: 23, scope: !234)
!244 = !DILocation(line: 111, column: 21, scope: !234)
!245 = !DILocation(line: 113, column: 24, scope: !234)
!246 = !DILocation(line: 113, column: 29, scope: !234)
!247 = !{!248, !71, i64 8}
!248 = !{!"", !88, i64 0, !71, i64 8}
!249 = !DILocation(line: 113, column: 17, scope: !234)
!250 = !DILocation(line: 116, column: 56, scope: !229)
!251 = !DILocation(line: 116, column: 44, scope: !229)
!252 = !DILocation(line: 116, column: 62, scope: !229)
!253 = !DILocation(line: 116, column: 19, scope: !229)
!254 = !DILocation(line: 116, column: 17, scope: !229)
!255 = !DILocation(line: 118, column: 43, scope: !229)
!256 = !DILocation(line: 118, column: 48, scope: !229)
!257 = !DILocation(line: 118, column: 54, scope: !229)
!258 = !DILocation(line: 118, column: 56, scope: !229)
!259 = !DILocation(line: 118, column: 21, scope: !229)
!260 = !DILocation(line: 118, column: 19, scope: !229)
!261 = !DILocation(line: 120, column: 17, scope: !262)
!262 = distinct !DILexicalBlock(scope: !229, file: !1, line: 120, column: 17)
!263 = !DILocation(line: 120, column: 17, scope: !229)
!264 = !DILocation(line: 121, column: 24, scope: !265)
!265 = distinct !DILexicalBlock(scope: !262, file: !1, line: 120, column: 24)
!266 = !DILocation(line: 121, column: 17, scope: !265)
!267 = !DILocation(line: 124, column: 20, scope: !229)
!268 = !DILocation(line: 124, column: 25, scope: !229)
!269 = !DILocation(line: 124, column: 13, scope: !229)
!270 = !DILocation(line: 127, column: 25, scope: !271)
!271 = distinct !DILexicalBlock(scope: !223, file: !1, line: 127, column: 13)
!272 = !DILocation(line: 127, column: 13, scope: !271)
!273 = !DILocation(line: 127, column: 31, scope: !271)
!274 = !DILocation(line: 127, column: 13, scope: !223)
!275 = !DILocation(line: 129, column: 17, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !1, line: 129, column: 17)
!277 = distinct !DILexicalBlock(scope: !271, file: !1, line: 127, column: 36)
!278 = !DILocation(line: 129, column: 19, scope: !276)
!279 = !DILocation(line: 129, column: 17, scope: !277)
!280 = !DILocation(line: 133, column: 17, scope: !281)
!281 = distinct !DILexicalBlock(scope: !276, file: !1, line: 129, column: 25)
!282 = !DILocation(line: 136, column: 42, scope: !277)
!283 = !DILocation(line: 136, column: 30, scope: !277)
!284 = !DILocation(line: 136, column: 48, scope: !277)
!285 = !DILocation(line: 136, column: 20, scope: !277)
!286 = !DILocation(line: 136, column: 13, scope: !277)
!287 = !DILocation(line: 139, column: 16, scope: !223)
!288 = !DILocation(line: 139, column: 9, scope: !223)
!289 = !DILocation(line: 142, column: 12, scope: !154)
!290 = !DILocation(line: 142, column: 17, scope: !154)
!291 = !DILocation(line: 142, column: 5, scope: !154)
!292 = !DILocation(line: 143, column: 1, scope: !154)
!293 = distinct !DISubprogram(name: "ngx_hash_find_wc_tail", scope: !1, file: !1, line: 147, type: !155, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !294)
!294 = !{!295, !296, !297, !298, !299, !300}
!295 = !DILocalVariable(name: "hwc", arg: 1, scope: !293, file: !1, line: 147, type: !28)
!296 = !DILocalVariable(name: "name", arg: 2, scope: !293, file: !1, line: 147, type: !24)
!297 = !DILocalVariable(name: "len", arg: 3, scope: !293, file: !1, line: 147, type: !5)
!298 = !DILocalVariable(name: "value", scope: !293, file: !1, line: 149, type: !4)
!299 = !DILocalVariable(name: "i", scope: !293, file: !1, line: 150, type: !26)
!300 = !DILocalVariable(name: "key", scope: !293, file: !1, line: 150, type: !26)
!301 = !DILocation(line: 147, column: 44, scope: !293)
!302 = !DILocation(line: 147, column: 57, scope: !293)
!303 = !DILocation(line: 147, column: 70, scope: !293)
!304 = !DILocation(line: 149, column: 5, scope: !293)
!305 = !DILocation(line: 149, column: 18, scope: !293)
!306 = !DILocation(line: 150, column: 5, scope: !293)
!307 = !DILocation(line: 150, column: 18, scope: !293)
!308 = !DILocation(line: 150, column: 21, scope: !293)
!309 = !DILocation(line: 156, column: 9, scope: !293)
!310 = !DILocation(line: 158, column: 12, scope: !311)
!311 = distinct !DILexicalBlock(scope: !293, file: !1, line: 158, column: 5)
!312 = !DILocation(line: 158, column: 10, scope: !311)
!313 = !DILocation(line: 158, column: 17, scope: !314)
!314 = distinct !DILexicalBlock(scope: !311, file: !1, line: 158, column: 5)
!315 = !DILocation(line: 158, column: 21, scope: !314)
!316 = !DILocation(line: 158, column: 19, scope: !314)
!317 = !DILocation(line: 158, column: 5, scope: !311)
!318 = !DILocation(line: 159, column: 13, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !1, line: 159, column: 13)
!320 = distinct !DILexicalBlock(scope: !314, file: !1, line: 158, column: 31)
!321 = !DILocation(line: 159, column: 18, scope: !319)
!322 = !DILocation(line: 159, column: 21, scope: !319)
!323 = !DILocation(line: 159, column: 13, scope: !320)
!324 = !DILocation(line: 160, column: 13, scope: !325)
!325 = distinct !DILexicalBlock(scope: !319, file: !1, line: 159, column: 29)
!326 = !DILocation(line: 163, column: 15, scope: !320)
!327 = !DILocation(line: 163, column: 13, scope: !320)
!328 = !DILocation(line: 164, column: 5, scope: !320)
!329 = !DILocation(line: 158, column: 27, scope: !314)
!330 = !DILocation(line: 158, column: 5, scope: !314)
!331 = distinct !{!331, !317, !332}
!332 = !DILocation(line: 164, column: 5, scope: !311)
!333 = !DILocation(line: 166, column: 9, scope: !334)
!334 = distinct !DILexicalBlock(scope: !293, file: !1, line: 166, column: 9)
!335 = !DILocation(line: 166, column: 14, scope: !334)
!336 = !DILocation(line: 166, column: 11, scope: !334)
!337 = !DILocation(line: 166, column: 9, scope: !293)
!338 = !DILocation(line: 167, column: 9, scope: !339)
!339 = distinct !DILexicalBlock(scope: !334, file: !1, line: 166, column: 19)
!340 = !DILocation(line: 174, column: 28, scope: !293)
!341 = !DILocation(line: 174, column: 33, scope: !293)
!342 = !DILocation(line: 174, column: 39, scope: !293)
!343 = !DILocation(line: 174, column: 44, scope: !293)
!344 = !DILocation(line: 174, column: 50, scope: !293)
!345 = !DILocation(line: 174, column: 13, scope: !293)
!346 = !DILocation(line: 174, column: 11, scope: !293)
!347 = !DILocation(line: 180, column: 9, scope: !348)
!348 = distinct !DILexicalBlock(scope: !293, file: !1, line: 180, column: 9)
!349 = !DILocation(line: 180, column: 9, scope: !293)
!350 = !DILocation(line: 188, column: 25, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !1, line: 188, column: 13)
!352 = distinct !DILexicalBlock(scope: !348, file: !1, line: 180, column: 16)
!353 = !DILocation(line: 188, column: 13, scope: !351)
!354 = !DILocation(line: 188, column: 31, scope: !351)
!355 = !DILocation(line: 188, column: 13, scope: !352)
!356 = !DILocation(line: 190, column: 14, scope: !357)
!357 = distinct !DILexicalBlock(scope: !351, file: !1, line: 188, column: 36)
!358 = !DILocation(line: 192, column: 56, scope: !357)
!359 = !DILocation(line: 192, column: 44, scope: !357)
!360 = !DILocation(line: 192, column: 62, scope: !357)
!361 = !DILocation(line: 192, column: 19, scope: !357)
!362 = !DILocation(line: 192, column: 17, scope: !357)
!363 = !DILocation(line: 194, column: 43, scope: !357)
!364 = !DILocation(line: 194, column: 49, scope: !357)
!365 = !DILocation(line: 194, column: 54, scope: !357)
!366 = !DILocation(line: 194, column: 58, scope: !357)
!367 = !DILocation(line: 194, column: 64, scope: !357)
!368 = !DILocation(line: 194, column: 62, scope: !357)
!369 = !DILocation(line: 194, column: 21, scope: !357)
!370 = !DILocation(line: 194, column: 19, scope: !357)
!371 = !DILocation(line: 196, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !357, file: !1, line: 196, column: 17)
!373 = !DILocation(line: 196, column: 17, scope: !357)
!374 = !DILocation(line: 197, column: 24, scope: !375)
!375 = distinct !DILexicalBlock(scope: !372, file: !1, line: 196, column: 24)
!376 = !DILocation(line: 197, column: 17, scope: !375)
!377 = !DILocation(line: 200, column: 20, scope: !357)
!378 = !DILocation(line: 200, column: 25, scope: !357)
!379 = !DILocation(line: 200, column: 13, scope: !357)
!380 = !DILocation(line: 203, column: 16, scope: !352)
!381 = !DILocation(line: 203, column: 9, scope: !352)
!382 = !DILocation(line: 206, column: 12, scope: !293)
!383 = !DILocation(line: 206, column: 17, scope: !293)
!384 = !DILocation(line: 206, column: 5, scope: !293)
!385 = !DILocation(line: 207, column: 1, scope: !293)
!386 = distinct !DISubprogram(name: "ngx_hash_find_combined", scope: !1, file: !1, line: 211, type: !387, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !396)
!387 = !DISubroutineType(types: !388)
!388 = !{!4, !389, !26, !24, !5}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_combined_t", file: !10, line: 49, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 45, size: 128, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !391, file: !10, line: 46, baseType: !33, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wc_head", scope: !391, file: !10, line: 47, baseType: !28, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wc_tail", scope: !391, file: !10, line: 48, baseType: !28, size: 32, offset: 96)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DILocalVariable(name: "hash", arg: 1, scope: !386, file: !1, line: 211, type: !389)
!398 = !DILocalVariable(name: "key", arg: 2, scope: !386, file: !1, line: 211, type: !26)
!399 = !DILocalVariable(name: "name", arg: 3, scope: !386, file: !1, line: 211, type: !24)
!400 = !DILocalVariable(name: "len", arg: 4, scope: !386, file: !1, line: 212, type: !5)
!401 = !DILocalVariable(name: "value", scope: !386, file: !1, line: 214, type: !4)
!402 = !DILocation(line: 211, column: 45, scope: !386)
!403 = !DILocation(line: 211, column: 62, scope: !386)
!404 = !DILocation(line: 211, column: 75, scope: !386)
!405 = !DILocation(line: 212, column: 12, scope: !386)
!406 = !DILocation(line: 214, column: 5, scope: !386)
!407 = !DILocation(line: 214, column: 12, scope: !386)
!408 = !DILocation(line: 216, column: 9, scope: !409)
!409 = distinct !DILexicalBlock(scope: !386, file: !1, line: 216, column: 9)
!410 = !DILocation(line: 216, column: 15, scope: !409)
!411 = !DILocation(line: 216, column: 20, scope: !409)
!412 = !{!413, !71, i64 0}
!413 = !{!"", !88, i64 0, !71, i64 8, !71, i64 12}
!414 = !DILocation(line: 216, column: 9, scope: !386)
!415 = !DILocation(line: 217, column: 32, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !1, line: 216, column: 29)
!417 = !DILocation(line: 217, column: 38, scope: !416)
!418 = !DILocation(line: 217, column: 44, scope: !416)
!419 = !DILocation(line: 217, column: 49, scope: !416)
!420 = !DILocation(line: 217, column: 55, scope: !416)
!421 = !DILocation(line: 217, column: 17, scope: !416)
!422 = !DILocation(line: 217, column: 15, scope: !416)
!423 = !DILocation(line: 219, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !416, file: !1, line: 219, column: 13)
!425 = !DILocation(line: 219, column: 13, scope: !416)
!426 = !DILocation(line: 220, column: 20, scope: !427)
!427 = distinct !DILexicalBlock(scope: !424, file: !1, line: 219, column: 20)
!428 = !DILocation(line: 220, column: 13, scope: !427)
!429 = !DILocation(line: 222, column: 5, scope: !416)
!430 = !DILocation(line: 224, column: 9, scope: !431)
!431 = distinct !DILexicalBlock(scope: !386, file: !1, line: 224, column: 9)
!432 = !DILocation(line: 224, column: 13, scope: !431)
!433 = !DILocation(line: 224, column: 9, scope: !386)
!434 = !DILocation(line: 225, column: 9, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !1, line: 224, column: 19)
!436 = !DILocation(line: 228, column: 9, scope: !437)
!437 = distinct !DILexicalBlock(scope: !386, file: !1, line: 228, column: 9)
!438 = !DILocation(line: 228, column: 15, scope: !437)
!439 = !{!413, !71, i64 8}
!440 = !DILocation(line: 228, column: 23, scope: !437)
!441 = !DILocation(line: 228, column: 26, scope: !437)
!442 = !DILocation(line: 228, column: 32, scope: !437)
!443 = !DILocation(line: 228, column: 41, scope: !437)
!444 = !DILocation(line: 228, column: 46, scope: !437)
!445 = !{!248, !71, i64 0}
!446 = !DILocation(line: 228, column: 9, scope: !386)
!447 = !DILocation(line: 229, column: 39, scope: !448)
!448 = distinct !DILexicalBlock(scope: !437, file: !1, line: 228, column: 55)
!449 = !DILocation(line: 229, column: 45, scope: !448)
!450 = !DILocation(line: 229, column: 54, scope: !448)
!451 = !DILocation(line: 229, column: 60, scope: !448)
!452 = !DILocation(line: 229, column: 17, scope: !448)
!453 = !DILocation(line: 229, column: 15, scope: !448)
!454 = !DILocation(line: 231, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !448, file: !1, line: 231, column: 13)
!456 = !DILocation(line: 231, column: 13, scope: !448)
!457 = !DILocation(line: 232, column: 20, scope: !458)
!458 = distinct !DILexicalBlock(scope: !455, file: !1, line: 231, column: 20)
!459 = !DILocation(line: 232, column: 13, scope: !458)
!460 = !DILocation(line: 234, column: 5, scope: !448)
!461 = !DILocation(line: 236, column: 9, scope: !462)
!462 = distinct !DILexicalBlock(scope: !386, file: !1, line: 236, column: 9)
!463 = !DILocation(line: 236, column: 15, scope: !462)
!464 = !{!413, !71, i64 12}
!465 = !DILocation(line: 236, column: 23, scope: !462)
!466 = !DILocation(line: 236, column: 26, scope: !462)
!467 = !DILocation(line: 236, column: 32, scope: !462)
!468 = !DILocation(line: 236, column: 41, scope: !462)
!469 = !DILocation(line: 236, column: 46, scope: !462)
!470 = !DILocation(line: 236, column: 9, scope: !386)
!471 = !DILocation(line: 237, column: 39, scope: !472)
!472 = distinct !DILexicalBlock(scope: !462, file: !1, line: 236, column: 55)
!473 = !DILocation(line: 237, column: 45, scope: !472)
!474 = !DILocation(line: 237, column: 54, scope: !472)
!475 = !DILocation(line: 237, column: 60, scope: !472)
!476 = !DILocation(line: 237, column: 17, scope: !472)
!477 = !DILocation(line: 237, column: 15, scope: !472)
!478 = !DILocation(line: 239, column: 13, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !1, line: 239, column: 13)
!480 = !DILocation(line: 239, column: 13, scope: !472)
!481 = !DILocation(line: 240, column: 20, scope: !482)
!482 = distinct !DILexicalBlock(scope: !479, file: !1, line: 239, column: 20)
!483 = !DILocation(line: 240, column: 13, scope: !482)
!484 = !DILocation(line: 242, column: 5, scope: !472)
!485 = !DILocation(line: 244, column: 5, scope: !386)
!486 = !DILocation(line: 245, column: 1, scope: !386)
!487 = distinct !DISubprogram(name: "ngx_hash_init", scope: !1, file: !1, line: 252, type: !488, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !677)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !493, !43, !26}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !27, line: 78, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !492)
!492 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_init_t", file: !10, line: 62, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 52, size: 224, elements: !496)
!496 = !{!497, !498, !503, !504, !505, !507, !676}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !495, file: !10, line: 53, baseType: !62, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !495, file: !10, line: 54, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_hash_key_pt", file: !10, line: 42, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DISubroutineType(types: !502)
!502 = !{!26, !24, !5}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !495, file: !10, line: 56, baseType: !26, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_size", scope: !495, file: !10, line: 57, baseType: !26, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !10, line: 59, baseType: !506, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !495, file: !10, line: 60, baseType: !508, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !510, line: 18, baseType: !511)
!510 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !512, line: 57, size: 320, elements: !513)
!512 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!513 = !{!514, !522, !523, !524, !656, !663, !675}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !511, file: !512, line: 58, baseType: !515, size: 128)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !512, line: 54, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !512, line: 49, size: 128, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !516, file: !512, line: 50, baseType: !24, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !516, file: !512, line: 51, baseType: !24, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !512, line: 52, baseType: !508, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !516, file: !512, line: 53, baseType: !26, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !511, file: !512, line: 59, baseType: !5, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !511, file: !512, line: 60, baseType: !508, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !511, file: !512, line: 61, baseType: !525, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !510, line: 19, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !528, line: 59, size: 64, elements: !529)
!528 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!529 = !{!530, !655}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !527, file: !528, line: 60, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !528, line: 18, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !528, line: 20, size: 352, elements: !534)
!534 = !{!535, !536, !537, !539, !540, !541, !542, !544, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !533, file: !528, line: 21, baseType: !24, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !533, file: !528, line: 22, baseType: !24, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !533, file: !528, line: 23, baseType: !538, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !492)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !533, file: !528, line: 24, baseType: !538, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !533, file: !528, line: 26, baseType: !24, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !533, file: !528, line: 27, baseType: !24, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !533, file: !528, line: 28, baseType: !543, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !528, line: 16, baseType: !4)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !533, file: !528, line: 29, baseType: !545, size: 32, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !510, line: 23, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !548, line: 16, size: 1216, elements: !549)
!548 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!549 = !{!550, !553, !554, !599, !600, !601, !640, !641}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !547, file: !548, line: 17, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !552, line: 16, baseType: !492)
!552 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !547, file: !548, line: 18, baseType: !48, size: 64, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !547, file: !548, line: 19, baseType: !555, size: 960, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !552, line: 17, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !557, line: 4, size: 960, elements: !558)
!557 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!558 = !{!559, !561, !562, !564, !565, !567, !568, !570, !572, !574, !575, !576, !577, !578, !579, !582, !583, !585, !586, !592, !593, !594}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !556, file: !557, line: 6, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !7)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !556, file: !557, line: 7, baseType: !560, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !556, file: !557, line: 8, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !7)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !556, file: !557, line: 9, baseType: !563, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !556, file: !557, line: 10, baseType: !566, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !7)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !556, file: !557, line: 11, baseType: !566, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !556, file: !557, line: 13, baseType: !569, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !7)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !556, file: !557, line: 14, baseType: !571, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !7)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !556, file: !557, line: 15, baseType: !573, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !7)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !556, file: !557, line: 16, baseType: !7, size: 32, offset: 288)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !556, file: !557, line: 17, baseType: !560, size: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !556, file: !557, line: 18, baseType: !560, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !556, file: !557, line: 19, baseType: !538, size: 32, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !556, file: !557, line: 20, baseType: !538, size: 32, offset: 416)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !556, file: !557, line: 21, baseType: !580, size: 32, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !581)
!581 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !556, file: !557, line: 22, baseType: !580, size: 32, offset: 480)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !556, file: !557, line: 23, baseType: !584, size: 32, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !492)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !556, file: !557, line: 24, baseType: !584, size: 32, offset: 544)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !556, file: !557, line: 26, baseType: !587, size: 64, offset: 576)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !588)
!588 = !{!589, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !587, file: !6, line: 288, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !581)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !587, file: !6, line: 288, baseType: !581, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !556, file: !557, line: 27, baseType: !587, size: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !556, file: !557, line: 28, baseType: !587, size: 64, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !556, file: !557, line: 29, baseType: !595, size: 192, offset: 768)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 192, elements: !597)
!596 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!597 = !{!598}
!598 = !DISubrange(count: 3)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !547, file: !548, line: 21, baseType: !538, size: 32, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !547, file: !548, line: 22, baseType: !538, size: 32, offset: 1120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !547, file: !548, line: 24, baseType: !602, size: 32, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !510, line: 20, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !605, line: 50, size: 320, elements: !606)
!605 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!606 = !{!607, !608, !621, !625, !626, !631, !632, !637, !638, !639}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !604, file: !605, line: 51, baseType: !26, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !604, file: !605, line: 52, baseType: !609, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !510, line: 21, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !612, line: 89, size: 160, elements: !613)
!612 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!613 = !{!614, !615, !616, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !611, file: !612, line: 90, baseType: !551, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !612, line: 91, baseType: !48, size: 64, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !611, file: !612, line: 93, baseType: !617, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !609, !602}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !611, file: !612, line: 94, baseType: !4, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !604, file: !605, line: 54, baseType: !622, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !623, line: 98, baseType: !624)
!623 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!624 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !604, file: !605, line: 56, baseType: !590, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !604, file: !605, line: 58, baseType: !627, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !605, line: 45, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!24, !602, !24, !5}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !604, file: !605, line: 59, baseType: !4, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !604, file: !605, line: 61, baseType: !633, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !605, line: 46, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !602, !26, !24, !5}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !604, file: !605, line: 62, baseType: !4, size: 32, offset: 224)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !604, file: !605, line: 70, baseType: !506, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !604, file: !605, line: 72, baseType: !602, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !547, file: !548, line: 37, baseType: !7, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !547, file: !548, line: 38, baseType: !7, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !533, file: !528, line: 30, baseType: !531, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !533, file: !528, line: 34, baseType: !7, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !533, file: !528, line: 40, baseType: !7, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !533, file: !528, line: 43, baseType: !7, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !533, file: !528, line: 45, baseType: !7, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !533, file: !528, line: 46, baseType: !7, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !533, file: !528, line: 47, baseType: !7, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !533, file: !528, line: 48, baseType: !7, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !533, file: !528, line: 49, baseType: !7, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !533, file: !528, line: 50, baseType: !7, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !533, file: !528, line: 52, baseType: !7, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !533, file: !528, line: 53, baseType: !7, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !533, file: !528, line: 55, baseType: !492, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !528, line: 61, baseType: !525, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !511, file: !512, line: 62, baseType: !657, size: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !512, line: 41, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !512, line: 43, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !659, file: !512, line: 44, baseType: !657, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !659, file: !512, line: 45, baseType: !4, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !511, file: !512, line: 63, baseType: !664, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !512, line: 32, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !512, line: 34, size: 96, elements: !667)
!667 = !{!668, !673, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !666, file: !512, line: 35, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !512, line: 30, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !4}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !666, file: !512, line: 36, baseType: !4, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !666, file: !512, line: 37, baseType: !664, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !511, file: !512, line: 64, baseType: !602, size: 32, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !495, file: !10, line: 61, baseType: !508, size: 32, offset: 192)
!677 = !{!678, !679, !680, !681, !682, !683, !685, !686, !687, !688, !689, !690, !691, !692}
!678 = !DILocalVariable(name: "hinit", arg: 1, scope: !487, file: !1, line: 252, type: !493)
!679 = !DILocalVariable(name: "names", arg: 2, scope: !487, file: !1, line: 252, type: !43)
!680 = !DILocalVariable(name: "nelts", arg: 3, scope: !487, file: !1, line: 252, type: !26)
!681 = !DILocalVariable(name: "elts", scope: !487, file: !1, line: 254, type: !24)
!682 = !DILocalVariable(name: "len", scope: !487, file: !1, line: 255, type: !5)
!683 = !DILocalVariable(name: "test", scope: !487, file: !1, line: 256, type: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!685 = !DILocalVariable(name: "i", scope: !487, file: !1, line: 257, type: !26)
!686 = !DILocalVariable(name: "n", scope: !487, file: !1, line: 257, type: !26)
!687 = !DILocalVariable(name: "key", scope: !487, file: !1, line: 257, type: !26)
!688 = !DILocalVariable(name: "size", scope: !487, file: !1, line: 257, type: !26)
!689 = !DILocalVariable(name: "start", scope: !487, file: !1, line: 257, type: !26)
!690 = !DILocalVariable(name: "bucket_size", scope: !487, file: !1, line: 257, type: !26)
!691 = !DILocalVariable(name: "elt", scope: !487, file: !1, line: 258, type: !8)
!692 = !DILocalVariable(name: "buckets", scope: !487, file: !1, line: 258, type: !37)
!693 = !DILocation(line: 252, column: 32, scope: !487)
!694 = !DILocation(line: 252, column: 55, scope: !487)
!695 = !DILocation(line: 252, column: 73, scope: !487)
!696 = !DILocation(line: 254, column: 5, scope: !487)
!697 = !DILocation(line: 254, column: 22, scope: !487)
!698 = !DILocation(line: 255, column: 5, scope: !487)
!699 = !DILocation(line: 255, column: 22, scope: !487)
!700 = !DILocation(line: 256, column: 5, scope: !487)
!701 = !DILocation(line: 256, column: 22, scope: !487)
!702 = !DILocation(line: 257, column: 5, scope: !487)
!703 = !DILocation(line: 257, column: 22, scope: !487)
!704 = !DILocation(line: 257, column: 25, scope: !487)
!705 = !DILocation(line: 257, column: 28, scope: !487)
!706 = !DILocation(line: 257, column: 33, scope: !487)
!707 = !DILocation(line: 257, column: 39, scope: !487)
!708 = !DILocation(line: 257, column: 46, scope: !487)
!709 = !DILocation(line: 258, column: 5, scope: !487)
!710 = !DILocation(line: 258, column: 22, scope: !487)
!711 = !DILocation(line: 258, column: 29, scope: !487)
!712 = !DILocation(line: 260, column: 9, scope: !713)
!713 = distinct !DILexicalBlock(scope: !487, file: !1, line: 260, column: 9)
!714 = !DILocation(line: 260, column: 16, scope: !713)
!715 = !{!716, !77, i64 8}
!716 = !{!"", !71, i64 0, !71, i64 4, !77, i64 8, !77, i64 12, !71, i64 16, !71, i64 20, !71, i64 24}
!717 = !DILocation(line: 260, column: 25, scope: !713)
!718 = !DILocation(line: 260, column: 9, scope: !487)
!719 = !DILocation(line: 261, column: 9, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 261, column: 9)
!721 = distinct !DILexicalBlock(scope: !713, file: !1, line: 260, column: 31)
!722 = !{!716, !71, i64 20}
!723 = !{!724, !71, i64 36}
!724 = !{!"ngx_pool_s", !725, i64 0, !77, i64 16, !71, i64 20, !71, i64 24, !71, i64 28, !71, i64 32, !71, i64 36}
!725 = !{!"", !71, i64 0, !71, i64 4, !71, i64 8, !77, i64 12}
!726 = !{!727, !77, i64 0}
!727 = !{!"ngx_log_s", !77, i64 0, !71, i64 4, !728, i64 8, !728, i64 12, !71, i64 16, !71, i64 20, !71, i64 24, !71, i64 28, !71, i64 32, !71, i64 36}
!728 = !{!"long", !72, i64 0}
!729 = !DILocation(line: 261, column: 9, scope: !721)
!730 = !{!716, !71, i64 16}
!731 = !DILocation(line: 265, column: 9, scope: !721)
!732 = !DILocation(line: 268, column: 12, scope: !733)
!733 = distinct !DILexicalBlock(scope: !487, file: !1, line: 268, column: 5)
!734 = !DILocation(line: 268, column: 10, scope: !733)
!735 = !DILocation(line: 268, column: 17, scope: !736)
!736 = distinct !DILexicalBlock(scope: !733, file: !1, line: 268, column: 5)
!737 = !DILocation(line: 268, column: 21, scope: !736)
!738 = !DILocation(line: 268, column: 19, scope: !736)
!739 = !DILocation(line: 268, column: 5, scope: !733)
!740 = !DILocation(line: 269, column: 13, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 269, column: 13)
!742 = distinct !DILexicalBlock(scope: !736, file: !1, line: 268, column: 33)
!743 = !DILocation(line: 269, column: 20, scope: !741)
!744 = !{!716, !77, i64 12}
!745 = !DILocation(line: 269, column: 34, scope: !741)
!746 = !{!747, !77, i64 0}
!747 = !{!"", !748, i64 0, !77, i64 8, !71, i64 12}
!748 = !{!"", !77, i64 0, !71, i64 4}
!749 = !DILocation(line: 269, column: 63, scope: !741)
!750 = !DILocation(line: 269, column: 32, scope: !741)
!751 = !DILocation(line: 269, column: 13, scope: !742)
!752 = !DILocation(line: 271, column: 13, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !1, line: 271, column: 13)
!754 = distinct !DILexicalBlock(scope: !741, file: !1, line: 270, column: 9)
!755 = !DILocation(line: 271, column: 13, scope: !754)
!756 = !DILocation(line: 275, column: 13, scope: !754)
!757 = !DILocation(line: 277, column: 5, scope: !742)
!758 = !DILocation(line: 268, column: 29, scope: !736)
!759 = !DILocation(line: 268, column: 5, scope: !736)
!760 = distinct !{!760, !739, !761}
!761 = !DILocation(line: 277, column: 5, scope: !733)
!762 = !DILocation(line: 279, column: 22, scope: !487)
!763 = !DILocation(line: 279, column: 29, scope: !487)
!764 = !DILocation(line: 279, column: 38, scope: !487)
!765 = !DILocation(line: 279, column: 57, scope: !487)
!766 = !DILocation(line: 279, column: 64, scope: !487)
!767 = !DILocation(line: 279, column: 70, scope: !487)
!768 = !DILocation(line: 279, column: 12, scope: !487)
!769 = !DILocation(line: 279, column: 10, scope: !487)
!770 = !DILocation(line: 280, column: 9, scope: !771)
!771 = distinct !DILexicalBlock(scope: !487, file: !1, line: 280, column: 9)
!772 = !DILocation(line: 280, column: 14, scope: !771)
!773 = !DILocation(line: 280, column: 9, scope: !487)
!774 = !DILocation(line: 281, column: 9, scope: !775)
!775 = distinct !DILexicalBlock(scope: !771, file: !1, line: 280, column: 23)
!776 = !DILocation(line: 284, column: 19, scope: !487)
!777 = !DILocation(line: 284, column: 26, scope: !487)
!778 = !DILocation(line: 284, column: 38, scope: !487)
!779 = !DILocation(line: 284, column: 17, scope: !487)
!780 = !DILocation(line: 286, column: 13, scope: !487)
!781 = !DILocation(line: 286, column: 22, scope: !487)
!782 = !DILocation(line: 286, column: 34, scope: !487)
!783 = !DILocation(line: 286, column: 19, scope: !487)
!784 = !DILocation(line: 286, column: 11, scope: !487)
!785 = !DILocation(line: 287, column: 13, scope: !487)
!786 = !DILocation(line: 287, column: 21, scope: !487)
!787 = !DILocation(line: 287, column: 11, scope: !487)
!788 = !DILocation(line: 289, column: 9, scope: !789)
!789 = distinct !DILexicalBlock(scope: !487, file: !1, line: 289, column: 9)
!790 = !DILocation(line: 289, column: 16, scope: !789)
!791 = !DILocation(line: 289, column: 25, scope: !789)
!792 = !DILocation(line: 289, column: 33, scope: !789)
!793 = !DILocation(line: 289, column: 36, scope: !789)
!794 = !DILocation(line: 289, column: 42, scope: !789)
!795 = !DILocation(line: 289, column: 45, scope: !789)
!796 = !DILocation(line: 289, column: 52, scope: !789)
!797 = !DILocation(line: 289, column: 63, scope: !789)
!798 = !DILocation(line: 289, column: 61, scope: !789)
!799 = !DILocation(line: 289, column: 69, scope: !789)
!800 = !DILocation(line: 289, column: 9, scope: !487)
!801 = !DILocation(line: 290, column: 17, scope: !802)
!802 = distinct !DILexicalBlock(scope: !789, file: !1, line: 289, column: 76)
!803 = !DILocation(line: 290, column: 24, scope: !802)
!804 = !DILocation(line: 290, column: 33, scope: !802)
!805 = !DILocation(line: 290, column: 15, scope: !802)
!806 = !DILocation(line: 291, column: 5, scope: !802)
!807 = !DILocation(line: 293, column: 17, scope: !808)
!808 = distinct !DILexicalBlock(scope: !487, file: !1, line: 293, column: 5)
!809 = !DILocation(line: 293, column: 15, scope: !808)
!810 = !DILocation(line: 293, column: 10, scope: !808)
!811 = !DILocation(line: 293, column: 24, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !1, line: 293, column: 5)
!813 = !DILocation(line: 293, column: 32, scope: !812)
!814 = !DILocation(line: 293, column: 39, scope: !812)
!815 = !DILocation(line: 293, column: 29, scope: !812)
!816 = !DILocation(line: 293, column: 5, scope: !808)
!817 = !DILocation(line: 295, column: 9, scope: !818)
!818 = distinct !DILexicalBlock(scope: !812, file: !1, line: 293, column: 57)
!819 = !DILocation(line: 297, column: 16, scope: !820)
!820 = distinct !DILexicalBlock(scope: !818, file: !1, line: 297, column: 9)
!821 = !DILocation(line: 297, column: 14, scope: !820)
!822 = !DILocation(line: 297, column: 21, scope: !823)
!823 = distinct !DILexicalBlock(scope: !820, file: !1, line: 297, column: 9)
!824 = !DILocation(line: 297, column: 25, scope: !823)
!825 = !DILocation(line: 297, column: 23, scope: !823)
!826 = !DILocation(line: 297, column: 9, scope: !820)
!827 = !DILocation(line: 298, column: 17, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !1, line: 298, column: 17)
!829 = distinct !DILexicalBlock(scope: !823, file: !1, line: 297, column: 37)
!830 = !DILocation(line: 298, column: 23, scope: !828)
!831 = !DILocation(line: 298, column: 26, scope: !828)
!832 = !DILocation(line: 298, column: 30, scope: !828)
!833 = !{!747, !71, i64 4}
!834 = !DILocation(line: 298, column: 35, scope: !828)
!835 = !DILocation(line: 298, column: 17, scope: !829)
!836 = !DILocation(line: 299, column: 17, scope: !837)
!837 = distinct !DILexicalBlock(scope: !828, file: !1, line: 298, column: 44)
!838 = !DILocation(line: 302, column: 19, scope: !829)
!839 = !DILocation(line: 302, column: 25, scope: !829)
!840 = !DILocation(line: 302, column: 28, scope: !829)
!841 = !{!747, !77, i64 8}
!842 = !DILocation(line: 302, column: 39, scope: !829)
!843 = !DILocation(line: 302, column: 37, scope: !829)
!844 = !DILocation(line: 302, column: 17, scope: !829)
!845 = !DILocation(line: 303, column: 36, scope: !829)
!846 = !DILocation(line: 303, column: 41, scope: !829)
!847 = !{!106, !106, i64 0}
!848 = !DILocation(line: 303, column: 48, scope: !829)
!849 = !DILocation(line: 303, column: 46, scope: !829)
!850 = !DILocation(line: 303, column: 25, scope: !829)
!851 = !DILocation(line: 303, column: 13, scope: !829)
!852 = !DILocation(line: 303, column: 18, scope: !829)
!853 = !DILocation(line: 303, column: 23, scope: !829)
!854 = !DILocation(line: 311, column: 17, scope: !855)
!855 = distinct !DILexicalBlock(scope: !829, file: !1, line: 311, column: 17)
!856 = !DILocation(line: 311, column: 22, scope: !855)
!857 = !DILocation(line: 311, column: 39, scope: !855)
!858 = !DILocation(line: 311, column: 29, scope: !855)
!859 = !DILocation(line: 311, column: 27, scope: !855)
!860 = !DILocation(line: 311, column: 17, scope: !829)
!861 = !DILocation(line: 312, column: 17, scope: !862)
!862 = distinct !DILexicalBlock(scope: !855, file: !1, line: 311, column: 52)
!863 = !DILocation(line: 314, column: 9, scope: !829)
!864 = !DILocation(line: 297, column: 33, scope: !823)
!865 = !DILocation(line: 297, column: 9, scope: !823)
!866 = distinct !{!866, !826, !867}
!867 = !DILocation(line: 314, column: 9, scope: !820)
!868 = !DILocation(line: 316, column: 9, scope: !818)
!869 = !DILocation(line: 320, column: 9, scope: !818)
!870 = !DILocation(line: 293, column: 53, scope: !812)
!871 = !DILocation(line: 293, column: 5, scope: !812)
!872 = distinct !{!872, !816, !873}
!873 = !DILocation(line: 321, column: 5, scope: !808)
!874 = !DILocation(line: 323, column: 12, scope: !487)
!875 = !DILocation(line: 323, column: 19, scope: !487)
!876 = !DILocation(line: 323, column: 10, scope: !487)
!877 = !DILocation(line: 325, column: 5, scope: !878)
!878 = distinct !DILexicalBlock(scope: !487, file: !1, line: 325, column: 5)
!879 = !DILocation(line: 325, column: 5, scope: !487)
!880 = !DILocation(line: 334, column: 12, scope: !881)
!881 = distinct !DILexicalBlock(scope: !487, file: !1, line: 334, column: 5)
!882 = !DILocation(line: 334, column: 10, scope: !881)
!883 = !DILocation(line: 334, column: 17, scope: !884)
!884 = distinct !DILexicalBlock(scope: !881, file: !1, line: 334, column: 5)
!885 = !DILocation(line: 334, column: 21, scope: !884)
!886 = !DILocation(line: 334, column: 19, scope: !884)
!887 = !DILocation(line: 334, column: 5, scope: !881)
!888 = !DILocation(line: 335, column: 9, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !1, line: 334, column: 32)
!890 = !DILocation(line: 335, column: 14, scope: !889)
!891 = !DILocation(line: 335, column: 17, scope: !889)
!892 = !DILocation(line: 336, column: 5, scope: !889)
!893 = !DILocation(line: 334, column: 28, scope: !884)
!894 = !DILocation(line: 334, column: 5, scope: !884)
!895 = distinct !{!895, !887, !896}
!896 = !DILocation(line: 336, column: 5, scope: !881)
!897 = !DILocation(line: 338, column: 12, scope: !898)
!898 = distinct !DILexicalBlock(scope: !487, file: !1, line: 338, column: 5)
!899 = !DILocation(line: 338, column: 10, scope: !898)
!900 = !DILocation(line: 338, column: 17, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !1, line: 338, column: 5)
!902 = !DILocation(line: 338, column: 21, scope: !901)
!903 = !DILocation(line: 338, column: 19, scope: !901)
!904 = !DILocation(line: 338, column: 5, scope: !898)
!905 = !DILocation(line: 339, column: 13, scope: !906)
!906 = distinct !DILexicalBlock(scope: !907, file: !1, line: 339, column: 13)
!907 = distinct !DILexicalBlock(scope: !901, file: !1, line: 338, column: 33)
!908 = !DILocation(line: 339, column: 19, scope: !906)
!909 = !DILocation(line: 339, column: 22, scope: !906)
!910 = !DILocation(line: 339, column: 26, scope: !906)
!911 = !DILocation(line: 339, column: 31, scope: !906)
!912 = !DILocation(line: 339, column: 13, scope: !907)
!913 = !DILocation(line: 340, column: 13, scope: !914)
!914 = distinct !DILexicalBlock(scope: !906, file: !1, line: 339, column: 40)
!915 = !DILocation(line: 343, column: 15, scope: !907)
!916 = !DILocation(line: 343, column: 21, scope: !907)
!917 = !DILocation(line: 343, column: 24, scope: !907)
!918 = !DILocation(line: 343, column: 35, scope: !907)
!919 = !DILocation(line: 343, column: 33, scope: !907)
!920 = !DILocation(line: 343, column: 13, scope: !907)
!921 = !DILocation(line: 344, column: 32, scope: !907)
!922 = !DILocation(line: 344, column: 37, scope: !907)
!923 = !DILocation(line: 344, column: 44, scope: !907)
!924 = !DILocation(line: 344, column: 42, scope: !907)
!925 = !DILocation(line: 344, column: 21, scope: !907)
!926 = !DILocation(line: 344, column: 9, scope: !907)
!927 = !DILocation(line: 344, column: 14, scope: !907)
!928 = !DILocation(line: 344, column: 19, scope: !907)
!929 = !DILocation(line: 345, column: 5, scope: !907)
!930 = !DILocation(line: 338, column: 29, scope: !901)
!931 = !DILocation(line: 338, column: 5, scope: !901)
!932 = distinct !{!932, !904, !933}
!933 = !DILocation(line: 345, column: 5, scope: !898)
!934 = !DILocation(line: 347, column: 9, scope: !487)
!935 = !DILocation(line: 349, column: 12, scope: !936)
!936 = distinct !DILexicalBlock(scope: !487, file: !1, line: 349, column: 5)
!937 = !DILocation(line: 349, column: 10, scope: !936)
!938 = !DILocation(line: 349, column: 17, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !1, line: 349, column: 5)
!940 = !DILocation(line: 349, column: 21, scope: !939)
!941 = !DILocation(line: 349, column: 19, scope: !939)
!942 = !DILocation(line: 349, column: 5, scope: !936)
!943 = !DILocation(line: 350, column: 13, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !1, line: 350, column: 13)
!945 = distinct !DILexicalBlock(scope: !939, file: !1, line: 349, column: 32)
!946 = !DILocation(line: 350, column: 18, scope: !944)
!947 = !DILocation(line: 350, column: 21, scope: !944)
!948 = !DILocation(line: 350, column: 13, scope: !945)
!949 = !DILocation(line: 351, column: 13, scope: !950)
!950 = distinct !DILexicalBlock(scope: !944, file: !1, line: 350, column: 40)
!951 = !DILocation(line: 354, column: 30, scope: !945)
!952 = !DILocation(line: 354, column: 19, scope: !945)
!953 = !DILocation(line: 354, column: 9, scope: !945)
!954 = !DILocation(line: 354, column: 14, scope: !945)
!955 = !DILocation(line: 354, column: 17, scope: !945)
!956 = !DILocation(line: 356, column: 16, scope: !945)
!957 = !DILocation(line: 356, column: 21, scope: !945)
!958 = !DILocation(line: 356, column: 13, scope: !945)
!959 = !DILocation(line: 357, column: 5, scope: !945)
!960 = !DILocation(line: 349, column: 28, scope: !939)
!961 = !DILocation(line: 349, column: 5, scope: !939)
!962 = distinct !{!962, !942, !963}
!963 = !DILocation(line: 357, column: 5, scope: !936)
!964 = !DILocation(line: 359, column: 9, scope: !965)
!965 = distinct !DILexicalBlock(scope: !487, file: !1, line: 359, column: 9)
!966 = !DILocation(line: 359, column: 16, scope: !965)
!967 = !{!716, !71, i64 0}
!968 = !DILocation(line: 359, column: 21, scope: !965)
!969 = !DILocation(line: 359, column: 9, scope: !487)
!970 = !DILocation(line: 360, column: 35, scope: !971)
!971 = distinct !DILexicalBlock(scope: !965, file: !1, line: 359, column: 30)
!972 = !DILocation(line: 360, column: 42, scope: !971)
!973 = !DILocation(line: 361, column: 48, scope: !971)
!974 = !DILocation(line: 361, column: 53, scope: !971)
!975 = !DILocation(line: 361, column: 46, scope: !971)
!976 = !DILocation(line: 360, column: 23, scope: !971)
!977 = !DILocation(line: 360, column: 9, scope: !971)
!978 = !DILocation(line: 360, column: 16, scope: !971)
!979 = !DILocation(line: 360, column: 21, scope: !971)
!980 = !DILocation(line: 362, column: 13, scope: !981)
!981 = distinct !DILexicalBlock(scope: !971, file: !1, line: 362, column: 13)
!982 = !DILocation(line: 362, column: 20, scope: !981)
!983 = !DILocation(line: 362, column: 25, scope: !981)
!984 = !DILocation(line: 362, column: 13, scope: !971)
!985 = !DILocation(line: 363, column: 22, scope: !986)
!986 = distinct !DILexicalBlock(scope: !981, file: !1, line: 362, column: 34)
!987 = !DILocation(line: 363, column: 13, scope: !986)
!988 = !DILocation(line: 364, column: 13, scope: !986)
!989 = !DILocation(line: 368, column: 35, scope: !971)
!990 = !DILocation(line: 368, column: 42, scope: !971)
!991 = !DILocation(line: 368, column: 24, scope: !971)
!992 = !DILocation(line: 368, column: 47, scope: !971)
!993 = !DILocation(line: 367, column: 19, scope: !971)
!994 = !DILocation(line: 367, column: 17, scope: !971)
!995 = !DILocation(line: 370, column: 5, scope: !971)
!996 = !DILocation(line: 371, column: 31, scope: !997)
!997 = distinct !DILexicalBlock(scope: !965, file: !1, line: 370, column: 12)
!998 = !DILocation(line: 371, column: 38, scope: !997)
!999 = !DILocation(line: 371, column: 44, scope: !997)
!1000 = !DILocation(line: 371, column: 49, scope: !997)
!1001 = !DILocation(line: 371, column: 19, scope: !997)
!1002 = !DILocation(line: 371, column: 17, scope: !997)
!1003 = !DILocation(line: 372, column: 13, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !997, file: !1, line: 372, column: 13)
!1005 = !DILocation(line: 372, column: 21, scope: !1004)
!1006 = !DILocation(line: 372, column: 13, scope: !997)
!1007 = !DILocation(line: 373, column: 22, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !1, line: 372, column: 30)
!1009 = !DILocation(line: 373, column: 13, scope: !1008)
!1010 = !DILocation(line: 374, column: 13, scope: !1008)
!1011 = !DILocation(line: 378, column: 23, scope: !487)
!1012 = !DILocation(line: 378, column: 30, scope: !487)
!1013 = !DILocation(line: 378, column: 36, scope: !487)
!1014 = !DILocation(line: 378, column: 42, scope: !487)
!1015 = !DILocation(line: 378, column: 40, scope: !487)
!1016 = !DILocation(line: 378, column: 12, scope: !487)
!1017 = !DILocation(line: 378, column: 10, scope: !487)
!1018 = !DILocation(line: 379, column: 9, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !487, file: !1, line: 379, column: 9)
!1020 = !DILocation(line: 379, column: 14, scope: !1019)
!1021 = !DILocation(line: 379, column: 9, scope: !487)
!1022 = !DILocation(line: 380, column: 18, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !1, line: 379, column: 23)
!1024 = !DILocation(line: 380, column: 9, scope: !1023)
!1025 = !DILocation(line: 381, column: 9, scope: !1023)
!1026 = !DILocation(line: 384, column: 12, scope: !487)
!1027 = !DILocation(line: 384, column: 10, scope: !487)
!1028 = !DILocation(line: 386, column: 12, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !487, file: !1, line: 386, column: 5)
!1030 = !DILocation(line: 386, column: 10, scope: !1029)
!1031 = !DILocation(line: 386, column: 17, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 386, column: 5)
!1033 = !DILocation(line: 386, column: 21, scope: !1032)
!1034 = !DILocation(line: 386, column: 19, scope: !1032)
!1035 = !DILocation(line: 386, column: 5, scope: !1029)
!1036 = !DILocation(line: 387, column: 13, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 387, column: 13)
!1038 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 386, column: 32)
!1039 = !DILocation(line: 387, column: 18, scope: !1037)
!1040 = !DILocation(line: 387, column: 21, scope: !1037)
!1041 = !DILocation(line: 387, column: 13, scope: !1038)
!1042 = !DILocation(line: 388, column: 13, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1037, file: !1, line: 387, column: 40)
!1044 = !DILocation(line: 391, column: 41, scope: !1038)
!1045 = !DILocation(line: 391, column: 22, scope: !1038)
!1046 = !DILocation(line: 391, column: 9, scope: !1038)
!1047 = !DILocation(line: 391, column: 17, scope: !1038)
!1048 = !DILocation(line: 391, column: 20, scope: !1038)
!1049 = !DILocation(line: 392, column: 17, scope: !1038)
!1050 = !DILocation(line: 392, column: 22, scope: !1038)
!1051 = !DILocation(line: 392, column: 14, scope: !1038)
!1052 = !DILocation(line: 393, column: 5, scope: !1038)
!1053 = !DILocation(line: 386, column: 28, scope: !1032)
!1054 = !DILocation(line: 386, column: 5, scope: !1032)
!1055 = distinct !{!1055, !1035, !1056}
!1056 = !DILocation(line: 393, column: 5, scope: !1029)
!1057 = !DILocation(line: 395, column: 12, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !487, file: !1, line: 395, column: 5)
!1059 = !DILocation(line: 395, column: 10, scope: !1058)
!1060 = !DILocation(line: 395, column: 17, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !1, line: 395, column: 5)
!1062 = !DILocation(line: 395, column: 21, scope: !1061)
!1063 = !DILocation(line: 395, column: 19, scope: !1061)
!1064 = !DILocation(line: 395, column: 5, scope: !1058)
!1065 = !DILocation(line: 396, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 395, column: 32)
!1067 = !DILocation(line: 396, column: 14, scope: !1066)
!1068 = !DILocation(line: 396, column: 17, scope: !1066)
!1069 = !DILocation(line: 397, column: 5, scope: !1066)
!1070 = !DILocation(line: 395, column: 28, scope: !1061)
!1071 = !DILocation(line: 395, column: 5, scope: !1061)
!1072 = distinct !{!1072, !1064, !1073}
!1073 = !DILocation(line: 397, column: 5, scope: !1058)
!1074 = !DILocation(line: 399, column: 12, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !487, file: !1, line: 399, column: 5)
!1076 = !DILocation(line: 399, column: 10, scope: !1075)
!1077 = !DILocation(line: 399, column: 17, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1075, file: !1, line: 399, column: 5)
!1079 = !DILocation(line: 399, column: 21, scope: !1078)
!1080 = !DILocation(line: 399, column: 19, scope: !1078)
!1081 = !DILocation(line: 399, column: 5, scope: !1075)
!1082 = !DILocation(line: 400, column: 13, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 400, column: 13)
!1084 = distinct !DILexicalBlock(scope: !1078, file: !1, line: 399, column: 33)
!1085 = !DILocation(line: 400, column: 19, scope: !1083)
!1086 = !DILocation(line: 400, column: 22, scope: !1083)
!1087 = !DILocation(line: 400, column: 26, scope: !1083)
!1088 = !DILocation(line: 400, column: 31, scope: !1083)
!1089 = !DILocation(line: 400, column: 13, scope: !1084)
!1090 = !DILocation(line: 401, column: 13, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 400, column: 40)
!1092 = !DILocation(line: 404, column: 15, scope: !1084)
!1093 = !DILocation(line: 404, column: 21, scope: !1084)
!1094 = !DILocation(line: 404, column: 24, scope: !1084)
!1095 = !DILocation(line: 404, column: 35, scope: !1084)
!1096 = !DILocation(line: 404, column: 33, scope: !1084)
!1097 = !DILocation(line: 404, column: 13, scope: !1084)
!1098 = !DILocation(line: 405, column: 46, scope: !1084)
!1099 = !DILocation(line: 405, column: 54, scope: !1084)
!1100 = !DILocation(line: 405, column: 35, scope: !1084)
!1101 = !DILocation(line: 405, column: 61, scope: !1084)
!1102 = !DILocation(line: 405, column: 66, scope: !1084)
!1103 = !DILocation(line: 405, column: 59, scope: !1084)
!1104 = !DILocation(line: 405, column: 15, scope: !1084)
!1105 = !DILocation(line: 405, column: 13, scope: !1084)
!1106 = !DILocation(line: 407, column: 22, scope: !1084)
!1107 = !DILocation(line: 407, column: 28, scope: !1084)
!1108 = !DILocation(line: 407, column: 31, scope: !1084)
!1109 = !{!747, !71, i64 12}
!1110 = !DILocation(line: 407, column: 9, scope: !1084)
!1111 = !DILocation(line: 407, column: 14, scope: !1084)
!1112 = !DILocation(line: 407, column: 20, scope: !1084)
!1113 = !DILocation(line: 408, column: 30, scope: !1084)
!1114 = !DILocation(line: 408, column: 36, scope: !1084)
!1115 = !DILocation(line: 408, column: 39, scope: !1084)
!1116 = !DILocation(line: 408, column: 43, scope: !1084)
!1117 = !DILocation(line: 408, column: 20, scope: !1084)
!1118 = !DILocation(line: 408, column: 9, scope: !1084)
!1119 = !DILocation(line: 408, column: 14, scope: !1084)
!1120 = !DILocation(line: 408, column: 18, scope: !1084)
!1121 = !DILocation(line: 410, column: 20, scope: !1084)
!1122 = !DILocation(line: 410, column: 25, scope: !1084)
!1123 = !DILocation(line: 410, column: 31, scope: !1084)
!1124 = !DILocation(line: 410, column: 37, scope: !1084)
!1125 = !DILocation(line: 410, column: 40, scope: !1084)
!1126 = !DILocation(line: 410, column: 44, scope: !1084)
!1127 = !DILocation(line: 410, column: 50, scope: !1084)
!1128 = !DILocation(line: 410, column: 56, scope: !1084)
!1129 = !DILocation(line: 410, column: 59, scope: !1084)
!1130 = !DILocation(line: 410, column: 63, scope: !1084)
!1131 = !DILocation(line: 410, column: 9, scope: !1084)
!1132 = !DILocation(line: 412, column: 32, scope: !1084)
!1133 = !DILocation(line: 412, column: 37, scope: !1084)
!1134 = !DILocation(line: 412, column: 44, scope: !1084)
!1135 = !DILocation(line: 412, column: 42, scope: !1084)
!1136 = !DILocation(line: 412, column: 21, scope: !1084)
!1137 = !DILocation(line: 412, column: 9, scope: !1084)
!1138 = !DILocation(line: 412, column: 14, scope: !1084)
!1139 = !DILocation(line: 412, column: 19, scope: !1084)
!1140 = !DILocation(line: 413, column: 5, scope: !1084)
!1141 = !DILocation(line: 399, column: 29, scope: !1078)
!1142 = !DILocation(line: 399, column: 5, scope: !1078)
!1143 = distinct !{!1143, !1081, !1144}
!1144 = !DILocation(line: 413, column: 5, scope: !1075)
!1145 = !DILocation(line: 415, column: 12, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !487, file: !1, line: 415, column: 5)
!1147 = !DILocation(line: 415, column: 10, scope: !1146)
!1148 = !DILocation(line: 415, column: 17, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 415, column: 5)
!1150 = !DILocation(line: 415, column: 21, scope: !1149)
!1151 = !DILocation(line: 415, column: 19, scope: !1149)
!1152 = !DILocation(line: 415, column: 5, scope: !1146)
!1153 = !DILocation(line: 416, column: 13, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 416, column: 13)
!1155 = distinct !DILexicalBlock(scope: !1149, file: !1, line: 415, column: 32)
!1156 = !DILocation(line: 416, column: 21, scope: !1154)
!1157 = !DILocation(line: 416, column: 24, scope: !1154)
!1158 = !DILocation(line: 416, column: 13, scope: !1155)
!1159 = !DILocation(line: 417, column: 13, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !1, line: 416, column: 33)
!1161 = !DILocation(line: 420, column: 46, scope: !1155)
!1162 = !DILocation(line: 420, column: 54, scope: !1155)
!1163 = !DILocation(line: 420, column: 35, scope: !1155)
!1164 = !DILocation(line: 420, column: 59, scope: !1155)
!1165 = !DILocation(line: 420, column: 64, scope: !1155)
!1166 = !DILocation(line: 420, column: 57, scope: !1155)
!1167 = !DILocation(line: 420, column: 15, scope: !1155)
!1168 = !DILocation(line: 420, column: 13, scope: !1155)
!1169 = !DILocation(line: 422, column: 9, scope: !1155)
!1170 = !DILocation(line: 422, column: 14, scope: !1155)
!1171 = !DILocation(line: 422, column: 20, scope: !1155)
!1172 = !DILocation(line: 423, column: 5, scope: !1155)
!1173 = !DILocation(line: 415, column: 28, scope: !1149)
!1174 = !DILocation(line: 415, column: 5, scope: !1149)
!1175 = distinct !{!1175, !1152, !1176}
!1176 = !DILocation(line: 423, column: 5, scope: !1146)
!1177 = !DILocation(line: 425, column: 14, scope: !487)
!1178 = !DILocation(line: 425, column: 5, scope: !487)
!1179 = !DILocation(line: 427, column: 28, scope: !487)
!1180 = !DILocation(line: 427, column: 5, scope: !487)
!1181 = !DILocation(line: 427, column: 12, scope: !487)
!1182 = !DILocation(line: 427, column: 18, scope: !487)
!1183 = !DILocation(line: 427, column: 26, scope: !487)
!1184 = !DILocation(line: 428, column: 25, scope: !487)
!1185 = !DILocation(line: 428, column: 5, scope: !487)
!1186 = !DILocation(line: 428, column: 12, scope: !487)
!1187 = !DILocation(line: 428, column: 18, scope: !487)
!1188 = !DILocation(line: 428, column: 23, scope: !487)
!1189 = !DILocation(line: 460, column: 5, scope: !487)
!1190 = !DILocation(line: 461, column: 1, scope: !487)
!1191 = distinct !DISubprogram(name: "ngx_hash_wildcard_init", scope: !1, file: !1, line: 465, type: !488, isLocal: false, isDefinition: true, scopeLine: 467, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1211, !1212, !1213, !1214, !1215}
!1193 = !DILocalVariable(name: "hinit", arg: 1, scope: !1191, file: !1, line: 465, type: !493)
!1194 = !DILocalVariable(name: "names", arg: 2, scope: !1191, file: !1, line: 465, type: !43)
!1195 = !DILocalVariable(name: "nelts", arg: 3, scope: !1191, file: !1, line: 466, type: !26)
!1196 = !DILocalVariable(name: "len", scope: !1191, file: !1, line: 468, type: !5)
!1197 = !DILocalVariable(name: "dot_len", scope: !1191, file: !1, line: 468, type: !5)
!1198 = !DILocalVariable(name: "i", scope: !1191, file: !1, line: 469, type: !26)
!1199 = !DILocalVariable(name: "n", scope: !1191, file: !1, line: 469, type: !26)
!1200 = !DILocalVariable(name: "dot", scope: !1191, file: !1, line: 469, type: !26)
!1201 = !DILocalVariable(name: "curr_names", scope: !1191, file: !1, line: 470, type: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !1203, line: 22, baseType: !1204)
!1203 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1203, line: 16, size: 160, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1204, file: !1203, line: 17, baseType: !4, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !1204, file: !1203, line: 18, baseType: !26, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1204, file: !1203, line: 19, baseType: !5, size: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !1204, file: !1203, line: 20, baseType: !26, size: 32, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1204, file: !1203, line: 21, baseType: !508, size: 32, offset: 128)
!1211 = !DILocalVariable(name: "next_names", scope: !1191, file: !1, line: 470, type: !1202)
!1212 = !DILocalVariable(name: "name", scope: !1191, file: !1, line: 471, type: !43)
!1213 = !DILocalVariable(name: "next_name", scope: !1191, file: !1, line: 471, type: !43)
!1214 = !DILocalVariable(name: "h", scope: !1191, file: !1, line: 472, type: !494)
!1215 = !DILocalVariable(name: "wdc", scope: !1191, file: !1, line: 473, type: !28)
!1216 = !DILocation(line: 465, column: 41, scope: !1191)
!1217 = !DILocation(line: 465, column: 64, scope: !1191)
!1218 = !DILocation(line: 466, column: 16, scope: !1191)
!1219 = !DILocation(line: 468, column: 5, scope: !1191)
!1220 = !DILocation(line: 468, column: 27, scope: !1191)
!1221 = !DILocation(line: 468, column: 32, scope: !1191)
!1222 = !DILocation(line: 469, column: 5, scope: !1191)
!1223 = !DILocation(line: 469, column: 27, scope: !1191)
!1224 = !DILocation(line: 469, column: 30, scope: !1191)
!1225 = !DILocation(line: 469, column: 33, scope: !1191)
!1226 = !DILocation(line: 470, column: 5, scope: !1191)
!1227 = !DILocation(line: 470, column: 27, scope: !1191)
!1228 = !DILocation(line: 470, column: 39, scope: !1191)
!1229 = !DILocation(line: 471, column: 5, scope: !1191)
!1230 = !DILocation(line: 471, column: 27, scope: !1191)
!1231 = !DILocation(line: 471, column: 34, scope: !1191)
!1232 = !DILocation(line: 472, column: 5, scope: !1191)
!1233 = !DILocation(line: 472, column: 27, scope: !1191)
!1234 = !DILocation(line: 473, column: 5, scope: !1191)
!1235 = !DILocation(line: 473, column: 27, scope: !1191)
!1236 = !DILocation(line: 475, column: 37, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 475, column: 9)
!1238 = !DILocation(line: 475, column: 44, scope: !1237)
!1239 = !{!716, !71, i64 24}
!1240 = !DILocation(line: 475, column: 55, scope: !1237)
!1241 = !DILocation(line: 475, column: 9, scope: !1237)
!1242 = !DILocation(line: 477, column: 9, scope: !1237)
!1243 = !DILocation(line: 475, column: 9, scope: !1191)
!1244 = !DILocation(line: 479, column: 9, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1237, file: !1, line: 478, column: 5)
!1246 = !DILocation(line: 482, column: 37, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 482, column: 9)
!1248 = !DILocation(line: 482, column: 44, scope: !1247)
!1249 = !DILocation(line: 482, column: 55, scope: !1247)
!1250 = !DILocation(line: 482, column: 9, scope: !1247)
!1251 = !DILocation(line: 484, column: 9, scope: !1247)
!1252 = !DILocation(line: 482, column: 9, scope: !1191)
!1253 = !DILocation(line: 486, column: 9, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1247, file: !1, line: 485, column: 5)
!1255 = !DILocation(line: 489, column: 12, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 489, column: 5)
!1257 = !DILocation(line: 489, column: 10, scope: !1256)
!1258 = !DILocation(line: 489, column: 17, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1256, file: !1, line: 489, column: 5)
!1260 = !DILocation(line: 489, column: 21, scope: !1259)
!1261 = !DILocation(line: 489, column: 19, scope: !1259)
!1262 = !DILocation(line: 489, column: 5, scope: !1256)
!1263 = !DILocation(line: 496, column: 13, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1259, file: !1, line: 489, column: 35)
!1265 = !DILocation(line: 498, column: 18, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 498, column: 9)
!1267 = !DILocation(line: 498, column: 14, scope: !1266)
!1268 = !DILocation(line: 498, column: 23, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !1, line: 498, column: 9)
!1270 = !DILocation(line: 498, column: 29, scope: !1269)
!1271 = !DILocation(line: 498, column: 35, scope: !1269)
!1272 = !DILocation(line: 498, column: 38, scope: !1269)
!1273 = !DILocation(line: 498, column: 42, scope: !1269)
!1274 = !DILocation(line: 498, column: 27, scope: !1269)
!1275 = !DILocation(line: 498, column: 9, scope: !1266)
!1276 = !DILocation(line: 499, column: 17, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1278, file: !1, line: 499, column: 17)
!1278 = distinct !DILexicalBlock(scope: !1269, file: !1, line: 498, column: 54)
!1279 = !DILocation(line: 499, column: 23, scope: !1277)
!1280 = !DILocation(line: 499, column: 26, scope: !1277)
!1281 = !DILocation(line: 499, column: 30, scope: !1277)
!1282 = !DILocation(line: 499, column: 35, scope: !1277)
!1283 = !DILocation(line: 499, column: 40, scope: !1277)
!1284 = !DILocation(line: 499, column: 17, scope: !1278)
!1285 = !DILocation(line: 500, column: 21, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1277, file: !1, line: 499, column: 48)
!1287 = !DILocation(line: 501, column: 17, scope: !1286)
!1288 = !DILocation(line: 503, column: 9, scope: !1278)
!1289 = !DILocation(line: 498, column: 50, scope: !1269)
!1290 = !DILocation(line: 498, column: 9, scope: !1269)
!1291 = distinct !{!1291, !1275, !1292}
!1292 = !DILocation(line: 503, column: 9, scope: !1266)
!1293 = !DILocation(line: 505, column: 16, scope: !1264)
!1294 = !DILocation(line: 505, column: 14, scope: !1264)
!1295 = !DILocation(line: 506, column: 13, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 506, column: 13)
!1297 = !DILocation(line: 506, column: 18, scope: !1296)
!1298 = !DILocation(line: 506, column: 13, scope: !1264)
!1299 = !DILocation(line: 507, column: 13, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1296, file: !1, line: 506, column: 27)
!1301 = !DILocation(line: 510, column: 25, scope: !1264)
!1302 = !DILocation(line: 510, column: 9, scope: !1264)
!1303 = !DILocation(line: 510, column: 15, scope: !1264)
!1304 = !DILocation(line: 510, column: 19, scope: !1264)
!1305 = !DILocation(line: 510, column: 23, scope: !1264)
!1306 = !DILocation(line: 511, column: 26, scope: !1264)
!1307 = !DILocation(line: 511, column: 32, scope: !1264)
!1308 = !DILocation(line: 511, column: 35, scope: !1264)
!1309 = !DILocation(line: 511, column: 39, scope: !1264)
!1310 = !DILocation(line: 511, column: 9, scope: !1264)
!1311 = !DILocation(line: 511, column: 15, scope: !1264)
!1312 = !DILocation(line: 511, column: 19, scope: !1264)
!1313 = !DILocation(line: 511, column: 24, scope: !1264)
!1314 = !DILocation(line: 512, column: 26, scope: !1264)
!1315 = !DILocation(line: 512, column: 33, scope: !1264)
!1316 = !{!716, !71, i64 4}
!1317 = !DILocation(line: 512, column: 37, scope: !1264)
!1318 = !DILocation(line: 512, column: 43, scope: !1264)
!1319 = !DILocation(line: 512, column: 47, scope: !1264)
!1320 = !DILocation(line: 512, column: 53, scope: !1264)
!1321 = !DILocation(line: 512, column: 59, scope: !1264)
!1322 = !DILocation(line: 512, column: 63, scope: !1264)
!1323 = !DILocation(line: 512, column: 9, scope: !1264)
!1324 = !DILocation(line: 512, column: 15, scope: !1264)
!1325 = !DILocation(line: 512, column: 24, scope: !1264)
!1326 = !DILocation(line: 513, column: 23, scope: !1264)
!1327 = !DILocation(line: 513, column: 29, scope: !1264)
!1328 = !DILocation(line: 513, column: 32, scope: !1264)
!1329 = !DILocation(line: 513, column: 9, scope: !1264)
!1330 = !DILocation(line: 513, column: 15, scope: !1264)
!1331 = !DILocation(line: 513, column: 21, scope: !1264)
!1332 = !DILocation(line: 520, column: 19, scope: !1264)
!1333 = !DILocation(line: 520, column: 23, scope: !1264)
!1334 = !DILocation(line: 520, column: 17, scope: !1264)
!1335 = !DILocation(line: 522, column: 13, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 522, column: 13)
!1337 = !DILocation(line: 522, column: 13, scope: !1264)
!1338 = !DILocation(line: 523, column: 16, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1336, file: !1, line: 522, column: 18)
!1340 = !DILocation(line: 524, column: 9, scope: !1339)
!1341 = !DILocation(line: 526, column: 20, scope: !1264)
!1342 = !DILocation(line: 526, column: 26, scope: !1264)
!1343 = !{!1344, !77, i64 4}
!1344 = !{!"", !71, i64 0, !77, i64 4, !77, i64 8, !77, i64 12, !71, i64 16}
!1345 = !DILocation(line: 528, column: 13, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 528, column: 13)
!1347 = !DILocation(line: 528, column: 19, scope: !1346)
!1348 = !DILocation(line: 528, column: 22, scope: !1346)
!1349 = !DILocation(line: 528, column: 26, scope: !1346)
!1350 = !DILocation(line: 528, column: 33, scope: !1346)
!1351 = !DILocation(line: 528, column: 30, scope: !1346)
!1352 = !DILocation(line: 528, column: 13, scope: !1264)
!1353 = !DILocation(line: 529, column: 25, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1346, file: !1, line: 528, column: 38)
!1355 = !DILocation(line: 529, column: 23, scope: !1354)
!1356 = !DILocation(line: 530, column: 17, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1354, file: !1, line: 530, column: 17)
!1358 = !DILocation(line: 530, column: 27, scope: !1357)
!1359 = !DILocation(line: 530, column: 17, scope: !1354)
!1360 = !DILocation(line: 531, column: 17, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1357, file: !1, line: 530, column: 36)
!1362 = !DILocation(line: 534, column: 34, scope: !1354)
!1363 = !DILocation(line: 534, column: 40, scope: !1354)
!1364 = !DILocation(line: 534, column: 43, scope: !1354)
!1365 = !DILocation(line: 534, column: 47, scope: !1354)
!1366 = !DILocation(line: 534, column: 53, scope: !1354)
!1367 = !DILocation(line: 534, column: 51, scope: !1354)
!1368 = !DILocation(line: 534, column: 13, scope: !1354)
!1369 = !DILocation(line: 534, column: 24, scope: !1354)
!1370 = !DILocation(line: 534, column: 28, scope: !1354)
!1371 = !DILocation(line: 534, column: 32, scope: !1354)
!1372 = !DILocation(line: 535, column: 35, scope: !1354)
!1373 = !DILocation(line: 535, column: 41, scope: !1354)
!1374 = !DILocation(line: 535, column: 44, scope: !1354)
!1375 = !DILocation(line: 535, column: 48, scope: !1354)
!1376 = !DILocation(line: 535, column: 55, scope: !1354)
!1377 = !DILocation(line: 535, column: 53, scope: !1354)
!1378 = !DILocation(line: 535, column: 13, scope: !1354)
!1379 = !DILocation(line: 535, column: 24, scope: !1354)
!1380 = !DILocation(line: 535, column: 28, scope: !1354)
!1381 = !DILocation(line: 535, column: 33, scope: !1354)
!1382 = !DILocation(line: 536, column: 13, scope: !1354)
!1383 = !DILocation(line: 536, column: 24, scope: !1354)
!1384 = !DILocation(line: 536, column: 33, scope: !1354)
!1385 = !DILocation(line: 537, column: 32, scope: !1354)
!1386 = !DILocation(line: 537, column: 38, scope: !1354)
!1387 = !DILocation(line: 537, column: 41, scope: !1354)
!1388 = !DILocation(line: 537, column: 13, scope: !1354)
!1389 = !DILocation(line: 537, column: 24, scope: !1354)
!1390 = !DILocation(line: 537, column: 30, scope: !1354)
!1391 = !DILocation(line: 543, column: 9, scope: !1354)
!1392 = !DILocation(line: 545, column: 18, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1264, file: !1, line: 545, column: 9)
!1394 = !DILocation(line: 545, column: 20, scope: !1393)
!1395 = !DILocation(line: 545, column: 16, scope: !1393)
!1396 = !DILocation(line: 545, column: 14, scope: !1393)
!1397 = !DILocation(line: 545, column: 25, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1393, file: !1, line: 545, column: 9)
!1399 = !DILocation(line: 545, column: 29, scope: !1398)
!1400 = !DILocation(line: 545, column: 27, scope: !1398)
!1401 = !DILocation(line: 545, column: 9, scope: !1393)
!1402 = !DILocation(line: 546, column: 17, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 546, column: 17)
!1404 = distinct !DILexicalBlock(scope: !1398, file: !1, line: 545, column: 41)
!1405 = !DILocation(line: 546, column: 72, scope: !1403)
!1406 = !DILocation(line: 546, column: 17, scope: !1404)
!1407 = !DILocation(line: 547, column: 17, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1403, file: !1, line: 546, column: 78)
!1409 = !DILocation(line: 550, column: 18, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 550, column: 17)
!1411 = !DILocation(line: 551, column: 17, scope: !1410)
!1412 = !DILocation(line: 551, column: 20, scope: !1410)
!1413 = !DILocation(line: 551, column: 26, scope: !1410)
!1414 = !DILocation(line: 551, column: 29, scope: !1410)
!1415 = !DILocation(line: 551, column: 33, scope: !1410)
!1416 = !DILocation(line: 551, column: 39, scope: !1410)
!1417 = !DILocation(line: 551, column: 37, scope: !1410)
!1418 = !DILocation(line: 552, column: 17, scope: !1410)
!1419 = !DILocation(line: 552, column: 20, scope: !1410)
!1420 = !DILocation(line: 552, column: 26, scope: !1410)
!1421 = !DILocation(line: 552, column: 29, scope: !1410)
!1422 = !DILocation(line: 552, column: 33, scope: !1410)
!1423 = !DILocation(line: 552, column: 38, scope: !1410)
!1424 = !DILocation(line: 552, column: 43, scope: !1410)
!1425 = !DILocation(line: 550, column: 17, scope: !1404)
!1426 = !DILocation(line: 554, column: 17, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1410, file: !1, line: 553, column: 13)
!1428 = !DILocation(line: 557, column: 25, scope: !1404)
!1429 = !DILocation(line: 557, column: 23, scope: !1404)
!1430 = !DILocation(line: 558, column: 17, scope: !1431)
!1431 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 558, column: 17)
!1432 = !DILocation(line: 558, column: 27, scope: !1431)
!1433 = !DILocation(line: 558, column: 17, scope: !1404)
!1434 = !DILocation(line: 559, column: 17, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1431, file: !1, line: 558, column: 36)
!1436 = !DILocation(line: 562, column: 34, scope: !1404)
!1437 = !DILocation(line: 562, column: 40, scope: !1404)
!1438 = !DILocation(line: 562, column: 43, scope: !1404)
!1439 = !DILocation(line: 562, column: 47, scope: !1404)
!1440 = !DILocation(line: 562, column: 53, scope: !1404)
!1441 = !DILocation(line: 562, column: 51, scope: !1404)
!1442 = !DILocation(line: 562, column: 13, scope: !1404)
!1443 = !DILocation(line: 562, column: 24, scope: !1404)
!1444 = !DILocation(line: 562, column: 28, scope: !1404)
!1445 = !DILocation(line: 562, column: 32, scope: !1404)
!1446 = !DILocation(line: 563, column: 35, scope: !1404)
!1447 = !DILocation(line: 563, column: 41, scope: !1404)
!1448 = !DILocation(line: 563, column: 44, scope: !1404)
!1449 = !DILocation(line: 563, column: 48, scope: !1404)
!1450 = !DILocation(line: 563, column: 55, scope: !1404)
!1451 = !DILocation(line: 563, column: 53, scope: !1404)
!1452 = !DILocation(line: 563, column: 13, scope: !1404)
!1453 = !DILocation(line: 563, column: 24, scope: !1404)
!1454 = !DILocation(line: 563, column: 28, scope: !1404)
!1455 = !DILocation(line: 563, column: 33, scope: !1404)
!1456 = !DILocation(line: 564, column: 13, scope: !1404)
!1457 = !DILocation(line: 564, column: 24, scope: !1404)
