; ModuleID = 'src/core/ngx_palloc.c'
source_filename = "src/core/ngx_palloc.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_pool_cleanup_file_t = type { i32, i8*, %struct.ngx_log_s* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_palloc.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !9, !12, !15, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !7, line: 64, baseType: !8)
!7 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 125, baseType: !14)
!13 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 120, baseType: !14)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !18, line: 18, baseType: !19)
!18 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !20, line: 57, size: 320, elements: !21)
!20 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !{!22, !32, !33, !34, !174, !181, !193}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !19, file: !20, line: 58, baseType: !23, size: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !20, line: 54, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 49, size: 128, elements: !25)
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !24, file: !20, line: 50, baseType: !5, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !20, line: 51, baseType: !5, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !20, line: 52, baseType: !16, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !24, file: !20, line: 53, baseType: !30, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !31, line: 79, baseType: !12)
!31 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !19, file: !20, line: 59, baseType: !15, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !19, file: !20, line: 60, baseType: !16, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !19, file: !20, line: 61, baseType: !35, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !18, line: 19, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !38, line: 59, size: 64, elements: !39)
!38 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = !{!40, !173}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !37, file: !38, line: 60, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !38, line: 18, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !38, line: 20, size: 352, elements: !44)
!44 = !{!45, !46, !47, !50, !51, !52, !53, !55, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !43, file: !38, line: 21, baseType: !5, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !38, line: 22, baseType: !5, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !43, file: !38, line: 23, baseType: !48, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !13, line: 222, baseType: !49)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !43, file: !38, line: 24, baseType: !48, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !43, file: !38, line: 26, baseType: !5, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !43, file: !38, line: 27, baseType: !5, size: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !43, file: !38, line: 28, baseType: !54, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !38, line: 16, baseType: !4)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !43, file: !38, line: 29, baseType: !56, size: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !18, line: 23, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !59, line: 16, size: 1216, elements: !60)
!59 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = !{!61, !64, !71, !116, !117, !118, !158, !159}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !58, file: !59, line: 17, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !63, line: 16, baseType: !49)
!63 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !59, line: 18, baseType: !65, size: 64, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !66, line: 19, baseType: !67)
!66 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 16, size: 64, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !66, line: 17, baseType: !15, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !66, line: 18, baseType: !5, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !58, file: !59, line: 19, baseType: !72, size: 960, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !63, line: 17, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !74, line: 4, size: 960, elements: !75)
!74 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = !{!76, !78, !79, !81, !82, !84, !85, !87, !89, !91, !92, !93, !94, !95, !96, !99, !100, !102, !103, !109, !110, !111}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !73, file: !74, line: 6, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !13, line: 232, baseType: !14)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !73, file: !74, line: 7, baseType: !77, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !73, file: !74, line: 8, baseType: !80, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !13, line: 227, baseType: !14)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !73, file: !74, line: 9, baseType: !80, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !73, file: !74, line: 10, baseType: !83, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !13, line: 217, baseType: !14)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !73, file: !74, line: 11, baseType: !83, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !73, file: !74, line: 13, baseType: !86, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !13, line: 212, baseType: !14)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !73, file: !74, line: 14, baseType: !88, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !13, line: 304, baseType: !14)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !73, file: !74, line: 15, baseType: !90, size: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !13, line: 309, baseType: !14)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !73, file: !74, line: 16, baseType: !14, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !73, file: !74, line: 17, baseType: !77, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !73, file: !74, line: 18, baseType: !77, size: 32, offset: 352)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !73, file: !74, line: 19, baseType: !48, size: 32, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !73, file: !74, line: 20, baseType: !48, size: 32, offset: 416)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !73, file: !74, line: 21, baseType: !97, size: 32, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !13, line: 237, baseType: !98)
!98 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !73, file: !74, line: 22, baseType: !97, size: 32, offset: 480)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !73, file: !74, line: 23, baseType: !101, size: 32, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !13, line: 242, baseType: !49)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !73, file: !74, line: 24, baseType: !101, size: 32, offset: 544)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !73, file: !74, line: 26, baseType: !104, size: 64, offset: 576)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !13, line: 288, size: 64, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !104, file: !13, line: 288, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !13, line: 75, baseType: !98)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !104, file: !13, line: 288, baseType: !98, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !73, file: !74, line: 27, baseType: !104, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !73, file: !74, line: 28, baseType: !104, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !73, file: !74, line: 29, baseType: !112, size: 192, offset: 768)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !114)
!113 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !58, file: !59, line: 21, baseType: !48, size: 32, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !58, file: !59, line: 22, baseType: !48, size: 32, offset: 1120)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !58, file: !59, line: 24, baseType: !119, size: 32, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !18, line: 20, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !122, line: 50, size: 320, elements: !123)
!122 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !{!124, !125, !138, !142, !143, !148, !149, !154, !155, !157}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !121, file: !122, line: 51, baseType: !30, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !121, file: !122, line: 52, baseType: !126, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !18, line: 21, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !129, line: 89, size: 160, elements: !130)
!129 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !{!131, !132, !133, !137}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !128, file: !129, line: 90, baseType: !62, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 91, baseType: !65, size: 64, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !128, file: !129, line: 93, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !126, !119}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 94, baseType: !4, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !121, file: !122, line: 54, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !140, line: 98, baseType: !141)
!140 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!141 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !121, file: !122, line: 56, baseType: !107, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !121, file: !122, line: 58, baseType: !144, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !122, line: 45, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{!5, !119, !5, !15}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !122, line: 59, baseType: !4, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !121, file: !122, line: 61, baseType: !150, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !122, line: 46, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !119, !30, !5, !15}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !121, file: !122, line: 62, baseType: !4, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !121, file: !122, line: 70, baseType: !156, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !122, line: 72, baseType: !119, size: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !58, file: !59, line: 37, baseType: !14, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !58, file: !59, line: 38, baseType: !14, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !43, file: !38, line: 30, baseType: !41, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !43, file: !38, line: 34, baseType: !14, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !43, file: !38, line: 40, baseType: !14, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !43, file: !38, line: 43, baseType: !14, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !43, file: !38, line: 45, baseType: !14, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !43, file: !38, line: 46, baseType: !14, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !43, file: !38, line: 47, baseType: !14, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !43, file: !38, line: 48, baseType: !14, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !43, file: !38, line: 49, baseType: !14, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !43, file: !38, line: 50, baseType: !14, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !43, file: !38, line: 52, baseType: !14, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !43, file: !38, line: 53, baseType: !14, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !43, file: !38, line: 55, baseType: !49, size: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !38, line: 61, baseType: !35, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !19, file: !20, line: 62, baseType: !175, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !20, line: 41, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !20, line: 43, size: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !20, line: 44, baseType: !175, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !177, file: !20, line: 45, baseType: !4, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !19, file: !20, line: 63, baseType: !182, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !20, line: 32, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !20, line: 34, size: 96, elements: !185)
!185 = !{!186, !191, !192}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !184, file: !20, line: 35, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !20, line: 30, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !4}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !20, line: 36, baseType: !4, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !20, line: 37, baseType: !182, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !19, file: !20, line: 64, baseType: !119, size: 32, offset: 288)
!194 = !{i32 2, !"Dwarf Version", i32 4}
!195 = !{i32 2, !"Debug Info Version", i32 3}
!196 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!197 = distinct !DISubprogram(name: "ngx_create_pool", scope: !1, file: !1, line: 19, type: !198, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!16, !15, !119}
!200 = !{!201, !202, !203}
!201 = !DILocalVariable(name: "size", arg: 1, scope: !197, file: !1, line: 19, type: !15)
!202 = !DILocalVariable(name: "log", arg: 2, scope: !197, file: !1, line: 19, type: !119)
!203 = !DILocalVariable(name: "p", scope: !197, file: !1, line: 21, type: !16)
!204 = !{!205, !205, i64 0}
!205 = !{!"int", !206, i64 0}
!206 = !{!"omnipotent char", !207, i64 0}
!207 = !{!"Simple C/C++ TBAA"}
!208 = !DIExpression()
!209 = !DILocation(line: 19, column: 24, scope: !197)
!210 = !{!211, !211, i64 0}
!211 = !{!"any pointer", !206, i64 0}
!212 = !DILocation(line: 19, column: 41, scope: !197)
!213 = !DILocation(line: 21, column: 5, scope: !197)
!214 = !DILocation(line: 21, column: 18, scope: !197)
!215 = !DILocation(line: 23, column: 42, scope: !197)
!216 = !DILocation(line: 23, column: 48, scope: !197)
!217 = !DILocation(line: 23, column: 9, scope: !197)
!218 = !DILocation(line: 23, column: 7, scope: !197)
!219 = !DILocation(line: 24, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !197, file: !1, line: 24, column: 9)
!221 = !DILocation(line: 24, column: 11, scope: !220)
!222 = !DILocation(line: 24, column: 9, scope: !197)
!223 = !DILocation(line: 25, column: 9, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !1, line: 24, column: 20)
!225 = !DILocation(line: 28, column: 28, scope: !197)
!226 = !DILocation(line: 28, column: 17, scope: !197)
!227 = !DILocation(line: 28, column: 30, scope: !197)
!228 = !DILocation(line: 28, column: 5, scope: !197)
!229 = !DILocation(line: 28, column: 8, scope: !197)
!230 = !DILocation(line: 28, column: 10, scope: !197)
!231 = !DILocation(line: 28, column: 15, scope: !197)
!232 = !{!233, !211, i64 0}
!233 = !{!"ngx_pool_s", !234, i64 0, !205, i64 16, !211, i64 20, !211, i64 24, !211, i64 28, !211, i64 32, !211, i64 36}
!234 = !{!"", !211, i64 0, !211, i64 4, !211, i64 8, !205, i64 12}
!235 = !DILocation(line: 29, column: 27, scope: !197)
!236 = !DILocation(line: 29, column: 16, scope: !197)
!237 = !DILocation(line: 29, column: 31, scope: !197)
!238 = !DILocation(line: 29, column: 29, scope: !197)
!239 = !DILocation(line: 29, column: 5, scope: !197)
!240 = !DILocation(line: 29, column: 8, scope: !197)
!241 = !DILocation(line: 29, column: 10, scope: !197)
!242 = !DILocation(line: 29, column: 14, scope: !197)
!243 = !{!233, !211, i64 4}
!244 = !DILocation(line: 30, column: 5, scope: !197)
!245 = !DILocation(line: 30, column: 8, scope: !197)
!246 = !DILocation(line: 30, column: 10, scope: !197)
!247 = !DILocation(line: 30, column: 15, scope: !197)
!248 = !{!233, !211, i64 8}
!249 = !DILocation(line: 31, column: 5, scope: !197)
!250 = !DILocation(line: 31, column: 8, scope: !197)
!251 = !DILocation(line: 31, column: 10, scope: !197)
!252 = !DILocation(line: 31, column: 17, scope: !197)
!253 = !{!233, !205, i64 12}
!254 = !DILocation(line: 33, column: 12, scope: !197)
!255 = !DILocation(line: 33, column: 17, scope: !197)
!256 = !DILocation(line: 33, column: 10, scope: !197)
!257 = !DILocation(line: 34, column: 15, scope: !197)
!258 = !DILocation(line: 34, column: 22, scope: !197)
!259 = !DILocation(line: 34, column: 20, scope: !197)
!260 = !DILocation(line: 34, column: 14, scope: !197)
!261 = !DILocation(line: 34, column: 49, scope: !197)
!262 = !DILocation(line: 34, column: 56, scope: !197)
!263 = !DILocation(line: 34, column: 5, scope: !197)
!264 = !DILocation(line: 34, column: 8, scope: !197)
!265 = !DILocation(line: 34, column: 12, scope: !197)
!266 = !{!233, !205, i64 16}
!267 = !DILocation(line: 36, column: 18, scope: !197)
!268 = !DILocation(line: 36, column: 5, scope: !197)
!269 = !DILocation(line: 36, column: 8, scope: !197)
!270 = !DILocation(line: 36, column: 16, scope: !197)
!271 = !{!233, !211, i64 20}
!272 = !DILocation(line: 37, column: 5, scope: !197)
!273 = !DILocation(line: 37, column: 8, scope: !197)
!274 = !DILocation(line: 37, column: 14, scope: !197)
!275 = !{!233, !211, i64 24}
!276 = !DILocation(line: 38, column: 5, scope: !197)
!277 = !DILocation(line: 38, column: 8, scope: !197)
!278 = !DILocation(line: 38, column: 14, scope: !197)
!279 = !{!233, !211, i64 28}
!280 = !DILocation(line: 39, column: 5, scope: !197)
!281 = !DILocation(line: 39, column: 8, scope: !197)
!282 = !DILocation(line: 39, column: 16, scope: !197)
!283 = !{!233, !211, i64 32}
!284 = !DILocation(line: 40, column: 14, scope: !197)
!285 = !DILocation(line: 40, column: 5, scope: !197)
!286 = !DILocation(line: 40, column: 8, scope: !197)
!287 = !DILocation(line: 40, column: 12, scope: !197)
!288 = !{!233, !211, i64 36}
!289 = !DILocation(line: 42, column: 12, scope: !197)
!290 = !DILocation(line: 42, column: 5, scope: !197)
!291 = !DILocation(line: 43, column: 1, scope: !197)
!292 = distinct !DISubprogram(name: "ngx_destroy_pool", scope: !1, file: !1, line: 47, type: !293, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !16}
!295 = !{!296, !297, !298, !299, !300}
!296 = !DILocalVariable(name: "pool", arg: 1, scope: !292, file: !1, line: 47, type: !16)
!297 = !DILocalVariable(name: "p", scope: !292, file: !1, line: 49, type: !16)
!298 = !DILocalVariable(name: "n", scope: !292, file: !1, line: 49, type: !16)
!299 = !DILocalVariable(name: "l", scope: !292, file: !1, line: 50, type: !175)
!300 = !DILocalVariable(name: "c", scope: !292, file: !1, line: 51, type: !182)
!301 = !DILocation(line: 47, column: 30, scope: !292)
!302 = !DILocation(line: 49, column: 5, scope: !292)
!303 = !DILocation(line: 49, column: 26, scope: !292)
!304 = !DILocation(line: 49, column: 30, scope: !292)
!305 = !DILocation(line: 50, column: 5, scope: !292)
!306 = !DILocation(line: 50, column: 26, scope: !292)
!307 = !DILocation(line: 51, column: 5, scope: !292)
!308 = !DILocation(line: 51, column: 26, scope: !292)
!309 = !DILocation(line: 53, column: 14, scope: !310)
!310 = distinct !DILexicalBlock(scope: !292, file: !1, line: 53, column: 5)
!311 = !DILocation(line: 53, column: 20, scope: !310)
!312 = !DILocation(line: 53, column: 12, scope: !310)
!313 = !DILocation(line: 53, column: 10, scope: !310)
!314 = !DILocation(line: 53, column: 29, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !1, line: 53, column: 5)
!316 = !DILocation(line: 53, column: 5, scope: !310)
!317 = !DILocation(line: 54, column: 13, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !1, line: 54, column: 13)
!319 = distinct !DILexicalBlock(scope: !315, file: !1, line: 53, column: 45)
!320 = !DILocation(line: 54, column: 16, scope: !318)
!321 = !{!322, !211, i64 0}
!322 = !{!"ngx_pool_cleanup_s", !211, i64 0, !211, i64 4, !211, i64 8}
!323 = !DILocation(line: 54, column: 13, scope: !319)
!324 = !DILocation(line: 57, column: 13, scope: !325)
!325 = distinct !DILexicalBlock(scope: !318, file: !1, line: 54, column: 25)
!326 = !DILocation(line: 57, column: 16, scope: !325)
!327 = !DILocation(line: 57, column: 24, scope: !325)
!328 = !DILocation(line: 57, column: 27, scope: !325)
!329 = !{!322, !211, i64 4}
!330 = !DILocation(line: 58, column: 9, scope: !325)
!331 = !DILocation(line: 59, column: 5, scope: !319)
!332 = !DILocation(line: 53, column: 36, scope: !315)
!333 = !DILocation(line: 53, column: 39, scope: !315)
!334 = !{!322, !211, i64 8}
!335 = !DILocation(line: 53, column: 34, scope: !315)
!336 = !DILocation(line: 53, column: 5, scope: !315)
!337 = distinct !{!337, !316, !338}
!338 = !DILocation(line: 59, column: 5, scope: !310)
!339 = !DILocation(line: 83, column: 14, scope: !340)
!340 = distinct !DILexicalBlock(scope: !292, file: !1, line: 83, column: 5)
!341 = !DILocation(line: 83, column: 20, scope: !340)
!342 = !DILocation(line: 83, column: 12, scope: !340)
!343 = !DILocation(line: 83, column: 10, scope: !340)
!344 = !DILocation(line: 83, column: 27, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !1, line: 83, column: 5)
!346 = !DILocation(line: 83, column: 5, scope: !340)
!347 = !DILocation(line: 84, column: 13, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !1, line: 84, column: 13)
!349 = distinct !DILexicalBlock(scope: !345, file: !1, line: 83, column: 43)
!350 = !DILocation(line: 84, column: 16, scope: !348)
!351 = !{!352, !211, i64 4}
!352 = !{!"ngx_pool_large_s", !211, i64 0, !211, i64 4}
!353 = !DILocation(line: 84, column: 13, scope: !349)
!354 = !DILocation(line: 85, column: 22, scope: !355)
!355 = distinct !DILexicalBlock(scope: !348, file: !1, line: 84, column: 23)
!356 = !DILocation(line: 85, column: 25, scope: !355)
!357 = !DILocation(line: 85, column: 13, scope: !355)
!358 = !DILocation(line: 86, column: 9, scope: !355)
!359 = !DILocation(line: 87, column: 5, scope: !349)
!360 = !DILocation(line: 83, column: 34, scope: !345)
!361 = !DILocation(line: 83, column: 37, scope: !345)
!362 = !{!352, !211, i64 0}
!363 = !DILocation(line: 83, column: 32, scope: !345)
!364 = !DILocation(line: 83, column: 5, scope: !345)
!365 = distinct !{!365, !346, !366}
!366 = !DILocation(line: 87, column: 5, scope: !340)
!367 = !DILocation(line: 89, column: 14, scope: !368)
!368 = distinct !DILexicalBlock(scope: !292, file: !1, line: 89, column: 5)
!369 = !DILocation(line: 89, column: 12, scope: !368)
!370 = !DILocation(line: 89, column: 24, scope: !368)
!371 = !DILocation(line: 89, column: 30, scope: !368)
!372 = !DILocation(line: 89, column: 32, scope: !368)
!373 = !DILocation(line: 89, column: 22, scope: !368)
!374 = !DILocation(line: 89, column: 10, scope: !368)
!375 = !DILocation(line: 90, column: 18, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !1, line: 89, column: 72)
!377 = distinct !DILexicalBlock(scope: !368, file: !1, line: 89, column: 5)
!378 = !DILocation(line: 90, column: 9, scope: !376)
!379 = !DILocation(line: 92, column: 13, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !1, line: 92, column: 13)
!381 = !DILocation(line: 92, column: 15, scope: !380)
!382 = !DILocation(line: 92, column: 13, scope: !376)
!383 = !DILocation(line: 93, column: 13, scope: !384)
!384 = distinct !DILexicalBlock(scope: !380, file: !1, line: 92, column: 24)
!385 = !DILocation(line: 95, column: 5, scope: !376)
!386 = !DILocation(line: 89, column: 54, scope: !377)
!387 = !DILocation(line: 89, column: 52, scope: !377)
!388 = !DILocation(line: 89, column: 61, scope: !377)
!389 = !DILocation(line: 89, column: 64, scope: !377)
!390 = !DILocation(line: 89, column: 66, scope: !377)
!391 = !DILocation(line: 89, column: 59, scope: !377)
!392 = !DILocation(line: 89, column: 5, scope: !377)
!393 = distinct !{!393, !394, !395}
!394 = !DILocation(line: 89, column: 5, scope: !368)
!395 = !DILocation(line: 95, column: 5, scope: !368)
!396 = !DILocation(line: 96, column: 1, scope: !292)
!397 = distinct !DISubprogram(name: "ngx_reset_pool", scope: !1, file: !1, line: 100, type: !293, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !398)
!398 = !{!399, !400, !401}
!399 = !DILocalVariable(name: "pool", arg: 1, scope: !397, file: !1, line: 100, type: !16)
!400 = !DILocalVariable(name: "p", scope: !397, file: !1, line: 102, type: !16)
!401 = !DILocalVariable(name: "l", scope: !397, file: !1, line: 103, type: !175)
!402 = !DILocation(line: 100, column: 28, scope: !397)
!403 = !DILocation(line: 102, column: 5, scope: !397)
!404 = !DILocation(line: 102, column: 24, scope: !397)
!405 = !DILocation(line: 103, column: 5, scope: !397)
!406 = !DILocation(line: 103, column: 24, scope: !397)
!407 = !DILocation(line: 105, column: 14, scope: !408)
!408 = distinct !DILexicalBlock(scope: !397, file: !1, line: 105, column: 5)
!409 = !DILocation(line: 105, column: 20, scope: !408)
!410 = !DILocation(line: 105, column: 12, scope: !408)
!411 = !DILocation(line: 105, column: 10, scope: !408)
!412 = !DILocation(line: 105, column: 27, scope: !413)
!413 = distinct !DILexicalBlock(scope: !408, file: !1, line: 105, column: 5)
!414 = !DILocation(line: 105, column: 5, scope: !408)
!415 = !DILocation(line: 106, column: 13, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !1, line: 106, column: 13)
!417 = distinct !DILexicalBlock(scope: !413, file: !1, line: 105, column: 43)
!418 = !DILocation(line: 106, column: 16, scope: !416)
!419 = !DILocation(line: 106, column: 13, scope: !417)
!420 = !DILocation(line: 107, column: 22, scope: !421)
!421 = distinct !DILexicalBlock(scope: !416, file: !1, line: 106, column: 23)
!422 = !DILocation(line: 107, column: 25, scope: !421)
!423 = !DILocation(line: 107, column: 13, scope: !421)
!424 = !DILocation(line: 108, column: 9, scope: !421)
!425 = !DILocation(line: 109, column: 5, scope: !417)
!426 = !DILocation(line: 105, column: 34, scope: !413)
!427 = !DILocation(line: 105, column: 37, scope: !413)
!428 = !DILocation(line: 105, column: 32, scope: !413)
!429 = !DILocation(line: 105, column: 5, scope: !413)
!430 = distinct !{!430, !414, !431}
!431 = !DILocation(line: 109, column: 5, scope: !408)
!432 = !DILocation(line: 111, column: 14, scope: !433)
!433 = distinct !DILexicalBlock(scope: !397, file: !1, line: 111, column: 5)
!434 = !DILocation(line: 111, column: 12, scope: !433)
!435 = !DILocation(line: 111, column: 10, scope: !433)
!436 = !DILocation(line: 111, column: 20, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !1, line: 111, column: 5)
!438 = !DILocation(line: 111, column: 5, scope: !433)
!439 = !DILocation(line: 112, column: 32, scope: !440)
!440 = distinct !DILexicalBlock(scope: !437, file: !1, line: 111, column: 38)
!441 = !DILocation(line: 112, column: 21, scope: !440)
!442 = !DILocation(line: 112, column: 34, scope: !440)
!443 = !DILocation(line: 112, column: 9, scope: !440)
!444 = !DILocation(line: 112, column: 12, scope: !440)
!445 = !DILocation(line: 112, column: 14, scope: !440)
!446 = !DILocation(line: 112, column: 19, scope: !440)
!447 = !DILocation(line: 113, column: 9, scope: !440)
!448 = !DILocation(line: 113, column: 12, scope: !440)
!449 = !DILocation(line: 113, column: 14, scope: !440)
!450 = !DILocation(line: 113, column: 21, scope: !440)
!451 = !DILocation(line: 114, column: 5, scope: !440)
!452 = !DILocation(line: 111, column: 27, scope: !437)
!453 = !DILocation(line: 111, column: 30, scope: !437)
!454 = !DILocation(line: 111, column: 32, scope: !437)
!455 = !DILocation(line: 111, column: 25, scope: !437)
!456 = !DILocation(line: 111, column: 5, scope: !437)
!457 = distinct !{!457, !438, !458}
!458 = !DILocation(line: 114, column: 5, scope: !433)
!459 = !DILocation(line: 116, column: 21, scope: !397)
!460 = !DILocation(line: 116, column: 5, scope: !397)
!461 = !DILocation(line: 116, column: 11, scope: !397)
!462 = !DILocation(line: 116, column: 19, scope: !397)
!463 = !DILocation(line: 117, column: 5, scope: !397)
!464 = !DILocation(line: 117, column: 11, scope: !397)
!465 = !DILocation(line: 117, column: 17, scope: !397)
!466 = !DILocation(line: 118, column: 5, scope: !397)
!467 = !DILocation(line: 118, column: 11, scope: !397)
!468 = !DILocation(line: 118, column: 17, scope: !397)
!469 = !DILocation(line: 119, column: 1, scope: !397)
!470 = distinct !DISubprogram(name: "ngx_palloc", scope: !1, file: !1, line: 123, type: !471, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!4, !16, !15}
!473 = !{!474, !475}
!474 = !DILocalVariable(name: "pool", arg: 1, scope: !470, file: !1, line: 123, type: !16)
!475 = !DILocalVariable(name: "size", arg: 2, scope: !470, file: !1, line: 123, type: !15)
!476 = !DILocation(line: 123, column: 24, scope: !470)
!477 = !DILocation(line: 123, column: 37, scope: !470)
!478 = !DILocation(line: 126, column: 9, scope: !479)
!479 = distinct !DILexicalBlock(scope: !470, file: !1, line: 126, column: 9)
!480 = !DILocation(line: 126, column: 17, scope: !479)
!481 = !DILocation(line: 126, column: 23, scope: !479)
!482 = !DILocation(line: 126, column: 14, scope: !479)
!483 = !DILocation(line: 126, column: 9, scope: !470)
!484 = !DILocation(line: 127, column: 33, scope: !485)
!485 = distinct !DILexicalBlock(scope: !479, file: !1, line: 126, column: 28)
!486 = !DILocation(line: 127, column: 39, scope: !485)
!487 = !DILocation(line: 127, column: 16, scope: !485)
!488 = !DILocation(line: 127, column: 9, scope: !485)
!489 = !DILocation(line: 131, column: 29, scope: !470)
!490 = !DILocation(line: 131, column: 35, scope: !470)
!491 = !DILocation(line: 131, column: 12, scope: !470)
!492 = !DILocation(line: 131, column: 5, scope: !470)
!493 = !DILocation(line: 132, column: 1, scope: !470)
!494 = distinct !DISubprogram(name: "ngx_palloc_small", scope: !1, file: !1, line: 149, type: !495, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{!4, !16, !15, !30}
!497 = !{!498, !499, !500, !501, !502}
!498 = !DILocalVariable(name: "pool", arg: 1, scope: !494, file: !1, line: 149, type: !16)
!499 = !DILocalVariable(name: "size", arg: 2, scope: !494, file: !1, line: 149, type: !15)
!500 = !DILocalVariable(name: "align", arg: 3, scope: !494, file: !1, line: 149, type: !30)
!501 = !DILocalVariable(name: "m", scope: !494, file: !1, line: 151, type: !5)
!502 = !DILocalVariable(name: "p", scope: !494, file: !1, line: 152, type: !16)
!503 = !DILocation(line: 149, column: 30, scope: !494)
!504 = !DILocation(line: 149, column: 43, scope: !494)
!505 = !DILocation(line: 149, column: 60, scope: !494)
!506 = !DILocation(line: 151, column: 5, scope: !494)
!507 = !DILocation(line: 151, column: 18, scope: !494)
!508 = !DILocation(line: 152, column: 5, scope: !494)
!509 = !DILocation(line: 152, column: 18, scope: !494)
!510 = !DILocation(line: 154, column: 9, scope: !494)
!511 = !DILocation(line: 154, column: 15, scope: !494)
!512 = !DILocation(line: 154, column: 7, scope: !494)
!513 = !DILocation(line: 156, column: 5, scope: !494)
!514 = distinct !{!514, !513, !515}
!515 = !DILocation(line: 171, column: 15, scope: !494)
!516 = !DILocation(line: 157, column: 13, scope: !517)
!517 = distinct !DILexicalBlock(scope: !494, file: !1, line: 156, column: 8)
!518 = !DILocation(line: 157, column: 16, scope: !517)
!519 = !DILocation(line: 157, column: 18, scope: !517)
!520 = !DILocation(line: 157, column: 11, scope: !517)
!521 = !DILocation(line: 159, column: 13, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !1, line: 159, column: 13)
!523 = !DILocation(line: 159, column: 13, scope: !517)
!524 = !DILocation(line: 160, column: 17, scope: !525)
!525 = distinct !DILexicalBlock(scope: !522, file: !1, line: 159, column: 20)
!526 = !DILocation(line: 160, column: 15, scope: !525)
!527 = !DILocation(line: 161, column: 9, scope: !525)
!528 = !DILocation(line: 163, column: 23, scope: !529)
!529 = distinct !DILexicalBlock(scope: !517, file: !1, line: 163, column: 13)
!530 = !DILocation(line: 163, column: 26, scope: !529)
!531 = !DILocation(line: 163, column: 28, scope: !529)
!532 = !DILocation(line: 163, column: 34, scope: !529)
!533 = !DILocation(line: 163, column: 32, scope: !529)
!534 = !DILocation(line: 163, column: 40, scope: !529)
!535 = !DILocation(line: 163, column: 37, scope: !529)
!536 = !DILocation(line: 163, column: 13, scope: !517)
!537 = !DILocation(line: 164, column: 25, scope: !538)
!538 = distinct !DILexicalBlock(scope: !529, file: !1, line: 163, column: 46)
!539 = !DILocation(line: 164, column: 29, scope: !538)
!540 = !DILocation(line: 164, column: 27, scope: !538)
!541 = !DILocation(line: 164, column: 13, scope: !538)
!542 = !DILocation(line: 164, column: 16, scope: !538)
!543 = !DILocation(line: 164, column: 18, scope: !538)
!544 = !DILocation(line: 164, column: 23, scope: !538)
!545 = !DILocation(line: 166, column: 20, scope: !538)
!546 = !DILocation(line: 166, column: 13, scope: !538)
!547 = !DILocation(line: 169, column: 13, scope: !517)
!548 = !DILocation(line: 169, column: 16, scope: !517)
!549 = !DILocation(line: 169, column: 18, scope: !517)
!550 = !DILocation(line: 169, column: 11, scope: !517)
!551 = !DILocation(line: 171, column: 5, scope: !517)
!552 = !DILocation(line: 171, column: 14, scope: !494)
!553 = !DILocation(line: 173, column: 29, scope: !494)
!554 = !DILocation(line: 173, column: 35, scope: !494)
!555 = !DILocation(line: 173, column: 12, scope: !494)
!556 = !DILocation(line: 173, column: 5, scope: !494)
!557 = !DILocation(line: 174, column: 1, scope: !494)
!558 = distinct !DISubprogram(name: "ngx_palloc_large", scope: !1, file: !1, line: 214, type: !471, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !559)
!559 = !{!560, !561, !562, !563, !564}
!560 = !DILocalVariable(name: "pool", arg: 1, scope: !558, file: !1, line: 214, type: !16)
!561 = !DILocalVariable(name: "size", arg: 2, scope: !558, file: !1, line: 214, type: !15)
!562 = !DILocalVariable(name: "p", scope: !558, file: !1, line: 216, type: !4)
!563 = !DILocalVariable(name: "n", scope: !558, file: !1, line: 217, type: !30)
!564 = !DILocalVariable(name: "large", scope: !558, file: !1, line: 218, type: !175)
!565 = !DILocation(line: 214, column: 30, scope: !558)
!566 = !DILocation(line: 214, column: 43, scope: !558)
!567 = !DILocation(line: 216, column: 5, scope: !558)
!568 = !DILocation(line: 216, column: 24, scope: !558)
!569 = !DILocation(line: 217, column: 5, scope: !558)
!570 = !DILocation(line: 217, column: 24, scope: !558)
!571 = !DILocation(line: 218, column: 5, scope: !558)
!572 = !DILocation(line: 218, column: 24, scope: !558)
!573 = !DILocation(line: 220, column: 19, scope: !558)
!574 = !DILocation(line: 220, column: 25, scope: !558)
!575 = !DILocation(line: 220, column: 31, scope: !558)
!576 = !DILocation(line: 220, column: 9, scope: !558)
!577 = !DILocation(line: 220, column: 7, scope: !558)
!578 = !DILocation(line: 221, column: 9, scope: !579)
!579 = distinct !DILexicalBlock(scope: !558, file: !1, line: 221, column: 9)
!580 = !DILocation(line: 221, column: 11, scope: !579)
!581 = !DILocation(line: 221, column: 9, scope: !558)
!582 = !DILocation(line: 222, column: 9, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !1, line: 221, column: 20)
!584 = !DILocation(line: 225, column: 7, scope: !558)
!585 = !DILocation(line: 227, column: 18, scope: !586)
!586 = distinct !DILexicalBlock(scope: !558, file: !1, line: 227, column: 5)
!587 = !DILocation(line: 227, column: 24, scope: !586)
!588 = !DILocation(line: 227, column: 16, scope: !586)
!589 = !DILocation(line: 227, column: 10, scope: !586)
!590 = !DILocation(line: 227, column: 31, scope: !591)
!591 = distinct !DILexicalBlock(scope: !586, file: !1, line: 227, column: 5)
!592 = !DILocation(line: 227, column: 5, scope: !586)
!593 = !DILocation(line: 228, column: 13, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 228, column: 13)
!595 = distinct !DILexicalBlock(scope: !591, file: !1, line: 227, column: 59)
!596 = !DILocation(line: 228, column: 20, scope: !594)
!597 = !DILocation(line: 228, column: 26, scope: !594)
!598 = !DILocation(line: 228, column: 13, scope: !595)
!599 = !DILocation(line: 229, column: 28, scope: !600)
!600 = distinct !DILexicalBlock(scope: !594, file: !1, line: 228, column: 35)
!601 = !DILocation(line: 229, column: 13, scope: !600)
!602 = !DILocation(line: 229, column: 20, scope: !600)
!603 = !DILocation(line: 229, column: 26, scope: !600)
!604 = !DILocation(line: 230, column: 20, scope: !600)
!605 = !DILocation(line: 230, column: 13, scope: !600)
!606 = !DILocation(line: 233, column: 14, scope: !607)
!607 = distinct !DILexicalBlock(scope: !595, file: !1, line: 233, column: 13)
!608 = !DILocation(line: 233, column: 17, scope: !607)
!609 = !DILocation(line: 233, column: 13, scope: !595)
!610 = !DILocation(line: 234, column: 13, scope: !611)
!611 = distinct !DILexicalBlock(scope: !607, file: !1, line: 233, column: 22)
!612 = !DILocation(line: 236, column: 5, scope: !595)
!613 = !DILocation(line: 227, column: 46, scope: !591)
!614 = !DILocation(line: 227, column: 53, scope: !591)
!615 = !DILocation(line: 227, column: 44, scope: !591)
!616 = !DILocation(line: 227, column: 5, scope: !591)
!617 = distinct !{!617, !592, !618}
!618 = !DILocation(line: 236, column: 5, scope: !586)
!619 = !DILocation(line: 238, column: 30, scope: !558)
!620 = !DILocation(line: 238, column: 13, scope: !558)
!621 = !DILocation(line: 238, column: 11, scope: !558)
!622 = !DILocation(line: 239, column: 9, scope: !623)
!623 = distinct !DILexicalBlock(scope: !558, file: !1, line: 239, column: 9)
!624 = !DILocation(line: 239, column: 15, scope: !623)
!625 = !DILocation(line: 239, column: 9, scope: !558)
!626 = !DILocation(line: 240, column: 18, scope: !627)
!627 = distinct !DILexicalBlock(scope: !623, file: !1, line: 239, column: 24)
!628 = !DILocation(line: 240, column: 9, scope: !627)
!629 = !DILocation(line: 241, column: 9, scope: !627)
!630 = !DILocation(line: 244, column: 20, scope: !558)
!631 = !DILocation(line: 244, column: 5, scope: !558)
!632 = !DILocation(line: 244, column: 12, scope: !558)
!633 = !DILocation(line: 244, column: 18, scope: !558)
!634 = !DILocation(line: 245, column: 19, scope: !558)
!635 = !DILocation(line: 245, column: 25, scope: !558)
!636 = !DILocation(line: 245, column: 5, scope: !558)
!637 = !DILocation(line: 245, column: 12, scope: !558)
!638 = !DILocation(line: 245, column: 17, scope: !558)
!639 = !DILocation(line: 246, column: 19, scope: !558)
!640 = !DILocation(line: 246, column: 5, scope: !558)
!641 = !DILocation(line: 246, column: 11, scope: !558)
!642 = !DILocation(line: 246, column: 17, scope: !558)
!643 = !DILocation(line: 248, column: 12, scope: !558)
!644 = !DILocation(line: 248, column: 5, scope: !558)
!645 = !DILocation(line: 249, column: 1, scope: !558)
!646 = distinct !DISubprogram(name: "ngx_pnalloc", scope: !1, file: !1, line: 136, type: !471, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !647)
!647 = !{!648, !649}
!648 = !DILocalVariable(name: "pool", arg: 1, scope: !646, file: !1, line: 136, type: !16)
!649 = !DILocalVariable(name: "size", arg: 2, scope: !646, file: !1, line: 136, type: !15)
!650 = !DILocation(line: 136, column: 25, scope: !646)
!651 = !DILocation(line: 136, column: 38, scope: !646)
!652 = !DILocation(line: 139, column: 9, scope: !653)
!653 = distinct !DILexicalBlock(scope: !646, file: !1, line: 139, column: 9)
!654 = !DILocation(line: 139, column: 17, scope: !653)
!655 = !DILocation(line: 139, column: 23, scope: !653)
!656 = !DILocation(line: 139, column: 14, scope: !653)
!657 = !DILocation(line: 139, column: 9, scope: !646)
!658 = !DILocation(line: 140, column: 33, scope: !659)
!659 = distinct !DILexicalBlock(scope: !653, file: !1, line: 139, column: 28)
!660 = !DILocation(line: 140, column: 39, scope: !659)
!661 = !DILocation(line: 140, column: 16, scope: !659)
!662 = !DILocation(line: 140, column: 9, scope: !659)
!663 = !DILocation(line: 144, column: 29, scope: !646)
!664 = !DILocation(line: 144, column: 35, scope: !646)
!665 = !DILocation(line: 144, column: 12, scope: !646)
!666 = !DILocation(line: 144, column: 5, scope: !646)
!667 = !DILocation(line: 145, column: 1, scope: !646)
!668 = distinct !DISubprogram(name: "ngx_pmemalign", scope: !1, file: !1, line: 253, type: !669, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!4, !16, !15, !15}
!671 = !{!672, !673, !674, !675, !676}
!672 = !DILocalVariable(name: "pool", arg: 1, scope: !668, file: !1, line: 253, type: !16)
!673 = !DILocalVariable(name: "size", arg: 2, scope: !668, file: !1, line: 253, type: !15)
!674 = !DILocalVariable(name: "alignment", arg: 3, scope: !668, file: !1, line: 253, type: !15)
!675 = !DILocalVariable(name: "p", scope: !668, file: !1, line: 255, type: !4)
!676 = !DILocalVariable(name: "large", scope: !668, file: !1, line: 256, type: !175)
!677 = !DILocation(line: 253, column: 27, scope: !668)
!678 = !DILocation(line: 253, column: 40, scope: !668)
!679 = !DILocation(line: 253, column: 53, scope: !668)
!680 = !DILocation(line: 255, column: 5, scope: !668)
!681 = !DILocation(line: 255, column: 24, scope: !668)
!682 = !DILocation(line: 256, column: 5, scope: !668)
!683 = !DILocation(line: 256, column: 24, scope: !668)
!684 = !DILocation(line: 258, column: 22, scope: !668)
!685 = !DILocation(line: 258, column: 33, scope: !668)
!686 = !DILocation(line: 258, column: 39, scope: !668)
!687 = !DILocation(line: 258, column: 45, scope: !668)
!688 = !DILocation(line: 258, column: 9, scope: !668)
!689 = !DILocation(line: 258, column: 7, scope: !668)
!690 = !DILocation(line: 259, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !668, file: !1, line: 259, column: 9)
!692 = !DILocation(line: 259, column: 11, scope: !691)
!693 = !DILocation(line: 259, column: 9, scope: !668)
!694 = !DILocation(line: 260, column: 9, scope: !695)
!695 = distinct !DILexicalBlock(scope: !691, file: !1, line: 259, column: 20)
!696 = !DILocation(line: 263, column: 30, scope: !668)
!697 = !DILocation(line: 263, column: 13, scope: !668)
!698 = !DILocation(line: 263, column: 11, scope: !668)
!699 = !DILocation(line: 264, column: 9, scope: !700)
!700 = distinct !DILexicalBlock(scope: !668, file: !1, line: 264, column: 9)
!701 = !DILocation(line: 264, column: 15, scope: !700)
!702 = !DILocation(line: 264, column: 9, scope: !668)
!703 = !DILocation(line: 265, column: 18, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !1, line: 264, column: 24)
!705 = !DILocation(line: 265, column: 9, scope: !704)
!706 = !DILocation(line: 266, column: 9, scope: !704)
!707 = !DILocation(line: 269, column: 20, scope: !668)
!708 = !DILocation(line: 269, column: 5, scope: !668)
!709 = !DILocation(line: 269, column: 12, scope: !668)
!710 = !DILocation(line: 269, column: 18, scope: !668)
!711 = !DILocation(line: 270, column: 19, scope: !668)
!712 = !DILocation(line: 270, column: 25, scope: !668)
!713 = !DILocation(line: 270, column: 5, scope: !668)
!714 = !DILocation(line: 270, column: 12, scope: !668)
!715 = !DILocation(line: 270, column: 17, scope: !668)
!716 = !DILocation(line: 271, column: 19, scope: !668)
!717 = !DILocation(line: 271, column: 5, scope: !668)
!718 = !DILocation(line: 271, column: 11, scope: !668)
!719 = !DILocation(line: 271, column: 17, scope: !668)
!720 = !DILocation(line: 273, column: 12, scope: !668)
!721 = !DILocation(line: 273, column: 5, scope: !668)
!722 = !DILocation(line: 274, column: 1, scope: !668)
!723 = distinct !DISubprogram(name: "ngx_pfree", scope: !1, file: !1, line: 278, type: !724, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !728)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !16, !4}
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !31, line: 78, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !13, line: 140, baseType: !49)
!728 = !{!729, !730, !731}
!729 = !DILocalVariable(name: "pool", arg: 1, scope: !723, file: !1, line: 278, type: !16)
!730 = !DILocalVariable(name: "p", arg: 2, scope: !723, file: !1, line: 278, type: !4)
!731 = !DILocalVariable(name: "l", scope: !723, file: !1, line: 280, type: !175)
!732 = !DILocation(line: 278, column: 23, scope: !723)
!733 = !DILocation(line: 278, column: 35, scope: !723)
!734 = !DILocation(line: 280, column: 5, scope: !723)
!735 = !DILocation(line: 280, column: 24, scope: !723)
!736 = !DILocation(line: 282, column: 14, scope: !737)
!737 = distinct !DILexicalBlock(scope: !723, file: !1, line: 282, column: 5)
!738 = !DILocation(line: 282, column: 20, scope: !737)
!739 = !DILocation(line: 282, column: 12, scope: !737)
!740 = !DILocation(line: 282, column: 10, scope: !737)
!741 = !DILocation(line: 282, column: 27, scope: !742)
!742 = distinct !DILexicalBlock(scope: !737, file: !1, line: 282, column: 5)
!743 = !DILocation(line: 282, column: 5, scope: !737)
!744 = !DILocation(line: 283, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 283, column: 13)
!746 = distinct !DILexicalBlock(scope: !742, file: !1, line: 282, column: 43)
!747 = !DILocation(line: 283, column: 18, scope: !745)
!748 = !DILocation(line: 283, column: 21, scope: !745)
!749 = !DILocation(line: 283, column: 15, scope: !745)
!750 = !DILocation(line: 283, column: 13, scope: !746)
!751 = !DILocation(line: 286, column: 22, scope: !752)
!752 = distinct !DILexicalBlock(scope: !745, file: !1, line: 283, column: 28)
!753 = !DILocation(line: 286, column: 25, scope: !752)
!754 = !DILocation(line: 286, column: 13, scope: !752)
!755 = !DILocation(line: 287, column: 13, scope: !752)
!756 = !DILocation(line: 287, column: 16, scope: !752)
!757 = !DILocation(line: 287, column: 22, scope: !752)
!758 = !DILocation(line: 289, column: 13, scope: !752)
!759 = !DILocation(line: 291, column: 5, scope: !746)
!760 = !DILocation(line: 282, column: 34, scope: !742)
!761 = !DILocation(line: 282, column: 37, scope: !742)
!762 = !DILocation(line: 282, column: 32, scope: !742)
!763 = !DILocation(line: 282, column: 5, scope: !742)
!764 = distinct !{!764, !743, !765}
!765 = !DILocation(line: 291, column: 5, scope: !737)
!766 = !DILocation(line: 293, column: 5, scope: !723)
!767 = !DILocation(line: 294, column: 1, scope: !723)
!768 = distinct !DISubprogram(name: "ngx_pcalloc", scope: !1, file: !1, line: 298, type: !471, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !769)
!769 = !{!770, !771, !772}
!770 = !DILocalVariable(name: "pool", arg: 1, scope: !768, file: !1, line: 298, type: !16)
!771 = !DILocalVariable(name: "size", arg: 2, scope: !768, file: !1, line: 298, type: !15)
!772 = !DILocalVariable(name: "p", scope: !768, file: !1, line: 300, type: !4)
!773 = !DILocation(line: 298, column: 25, scope: !768)
!774 = !DILocation(line: 298, column: 38, scope: !768)
!775 = !DILocation(line: 300, column: 5, scope: !768)
!776 = !DILocation(line: 300, column: 11, scope: !768)
!777 = !DILocation(line: 302, column: 20, scope: !768)
!778 = !DILocation(line: 302, column: 26, scope: !768)
!779 = !DILocation(line: 302, column: 9, scope: !768)
!780 = !DILocation(line: 302, column: 7, scope: !768)
!781 = !DILocation(line: 303, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !768, file: !1, line: 303, column: 9)
!783 = !DILocation(line: 303, column: 9, scope: !768)
!784 = !DILocation(line: 304, column: 9, scope: !785)
!785 = distinct !DILexicalBlock(scope: !782, file: !1, line: 303, column: 12)
!786 = !DILocation(line: 305, column: 5, scope: !785)
!787 = !DILocation(line: 307, column: 12, scope: !768)
!788 = !DILocation(line: 308, column: 1, scope: !768)
!789 = !DILocation(line: 307, column: 5, scope: !768)
!790 = distinct !DISubprogram(name: "ngx_pool_cleanup_add", scope: !1, file: !1, line: 312, type: !791, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!182, !16, !15}
!793 = !{!794, !795, !796}
!794 = !DILocalVariable(name: "p", arg: 1, scope: !790, file: !1, line: 312, type: !16)
!795 = !DILocalVariable(name: "size", arg: 2, scope: !790, file: !1, line: 312, type: !15)
!796 = !DILocalVariable(name: "c", scope: !790, file: !1, line: 314, type: !182)
!797 = !DILocation(line: 312, column: 34, scope: !790)
!798 = !DILocation(line: 312, column: 44, scope: !790)
!799 = !DILocation(line: 314, column: 5, scope: !790)
!800 = !DILocation(line: 314, column: 26, scope: !790)
!801 = !DILocation(line: 316, column: 20, scope: !790)
!802 = !DILocation(line: 316, column: 9, scope: !790)
!803 = !DILocation(line: 316, column: 7, scope: !790)
!804 = !DILocation(line: 317, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !790, file: !1, line: 317, column: 9)
!806 = !DILocation(line: 317, column: 11, scope: !805)
!807 = !DILocation(line: 317, column: 9, scope: !790)
!808 = !DILocation(line: 318, column: 9, scope: !809)
!809 = distinct !DILexicalBlock(scope: !805, file: !1, line: 317, column: 20)
!810 = !DILocation(line: 321, column: 9, scope: !811)
!811 = distinct !DILexicalBlock(scope: !790, file: !1, line: 321, column: 9)
!812 = !DILocation(line: 321, column: 9, scope: !790)
!813 = !DILocation(line: 322, column: 30, scope: !814)
!814 = distinct !DILexicalBlock(scope: !811, file: !1, line: 321, column: 15)
!815 = !DILocation(line: 322, column: 33, scope: !814)
!816 = !DILocation(line: 322, column: 19, scope: !814)
!817 = !DILocation(line: 322, column: 9, scope: !814)
!818 = !DILocation(line: 322, column: 12, scope: !814)
!819 = !DILocation(line: 322, column: 17, scope: !814)
!820 = !DILocation(line: 323, column: 13, scope: !821)
!821 = distinct !DILexicalBlock(scope: !814, file: !1, line: 323, column: 13)
!822 = !DILocation(line: 323, column: 16, scope: !821)
!823 = !DILocation(line: 323, column: 21, scope: !821)
!824 = !DILocation(line: 323, column: 13, scope: !814)
!825 = !DILocation(line: 324, column: 13, scope: !826)
!826 = distinct !DILexicalBlock(scope: !821, file: !1, line: 323, column: 30)
!827 = !DILocation(line: 327, column: 5, scope: !814)
!828 = !DILocation(line: 328, column: 9, scope: !829)
!829 = distinct !DILexicalBlock(scope: !811, file: !1, line: 327, column: 12)
!830 = !DILocation(line: 328, column: 12, scope: !829)
!831 = !DILocation(line: 328, column: 17, scope: !829)
!832 = !DILocation(line: 331, column: 5, scope: !790)
!833 = !DILocation(line: 331, column: 8, scope: !790)
!834 = !DILocation(line: 331, column: 16, scope: !790)
!835 = !DILocation(line: 332, column: 15, scope: !790)
!836 = !DILocation(line: 332, column: 18, scope: !790)
!837 = !DILocation(line: 332, column: 5, scope: !790)
!838 = !DILocation(line: 332, column: 8, scope: !790)
!839 = !DILocation(line: 332, column: 13, scope: !790)
!840 = !DILocation(line: 334, column: 18, scope: !790)
!841 = !DILocation(line: 334, column: 5, scope: !790)
!842 = !DILocation(line: 334, column: 8, scope: !790)
!843 = !DILocation(line: 334, column: 16, scope: !790)
!844 = !DILocation(line: 338, column: 12, scope: !790)
!845 = !DILocation(line: 338, column: 5, scope: !790)
!846 = !DILocation(line: 339, column: 1, scope: !790)
!847 = distinct !DISubprogram(name: "ngx_pool_run_cleanup_file", scope: !1, file: !1, line: 343, type: !848, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !16, !62}
!850 = !{!851, !852, !853, !854}
!851 = !DILocalVariable(name: "p", arg: 1, scope: !847, file: !1, line: 343, type: !16)
!852 = !DILocalVariable(name: "fd", arg: 2, scope: !847, file: !1, line: 343, type: !62)
!853 = !DILocalVariable(name: "c", scope: !847, file: !1, line: 345, type: !182)
!854 = !DILocalVariable(name: "cf", scope: !847, file: !1, line: 346, type: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_file_t", file: !20, line: 72, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 68, size: 96, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !857, file: !20, line: 69, baseType: !62, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !857, file: !20, line: 70, baseType: !5, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !857, file: !20, line: 71, baseType: !119, size: 32, offset: 64)
!862 = !DILocation(line: 343, column: 39, scope: !847)
!863 = !DILocation(line: 343, column: 51, scope: !847)
!864 = !DILocation(line: 345, column: 5, scope: !847)
!865 = !DILocation(line: 345, column: 31, scope: !847)
!866 = !DILocation(line: 346, column: 5, scope: !847)
!867 = !DILocation(line: 346, column: 31, scope: !847)
!868 = !DILocation(line: 348, column: 14, scope: !869)
!869 = distinct !DILexicalBlock(scope: !847, file: !1, line: 348, column: 5)
!870 = !DILocation(line: 348, column: 17, scope: !869)
!871 = !DILocation(line: 348, column: 12, scope: !869)
!872 = !DILocation(line: 348, column: 10, scope: !869)
!873 = !DILocation(line: 348, column: 26, scope: !874)
!874 = distinct !DILexicalBlock(scope: !869, file: !1, line: 348, column: 5)
!875 = !DILocation(line: 348, column: 5, scope: !869)
!876 = !DILocation(line: 349, column: 13, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 349, column: 13)
!878 = distinct !DILexicalBlock(scope: !874, file: !1, line: 348, column: 42)
!879 = !DILocation(line: 349, column: 16, scope: !877)
!880 = !DILocation(line: 349, column: 24, scope: !877)
!881 = !DILocation(line: 349, column: 13, scope: !878)
!882 = !DILocation(line: 351, column: 18, scope: !883)
!883 = distinct !DILexicalBlock(scope: !877, file: !1, line: 349, column: 50)
!884 = !DILocation(line: 351, column: 21, scope: !883)
!885 = !DILocation(line: 351, column: 16, scope: !883)
!886 = !DILocation(line: 353, column: 17, scope: !887)
!887 = distinct !DILexicalBlock(scope: !883, file: !1, line: 353, column: 17)
!888 = !DILocation(line: 353, column: 21, scope: !887)
!889 = !{!890, !205, i64 0}
!890 = !{!"", !205, i64 0, !211, i64 4, !211, i64 8}
!891 = !DILocation(line: 353, column: 27, scope: !887)
!892 = !DILocation(line: 353, column: 24, scope: !887)
!893 = !DILocation(line: 353, column: 17, scope: !883)
!894 = !DILocation(line: 354, column: 17, scope: !895)
!895 = distinct !DILexicalBlock(scope: !887, file: !1, line: 353, column: 31)
!896 = !DILocation(line: 354, column: 20, scope: !895)
!897 = !DILocation(line: 354, column: 28, scope: !895)
!898 = !DILocation(line: 355, column: 17, scope: !895)
!899 = !DILocation(line: 355, column: 20, scope: !895)
!900 = !DILocation(line: 355, column: 28, scope: !895)
!901 = !DILocation(line: 356, column: 17, scope: !895)
!902 = !DILocation(line: 358, column: 9, scope: !883)
!903 = !DILocation(line: 359, column: 5, scope: !878)
!904 = !DILocation(line: 348, column: 33, scope: !874)
!905 = !DILocation(line: 348, column: 36, scope: !874)
!906 = !DILocation(line: 348, column: 31, scope: !874)
!907 = !DILocation(line: 348, column: 5, scope: !874)
!908 = distinct !{!908, !875, !909}
!909 = !DILocation(line: 359, column: 5, scope: !869)
!910 = !DILocation(line: 360, column: 1, scope: !847)
!911 = distinct !DISubprogram(name: "ngx_pool_cleanup_file", scope: !1, file: !1, line: 364, type: !189, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !912)
!912 = !{!913, !914}
!913 = !DILocalVariable(name: "data", arg: 1, scope: !911, file: !1, line: 364, type: !4)
!914 = !DILocalVariable(name: "c", scope: !911, file: !1, line: 366, type: !855)
!915 = !DILocation(line: 364, column: 29, scope: !911)
!916 = !DILocation(line: 366, column: 5, scope: !911)
!917 = !DILocation(line: 366, column: 31, scope: !911)
!918 = !DILocation(line: 366, column: 35, scope: !911)
!919 = !DILocation(line: 371, column: 24, scope: !920)
!920 = distinct !DILexicalBlock(scope: !911, file: !1, line: 371, column: 9)
!921 = !DILocation(line: 371, column: 27, scope: !920)
!922 = !DILocation(line: 371, column: 9, scope: !920)
!923 = !DILocation(line: 371, column: 31, scope: !920)
!924 = !DILocation(line: 371, column: 9, scope: !911)
!925 = !DILocation(line: 372, column: 9, scope: !926)
