; ModuleID = 'src/core/ngx_file.c'
source_filename = "src/core/ngx_file.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "temp_number", scope: !2, file: !3, line: 15, type: !68, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !64)
!3 = !DIFile(filename: "src/core/ngx_file.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !11, !14, !17, !58, !45, !59, !62, !29}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !9, line: 64, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 191, baseType: !13)
!12 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_t", file: !20, line: 62, baseType: !21)
!20 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 50, size: 384, elements: !22)
!22 = !{!23, !31, !32, !36, !48, !50, !55, !56, !57}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !20, line: 51, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !25, line: 19, baseType: !26)
!25 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 16, size: 64, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, file: !25, line: 17, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 120, baseType: !13)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !26, file: !25, line: 18, baseType: !7, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, file: !20, line: 52, baseType: !29, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !21, file: !20, line: 53, baseType: !33, size: 96, offset: 96)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 3)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "manager", scope: !21, file: !20, line: 55, baseType: !37, size: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_manager_pt", file: !20, line: 45, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !6}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !42, line: 16, baseType: !43)
!42 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !44, line: 16, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !46, line: 79, baseType: !47)
!46 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !12, line: 125, baseType: !13)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "purger", scope: !21, file: !20, line: 56, baseType: !49, size: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_purger_pt", file: !20, line: 46, baseType: !38)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "loader", scope: !21, file: !20, line: 57, baseType: !51, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_path_loader_pt", file: !20, line: 47, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !6}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !20, line: 58, baseType: !6, size: 32, offset: 288)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !21, file: !20, line: 60, baseType: !7, size: 32, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !21, file: !20, line: 61, baseType: !45, size: 32, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !60, line: 16, baseType: !61)
!60 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !12, line: 304, baseType: !13)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !12, line: 222, baseType: !63)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !{!65, !73, !0}
!65 = !DIGlobalVariableExpression(var: !66)
!66 = distinct !DIGlobalVariable(name: "ngx_temp_number", scope: !2, file: !3, line: 16, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !69, line: 106, baseType: !70)
!69 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !69, line: 98, baseType: !72)
!72 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIGlobalVariableExpression(var: !74)
!74 = distinct !DIGlobalVariable(name: "ngx_random_number", scope: !2, file: !3, line: 17, type: !75, isLocal: false, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_int_t", file: !69, line: 97, baseType: !76)
!76 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!80 = distinct !DISubprogram(name: "ngx_get_full_name", scope: !3, file: !3, line: 21, type: !81, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !243)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !85, !242, !242}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !46, line: 78, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !12, line: 140, baseType: !63)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !87, line: 18, baseType: !88)
!87 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !89, line: 57, size: 320, elements: !90)
!89 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = !{!91, !99, !100, !101, !225, !232, !241}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !88, file: !89, line: 58, baseType: !92, size: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !89, line: 54, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 49, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !93, file: !89, line: 50, baseType: !7, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !93, file: !89, line: 51, baseType: !7, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !89, line: 52, baseType: !85, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !93, file: !89, line: 53, baseType: !45, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !88, file: !89, line: 59, baseType: !29, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !88, file: !89, line: 60, baseType: !85, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !88, file: !89, line: 61, baseType: !102, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !87, line: 19, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !105, line: 59, size: 64, elements: !106)
!105 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!106 = !{!107, !224}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !104, file: !105, line: 60, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !105, line: 18, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !105, line: 20, size: 352, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !120, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !110, file: !105, line: 21, baseType: !7, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !105, line: 22, baseType: !7, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !110, file: !105, line: 23, baseType: !62, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !110, file: !105, line: 24, baseType: !62, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !110, file: !105, line: 26, baseType: !7, size: 32, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !110, file: !105, line: 27, baseType: !7, size: 32, offset: 160)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !110, file: !105, line: 28, baseType: !119, size: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !105, line: 16, baseType: !6)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !110, file: !105, line: 29, baseType: !121, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !87, line: 23, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !20, line: 16, size: 1216, elements: !124)
!124 = !{!125, !128, !129, !170, !171, !172, !209, !210}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !123, file: !20, line: 17, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !127, line: 16, baseType: !63)
!127 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !20, line: 18, baseType: !24, size: 64, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !123, file: !20, line: 19, baseType: !130, size: 960, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !127, line: 17, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !132, line: 4, size: 960, elements: !133)
!132 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!133 = !{!134, !136, !137, !139, !140, !142, !143, !145, !146, !148, !149, !150, !151, !152, !153, !155, !156, !158, !159, !165, !166, !167}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !131, file: !132, line: 6, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !12, line: 232, baseType: !13)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !131, file: !132, line: 7, baseType: !135, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !131, file: !132, line: 8, baseType: !138, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !12, line: 227, baseType: !13)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !131, file: !132, line: 9, baseType: !138, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !131, file: !132, line: 10, baseType: !141, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !12, line: 217, baseType: !13)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !131, file: !132, line: 11, baseType: !141, size: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !131, file: !132, line: 13, baseType: !144, size: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !12, line: 212, baseType: !13)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !131, file: !132, line: 14, baseType: !61, size: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !131, file: !132, line: 15, baseType: !147, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !12, line: 309, baseType: !13)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !131, file: !132, line: 16, baseType: !13, size: 32, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !131, file: !132, line: 17, baseType: !135, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !131, file: !132, line: 18, baseType: !135, size: 32, offset: 352)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !131, file: !132, line: 19, baseType: !62, size: 32, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !131, file: !132, line: 20, baseType: !62, size: 32, offset: 416)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !131, file: !132, line: 21, baseType: !154, size: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !12, line: 237, baseType: !76)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !131, file: !132, line: 22, baseType: !154, size: 32, offset: 480)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !131, file: !132, line: 23, baseType: !157, size: 32, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !12, line: 242, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !131, file: !132, line: 24, baseType: !157, size: 32, offset: 544)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !131, file: !132, line: 26, baseType: !160, size: 64, offset: 576)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !12, line: 288, size: 64, elements: !161)
!161 = !{!162, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !160, file: !12, line: 288, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !12, line: 75, baseType: !76)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !160, file: !12, line: 288, baseType: !76, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !131, file: !132, line: 27, baseType: !160, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !131, file: !132, line: 28, baseType: !160, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !131, file: !132, line: 29, baseType: !168, size: 192, offset: 768)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 192, elements: !34)
!169 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !123, file: !20, line: 21, baseType: !62, size: 32, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !123, file: !20, line: 22, baseType: !62, size: 32, offset: 1120)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !123, file: !20, line: 24, baseType: !173, size: 32, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !87, line: 20, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !176, line: 50, size: 320, elements: !177)
!176 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!177 = !{!178, !179, !192, !193, !194, !199, !200, !205, !206, !208}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !175, file: !176, line: 51, baseType: !45, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !175, file: !176, line: 52, baseType: !180, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !87, line: 21, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !183, line: 89, size: 160, elements: !184)
!183 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!184 = !{!185, !186, !187, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !182, file: !183, line: 90, baseType: !126, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 91, baseType: !24, size: 64, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !182, file: !183, line: 93, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !180, !173}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !183, line: 94, baseType: !6, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !175, file: !176, line: 54, baseType: !71, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !175, file: !176, line: 56, baseType: !163, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !175, file: !176, line: 58, baseType: !195, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !176, line: 45, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!7, !173, !7, !29}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !175, file: !176, line: 59, baseType: !6, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !175, file: !176, line: 61, baseType: !201, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !176, line: 46, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !173, !45, !7, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !175, file: !176, line: 62, baseType: !6, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !175, file: !176, line: 70, baseType: !207, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 72, baseType: !173, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !123, file: !20, line: 37, baseType: !13, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !123, file: !20, line: 38, baseType: !13, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !110, file: !105, line: 30, baseType: !108, size: 32, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !110, file: !105, line: 34, baseType: !13, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !110, file: !105, line: 40, baseType: !13, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !110, file: !105, line: 43, baseType: !13, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !110, file: !105, line: 45, baseType: !13, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !110, file: !105, line: 46, baseType: !13, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !110, file: !105, line: 47, baseType: !13, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !110, file: !105, line: 48, baseType: !13, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !110, file: !105, line: 49, baseType: !13, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !110, file: !105, line: 50, baseType: !13, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !110, file: !105, line: 52, baseType: !13, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !110, file: !105, line: 53, baseType: !13, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !110, file: !105, line: 55, baseType: !63, size: 32, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !105, line: 61, baseType: !102, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !88, file: !89, line: 62, baseType: !226, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !89, line: 41, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !89, line: 43, size: 64, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !89, line: 44, baseType: !226, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !228, file: !89, line: 45, baseType: !6, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !88, file: !89, line: 63, baseType: !233, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !89, line: 32, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !89, line: 34, size: 96, elements: !236)
!236 = !{!237, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !235, file: !89, line: 35, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !89, line: 30, baseType: !52)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !89, line: 36, baseType: !6, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !89, line: 37, baseType: !233, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !88, file: !89, line: 64, baseType: !173, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!243 = !{!244, !245, !246, !247, !248, !249, !250}
!244 = !DILocalVariable(name: "pool", arg: 1, scope: !80, file: !3, line: 21, type: !85)
!245 = !DILocalVariable(name: "prefix", arg: 2, scope: !80, file: !3, line: 21, type: !242)
!246 = !DILocalVariable(name: "name", arg: 3, scope: !80, file: !3, line: 21, type: !242)
!247 = !DILocalVariable(name: "len", scope: !80, file: !3, line: 23, type: !29)
!248 = !DILocalVariable(name: "p", scope: !80, file: !3, line: 24, type: !7)
!249 = !DILocalVariable(name: "n", scope: !80, file: !3, line: 24, type: !7)
!250 = !DILocalVariable(name: "rc", scope: !80, file: !3, line: 25, type: !83)
!251 = !{!252, !252, i64 0}
!252 = !{!"any pointer", !253, i64 0}
!253 = !{!"omnipotent char", !254, i64 0}
!254 = !{!"Simple C/C++ TBAA"}
!255 = !DIExpression()
!256 = !DILocation(line: 21, column: 31, scope: !80)
!257 = !DILocation(line: 21, column: 48, scope: !80)
!258 = !DILocation(line: 21, column: 67, scope: !80)
!259 = !DILocation(line: 23, column: 5, scope: !80)
!260 = !DILocation(line: 23, column: 17, scope: !80)
!261 = !DILocation(line: 24, column: 5, scope: !80)
!262 = !DILocation(line: 24, column: 17, scope: !80)
!263 = !DILocation(line: 24, column: 21, scope: !80)
!264 = !DILocation(line: 25, column: 5, scope: !80)
!265 = !DILocation(line: 25, column: 17, scope: !80)
!266 = !DILocation(line: 27, column: 29, scope: !80)
!267 = !DILocation(line: 27, column: 10, scope: !80)
!268 = !DILocation(line: 27, column: 8, scope: !80)
!269 = !{!270, !270, i64 0}
!270 = !{!"int", !253, i64 0}
!271 = !DILocation(line: 29, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !80, file: !3, line: 29, column: 9)
!273 = !DILocation(line: 29, column: 12, scope: !272)
!274 = !DILocation(line: 29, column: 9, scope: !80)
!275 = !DILocation(line: 30, column: 16, scope: !276)
!276 = distinct !DILexicalBlock(scope: !272, file: !3, line: 29, column: 23)
!277 = !DILocation(line: 30, column: 9, scope: !276)
!278 = !DILocation(line: 33, column: 11, scope: !80)
!279 = !DILocation(line: 33, column: 19, scope: !80)
!280 = !{!281, !270, i64 0}
!281 = !{!"", !270, i64 0, !252, i64 4}
!282 = !DILocation(line: 33, column: 9, scope: !80)
!283 = !DILocation(line: 43, column: 21, scope: !80)
!284 = !DILocation(line: 43, column: 27, scope: !80)
!285 = !DILocation(line: 43, column: 33, scope: !80)
!286 = !DILocation(line: 43, column: 39, scope: !80)
!287 = !DILocation(line: 43, column: 31, scope: !80)
!288 = !DILocation(line: 43, column: 43, scope: !80)
!289 = !DILocation(line: 43, column: 9, scope: !80)
!290 = !DILocation(line: 43, column: 7, scope: !80)
!291 = !DILocation(line: 44, column: 9, scope: !292)
!292 = distinct !DILexicalBlock(scope: !80, file: !3, line: 44, column: 9)
!293 = !DILocation(line: 44, column: 11, scope: !292)
!294 = !DILocation(line: 44, column: 9, scope: !80)
!295 = !DILocation(line: 45, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 44, column: 20)
!297 = !DILocation(line: 48, column: 9, scope: !80)
!298 = !{!281, !252, i64 4}
!299 = !DILocation(line: 48, column: 7, scope: !80)
!300 = !DILocation(line: 49, column: 17, scope: !80)
!301 = !DILocation(line: 49, column: 20, scope: !80)
!302 = !DILocation(line: 49, column: 26, scope: !80)
!303 = !DILocation(line: 49, column: 32, scope: !80)
!304 = !DILocation(line: 49, column: 38, scope: !80)
!305 = !DILocation(line: 49, column: 42, scope: !80)
!306 = !DILocation(line: 49, column: 5, scope: !80)
!307 = !DILocation(line: 51, column: 18, scope: !80)
!308 = !DILocation(line: 51, column: 5, scope: !80)
!309 = !DILocation(line: 51, column: 11, scope: !80)
!310 = !DILocation(line: 51, column: 15, scope: !80)
!311 = !DILocation(line: 52, column: 18, scope: !80)
!312 = !DILocation(line: 52, column: 5, scope: !80)
!313 = !DILocation(line: 52, column: 11, scope: !80)
!314 = !DILocation(line: 52, column: 16, scope: !80)
!315 = !DILocation(line: 54, column: 5, scope: !80)
!316 = !DILocation(line: 55, column: 1, scope: !80)
!317 = distinct !DISubprogram(name: "ngx_test_full_name", scope: !3, file: !3, line: 59, type: !318, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!83, !242}
!320 = !{!321}
!321 = !DILocalVariable(name: "name", arg: 1, scope: !317, file: !3, line: 59, type: !242)
!322 = !DILocation(line: 59, column: 31, scope: !317)
!323 = !DILocation(line: 98, column: 9, scope: !324)
!324 = distinct !DILexicalBlock(scope: !317, file: !3, line: 98, column: 9)
!325 = !DILocation(line: 98, column: 15, scope: !324)
!326 = !{!253, !253, i64 0}
!327 = !DILocation(line: 98, column: 23, scope: !324)
!328 = !DILocation(line: 98, column: 9, scope: !317)
!329 = !DILocation(line: 99, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !324, file: !3, line: 98, column: 31)
!331 = !DILocation(line: 102, column: 5, scope: !317)
!332 = !DILocation(line: 105, column: 1, scope: !317)
!333 = distinct !DISubprogram(name: "ngx_write_chain_to_temp_file", scope: !3, file: !3, line: 109, type: !334, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !351)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !337, !102}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !12, line: 135, baseType: !63)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_temp_file_t", file: !20, line: 84, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 71, size: 1408, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !339, file: !20, line: 72, baseType: !122, size: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !339, file: !20, line: 73, baseType: !62, size: 32, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !339, file: !20, line: 74, baseType: !18, size: 32, offset: 1248)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !339, file: !20, line: 75, baseType: !85, size: 32, offset: 1280)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "warn", scope: !339, file: !20, line: 76, baseType: !207, size: 32, offset: 1312)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !339, file: !20, line: 78, baseType: !45, size: 32, offset: 1344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !339, file: !20, line: 80, baseType: !13, size: 8, offset: 1376, flags: DIFlagBitField, extraData: i64 1376)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !339, file: !20, line: 81, baseType: !13, size: 1, offset: 1384, flags: DIFlagBitField, extraData: i64 1376)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "clean", scope: !339, file: !20, line: 82, baseType: !13, size: 1, offset: 1385, flags: DIFlagBitField, extraData: i64 1376)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "thread_write", scope: !339, file: !20, line: 83, baseType: !13, size: 1, offset: 1386, flags: DIFlagBitField, extraData: i64 1376)
!351 = !{!352, !353, !354}
!352 = !DILocalVariable(name: "tf", arg: 1, scope: !333, file: !3, line: 109, type: !337)
!353 = !DILocalVariable(name: "chain", arg: 2, scope: !333, file: !3, line: 109, type: !102)
!354 = !DILocalVariable(name: "rc", scope: !333, file: !3, line: 111, type: !83)
!355 = !DILocation(line: 109, column: 47, scope: !333)
!356 = !DILocation(line: 109, column: 64, scope: !333)
!357 = !DILocation(line: 111, column: 5, scope: !333)
!358 = !DILocation(line: 111, column: 16, scope: !333)
!359 = !DILocation(line: 113, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !333, file: !3, line: 113, column: 9)
!361 = !DILocation(line: 113, column: 13, scope: !360)
!362 = !DILocation(line: 113, column: 18, scope: !360)
!363 = !{!364, !270, i64 0}
!364 = !{!"", !365, i64 0, !270, i64 152, !252, i64 156, !252, i64 160, !252, i64 164, !270, i64 168, !270, i64 172, !270, i64 173, !270, i64 173, !270, i64 173}
!365 = !{!"ngx_file_s", !270, i64 0, !281, i64 4, !366, i64 16, !270, i64 136, !270, i64 140, !252, i64 144, !270, i64 148, !270, i64 148}
!366 = !{!"stat", !270, i64 0, !270, i64 4, !270, i64 8, !270, i64 12, !270, i64 16, !270, i64 20, !270, i64 24, !270, i64 28, !270, i64 32, !270, i64 36, !270, i64 40, !270, i64 44, !270, i64 48, !270, i64 52, !367, i64 56, !367, i64 60, !270, i64 64, !270, i64 68, !368, i64 72, !368, i64 80, !368, i64 88, !253, i64 96}
!367 = !{!"long", !253, i64 0}
!368 = !{!"timespec", !367, i64 0, !367, i64 4}
!369 = !DILocation(line: 113, column: 21, scope: !360)
!370 = !DILocation(line: 113, column: 9, scope: !333)
!371 = !DILocation(line: 114, column: 36, scope: !372)
!372 = distinct !DILexicalBlock(scope: !360, file: !3, line: 113, column: 42)
!373 = !DILocation(line: 114, column: 40, scope: !372)
!374 = !DILocation(line: 114, column: 46, scope: !372)
!375 = !DILocation(line: 114, column: 50, scope: !372)
!376 = !{!364, !252, i64 156}
!377 = !DILocation(line: 114, column: 56, scope: !372)
!378 = !DILocation(line: 114, column: 60, scope: !372)
!379 = !{!364, !252, i64 160}
!380 = !DILocation(line: 115, column: 35, scope: !372)
!381 = !DILocation(line: 115, column: 39, scope: !372)
!382 = !DILocation(line: 115, column: 51, scope: !372)
!383 = !DILocation(line: 115, column: 55, scope: !372)
!384 = !DILocation(line: 115, column: 62, scope: !372)
!385 = !DILocation(line: 115, column: 66, scope: !372)
!386 = !{!364, !270, i64 168}
!387 = !DILocation(line: 114, column: 14, scope: !372)
!388 = !DILocation(line: 114, column: 12, scope: !372)
!389 = !DILocation(line: 117, column: 13, scope: !390)
!390 = distinct !DILexicalBlock(scope: !372, file: !3, line: 117, column: 13)
!391 = !DILocation(line: 117, column: 16, scope: !390)
!392 = !DILocation(line: 117, column: 13, scope: !372)
!393 = !DILocation(line: 118, column: 20, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !3, line: 117, column: 27)
!395 = !DILocation(line: 118, column: 13, scope: !394)
!396 = !DILocation(line: 121, column: 13, scope: !397)
!397 = distinct !DILexicalBlock(scope: !372, file: !3, line: 121, column: 13)
!398 = !DILocation(line: 121, column: 17, scope: !397)
!399 = !DILocation(line: 121, column: 13, scope: !372)
!400 = !DILocation(line: 122, column: 13, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 122, column: 13)
!402 = distinct !DILexicalBlock(scope: !397, file: !3, line: 121, column: 28)
!403 = !{!364, !252, i64 144}
!404 = !{!405, !270, i64 0}
!405 = !{!"ngx_log_s", !270, i64 0, !252, i64 4, !367, i64 8, !367, i64 12, !252, i64 16, !252, i64 20, !252, i64 24, !252, i64 28, !252, i64 32, !252, i64 36}
!406 = !DILocation(line: 122, column: 13, scope: !402)
!407 = !{!364, !252, i64 164}
!408 = !DILocation(line: 124, column: 9, scope: !402)
!409 = !DILocation(line: 125, column: 5, scope: !372)
!410 = !DILocation(line: 136, column: 37, scope: !333)
!411 = !DILocation(line: 136, column: 41, scope: !333)
!412 = !DILocation(line: 136, column: 47, scope: !333)
!413 = !DILocation(line: 136, column: 54, scope: !333)
!414 = !DILocation(line: 136, column: 58, scope: !333)
!415 = !{!364, !270, i64 152}
!416 = !DILocation(line: 136, column: 66, scope: !333)
!417 = !DILocation(line: 136, column: 70, scope: !333)
!418 = !DILocation(line: 136, column: 12, scope: !333)
!419 = !DILocation(line: 136, column: 5, scope: !333)
!420 = !DILocation(line: 137, column: 1, scope: !333)
!421 = distinct !DISubprogram(name: "ngx_create_temp_file", scope: !3, file: !3, line: 141, type: !422, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!83, !121, !18, !85, !45, !45, !45}
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !437, !438, !439, !440}
!425 = !DILocalVariable(name: "file", arg: 1, scope: !421, file: !3, line: 141, type: !121)
!426 = !DILocalVariable(name: "path", arg: 2, scope: !421, file: !3, line: 141, type: !18)
!427 = !DILocalVariable(name: "pool", arg: 3, scope: !421, file: !3, line: 141, type: !85)
!428 = !DILocalVariable(name: "persistent", arg: 4, scope: !421, file: !3, line: 142, type: !45)
!429 = !DILocalVariable(name: "clean", arg: 5, scope: !421, file: !3, line: 142, type: !45)
!430 = !DILocalVariable(name: "access", arg: 6, scope: !421, file: !3, line: 142, type: !45)
!431 = !DILocalVariable(name: "levels", scope: !421, file: !3, line: 144, type: !29)
!432 = !DILocalVariable(name: "p", scope: !421, file: !3, line: 145, type: !7)
!433 = !DILocalVariable(name: "n", scope: !421, file: !3, line: 146, type: !11)
!434 = !DILocalVariable(name: "err", scope: !421, file: !3, line: 147, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !436, line: 16, baseType: !63)
!436 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!437 = !DILocalVariable(name: "name", scope: !421, file: !3, line: 148, type: !24)
!438 = !DILocalVariable(name: "prefix", scope: !421, file: !3, line: 149, type: !45)
!439 = !DILocalVariable(name: "cln", scope: !421, file: !3, line: 150, type: !233)
!440 = !DILocalVariable(name: "clnf", scope: !421, file: !3, line: 151, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_file_t", file: !89, line: 72, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 68, size: 96, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !443, file: !89, line: 69, baseType: !126, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !89, line: 70, baseType: !7, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !443, file: !89, line: 71, baseType: !173, size: 32, offset: 64)
!448 = !DILocation(line: 141, column: 34, scope: !421)
!449 = !DILocation(line: 141, column: 52, scope: !421)
!450 = !DILocation(line: 141, column: 70, scope: !421)
!451 = !DILocation(line: 142, column: 16, scope: !421)
!452 = !DILocation(line: 142, column: 39, scope: !421)
!453 = !DILocation(line: 142, column: 57, scope: !421)
!454 = !DILocation(line: 144, column: 5, scope: !421)
!455 = !DILocation(line: 144, column: 31, scope: !421)
!456 = !DILocation(line: 145, column: 5, scope: !421)
!457 = !DILocation(line: 145, column: 31, scope: !421)
!458 = !DILocation(line: 146, column: 5, scope: !421)
!459 = !DILocation(line: 146, column: 31, scope: !421)
!460 = !DILocation(line: 147, column: 5, scope: !421)
!461 = !DILocation(line: 147, column: 31, scope: !421)
!462 = !DILocation(line: 148, column: 5, scope: !421)
!463 = !DILocation(line: 148, column: 31, scope: !421)
!464 = !DILocation(line: 149, column: 5, scope: !421)
!465 = !DILocation(line: 149, column: 31, scope: !421)
!466 = !DILocation(line: 150, column: 5, scope: !421)
!467 = !DILocation(line: 150, column: 31, scope: !421)
!468 = !DILocation(line: 151, column: 5, scope: !421)
!469 = !DILocation(line: 151, column: 31, scope: !421)
!470 = !DILocation(line: 153, column: 9, scope: !471)
!471 = distinct !DILexicalBlock(scope: !421, file: !3, line: 153, column: 9)
!472 = !DILocation(line: 153, column: 15, scope: !471)
!473 = !DILocation(line: 153, column: 20, scope: !471)
!474 = !{!365, !270, i64 4}
!475 = !DILocation(line: 153, column: 9, scope: !421)
!476 = !DILocation(line: 154, column: 16, scope: !477)
!477 = distinct !DILexicalBlock(scope: !471, file: !3, line: 153, column: 25)
!478 = !DILocation(line: 154, column: 22, scope: !477)
!479 = !{i64 0, i64 4, !269, i64 4, i64 4, !251}
!480 = !DILocation(line: 155, column: 16, scope: !477)
!481 = !DILocation(line: 156, column: 16, scope: !477)
!482 = !DILocation(line: 158, column: 5, scope: !477)
!483 = !DILocation(line: 159, column: 16, scope: !484)
!484 = distinct !DILexicalBlock(scope: !471, file: !3, line: 158, column: 12)
!485 = !DILocation(line: 159, column: 22, scope: !484)
!486 = !DILocation(line: 160, column: 18, scope: !484)
!487 = !DILocation(line: 160, column: 24, scope: !484)
!488 = !{!489, !270, i64 8}
!489 = !{!"", !281, i64 0, !270, i64 8, !253, i64 12, !252, i64 24, !252, i64 28, !252, i64 32, !252, i64 36, !252, i64 40, !270, i64 44}
!490 = !DILocation(line: 160, column: 16, scope: !484)
!491 = !DILocation(line: 161, column: 16, scope: !484)
!492 = !DILocation(line: 164, column: 27, scope: !421)
!493 = !DILocation(line: 164, column: 31, scope: !421)
!494 = !DILocation(line: 164, column: 37, scope: !421)
!495 = !DILocation(line: 164, column: 35, scope: !421)
!496 = !DILocation(line: 164, column: 44, scope: !421)
!497 = !DILocation(line: 164, column: 5, scope: !421)
!498 = !DILocation(line: 164, column: 11, scope: !421)
!499 = !DILocation(line: 164, column: 16, scope: !421)
!500 = !DILocation(line: 164, column: 20, scope: !421)
!501 = !DILocation(line: 166, column: 35, scope: !421)
!502 = !DILocation(line: 166, column: 41, scope: !421)
!503 = !DILocation(line: 166, column: 47, scope: !421)
!504 = !DILocation(line: 166, column: 52, scope: !421)
!505 = !DILocation(line: 166, column: 56, scope: !421)
!506 = !DILocation(line: 166, column: 23, scope: !421)
!507 = !DILocation(line: 166, column: 5, scope: !421)
!508 = !DILocation(line: 166, column: 11, scope: !421)
!509 = !DILocation(line: 166, column: 16, scope: !421)
!510 = !DILocation(line: 166, column: 21, scope: !421)
!511 = !{!365, !252, i64 8}
!512 = !DILocation(line: 167, column: 9, scope: !513)
!513 = distinct !DILexicalBlock(scope: !421, file: !3, line: 167, column: 9)
!514 = !DILocation(line: 167, column: 15, scope: !513)
!515 = !DILocation(line: 167, column: 20, scope: !513)
!516 = !DILocation(line: 167, column: 25, scope: !513)
!517 = !DILocation(line: 167, column: 9, scope: !421)
!518 = !DILocation(line: 168, column: 9, scope: !519)
!519 = distinct !DILexicalBlock(scope: !513, file: !3, line: 167, column: 34)
!520 = !DILocation(line: 177, column: 9, scope: !421)
!521 = !DILocation(line: 177, column: 7, scope: !421)
!522 = !DILocation(line: 179, column: 9, scope: !523)
!523 = distinct !DILexicalBlock(scope: !421, file: !3, line: 179, column: 9)
!524 = !DILocation(line: 179, column: 9, scope: !421)
!525 = !DILocation(line: 180, column: 10, scope: !526)
!526 = distinct !DILexicalBlock(scope: !523, file: !3, line: 179, column: 17)
!527 = !DILocation(line: 180, column: 12, scope: !526)
!528 = !DILocation(line: 181, column: 5, scope: !526)
!529 = !DILocation(line: 183, column: 14, scope: !421)
!530 = !DILocation(line: 183, column: 12, scope: !421)
!531 = !DILocation(line: 183, column: 7, scope: !421)
!532 = !DILocation(line: 185, column: 20, scope: !421)
!533 = !DILocation(line: 185, column: 7, scope: !421)
!534 = !DILocation(line: 187, column: 32, scope: !421)
!535 = !DILocation(line: 187, column: 11, scope: !421)
!536 = !DILocation(line: 187, column: 9, scope: !421)
!537 = !DILocation(line: 188, column: 9, scope: !538)
!538 = distinct !DILexicalBlock(scope: !421, file: !3, line: 188, column: 9)
!539 = !DILocation(line: 188, column: 13, scope: !538)
!540 = !DILocation(line: 188, column: 9, scope: !421)
!541 = !DILocation(line: 189, column: 9, scope: !542)
!542 = distinct !DILexicalBlock(scope: !538, file: !3, line: 188, column: 22)
!543 = !DILocation(line: 192, column: 5, scope: !421)
!544 = !DILocation(line: 193, column: 28, scope: !545)
!545 = distinct !DILexicalBlock(scope: !546, file: !3, line: 192, column: 16)
!546 = distinct !DILexicalBlock(scope: !547, file: !3, line: 192, column: 5)
!547 = distinct !DILexicalBlock(scope: !421, file: !3, line: 192, column: 5)
!548 = !DILocation(line: 193, column: 43, scope: !545)
!549 = !DILocation(line: 193, column: 16, scope: !545)
!550 = !DILocation(line: 195, column: 14, scope: !551)
!551 = distinct !DILexicalBlock(scope: !545, file: !3, line: 195, column: 13)
!552 = !DILocation(line: 195, column: 13, scope: !545)
!553 = !DILocation(line: 196, column: 40, scope: !554)
!554 = distinct !DILexicalBlock(scope: !551, file: !3, line: 195, column: 22)
!555 = !DILocation(line: 196, column: 46, scope: !554)
!556 = !DILocation(line: 196, column: 52, scope: !554)
!557 = !DILocation(line: 196, column: 57, scope: !554)
!558 = !DILocation(line: 196, column: 63, scope: !554)
!559 = !DILocation(line: 196, column: 69, scope: !554)
!560 = !DILocation(line: 196, column: 74, scope: !554)
!561 = !DILocation(line: 196, column: 13, scope: !554)
!562 = !DILocation(line: 197, column: 9, scope: !554)
!563 = !DILocation(line: 202, column: 38, scope: !545)
!564 = !DILocation(line: 202, column: 44, scope: !545)
!565 = !DILocation(line: 202, column: 49, scope: !545)
!566 = !DILocation(line: 202, column: 55, scope: !545)
!567 = !DILocation(line: 202, column: 67, scope: !545)
!568 = !DILocation(line: 202, column: 20, scope: !545)
!569 = !DILocation(line: 202, column: 9, scope: !545)
!570 = !DILocation(line: 202, column: 15, scope: !545)
!571 = !DILocation(line: 202, column: 18, scope: !545)
!572 = !{!365, !270, i64 0}
!573 = !DILocation(line: 207, column: 13, scope: !574)
!574 = distinct !DILexicalBlock(scope: !545, file: !3, line: 207, column: 13)
!575 = !DILocation(line: 207, column: 19, scope: !574)
!576 = !DILocation(line: 207, column: 22, scope: !574)
!577 = !DILocation(line: 207, column: 13, scope: !545)
!578 = !DILocation(line: 209, column: 28, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 207, column: 43)
!580 = !DILocation(line: 209, column: 13, scope: !579)
!581 = !DILocation(line: 209, column: 18, scope: !579)
!582 = !DILocation(line: 209, column: 26, scope: !579)
!583 = !{!584, !252, i64 0}
!584 = !{!"ngx_pool_cleanup_s", !252, i64 0, !252, i64 4, !252, i64 8}
!585 = !DILocation(line: 210, column: 20, scope: !579)
!586 = !DILocation(line: 210, column: 25, scope: !579)
!587 = !{!584, !252, i64 4}
!588 = !DILocation(line: 210, column: 18, scope: !579)
!589 = !DILocation(line: 212, column: 24, scope: !579)
!590 = !DILocation(line: 212, column: 30, scope: !579)
!591 = !DILocation(line: 212, column: 13, scope: !579)
!592 = !DILocation(line: 212, column: 19, scope: !579)
!593 = !DILocation(line: 212, column: 22, scope: !579)
!594 = !{!595, !270, i64 0}
!595 = !{!"", !270, i64 0, !252, i64 4, !252, i64 8}
!596 = !DILocation(line: 213, column: 26, scope: !579)
!597 = !DILocation(line: 213, column: 32, scope: !579)
!598 = !DILocation(line: 213, column: 37, scope: !579)
!599 = !DILocation(line: 213, column: 13, scope: !579)
!600 = !DILocation(line: 213, column: 19, scope: !579)
!601 = !DILocation(line: 213, column: 24, scope: !579)
!602 = !{!595, !252, i64 4}
!603 = !DILocation(line: 214, column: 25, scope: !579)
!604 = !DILocation(line: 214, column: 31, scope: !579)
!605 = !{!606, !252, i64 36}
!606 = !{!"ngx_pool_s", !607, i64 0, !270, i64 16, !252, i64 20, !252, i64 24, !252, i64 28, !252, i64 32, !252, i64 36}
!607 = !{!"", !252, i64 0, !252, i64 4, !252, i64 8, !270, i64 12}
!608 = !DILocation(line: 214, column: 13, scope: !579)
!609 = !DILocation(line: 214, column: 19, scope: !579)
!610 = !DILocation(line: 214, column: 23, scope: !579)
!611 = !{!595, !252, i64 8}
!612 = !DILocation(line: 216, column: 13, scope: !579)
!613 = !DILocation(line: 219, column: 15, scope: !545)
!614 = !DILocation(line: 219, column: 13, scope: !545)
!615 = !DILocation(line: 221, column: 13, scope: !616)
!616 = distinct !DILexicalBlock(scope: !545, file: !3, line: 221, column: 13)
!617 = !DILocation(line: 221, column: 17, scope: !616)
!618 = !DILocation(line: 221, column: 13, scope: !545)
!619 = !DILocation(line: 222, column: 28, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !3, line: 221, column: 37)
!621 = !DILocation(line: 222, column: 15, scope: !620)
!622 = !DILocation(line: 223, column: 13, scope: !620)
!623 = distinct !{!623, !624, !625}
!624 = !DILocation(line: 192, column: 5, scope: !547)
!625 = !DILocation(line: 236, column: 5, scope: !547)
!626 = !DILocation(line: 226, column: 14, scope: !627)
!627 = distinct !DILexicalBlock(scope: !545, file: !3, line: 226, column: 13)
!628 = !DILocation(line: 226, column: 20, scope: !627)
!629 = !DILocation(line: 226, column: 29, scope: !627)
!630 = !DILocation(line: 226, column: 35, scope: !627)
!631 = !DILocation(line: 226, column: 39, scope: !627)
!632 = !DILocation(line: 226, column: 43, scope: !627)
!633 = !DILocation(line: 226, column: 13, scope: !545)
!634 = !DILocation(line: 227, column: 13, scope: !635)
!635 = distinct !DILexicalBlock(scope: !636, file: !3, line: 227, column: 13)
!636 = distinct !DILexicalBlock(scope: !627, file: !3, line: 226, column: 60)
!637 = !{!365, !252, i64 144}
!638 = !DILocation(line: 227, column: 13, scope: !636)
!639 = !DILocation(line: 230, column: 13, scope: !636)
!640 = !DILocation(line: 233, column: 29, scope: !641)
!641 = distinct !DILexicalBlock(scope: !545, file: !3, line: 233, column: 13)
!642 = !DILocation(line: 233, column: 35, scope: !641)
!643 = !DILocation(line: 233, column: 13, scope: !641)
!644 = !DILocation(line: 233, column: 41, scope: !641)
!645 = !DILocation(line: 233, column: 13, scope: !545)
!646 = !DILocation(line: 234, column: 13, scope: !647)
!647 = distinct !DILexicalBlock(scope: !641, file: !3, line: 233, column: 55)
!648 = !DILocation(line: 192, column: 5, scope: !546)
!649 = !DILocation(line: 237, column: 1, scope: !421)
!650 = distinct !DISubprogram(name: "ngx_next_temp_number", scope: !3, file: !3, line: 348, type: !651, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{!71, !45}
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(name: "collision", arg: 1, scope: !650, file: !3, line: 348, type: !45)
!655 = !DILocalVariable(name: "n", scope: !650, file: !3, line: 350, type: !71)
!656 = !DILocalVariable(name: "add", scope: !650, file: !3, line: 350, type: !71)
!657 = !DILocation(line: 348, column: 33, scope: !650)
!658 = !DILocation(line: 350, column: 5, scope: !650)
!659 = !DILocation(line: 350, column: 24, scope: !650)
!660 = !DILocation(line: 350, column: 27, scope: !650)
!661 = !DILocation(line: 352, column: 11, scope: !650)
!662 = !DILocation(line: 352, column: 23, scope: !650)
!663 = !{!367, !367, i64 0}
!664 = !DILocation(line: 352, column: 9, scope: !650)
!665 = !DILocation(line: 354, column: 9, scope: !650)
!666 = !DILocation(line: 354, column: 7, scope: !650)
!667 = !DILocation(line: 356, column: 12, scope: !650)
!668 = !DILocation(line: 356, column: 16, scope: !650)
!669 = !DILocation(line: 356, column: 14, scope: !650)
!670 = !DILocation(line: 357, column: 1, scope: !650)
!671 = !DILocation(line: 356, column: 5, scope: !650)
!672 = distinct !DISubprogram(name: "ngx_create_hashed_filename", scope: !3, file: !3, line: 241, type: !673, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !675)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !18, !7, !29}
!675 = !{!676, !677, !678, !679, !680, !681}
!676 = !DILocalVariable(name: "path", arg: 1, scope: !672, file: !3, line: 241, type: !18)
!677 = !DILocalVariable(name: "file", arg: 2, scope: !672, file: !3, line: 241, type: !7)
!678 = !DILocalVariable(name: "len", arg: 3, scope: !672, file: !3, line: 241, type: !29)
!679 = !DILocalVariable(name: "i", scope: !672, file: !3, line: 243, type: !29)
!680 = !DILocalVariable(name: "level", scope: !672, file: !3, line: 243, type: !29)
!681 = !DILocalVariable(name: "n", scope: !672, file: !3, line: 244, type: !45)
!682 = !DILocation(line: 241, column: 40, scope: !672)
!683 = !DILocation(line: 241, column: 54, scope: !672)
!684 = !DILocation(line: 241, column: 67, scope: !672)
!685 = !DILocation(line: 243, column: 5, scope: !672)
!686 = !DILocation(line: 243, column: 17, scope: !672)
!687 = !DILocation(line: 243, column: 20, scope: !672)
!688 = !DILocation(line: 244, column: 5, scope: !672)
!689 = !DILocation(line: 244, column: 17, scope: !672)
!690 = !DILocation(line: 246, column: 9, scope: !672)
!691 = !DILocation(line: 246, column: 15, scope: !672)
!692 = !DILocation(line: 246, column: 20, scope: !672)
!693 = !{!489, !270, i64 0}
!694 = !DILocation(line: 246, column: 24, scope: !672)
!695 = !DILocation(line: 246, column: 7, scope: !672)
!696 = !DILocation(line: 248, column: 5, scope: !672)
!697 = !DILocation(line: 248, column: 10, scope: !672)
!698 = !DILocation(line: 248, column: 16, scope: !672)
!699 = !DILocation(line: 248, column: 21, scope: !672)
!700 = !DILocation(line: 248, column: 27, scope: !672)
!701 = !DILocation(line: 248, column: 33, scope: !672)
!702 = !DILocation(line: 248, column: 25, scope: !672)
!703 = !DILocation(line: 248, column: 39, scope: !672)
!704 = !DILocation(line: 250, column: 12, scope: !705)
!705 = distinct !DILexicalBlock(scope: !672, file: !3, line: 250, column: 5)
!706 = !DILocation(line: 250, column: 10, scope: !705)
!707 = !DILocation(line: 250, column: 17, scope: !708)
!708 = distinct !DILexicalBlock(scope: !705, file: !3, line: 250, column: 5)
!709 = !DILocation(line: 250, column: 19, scope: !708)
!710 = !DILocation(line: 250, column: 5, scope: !705)
!711 = !DILocation(line: 251, column: 17, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !3, line: 250, column: 46)
!713 = !DILocation(line: 251, column: 23, scope: !712)
!714 = !DILocation(line: 251, column: 29, scope: !712)
!715 = !DILocation(line: 251, column: 15, scope: !712)
!716 = !DILocation(line: 253, column: 13, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !3, line: 253, column: 13)
!718 = !DILocation(line: 253, column: 19, scope: !717)
!719 = !DILocation(line: 253, column: 13, scope: !712)
!720 = !DILocation(line: 254, column: 13, scope: !721)
!721 = distinct !DILexicalBlock(scope: !717, file: !3, line: 253, column: 25)
!722 = !DILocation(line: 257, column: 16, scope: !712)
!723 = !DILocation(line: 257, column: 13, scope: !712)
!724 = !DILocation(line: 258, column: 9, scope: !712)
!725 = !DILocation(line: 258, column: 14, scope: !712)
!726 = !DILocation(line: 258, column: 16, scope: !712)
!727 = !DILocation(line: 258, column: 21, scope: !712)
!728 = !DILocation(line: 259, column: 9, scope: !712)
!729 = !DILocation(line: 260, column: 14, scope: !712)
!730 = !DILocation(line: 260, column: 20, scope: !712)
!731 = !DILocation(line: 260, column: 11, scope: !712)
!732 = !DILocation(line: 261, column: 5, scope: !712)
!733 = !DILocation(line: 250, column: 42, scope: !708)
!734 = !DILocation(line: 250, column: 5, scope: !708)
!735 = distinct !{!735, !710, !736}
!736 = !DILocation(line: 261, column: 5, scope: !705)
!737 = !DILocation(line: 262, column: 1, scope: !672)
!738 = distinct !DISubprogram(name: "ngx_create_path", scope: !3, file: !3, line: 266, type: !739, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!83, !121, !18}
!741 = !{!742, !743, !744, !745, !746}
!742 = !DILocalVariable(name: "file", arg: 1, scope: !738, file: !3, line: 266, type: !121)
!743 = !DILocalVariable(name: "path", arg: 2, scope: !738, file: !3, line: 266, type: !18)
!744 = !DILocalVariable(name: "pos", scope: !738, file: !3, line: 268, type: !29)
!745 = !DILocalVariable(name: "err", scope: !738, file: !3, line: 269, type: !435)
!746 = !DILocalVariable(name: "i", scope: !738, file: !3, line: 270, type: !45)
!747 = !DILocation(line: 266, column: 29, scope: !738)
!748 = !DILocation(line: 266, column: 47, scope: !738)
!749 = !DILocation(line: 268, column: 5, scope: !738)
!750 = !DILocation(line: 268, column: 17, scope: !738)
!751 = !DILocation(line: 269, column: 5, scope: !738)
!752 = !DILocation(line: 269, column: 17, scope: !738)
!753 = !DILocation(line: 270, column: 5, scope: !738)
!754 = !DILocation(line: 270, column: 17, scope: !738)
!755 = !DILocation(line: 272, column: 11, scope: !738)
!756 = !DILocation(line: 272, column: 17, scope: !738)
!757 = !DILocation(line: 272, column: 22, scope: !738)
!758 = !DILocation(line: 272, column: 9, scope: !738)
!759 = !DILocation(line: 274, column: 12, scope: !760)
!760 = distinct !DILexicalBlock(scope: !738, file: !3, line: 274, column: 5)
!761 = !DILocation(line: 274, column: 10, scope: !760)
!762 = !DILocation(line: 274, column: 17, scope: !763)
!763 = distinct !DILexicalBlock(scope: !760, file: !3, line: 274, column: 5)
!764 = !DILocation(line: 274, column: 19, scope: !763)
!765 = !DILocation(line: 274, column: 5, scope: !760)
!766 = !DILocation(line: 275, column: 13, scope: !767)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 275, column: 13)
!768 = distinct !DILexicalBlock(scope: !763, file: !3, line: 274, column: 46)
!769 = !DILocation(line: 275, column: 19, scope: !767)
!770 = !DILocation(line: 275, column: 25, scope: !767)
!771 = !DILocation(line: 275, column: 28, scope: !767)
!772 = !DILocation(line: 275, column: 13, scope: !768)
!773 = !DILocation(line: 276, column: 13, scope: !774)
!774 = distinct !DILexicalBlock(scope: !767, file: !3, line: 275, column: 34)
!775 = !DILocation(line: 279, column: 16, scope: !768)
!776 = !DILocation(line: 279, column: 22, scope: !768)
!777 = !DILocation(line: 279, column: 28, scope: !768)
!778 = !DILocation(line: 279, column: 31, scope: !768)
!779 = !DILocation(line: 279, column: 13, scope: !768)
!780 = !DILocation(line: 281, column: 9, scope: !768)
!781 = !DILocation(line: 281, column: 15, scope: !768)
!782 = !DILocation(line: 281, column: 20, scope: !768)
!783 = !DILocation(line: 281, column: 25, scope: !768)
!784 = !DILocation(line: 281, column: 30, scope: !768)
!785 = !DILocation(line: 286, column: 13, scope: !786)
!786 = distinct !DILexicalBlock(scope: !768, file: !3, line: 286, column: 13)
!787 = !DILocation(line: 286, column: 51, scope: !786)
!788 = !DILocation(line: 286, column: 13, scope: !768)
!789 = !DILocation(line: 287, column: 19, scope: !790)
!790 = distinct !DILexicalBlock(scope: !786, file: !3, line: 286, column: 70)
!791 = !DILocation(line: 287, column: 17, scope: !790)
!792 = !DILocation(line: 288, column: 17, scope: !793)
!793 = distinct !DILexicalBlock(scope: !790, file: !3, line: 288, column: 17)
!794 = !DILocation(line: 288, column: 21, scope: !793)
!795 = !DILocation(line: 288, column: 17, scope: !790)
!796 = !DILocation(line: 289, column: 17, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 289, column: 17)
!798 = distinct !DILexicalBlock(scope: !793, file: !3, line: 288, column: 36)
!799 = !DILocation(line: 289, column: 17, scope: !798)
!800 = !DILocation(line: 292, column: 17, scope: !798)
!801 = !DILocation(line: 294, column: 9, scope: !790)
!802 = !DILocation(line: 296, column: 9, scope: !768)
!803 = !DILocation(line: 296, column: 15, scope: !768)
!804 = !DILocation(line: 296, column: 20, scope: !768)
!805 = !DILocation(line: 296, column: 25, scope: !768)
!806 = !DILocation(line: 296, column: 30, scope: !768)
!807 = !DILocation(line: 297, column: 5, scope: !768)
!808 = !DILocation(line: 274, column: 42, scope: !763)
!809 = !DILocation(line: 274, column: 5, scope: !763)
!810 = distinct !{!810, !765, !811}
!811 = !DILocation(line: 297, column: 5, scope: !760)
!812 = !DILocation(line: 299, column: 5, scope: !738)
!813 = !DILocation(line: 300, column: 1, scope: !738)
!814 = distinct !DISubprogram(name: "ngx_create_full_path", scope: !3, file: !3, line: 304, type: !815, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!435, !7, !45}
!817 = !{!818, !819, !820, !821, !822}
!818 = !DILocalVariable(name: "dir", arg: 1, scope: !814, file: !3, line: 304, type: !7)
!819 = !DILocalVariable(name: "access", arg: 2, scope: !814, file: !3, line: 304, type: !45)
!820 = !DILocalVariable(name: "p", scope: !814, file: !3, line: 306, type: !7)
!821 = !DILocalVariable(name: "ch", scope: !814, file: !3, line: 306, type: !8)
!822 = !DILocalVariable(name: "err", scope: !814, file: !3, line: 307, type: !435)
!823 = !DILocation(line: 304, column: 30, scope: !814)
!824 = !DILocation(line: 304, column: 46, scope: !814)
!825 = !DILocation(line: 306, column: 5, scope: !814)
!826 = !DILocation(line: 306, column: 17, scope: !814)
!827 = !DILocation(line: 306, column: 20, scope: !814)
!828 = !DILocation(line: 307, column: 5, scope: !814)
!829 = !DILocation(line: 307, column: 17, scope: !814)
!830 = !DILocation(line: 309, column: 9, scope: !814)
!831 = !DILocation(line: 314, column: 9, scope: !814)
!832 = !DILocation(line: 314, column: 13, scope: !814)
!833 = !DILocation(line: 314, column: 7, scope: !814)
!834 = !DILocation(line: 317, column: 5, scope: !814)
!835 = !DILocation(line: 317, column: 25, scope: !836)
!836 = distinct !DILexicalBlock(scope: !837, file: !3, line: 317, column: 5)
!837 = distinct !DILexicalBlock(scope: !814, file: !3, line: 317, column: 5)
!838 = !DILocation(line: 317, column: 24, scope: !836)
!839 = !DILocation(line: 317, column: 5, scope: !837)
!840 = !DILocation(line: 318, column: 15, scope: !841)
!841 = distinct !DILexicalBlock(scope: !836, file: !3, line: 317, column: 33)
!842 = !DILocation(line: 318, column: 14, scope: !841)
!843 = !DILocation(line: 318, column: 12, scope: !841)
!844 = !DILocation(line: 320, column: 13, scope: !845)
!845 = distinct !DILexicalBlock(scope: !841, file: !3, line: 320, column: 13)
!846 = !DILocation(line: 320, column: 16, scope: !845)
!847 = !DILocation(line: 320, column: 13, scope: !841)
!848 = !DILocation(line: 321, column: 13, scope: !849)
!849 = distinct !DILexicalBlock(scope: !845, file: !3, line: 320, column: 24)
!850 = !DILocation(line: 324, column: 10, scope: !841)
!851 = !DILocation(line: 324, column: 12, scope: !841)
!852 = !DILocation(line: 326, column: 13, scope: !853)
!853 = distinct !DILexicalBlock(scope: !841, file: !3, line: 326, column: 13)
!854 = !DILocation(line: 326, column: 41, scope: !853)
!855 = !DILocation(line: 326, column: 13, scope: !841)
!856 = !DILocation(line: 327, column: 19, scope: !857)
!857 = distinct !DILexicalBlock(scope: !853, file: !3, line: 326, column: 60)
!858 = !DILocation(line: 327, column: 17, scope: !857)
!859 = !DILocation(line: 329, column: 21, scope: !857)
!860 = !DILocation(line: 329, column: 13, scope: !857)
!861 = !DILocation(line: 331, column: 21, scope: !862)
!862 = distinct !DILexicalBlock(scope: !857, file: !3, line: 329, column: 26)
!863 = !DILocation(line: 331, column: 17, scope: !862)
!864 = !DILocation(line: 336, column: 24, scope: !862)
!865 = !DILocation(line: 336, column: 17, scope: !862)
!866 = !DILocation(line: 338, column: 9, scope: !857)
!867 = !DILocation(line: 340, column: 10, scope: !841)
!868 = !DILocation(line: 340, column: 12, scope: !841)
!869 = !DILocation(line: 341, column: 5, scope: !841)
!870 = !DILocation(line: 317, column: 29, scope: !836)
!871 = !DILocation(line: 317, column: 5, scope: !836)
!872 = distinct !{!872, !839, !873}
!873 = !DILocation(line: 341, column: 5, scope: !837)
!874 = !DILocation(line: 343, column: 12, scope: !814)
!875 = !DILocation(line: 343, column: 5, scope: !814)
!876 = !DILocation(line: 344, column: 1, scope: !814)
!877 = distinct !DISubprogram(name: "ngx_conf_set_path_slot", scope: !3, file: !3, line: 361, type: !878, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1172)
!878 = !DISubroutineType(types: !879)
!879 = !{!207, !880, !1059, !6}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !87, line: 16, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !183, line: 116, size: 384, elements: !883)
!883 = !{!884, !885, !896, !1154, !1155, !1156, !1165, !1166, !1167, !1168, !1169, !1171}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !183, line: 117, baseType: !207, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !882, file: !183, line: 118, baseType: !886, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !888, line: 22, baseType: !889)
!888 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !888, line: 16, size: 160, elements: !890)
!890 = !{!891, !892, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !889, file: !888, line: 17, baseType: !6, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !889, file: !888, line: 18, baseType: !45, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !888, line: 19, baseType: !29, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !889, file: !888, line: 20, baseType: !45, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !889, file: !888, line: 21, baseType: !85, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !882, file: !183, line: 120, baseType: !897, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !87, line: 17, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !900, line: 38, size: 2496, elements: !901)
!900 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!901 = !{!902, !906, !907, !908, !909, !910, !1041, !1042, !1043, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1123, !1124, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !899, file: !900, line: 39, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !899, file: !900, line: 40, baseType: !85, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !899, file: !900, line: 42, baseType: !173, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !899, file: !900, line: 43, baseType: !174, size: 320, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !899, file: !900, line: 45, baseType: !45, size: 32, offset: 416)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !899, file: !900, line: 47, baseType: !911, size: 32, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !87, line: 26, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !915, line: 121, size: 896, elements: !916)
!915 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!916 = !{!917, !918, !922, !923, !926, !932, !934, !939, !944, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1014, !1015, !1016, !1017, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !914, file: !915, line: 122, baseType: !6, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !914, file: !915, line: 123, baseType: !919, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !87, line: 24, baseType: !921)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !87, line: 24, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !914, file: !915, line: 124, baseType: !919, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !914, file: !915, line: 126, baseType: !924, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !925, line: 17, baseType: !63)
!925 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!926 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !914, file: !915, line: 128, baseType: !927, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !928, line: 19, baseType: !929)
!928 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!336, !912, !7, !29}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !914, file: !915, line: 129, baseType: !933, size: 32, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !928, line: 22, baseType: !929)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !914, file: !915, line: 130, baseType: !935, size: 32, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !928, line: 20, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!336, !912, !102, !62}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !914, file: !915, line: 131, baseType: !940, size: 32, offset: 224)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !928, line: 23, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!102, !912, !102, !62}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !914, file: !915, line: 133, baseType: !945, size: 32, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !915, line: 16, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !915, line: 18, size: 960, elements: !948)
!948 = !{!949, !950, !962, !964, !965, !966, !967, !968, !969, !970, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !947, file: !915, line: 19, baseType: !924, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !947, file: !915, line: 21, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !953, line: 297, size: 128, elements: !954)
!953 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!954 = !{!955, !958}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !952, file: !953, line: 298, baseType: !956, size: 16)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !12, line: 409, baseType: !957)
!957 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !952, file: !953, line: 299, baseType: !959, size: 112, offset: 16)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 112, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 14)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !947, file: !915, line: 22, baseType: !963, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !12, line: 404, baseType: !13)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !947, file: !915, line: 23, baseType: !29, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !947, file: !915, line: 24, baseType: !24, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !947, file: !915, line: 26, baseType: !63, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !947, file: !915, line: 28, baseType: !63, size: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !947, file: !915, line: 29, baseType: !63, size: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !947, file: !915, line: 30, baseType: !63, size: 32, offset: 288)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !947, file: !915, line: 38, baseType: !971, size: 32, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !87, line: 32, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !912}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !947, file: !915, line: 40, baseType: !6, size: 32, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !947, file: !915, line: 42, baseType: !174, size: 320, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !947, file: !915, line: 43, baseType: !173, size: 32, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !947, file: !915, line: 45, baseType: !29, size: 32, offset: 736)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !947, file: !915, line: 47, baseType: !29, size: 32, offset: 768)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !947, file: !915, line: 49, baseType: !41, size: 32, offset: 800)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !947, file: !915, line: 51, baseType: !945, size: 32, offset: 832)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !947, file: !915, line: 52, baseType: !912, size: 32, offset: 864)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !947, file: !915, line: 54, baseType: !45, size: 32, offset: 896)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !947, file: !915, line: 56, baseType: !13, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !947, file: !915, line: 57, baseType: !13, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !947, file: !915, line: 58, baseType: !13, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !947, file: !915, line: 60, baseType: !13, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !947, file: !915, line: 61, baseType: !13, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !947, file: !915, line: 62, baseType: !13, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !947, file: !915, line: 63, baseType: !13, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !947, file: !915, line: 64, baseType: !13, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !947, file: !915, line: 65, baseType: !13, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !947, file: !915, line: 66, baseType: !13, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !947, file: !915, line: 67, baseType: !13, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !947, file: !915, line: 70, baseType: !13, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !947, file: !915, line: 72, baseType: !13, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !947, file: !915, line: 73, baseType: !13, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !947, file: !915, line: 74, baseType: !13, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !947, file: !915, line: 76, baseType: !13, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !947, file: !915, line: 77, baseType: !13, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !947, file: !915, line: 78, baseType: !13, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !914, file: !915, line: 135, baseType: !62, size: 32, offset: 288)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !914, file: !915, line: 137, baseType: !173, size: 32, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !914, file: !915, line: 139, baseType: !85, size: 32, offset: 352)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !914, file: !915, line: 141, baseType: !63, size: 32, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !914, file: !915, line: 143, baseType: !951, size: 32, offset: 416)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !914, file: !915, line: 144, baseType: !963, size: 32, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !914, file: !915, line: 145, baseType: !24, size: 64, offset: 480)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !914, file: !915, line: 147, baseType: !24, size: 64, offset: 544)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !914, file: !915, line: 148, baseType: !1011, size: 16, offset: 608)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1012, line: 12, baseType: !1013)
!1012 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !12, line: 186, baseType: !957)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !914, file: !915, line: 154, baseType: !951, size: 32, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !914, file: !915, line: 155, baseType: !963, size: 32, offset: 672)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !914, file: !915, line: 157, baseType: !108, size: 32, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !914, file: !915, line: 159, baseType: !1018, size: 64, offset: 736)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !1019, line: 16, baseType: !1020)
!1019 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !1019, line: 18, size: 64, elements: !1021)
!1021 = !{!1022, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1020, file: !1019, line: 19, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !1019, line: 20, baseType: !1023, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !914, file: !915, line: 161, baseType: !71, size: 32, offset: 800)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !914, file: !915, line: 163, baseType: !45, size: 32, offset: 832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !914, file: !915, line: 165, baseType: !13, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !914, file: !915, line: 167, baseType: !13, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !914, file: !915, line: 169, baseType: !13, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !914, file: !915, line: 170, baseType: !13, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !914, file: !915, line: 171, baseType: !13, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !914, file: !915, line: 173, baseType: !13, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !914, file: !915, line: 174, baseType: !13, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !914, file: !915, line: 175, baseType: !13, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !914, file: !915, line: 176, baseType: !13, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !914, file: !915, line: 178, baseType: !13, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !914, file: !915, line: 179, baseType: !13, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !914, file: !915, line: 180, baseType: !13, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !914, file: !915, line: 181, baseType: !13, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !914, file: !915, line: 183, baseType: !13, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !899, file: !900, line: 48, baseType: !912, size: 32, offset: 480)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !899, file: !900, line: 49, baseType: !45, size: 32, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !899, file: !900, line: 51, baseType: !1044, size: 32, offset: 544)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !87, line: 15, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !1048, line: 222, size: 800, elements: !1049)
!1048 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1070, !1071, !1075, !1079, !1080, !1081, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !1047, file: !1048, line: 223, baseType: !45, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1047, file: !1048, line: 224, baseType: !45, size: 32, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !1048, line: 226, baseType: !207, size: 32, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !1047, file: !1048, line: 228, baseType: !45, size: 32, offset: 96)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !1047, file: !1048, line: 229, baseType: !45, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1047, file: !1048, line: 231, baseType: !45, size: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1047, file: !1048, line: 232, baseType: !14, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1047, file: !1048, line: 234, baseType: !6, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !1047, file: !1048, line: 235, baseType: !1059, size: 32, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !87, line: 22, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !183, line: 77, size: 224, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1067, !1068, !1069}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !183, line: 78, baseType: !24, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1061, file: !183, line: 79, baseType: !45, size: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1061, file: !183, line: 80, baseType: !1066, size: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !1061, file: !183, line: 81, baseType: !45, size: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1061, file: !183, line: 82, baseType: !45, size: 32, offset: 160)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !1061, file: !183, line: 83, baseType: !6, size: 32, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1047, file: !1048, line: 236, baseType: !45, size: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !1047, file: !1048, line: 238, baseType: !1072, size: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 32)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!83, !173}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !1047, file: !1048, line: 240, baseType: !1076, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 32)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!83, !897}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !1047, file: !1048, line: 242, baseType: !1076, size: 32, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !1047, file: !1048, line: 243, baseType: !1076, size: 32, offset: 416)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !1047, file: !1048, line: 244, baseType: !1082, size: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 32)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !897}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !1047, file: !1048, line: 245, baseType: !1082, size: 32, offset: 480)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !1047, file: !1048, line: 247, baseType: !1082, size: 32, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !1047, file: !1048, line: 249, baseType: !47, size: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !1047, file: !1048, line: 250, baseType: !47, size: 32, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !1047, file: !1048, line: 251, baseType: !47, size: 32, offset: 608)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !1047, file: !1048, line: 252, baseType: !47, size: 32, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !1047, file: !1048, line: 253, baseType: !47, size: 32, offset: 672)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !1047, file: !1048, line: 254, baseType: !47, size: 32, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !1047, file: !1048, line: 255, baseType: !47, size: 32, offset: 736)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !1047, file: !1048, line: 256, baseType: !47, size: 32, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !899, file: !900, line: 52, baseType: !45, size: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !899, file: !900, line: 53, baseType: !45, size: 32, offset: 608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !899, file: !900, line: 55, baseType: !1018, size: 64, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !899, file: !900, line: 56, baseType: !45, size: 32, offset: 704)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !899, file: !900, line: 58, baseType: !887, size: 160, offset: 736)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !899, file: !900, line: 59, baseType: !887, size: 160, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !899, file: !900, line: 61, baseType: !887, size: 160, offset: 1056)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !899, file: !900, line: 62, baseType: !1103, size: 96, offset: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !44, line: 32, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !44, line: 37, size: 96, elements: !1105)
!1105 = !{!1106, !1117, !1118}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1104, file: !44, line: 38, baseType: !1107, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !44, line: 20, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !44, line: 22, size: 160, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1109, file: !44, line: 23, baseType: !43, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1109, file: !44, line: 24, baseType: !1107, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1109, file: !44, line: 25, baseType: !1107, size: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1109, file: !44, line: 26, baseType: !1107, size: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1109, file: !44, line: 27, baseType: !8, size: 8, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !44, line: 28, baseType: !8, size: 8, offset: 136)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !1104, file: !44, line: 39, baseType: !1107, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !1104, file: !44, line: 40, baseType: !1119, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !44, line: 34, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 32)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1107, !1107, !1107}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !899, file: !900, line: 63, baseType: !1108, size: 160, offset: 1312)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !899, file: !900, line: 65, baseType: !1125, size: 224, offset: 1472)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !1126, line: 31, baseType: !1127)
!1126 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1126, line: 25, size: 224, elements: !1128)
!1128 = !{!1129, !1137, !1138, !1139, !1140}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1127, file: !1126, line: 26, baseType: !1130, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !1126, line: 16, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !1126, line: 18, size: 96, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1132, file: !1126, line: 19, baseType: !6, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !1132, file: !1126, line: 20, baseType: !45, size: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1132, file: !1126, line: 21, baseType: !1130, size: 32, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !1127, file: !1126, line: 27, baseType: !1131, size: 96, offset: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !1126, line: 28, baseType: !29, size: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !1127, file: !1126, line: 29, baseType: !45, size: 32, offset: 160)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1127, file: !1126, line: 30, baseType: !85, size: 32, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !899, file: !900, line: 66, baseType: !1125, size: 224, offset: 1696)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !899, file: !900, line: 68, baseType: !45, size: 32, offset: 1920)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !899, file: !900, line: 69, baseType: !45, size: 32, offset: 1952)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !899, file: !900, line: 71, baseType: !912, size: 32, offset: 1984)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !899, file: !900, line: 72, baseType: !919, size: 32, offset: 2016)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !899, file: !900, line: 73, baseType: !919, size: 32, offset: 2048)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !899, file: !900, line: 75, baseType: !897, size: 32, offset: 2080)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !899, file: !900, line: 77, baseType: !24, size: 64, offset: 2112)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !899, file: !900, line: 78, baseType: !24, size: 64, offset: 2176)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !899, file: !900, line: 79, baseType: !24, size: 64, offset: 2240)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !899, file: !900, line: 80, baseType: !24, size: 64, offset: 2304)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !899, file: !900, line: 81, baseType: !24, size: 64, offset: 2368)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !899, file: !900, line: 82, baseType: !24, size: 64, offset: 2432)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !882, file: !183, line: 121, baseType: !85, size: 32, offset: 96)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !882, file: !183, line: 122, baseType: !85, size: 32, offset: 128)
