; ModuleID = 'src/core/ngx_crypt.c'
source_filename = "src/core/ngx_crypt.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_md5_t = type { i64, i32, i32, i32, i32, [64 x i8] }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "itoa64", scope: !2, file: !3, line: 155, type: !26, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ngx_crypt_to64", scope: !3, file: !3, line: 153, type: !4, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, unit: !14, variables: !22)
!3 = !DIFile(filename: "src/core/ngx_crypt.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !10, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !8, line: 64, baseType: !9)
!8 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 191, baseType: !12)
!11 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 120, baseType: !12)
!14 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !16, globals: !21)
!15 = !{}
!16 = !{!17, !6, !20}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!21 = !{!0}
!22 = !{!23, !24, !25}
!23 = !DILocalVariable(name: "p", arg: 1, scope: !2, file: !3, line: 153, type: !6)
!24 = !DILocalVariable(name: "v", arg: 2, scope: !2, file: !3, line: 153, type: !10)
!25 = !DILocalVariable(name: "n", arg: 3, scope: !2, file: !3, line: 153, type: !13)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 520, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 65)
!29 = !{i32 2, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!32 = distinct !DISubprogram(name: "ngx_crypt", scope: !3, file: !3, line: 30, type: !33, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !14, variables: !217)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !39, !6, !6, !216}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !36, line: 78, baseType: !37)
!36 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !11, line: 140, baseType: !38)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !41, line: 18, baseType: !42)
!41 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !43, line: 57, size: 320, elements: !44)
!43 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !{!45, !55, !56, !57, !196, !203, !215}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !42, file: !43, line: 58, baseType: !46, size: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !43, line: 54, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 49, size: 128, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !47, file: !43, line: 50, baseType: !6, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !47, file: !43, line: 51, baseType: !6, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !43, line: 52, baseType: !39, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !47, file: !43, line: 53, baseType: !53, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !36, line: 79, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !11, line: 125, baseType: !12)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !42, file: !43, line: 59, baseType: !13, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !42, file: !43, line: 60, baseType: !39, size: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !42, file: !43, line: 61, baseType: !58, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !41, line: 19, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !61, line: 59, size: 64, elements: !62)
!61 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!62 = !{!63, !195}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !60, file: !61, line: 60, baseType: !64, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !61, line: 18, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !61, line: 20, size: 352, elements: !67)
!67 = !{!68, !69, !70, !72, !73, !74, !75, !77, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !66, file: !61, line: 21, baseType: !6, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !66, file: !61, line: 22, baseType: !6, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !66, file: !61, line: 23, baseType: !71, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !11, line: 222, baseType: !38)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !66, file: !61, line: 24, baseType: !71, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !66, file: !61, line: 26, baseType: !6, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !66, file: !61, line: 27, baseType: !6, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !61, line: 28, baseType: !76, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !61, line: 16, baseType: !20)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !66, file: !61, line: 29, baseType: !78, size: 32, offset: 224)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !41, line: 23, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !81, line: 16, size: 1216, elements: !82)
!81 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !{!83, !86, !93, !138, !139, !140, !180, !181}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !80, file: !81, line: 17, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !85, line: 16, baseType: !38)
!85 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !81, line: 18, baseType: !87, size: 64, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !88, line: 19, baseType: !89)
!88 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 16, size: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !89, file: !88, line: 17, baseType: !13, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !88, line: 18, baseType: !6, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !80, file: !81, line: 19, baseType: !94, size: 960, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !85, line: 17, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !96, line: 4, size: 960, elements: !97)
!96 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!97 = !{!98, !100, !101, !103, !104, !106, !107, !109, !111, !113, !114, !115, !116, !117, !118, !121, !122, !124, !125, !131, !132, !133}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !95, file: !96, line: 6, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !11, line: 232, baseType: !12)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !95, file: !96, line: 7, baseType: !99, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !95, file: !96, line: 8, baseType: !102, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !11, line: 227, baseType: !12)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !95, file: !96, line: 9, baseType: !102, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !95, file: !96, line: 10, baseType: !105, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !11, line: 217, baseType: !12)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !95, file: !96, line: 11, baseType: !105, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !95, file: !96, line: 13, baseType: !108, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !11, line: 212, baseType: !12)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !95, file: !96, line: 14, baseType: !110, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !11, line: 304, baseType: !12)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !95, file: !96, line: 15, baseType: !112, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !11, line: 309, baseType: !12)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !95, file: !96, line: 16, baseType: !12, size: 32, offset: 288)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !95, file: !96, line: 17, baseType: !99, size: 32, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !95, file: !96, line: 18, baseType: !99, size: 32, offset: 352)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !95, file: !96, line: 19, baseType: !71, size: 32, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !95, file: !96, line: 20, baseType: !71, size: 32, offset: 416)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !95, file: !96, line: 21, baseType: !119, size: 32, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !11, line: 237, baseType: !120)
!120 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !95, file: !96, line: 22, baseType: !119, size: 32, offset: 480)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !95, file: !96, line: 23, baseType: !123, size: 32, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !11, line: 242, baseType: !38)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !95, file: !96, line: 24, baseType: !123, size: 32, offset: 544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !95, file: !96, line: 26, baseType: !126, size: 64, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !11, line: 288, size: 64, elements: !127)
!127 = !{!128, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !11, line: 288, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !11, line: 75, baseType: !120)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !11, line: 288, baseType: !120, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !95, file: !96, line: 27, baseType: !126, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !95, file: !96, line: 28, baseType: !126, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !95, file: !96, line: 29, baseType: !134, size: 192, offset: 768)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192, elements: !136)
!135 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!136 = !{!137}
!137 = !DISubrange(count: 3)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !80, file: !81, line: 21, baseType: !71, size: 32, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !80, file: !81, line: 22, baseType: !71, size: 32, offset: 1120)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !80, file: !81, line: 24, baseType: !141, size: 32, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !41, line: 20, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !144, line: 50, size: 320, elements: !145)
!144 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!145 = !{!146, !147, !160, !164, !165, !170, !171, !176, !177, !179}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !143, file: !144, line: 51, baseType: !53, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !143, file: !144, line: 52, baseType: !148, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !41, line: 21, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !151, line: 89, size: 160, elements: !152)
!151 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!152 = !{!153, !154, !155, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !150, file: !151, line: 90, baseType: !84, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !151, line: 91, baseType: !87, size: 64, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !150, file: !151, line: 93, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !148, !141}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !151, line: 94, baseType: !20, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !143, file: !144, line: 54, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !162, line: 98, baseType: !163)
!162 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !143, file: !144, line: 56, baseType: !129, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !143, file: !144, line: 58, baseType: !166, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !144, line: 45, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !141, !6, !13}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !144, line: 59, baseType: !20, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !143, file: !144, line: 61, baseType: !172, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !144, line: 46, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !141, !53, !6, !13}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !143, file: !144, line: 62, baseType: !20, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !143, file: !144, line: 70, baseType: !178, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !144, line: 72, baseType: !141, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !80, file: !81, line: 37, baseType: !12, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !80, file: !81, line: 38, baseType: !12, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !66, file: !61, line: 30, baseType: !64, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !66, file: !61, line: 34, baseType: !12, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !66, file: !61, line: 40, baseType: !12, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !66, file: !61, line: 43, baseType: !12, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !66, file: !61, line: 45, baseType: !12, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !66, file: !61, line: 46, baseType: !12, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !66, file: !61, line: 47, baseType: !12, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !66, file: !61, line: 48, baseType: !12, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !66, file: !61, line: 49, baseType: !12, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !66, file: !61, line: 50, baseType: !12, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !66, file: !61, line: 52, baseType: !12, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !66, file: !61, line: 53, baseType: !12, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !66, file: !61, line: 55, baseType: !38, size: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !60, file: !61, line: 61, baseType: !58, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !42, file: !43, line: 62, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !43, line: 41, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !43, line: 43, size: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !43, line: 44, baseType: !197, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !199, file: !43, line: 45, baseType: !20, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !42, file: !43, line: 63, baseType: !204, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !43, line: 32, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !43, line: 34, size: 96, elements: !207)
!207 = !{!208, !213, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !206, file: !43, line: 35, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !43, line: 30, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !20}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !43, line: 36, baseType: !20, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !43, line: 37, baseType: !204, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !42, file: !43, line: 64, baseType: !141, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!217 = !{!218, !219, !220, !221}
!218 = !DILocalVariable(name: "pool", arg: 1, scope: !32, file: !3, line: 30, type: !39)
!219 = !DILocalVariable(name: "key", arg: 2, scope: !32, file: !3, line: 30, type: !6)
!220 = !DILocalVariable(name: "salt", arg: 3, scope: !32, file: !3, line: 30, type: !6)
!221 = !DILocalVariable(name: "encrypted", arg: 4, scope: !32, file: !3, line: 30, type: !216)
!222 = !{!223, !223, i64 0}
!223 = !{!"any pointer", !224, i64 0}
!224 = !{!"omnipotent char", !225, i64 0}
!225 = !{!"Simple C/C++ TBAA"}
!226 = !DIExpression()
!227 = !DILocation(line: 30, column: 23, scope: !32)
!228 = !DILocation(line: 30, column: 37, scope: !32)
!229 = !DILocation(line: 30, column: 50, scope: !32)
!230 = !DILocation(line: 30, column: 65, scope: !32)
!231 = !DILocation(line: 32, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !32, file: !3, line: 32, column: 9)
!233 = !DILocation(line: 32, column: 59, scope: !232)
!234 = !DILocation(line: 32, column: 9, scope: !32)
!235 = !DILocation(line: 33, column: 31, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !3, line: 32, column: 65)
!237 = !DILocation(line: 33, column: 37, scope: !236)
!238 = !DILocation(line: 33, column: 42, scope: !236)
!239 = !DILocation(line: 33, column: 48, scope: !236)
!240 = !DILocation(line: 33, column: 16, scope: !236)
!241 = !DILocation(line: 33, column: 9, scope: !236)
!242 = !DILocation(line: 35, column: 16, scope: !243)
!243 = distinct !DILexicalBlock(scope: !232, file: !3, line: 35, column: 16)
!244 = !DILocation(line: 35, column: 68, scope: !243)
!245 = !DILocation(line: 35, column: 16, scope: !232)
!246 = !DILocation(line: 36, column: 32, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !3, line: 35, column: 74)
!248 = !DILocation(line: 36, column: 38, scope: !247)
!249 = !DILocation(line: 36, column: 43, scope: !247)
!250 = !DILocation(line: 36, column: 49, scope: !247)
!251 = !DILocation(line: 36, column: 16, scope: !247)
!252 = !DILocation(line: 36, column: 9, scope: !247)
!253 = !DILocation(line: 38, column: 16, scope: !254)
!254 = distinct !DILexicalBlock(scope: !243, file: !3, line: 38, column: 16)
!255 = !DILocation(line: 38, column: 66, scope: !254)
!256 = !DILocation(line: 38, column: 16, scope: !243)
!257 = !DILocation(line: 39, column: 31, scope: !258)
!258 = distinct !DILexicalBlock(scope: !254, file: !3, line: 38, column: 72)
!259 = !DILocation(line: 39, column: 37, scope: !258)
!260 = !DILocation(line: 39, column: 42, scope: !258)
!261 = !DILocation(line: 39, column: 48, scope: !258)
!262 = !DILocation(line: 39, column: 16, scope: !258)
!263 = !DILocation(line: 39, column: 9, scope: !258)
!264 = !DILocation(line: 41, column: 16, scope: !265)
!265 = distinct !DILexicalBlock(scope: !254, file: !3, line: 41, column: 16)
!266 = !DILocation(line: 41, column: 64, scope: !265)
!267 = !DILocation(line: 41, column: 16, scope: !254)
!268 = !DILocation(line: 42, column: 30, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !3, line: 41, column: 70)
!270 = !DILocation(line: 42, column: 36, scope: !269)
!271 = !DILocation(line: 42, column: 41, scope: !269)
!272 = !DILocation(line: 42, column: 47, scope: !269)
!273 = !DILocation(line: 42, column: 16, scope: !269)
!274 = !DILocation(line: 42, column: 9, scope: !269)
!275 = !DILocation(line: 47, column: 27, scope: !32)
!276 = !DILocation(line: 47, column: 33, scope: !32)
!277 = !DILocation(line: 47, column: 38, scope: !32)
!278 = !DILocation(line: 47, column: 44, scope: !32)
!279 = !DILocation(line: 47, column: 12, scope: !32)
!280 = !DILocation(line: 47, column: 5, scope: !32)
!281 = !DILocation(line: 48, column: 1, scope: !32)
!282 = distinct !DISubprogram(name: "ngx_crypt_apr1", scope: !3, file: !3, line: 52, type: !33, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, unit: !14, variables: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !296, !297, !298, !314}
!284 = !DILocalVariable(name: "pool", arg: 1, scope: !282, file: !3, line: 52, type: !39)
!285 = !DILocalVariable(name: "key", arg: 2, scope: !282, file: !3, line: 52, type: !6)
!286 = !DILocalVariable(name: "salt", arg: 3, scope: !282, file: !3, line: 52, type: !6)
!287 = !DILocalVariable(name: "encrypted", arg: 4, scope: !282, file: !3, line: 52, type: !216)
!288 = !DILocalVariable(name: "n", scope: !282, file: !3, line: 54, type: !35)
!289 = !DILocalVariable(name: "i", scope: !282, file: !3, line: 55, type: !53)
!290 = !DILocalVariable(name: "p", scope: !282, file: !3, line: 56, type: !6)
!291 = !DILocalVariable(name: "last", scope: !282, file: !3, line: 56, type: !6)
!292 = !DILocalVariable(name: "final", scope: !282, file: !3, line: 56, type: !293)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 16)
!296 = !DILocalVariable(name: "saltlen", scope: !282, file: !3, line: 57, type: !13)
!297 = !DILocalVariable(name: "keylen", scope: !282, file: !3, line: 57, type: !13)
!298 = !DILocalVariable(name: "md5", scope: !282, file: !3, line: 58, type: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_md5_t", file: !300, line: 20, baseType: !301)
!300 = !DIFile(filename: "src/core/ngx_md5.h", directory: "/home/sam/Projects/nginx-1.12.2")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 16, size: 704, elements: !302)
!302 = !{!303, !306, !307, !308, !309, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !301, file: !300, line: 17, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 196, baseType: !305)
!305 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !301, file: !300, line: 18, baseType: !10, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !301, file: !300, line: 18, baseType: !10, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !301, file: !300, line: 18, baseType: !10, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !301, file: !300, line: 18, baseType: !10, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !301, file: !300, line: 19, baseType: !311, size: 512, offset: 192)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 64)
!314 = !DILocalVariable(name: "ctx1", scope: !282, file: !3, line: 58, type: !299)
!315 = !DILocation(line: 52, column: 28, scope: !282)
!316 = !DILocation(line: 52, column: 42, scope: !282)
!317 = !DILocation(line: 52, column: 55, scope: !282)
!318 = !DILocation(line: 52, column: 70, scope: !282)
!319 = !DILocation(line: 54, column: 5, scope: !282)
!320 = !DILocation(line: 54, column: 24, scope: !282)
!321 = !DILocation(line: 55, column: 5, scope: !282)
!322 = !DILocation(line: 55, column: 24, scope: !282)
!323 = !DILocation(line: 56, column: 5, scope: !282)
!324 = !DILocation(line: 56, column: 24, scope: !282)
!325 = !DILocation(line: 56, column: 28, scope: !282)
!326 = !DILocation(line: 56, column: 34, scope: !282)
!327 = !DILocation(line: 57, column: 5, scope: !282)
!328 = !DILocation(line: 57, column: 24, scope: !282)
!329 = !DILocation(line: 57, column: 33, scope: !282)
!330 = !DILocation(line: 58, column: 5, scope: !282)
!331 = !DILocation(line: 58, column: 24, scope: !282)
!332 = !DILocation(line: 58, column: 29, scope: !282)
!333 = !DILocation(line: 62, column: 14, scope: !282)
!334 = !DILocation(line: 62, column: 12, scope: !282)
!335 = !{!336, !336, i64 0}
!336 = !{!"int", !224, i64 0}
!337 = !DILocation(line: 66, column: 10, scope: !282)
!338 = !DILocation(line: 67, column: 12, scope: !282)
!339 = !DILocation(line: 67, column: 17, scope: !282)
!340 = !DILocation(line: 67, column: 10, scope: !282)
!341 = !DILocation(line: 68, column: 14, scope: !342)
!342 = distinct !DILexicalBlock(scope: !282, file: !3, line: 68, column: 5)
!343 = !DILocation(line: 68, column: 12, scope: !342)
!344 = !DILocation(line: 68, column: 10, scope: !342)
!345 = !DILocation(line: 68, column: 21, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !3, line: 68, column: 5)
!347 = !DILocation(line: 68, column: 20, scope: !346)
!348 = !{!224, !224, i64 0}
!349 = !DILocation(line: 68, column: 23, scope: !346)
!350 = !DILocation(line: 68, column: 27, scope: !346)
!351 = !DILocation(line: 68, column: 26, scope: !346)
!352 = !DILocation(line: 68, column: 29, scope: !346)
!353 = !DILocation(line: 68, column: 36, scope: !346)
!354 = !DILocation(line: 68, column: 39, scope: !346)
!355 = !DILocation(line: 68, column: 43, scope: !346)
!356 = !DILocation(line: 68, column: 41, scope: !346)
!357 = !DILocation(line: 68, column: 5, scope: !342)
!358 = !DILocation(line: 68, column: 67, scope: !359)
!359 = distinct !DILexicalBlock(scope: !346, file: !3, line: 68, column: 54)
!360 = !DILocation(line: 68, column: 50, scope: !346)
!361 = !DILocation(line: 68, column: 5, scope: !346)
!362 = distinct !{!362, !357, !363}
!363 = !DILocation(line: 68, column: 67, scope: !342)
!364 = !DILocation(line: 69, column: 15, scope: !282)
!365 = !DILocation(line: 69, column: 19, scope: !282)
!366 = !DILocation(line: 69, column: 17, scope: !282)
!367 = !DILocation(line: 69, column: 13, scope: !282)
!368 = !DILocation(line: 73, column: 5, scope: !282)
!369 = !DILocation(line: 74, column: 26, scope: !282)
!370 = !DILocation(line: 74, column: 31, scope: !282)
!371 = !DILocation(line: 74, column: 5, scope: !282)
!372 = !DILocation(line: 75, column: 5, scope: !282)
!373 = !DILocation(line: 76, column: 26, scope: !282)
!374 = !DILocation(line: 76, column: 32, scope: !282)
!375 = !DILocation(line: 76, column: 5, scope: !282)
!376 = !DILocation(line: 78, column: 5, scope: !282)
!377 = !DILocation(line: 79, column: 27, scope: !282)
!378 = !DILocation(line: 79, column: 32, scope: !282)
!379 = !DILocation(line: 79, column: 5, scope: !282)
!380 = !DILocation(line: 80, column: 27, scope: !282)
!381 = !DILocation(line: 80, column: 33, scope: !282)
!382 = !DILocation(line: 80, column: 5, scope: !282)
!383 = !DILocation(line: 81, column: 27, scope: !282)
!384 = !DILocation(line: 81, column: 32, scope: !282)
!385 = !DILocation(line: 81, column: 5, scope: !282)
!386 = !DILocation(line: 82, column: 19, scope: !282)
!387 = !DILocation(line: 82, column: 5, scope: !282)
!388 = !DILocation(line: 84, column: 14, scope: !389)
!389 = distinct !DILexicalBlock(scope: !282, file: !3, line: 84, column: 5)
!390 = !DILocation(line: 84, column: 12, scope: !389)
!391 = !DILocation(line: 84, column: 10, scope: !389)
!392 = !DILocation(line: 84, column: 22, scope: !393)
!393 = distinct !DILexicalBlock(scope: !389, file: !3, line: 84, column: 5)
!394 = !DILocation(line: 84, column: 24, scope: !393)
!395 = !DILocation(line: 84, column: 5, scope: !389)
!396 = !DILocation(line: 85, column: 30, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !3, line: 84, column: 38)
!398 = !DILocation(line: 85, column: 37, scope: !397)
!399 = !DILocation(line: 85, column: 39, scope: !397)
!400 = !DILocation(line: 85, column: 51, scope: !397)
!401 = !DILocation(line: 85, column: 9, scope: !397)
!402 = !DILocation(line: 86, column: 5, scope: !397)
!403 = !DILocation(line: 84, column: 31, scope: !393)
!404 = !DILocation(line: 84, column: 5, scope: !393)
!405 = distinct !{!405, !395, !406}
!406 = !DILocation(line: 86, column: 5, scope: !389)
!407 = !DILocation(line: 88, column: 5, scope: !282)
!408 = !DILocation(line: 90, column: 14, scope: !409)
!409 = distinct !DILexicalBlock(scope: !282, file: !3, line: 90, column: 5)
!410 = !DILocation(line: 90, column: 12, scope: !409)
!411 = !DILocation(line: 90, column: 10, scope: !409)
!412 = !DILocation(line: 90, column: 22, scope: !413)
!413 = distinct !DILexicalBlock(scope: !409, file: !3, line: 90, column: 5)
!414 = !DILocation(line: 90, column: 5, scope: !409)
!415 = !DILocation(line: 91, column: 13, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 91, column: 13)
!417 = distinct !DILexicalBlock(scope: !413, file: !3, line: 90, column: 34)
!418 = !DILocation(line: 91, column: 15, scope: !416)
!419 = !DILocation(line: 91, column: 13, scope: !417)
!420 = !DILocation(line: 92, column: 34, scope: !421)
!421 = distinct !DILexicalBlock(scope: !416, file: !3, line: 91, column: 20)
!422 = !DILocation(line: 92, column: 13, scope: !421)
!423 = !DILocation(line: 94, column: 9, scope: !421)
!424 = !DILocation(line: 95, column: 34, scope: !425)
!425 = distinct !DILexicalBlock(scope: !416, file: !3, line: 94, column: 16)
!426 = !DILocation(line: 95, column: 13, scope: !425)
!427 = !DILocation(line: 97, column: 5, scope: !417)
!428 = !DILocation(line: 90, column: 27, scope: !413)
!429 = !DILocation(line: 90, column: 5, scope: !413)
!430 = distinct !{!430, !414, !431}
!431 = !DILocation(line: 97, column: 5, scope: !409)
!432 = !DILocation(line: 99, column: 19, scope: !282)
!433 = !DILocation(line: 99, column: 5, scope: !282)
!434 = !DILocation(line: 101, column: 12, scope: !435)
!435 = distinct !DILexicalBlock(scope: !282, file: !3, line: 101, column: 5)
!436 = !DILocation(line: 101, column: 10, scope: !435)
!437 = !DILocation(line: 101, column: 17, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 101, column: 5)
!439 = !DILocation(line: 101, column: 19, scope: !438)
!440 = !DILocation(line: 101, column: 5, scope: !435)
!441 = !DILocation(line: 102, column: 9, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !3, line: 101, column: 32)
!443 = !DILocation(line: 104, column: 13, scope: !444)
!444 = distinct !DILexicalBlock(scope: !442, file: !3, line: 104, column: 13)
!445 = !DILocation(line: 104, column: 15, scope: !444)
!446 = !DILocation(line: 104, column: 13, scope: !442)
!447 = !DILocation(line: 105, column: 35, scope: !448)
!448 = distinct !DILexicalBlock(scope: !444, file: !3, line: 104, column: 20)
!449 = !DILocation(line: 105, column: 40, scope: !448)
!450 = !DILocation(line: 105, column: 13, scope: !448)
!451 = !DILocation(line: 107, column: 9, scope: !448)
!452 = !DILocation(line: 108, column: 35, scope: !453)
!453 = distinct !DILexicalBlock(scope: !444, file: !3, line: 107, column: 16)
!454 = !DILocation(line: 108, column: 13, scope: !453)
!455 = !DILocation(line: 111, column: 13, scope: !456)
!456 = distinct !DILexicalBlock(scope: !442, file: !3, line: 111, column: 13)
!457 = !DILocation(line: 111, column: 15, scope: !456)
!458 = !DILocation(line: 111, column: 13, scope: !442)
!459 = !DILocation(line: 112, column: 35, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !3, line: 111, column: 20)
!461 = !DILocation(line: 112, column: 41, scope: !460)
!462 = !DILocation(line: 112, column: 13, scope: !460)
!463 = !DILocation(line: 113, column: 9, scope: !460)
!464 = !DILocation(line: 115, column: 13, scope: !465)
!465 = distinct !DILexicalBlock(scope: !442, file: !3, line: 115, column: 13)
!466 = !DILocation(line: 115, column: 15, scope: !465)
!467 = !DILocation(line: 115, column: 13, scope: !442)
!468 = !DILocation(line: 116, column: 35, scope: !469)
!469 = distinct !DILexicalBlock(scope: !465, file: !3, line: 115, column: 20)
!470 = !DILocation(line: 116, column: 40, scope: !469)
!471 = !DILocation(line: 116, column: 13, scope: !469)
!472 = !DILocation(line: 117, column: 9, scope: !469)
!473 = !DILocation(line: 119, column: 13, scope: !474)
!474 = distinct !DILexicalBlock(scope: !442, file: !3, line: 119, column: 13)
!475 = !DILocation(line: 119, column: 15, scope: !474)
!476 = !DILocation(line: 119, column: 13, scope: !442)
!477 = !DILocation(line: 120, column: 35, scope: !478)
!478 = distinct !DILexicalBlock(scope: !474, file: !3, line: 119, column: 20)
!479 = !DILocation(line: 120, column: 13, scope: !478)
!480 = !DILocation(line: 122, column: 9, scope: !478)
!481 = !DILocation(line: 123, column: 35, scope: !482)
!482 = distinct !DILexicalBlock(scope: !474, file: !3, line: 122, column: 16)
!483 = !DILocation(line: 123, column: 40, scope: !482)
!484 = !DILocation(line: 123, column: 13, scope: !482)
!485 = !DILocation(line: 126, column: 23, scope: !442)
!486 = !DILocation(line: 126, column: 9, scope: !442)
!487 = !DILocation(line: 127, column: 5, scope: !442)
!488 = !DILocation(line: 101, column: 28, scope: !438)
!489 = !DILocation(line: 101, column: 5, scope: !438)
!490 = distinct !{!490, !440, !491}
!491 = !DILocation(line: 127, column: 5, scope: !435)
!492 = !DILocation(line: 131, column: 30, scope: !282)
!493 = !DILocation(line: 131, column: 59, scope: !282)
!494 = !DILocation(line: 131, column: 57, scope: !282)
!495 = !DILocation(line: 131, column: 67, scope: !282)
!496 = !DILocation(line: 131, column: 71, scope: !282)
!497 = !DILocation(line: 131, column: 76, scope: !282)
!498 = !DILocation(line: 131, column: 18, scope: !282)
!499 = !DILocation(line: 131, column: 6, scope: !282)
!500 = !DILocation(line: 131, column: 16, scope: !282)
!501 = !DILocation(line: 132, column: 10, scope: !502)
!502 = distinct !DILexicalBlock(scope: !282, file: !3, line: 132, column: 9)
!503 = !DILocation(line: 132, column: 9, scope: !502)
!504 = !DILocation(line: 132, column: 20, scope: !502)
!505 = !DILocation(line: 132, column: 9, scope: !282)
!506 = !DILocation(line: 133, column: 9, scope: !507)
!507 = distinct !DILexicalBlock(scope: !502, file: !3, line: 132, column: 29)
!508 = !DILocation(line: 136, column: 9, scope: !282)
!509 = !DILocation(line: 136, column: 7, scope: !282)
!510 = !DILocation(line: 137, column: 9, scope: !282)
!511 = !DILocation(line: 137, column: 7, scope: !282)
!512 = !DILocation(line: 138, column: 7, scope: !282)
!513 = !DILocation(line: 138, column: 10, scope: !282)
!514 = !DILocation(line: 140, column: 24, scope: !282)
!515 = !DILocation(line: 140, column: 28, scope: !282)
!516 = !DILocation(line: 140, column: 37, scope: !282)
!517 = !DILocation(line: 140, column: 46, scope: !282)
!518 = !DILocation(line: 140, column: 55, scope: !282)
!519 = !DILocation(line: 140, column: 43, scope: !282)
!520 = !DILocation(line: 140, column: 62, scope: !282)
!521 = !DILocation(line: 140, column: 60, scope: !282)
!522 = !DILocation(line: 140, column: 9, scope: !282)
!523 = !DILocation(line: 140, column: 7, scope: !282)
!524 = !DILocation(line: 141, column: 24, scope: !282)
!525 = !DILocation(line: 141, column: 28, scope: !282)
!526 = !DILocation(line: 141, column: 37, scope: !282)
!527 = !DILocation(line: 141, column: 46, scope: !282)
!528 = !DILocation(line: 141, column: 55, scope: !282)
!529 = !DILocation(line: 141, column: 43, scope: !282)
!530 = !DILocation(line: 141, column: 62, scope: !282)
!531 = !DILocation(line: 141, column: 60, scope: !282)
!532 = !DILocation(line: 141, column: 9, scope: !282)
!533 = !DILocation(line: 141, column: 7, scope: !282)
!534 = !DILocation(line: 142, column: 24, scope: !282)
!535 = !DILocation(line: 142, column: 28, scope: !282)
!536 = !DILocation(line: 142, column: 37, scope: !282)
!537 = !DILocation(line: 142, column: 46, scope: !282)
!538 = !DILocation(line: 142, column: 55, scope: !282)
!539 = !DILocation(line: 142, column: 43, scope: !282)
!540 = !DILocation(line: 142, column: 62, scope: !282)
!541 = !DILocation(line: 142, column: 60, scope: !282)
!542 = !DILocation(line: 142, column: 9, scope: !282)
!543 = !DILocation(line: 142, column: 7, scope: !282)
!544 = !DILocation(line: 143, column: 24, scope: !282)
!545 = !DILocation(line: 143, column: 28, scope: !282)
!546 = !DILocation(line: 143, column: 37, scope: !282)
!547 = !DILocation(line: 143, column: 46, scope: !282)
!548 = !DILocation(line: 143, column: 55, scope: !282)
!549 = !DILocation(line: 143, column: 43, scope: !282)
!550 = !DILocation(line: 143, column: 62, scope: !282)
!551 = !DILocation(line: 143, column: 60, scope: !282)
!552 = !DILocation(line: 143, column: 9, scope: !282)
!553 = !DILocation(line: 143, column: 7, scope: !282)
!554 = !DILocation(line: 144, column: 24, scope: !282)
!555 = !DILocation(line: 144, column: 28, scope: !282)
!556 = !DILocation(line: 144, column: 37, scope: !282)
!557 = !DILocation(line: 144, column: 46, scope: !282)
!558 = !DILocation(line: 144, column: 55, scope: !282)
!559 = !DILocation(line: 144, column: 43, scope: !282)
!560 = !DILocation(line: 144, column: 62, scope: !282)
!561 = !DILocation(line: 144, column: 60, scope: !282)
!562 = !DILocation(line: 144, column: 9, scope: !282)
!563 = !DILocation(line: 144, column: 7, scope: !282)
!564 = !DILocation(line: 145, column: 24, scope: !282)
!565 = !DILocation(line: 145, column: 27, scope: !282)
!566 = !DILocation(line: 145, column: 9, scope: !282)
!567 = !DILocation(line: 145, column: 7, scope: !282)
!568 = !DILocation(line: 146, column: 6, scope: !282)
!569 = !DILocation(line: 146, column: 8, scope: !282)
!570 = !DILocation(line: 148, column: 5, scope: !282)
!571 = !DILocation(line: 149, column: 1, scope: !282)
!572 = distinct !DISubprogram(name: "ngx_crypt_plain", scope: !3, file: !3, line: 168, type: !33, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, unit: !14, variables: !573)
!573 = !{!574, !575, !576, !577, !578, !579}
!574 = !DILocalVariable(name: "pool", arg: 1, scope: !572, file: !3, line: 168, type: !39)
!575 = !DILocalVariable(name: "key", arg: 2, scope: !572, file: !3, line: 168, type: !6)
!576 = !DILocalVariable(name: "salt", arg: 3, scope: !572, file: !3, line: 168, type: !6)
!577 = !DILocalVariable(name: "encrypted", arg: 4, scope: !572, file: !3, line: 168, type: !216)
!578 = !DILocalVariable(name: "len", scope: !572, file: !3, line: 170, type: !13)
!579 = !DILocalVariable(name: "p", scope: !572, file: !3, line: 171, type: !6)
!580 = !DILocation(line: 168, column: 29, scope: !572)
!581 = !DILocation(line: 168, column: 43, scope: !572)
!582 = !DILocation(line: 168, column: 56, scope: !572)
!583 = !DILocation(line: 168, column: 71, scope: !572)
!584 = !DILocation(line: 170, column: 5, scope: !572)
!585 = !DILocation(line: 170, column: 14, scope: !572)
!586 = !DILocation(line: 171, column: 5, scope: !572)
!587 = !DILocation(line: 171, column: 14, scope: !572)
!588 = !DILocation(line: 173, column: 11, scope: !572)
!589 = !DILocation(line: 173, column: 9, scope: !572)
!590 = !DILocation(line: 175, column: 30, scope: !572)
!591 = !DILocation(line: 175, column: 60, scope: !572)
!592 = !DILocation(line: 175, column: 58, scope: !572)
!593 = !DILocation(line: 175, column: 64, scope: !572)
!594 = !DILocation(line: 175, column: 18, scope: !572)
!595 = !DILocation(line: 175, column: 6, scope: !572)
!596 = !DILocation(line: 175, column: 16, scope: !572)
!597 = !DILocation(line: 176, column: 10, scope: !598)
!598 = distinct !DILexicalBlock(scope: !572, file: !3, line: 176, column: 9)
!599 = !DILocation(line: 176, column: 9, scope: !598)
!600 = !DILocation(line: 176, column: 20, scope: !598)
!601 = !DILocation(line: 176, column: 9, scope: !572)
!602 = !DILocation(line: 177, column: 9, scope: !603)
!603 = distinct !DILexicalBlock(scope: !598, file: !3, line: 176, column: 29)
!604 = !DILocation(line: 180, column: 9, scope: !572)
!605 = !DILocation(line: 180, column: 7, scope: !572)
!606 = !DILocation(line: 181, column: 5, scope: !572)
!607 = !DILocation(line: 183, column: 5, scope: !572)
!608 = !DILocation(line: 184, column: 1, scope: !572)
!609 = distinct !DISubprogram(name: "ngx_crypt_ssha", scope: !3, file: !3, line: 188, type: !33, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !14, variables: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619}
!611 = !DILocalVariable(name: "pool", arg: 1, scope: !609, file: !3, line: 188, type: !39)
!612 = !DILocalVariable(name: "key", arg: 2, scope: !609, file: !3, line: 188, type: !6)
!613 = !DILocalVariable(name: "salt", arg: 3, scope: !609, file: !3, line: 188, type: !6)
!614 = !DILocalVariable(name: "encrypted", arg: 4, scope: !609, file: !3, line: 188, type: !216)
!615 = !DILocalVariable(name: "len", scope: !609, file: !3, line: 190, type: !13)
!616 = !DILocalVariable(name: "rc", scope: !609, file: !3, line: 191, type: !35)
!617 = !DILocalVariable(name: "encoded", scope: !609, file: !3, line: 192, type: !87)
!618 = !DILocalVariable(name: "decoded", scope: !609, file: !3, line: 192, type: !87)
!619 = !DILocalVariable(name: "sha1", scope: !609, file: !3, line: 193, type: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_sha1_t", file: !621, line: 20, baseType: !622)
!621 = !DIFile(filename: "src/core/ngx_sha1.h", directory: "/home/sam/Projects/nginx-1.12.2")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !621, line: 16, size: 768, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !622, file: !621, line: 17, baseType: !304, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !622, file: !621, line: 18, baseType: !10, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !622, file: !621, line: 19, baseType: !311, size: 512, offset: 256)
!632 = !DILocation(line: 188, column: 28, scope: !609)
!633 = !DILocation(line: 188, column: 42, scope: !609)
!634 = !DILocation(line: 188, column: 55, scope: !609)
!635 = !DILocation(line: 188, column: 70, scope: !609)
!636 = !DILocation(line: 190, column: 5, scope: !609)
!637 = !DILocation(line: 190, column: 18, scope: !609)
!638 = !DILocation(line: 191, column: 5, scope: !609)
!639 = !DILocation(line: 191, column: 18, scope: !609)
!640 = !DILocation(line: 192, column: 5, scope: !609)
!641 = !DILocation(line: 192, column: 18, scope: !609)
!642 = !DILocation(line: 192, column: 27, scope: !609)
!643 = !DILocation(line: 193, column: 5, scope: !609)
!644 = !DILocation(line: 193, column: 18, scope: !609)
!645 = !DILocation(line: 199, column: 20, scope: !609)
!646 = !DILocation(line: 199, column: 25, scope: !609)
!647 = !DILocation(line: 199, column: 44, scope: !609)
!648 = !DILocation(line: 199, column: 13, scope: !609)
!649 = !DILocation(line: 199, column: 18, scope: !609)
!650 = !{!651, !223, i64 4}
!651 = !{!"", !336, i64 0, !223, i64 4}
!652 = !DILocation(line: 200, column: 19, scope: !609)
!653 = !DILocation(line: 200, column: 13, scope: !609)
!654 = !DILocation(line: 200, column: 17, scope: !609)
!655 = !{!651, !336, i64 0}
!656 = !DILocation(line: 202, column: 11, scope: !609)
!657 = !DILocation(line: 202, column: 9, scope: !609)
!658 = !DILocation(line: 204, column: 32, scope: !609)
!659 = !DILocation(line: 204, column: 38, scope: !609)
!660 = !DILocation(line: 204, column: 20, scope: !609)
!661 = !DILocation(line: 204, column: 13, scope: !609)
!662 = !DILocation(line: 204, column: 18, scope: !609)
!663 = !DILocation(line: 205, column: 17, scope: !664)
!664 = distinct !DILexicalBlock(scope: !609, file: !3, line: 205, column: 9)
!665 = !DILocation(line: 205, column: 22, scope: !664)
!666 = !DILocation(line: 205, column: 9, scope: !609)
!667 = !DILocation(line: 206, column: 9, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !3, line: 205, column: 31)
!669 = !DILocation(line: 209, column: 10, scope: !609)
!670 = !DILocation(line: 209, column: 8, scope: !609)
!671 = !DILocation(line: 211, column: 9, scope: !672)
!672 = distinct !DILexicalBlock(scope: !609, file: !3, line: 211, column: 9)
!673 = !DILocation(line: 211, column: 12, scope: !672)
!674 = !DILocation(line: 211, column: 22, scope: !672)
!675 = !DILocation(line: 211, column: 33, scope: !672)
!676 = !DILocation(line: 211, column: 37, scope: !672)
!677 = !DILocation(line: 211, column: 9, scope: !609)
!678 = !DILocation(line: 212, column: 17, scope: !679)
!679 = distinct !DILexicalBlock(scope: !672, file: !3, line: 211, column: 43)
!680 = !DILocation(line: 212, column: 21, scope: !679)
!681 = !DILocation(line: 213, column: 5, scope: !679)
!682 = !DILocation(line: 217, column: 5, scope: !609)
!683 = !DILocation(line: 218, column: 28, scope: !609)
!684 = !DILocation(line: 218, column: 33, scope: !609)
!685 = !DILocation(line: 218, column: 5, scope: !609)
!686 = !DILocation(line: 219, column: 36, scope: !609)
!687 = !DILocation(line: 219, column: 41, scope: !609)
!688 = !DILocation(line: 219, column: 55, scope: !609)
!689 = !DILocation(line: 219, column: 59, scope: !609)
!690 = !DILocation(line: 219, column: 5, scope: !609)
!691 = !DILocation(line: 220, column: 28, scope: !609)
!692 = !DILocation(line: 220, column: 5, scope: !609)
!693 = !DILocation(line: 224, column: 34, scope: !609)
!694 = !DILocation(line: 224, column: 32, scope: !609)
!695 = !DILocation(line: 224, column: 73, scope: !609)
!696 = !DILocation(line: 224, column: 9, scope: !609)
!697 = !DILocation(line: 226, column: 30, scope: !609)
!698 = !DILocation(line: 226, column: 36, scope: !609)
!699 = !DILocation(line: 226, column: 18, scope: !609)
!700 = !DILocation(line: 226, column: 6, scope: !609)
!701 = !DILocation(line: 226, column: 16, scope: !609)
