; ModuleID = 'src/core/ngx_connection.c'
source_filename = "src/core/ngx_connection.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_event_actions_t = type { i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_connection_s*)*, i32 (%struct.ngx_connection_s*, i32)*, i32 (void (%struct.ngx_event_s*)*)*, i32 (%struct.ngx_cycle_s*, i32, i32)*, i32 (%struct.ngx_cycle_s*, i32)*, void (%struct.ngx_cycle_s*)* }
%struct.ngx_event_s = type { i8*, i24, void (%struct.ngx_event_s*)*, i32, %struct.ngx_log_s*, %struct.ngx_rbtree_node_s, %struct.ngx_queue_s }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }
%struct.ngx_queue_s = type { %struct.ngx_queue_s*, %struct.ngx_queue_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_io", scope: !2, file: !3, line: 13, type: !579, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !578)
!3 = !DIFile(filename: "src/core/ngx_connection.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 93, size: 32, elements: !7)
!6 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "NGX_ERROR_ALERT", value: 0)
!9 = !DIEnumerator(name: "NGX_ERROR_ERR", value: 1)
!10 = !DIEnumerator(name: "NGX_ERROR_INFO", value: 2)
!11 = !DIEnumerator(name: "NGX_ERROR_IGNORE_ECONNRESET", value: 3)
!12 = !DIEnumerator(name: "NGX_ERROR_IGNORE_EINVAL", value: 4)
!13 = !{!14, !15, !18, !21, !23, !25, !27, !30, !283, !539, !566, !224, !51}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !16, line: 17, baseType: !17)
!16 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !19, line: 404, baseType: !20)
!19 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !29)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !19, line: 125, baseType: !20)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !32, line: 17, baseType: !33)
!32 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !34, line: 38, size: 2496, elements: !35)
!34 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!35 = !{!36, !40, !219, !220, !221, !222, !397, !398, !399, !490, !491, !492, !493, !494, !495, !496, !497, !508, !509, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !33, file: !34, line: 39, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !33, file: !34, line: 40, baseType: !41, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !32, line: 18, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !44, line: 57, size: 320, elements: !45)
!44 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !{!46, !58, !60, !61, !199, !206, !218}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !43, file: !44, line: 58, baseType: !47, size: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !44, line: 54, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 49, size: 128, elements: !49)
!49 = !{!50, !55, !56, !57}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !48, file: !44, line: 50, baseType: !51, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !53, line: 64, baseType: !54)
!53 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !48, file: !44, line: 51, baseType: !51, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !44, line: 52, baseType: !41, size: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !48, file: !44, line: 53, baseType: !27, size: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !43, file: !44, line: 59, baseType: !59, size: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 120, baseType: !20)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !43, file: !44, line: 60, baseType: !41, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !43, file: !44, line: 61, baseType: !62, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !32, line: 19, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !65, line: 59, size: 64, elements: !66)
!65 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!66 = !{!67, !198}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !64, file: !65, line: 60, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !65, line: 18, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !65, line: 20, size: 352, elements: !71)
!71 = !{!72, !73, !74, !76, !77, !78, !79, !81, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !70, file: !65, line: 21, baseType: !51, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !70, file: !65, line: 22, baseType: !51, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !70, file: !65, line: 23, baseType: !75, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !19, line: 222, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !70, file: !65, line: 24, baseType: !75, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !70, file: !65, line: 26, baseType: !51, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !70, file: !65, line: 27, baseType: !51, size: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !70, file: !65, line: 28, baseType: !80, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !65, line: 16, baseType: !14)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !70, file: !65, line: 29, baseType: !82, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !32, line: 23, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !85, line: 16, size: 1216, elements: !86)
!85 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = !{!87, !90, !97, !142, !143, !144, !183, !184}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !84, file: !85, line: 17, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !89, line: 16, baseType: !17)
!89 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 18, baseType: !91, size: 64, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !92, line: 19, baseType: !93)
!92 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 16, size: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !93, file: !92, line: 17, baseType: !59, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !92, line: 18, baseType: !51, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !84, file: !85, line: 19, baseType: !98, size: 960, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !89, line: 17, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !100, line: 4, size: 960, elements: !101)
!100 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = !{!102, !104, !105, !107, !108, !110, !111, !113, !115, !117, !118, !119, !120, !121, !122, !125, !126, !128, !129, !135, !136, !137}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !99, file: !100, line: 6, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !19, line: 232, baseType: !20)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !99, file: !100, line: 7, baseType: !103, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !99, file: !100, line: 8, baseType: !106, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !19, line: 227, baseType: !20)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !99, file: !100, line: 9, baseType: !106, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !99, file: !100, line: 10, baseType: !109, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !19, line: 217, baseType: !20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !99, file: !100, line: 11, baseType: !109, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !99, file: !100, line: 13, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !19, line: 212, baseType: !20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !99, file: !100, line: 14, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !19, line: 304, baseType: !20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !99, file: !100, line: 15, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !19, line: 309, baseType: !20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !99, file: !100, line: 16, baseType: !20, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !99, file: !100, line: 17, baseType: !103, size: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !99, file: !100, line: 18, baseType: !103, size: 32, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !99, file: !100, line: 19, baseType: !75, size: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !99, file: !100, line: 20, baseType: !75, size: 32, offset: 416)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !99, file: !100, line: 21, baseType: !123, size: 32, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !19, line: 237, baseType: !124)
!124 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !99, file: !100, line: 22, baseType: !123, size: 32, offset: 480)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !99, file: !100, line: 23, baseType: !127, size: 32, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !19, line: 242, baseType: !17)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !99, file: !100, line: 24, baseType: !127, size: 32, offset: 544)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !99, file: !100, line: 26, baseType: !130, size: 64, offset: 576)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !19, line: 288, size: 64, elements: !131)
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !130, file: !19, line: 288, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !19, line: 75, baseType: !124)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !130, file: !19, line: 288, baseType: !124, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !99, file: !100, line: 27, baseType: !130, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !99, file: !100, line: 28, baseType: !130, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !99, file: !100, line: 29, baseType: !138, size: 192, offset: 768)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, elements: !140)
!139 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !84, file: !85, line: 21, baseType: !75, size: 32, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !84, file: !85, line: 22, baseType: !75, size: 32, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !84, file: !85, line: 24, baseType: !145, size: 32, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !32, line: 20, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !148, line: 50, size: 320, elements: !149)
!148 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!149 = !{!150, !151, !164, !168, !169, !174, !175, !180, !181, !182}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !147, file: !148, line: 51, baseType: !27, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !147, file: !148, line: 52, baseType: !152, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !32, line: 21, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !155, line: 89, size: 160, elements: !156)
!155 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!156 = !{!157, !158, !159, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !154, file: !155, line: 90, baseType: !88, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 91, baseType: !91, size: 64, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !154, file: !155, line: 93, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !152, !145}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !155, line: 94, baseType: !14, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !147, file: !148, line: 54, baseType: !165, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !166, line: 98, baseType: !167)
!166 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !147, file: !148, line: 56, baseType: !133, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !147, file: !148, line: 58, baseType: !170, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !148, line: 45, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{!51, !145, !51, !59}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !148, line: 59, baseType: !14, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !147, file: !148, line: 61, baseType: !176, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !148, line: 46, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !145, !27, !51, !59}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !147, file: !148, line: 62, baseType: !14, size: 32, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !147, file: !148, line: 70, baseType: !23, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !148, line: 72, baseType: !145, size: 32, offset: 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !84, file: !85, line: 37, baseType: !20, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !84, file: !85, line: 38, baseType: !20, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !70, file: !65, line: 30, baseType: !68, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !70, file: !65, line: 34, baseType: !20, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !70, file: !65, line: 40, baseType: !20, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !70, file: !65, line: 43, baseType: !20, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !70, file: !65, line: 45, baseType: !20, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !70, file: !65, line: 46, baseType: !20, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !70, file: !65, line: 47, baseType: !20, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !70, file: !65, line: 48, baseType: !20, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !70, file: !65, line: 49, baseType: !20, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !70, file: !65, line: 50, baseType: !20, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !70, file: !65, line: 52, baseType: !20, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !70, file: !65, line: 53, baseType: !20, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !70, file: !65, line: 55, baseType: !17, size: 32, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !65, line: 61, baseType: !62, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !43, file: !44, line: 62, baseType: !200, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !44, line: 41, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !44, line: 43, size: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !44, line: 44, baseType: !200, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !202, file: !44, line: 45, baseType: !14, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !43, file: !44, line: 63, baseType: !207, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !44, line: 32, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !44, line: 34, size: 96, elements: !210)
!210 = !{!211, !216, !217}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !209, file: !44, line: 35, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !44, line: 30, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !14}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !44, line: 36, baseType: !14, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !44, line: 37, baseType: !207, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !43, file: !44, line: 64, baseType: !145, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !33, file: !34, line: 42, baseType: !145, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !33, file: !34, line: 43, baseType: !146, size: 320, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !33, file: !34, line: 45, baseType: !27, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !33, file: !34, line: 47, baseType: !223, size: 32, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !32, line: 26, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !6, line: 121, size: 896, elements: !227)
!227 = !{!228, !229, !285, !286, !287, !294, !296, !301, !306, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !6, line: 122, baseType: !14, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !226, file: !6, line: 123, baseType: !230, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !32, line: 24, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !233, line: 30, size: 384, elements: !234)
!233 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !262, !263, !264, !277}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !233, line: 31, baseType: !14, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !232, file: !233, line: 33, baseType: !20, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !232, file: !233, line: 35, baseType: !20, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !232, file: !233, line: 38, baseType: !20, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !232, file: !233, line: 44, baseType: !20, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !232, file: !233, line: 46, baseType: !20, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !232, file: !233, line: 49, baseType: !20, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !232, file: !233, line: 51, baseType: !20, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !232, file: !233, line: 54, baseType: !20, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !232, file: !233, line: 56, baseType: !20, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !232, file: !233, line: 57, baseType: !20, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !232, file: !233, line: 59, baseType: !20, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !232, file: !233, line: 60, baseType: !20, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !232, file: !233, line: 62, baseType: !20, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !232, file: !233, line: 64, baseType: !20, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !232, file: !233, line: 67, baseType: !20, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !232, file: !233, line: 69, baseType: !20, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !232, file: !233, line: 71, baseType: !20, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !232, file: !233, line: 74, baseType: !20, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !232, file: !233, line: 75, baseType: !20, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !232, file: !233, line: 77, baseType: !20, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !232, file: !233, line: 107, baseType: !20, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !232, file: !233, line: 110, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !32, line: 31, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !230}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !232, file: !233, line: 117, baseType: !27, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !232, file: !233, line: 119, baseType: !145, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !232, file: !233, line: 121, baseType: !265, size: 160, offset: 160)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !266, line: 20, baseType: !267)
!266 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !266, line: 22, size: 160, elements: !268)
!268 = !{!269, !271, !273, !274, !275, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !267, file: !266, line: 23, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !266, line: 16, baseType: !27)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !267, file: !266, line: 24, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !267, file: !266, line: 25, baseType: !272, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !267, file: !266, line: 26, baseType: !272, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !267, file: !266, line: 27, baseType: !52, size: 8, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !266, line: 28, baseType: !52, size: 8, offset: 136)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !232, file: !233, line: 124, baseType: !278, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !279, line: 16, baseType: !280)
!279 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !279, line: 18, size: 64, elements: !281)
!281 = !{!282, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !279, line: 19, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !279, line: 20, baseType: !283, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !226, file: !6, line: 124, baseType: !230, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !226, file: !6, line: 126, baseType: !15, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !226, file: !6, line: 128, baseType: !288, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !289, line: 19, baseType: !290)
!289 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !224, !51, !59}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 135, baseType: !17)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !226, file: !6, line: 129, baseType: !295, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !289, line: 22, baseType: !290)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !226, file: !6, line: 130, baseType: !297, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !289, line: 20, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{!293, !224, !62, !75}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !226, file: !6, line: 131, baseType: !302, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !289, line: 23, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{!62, !224, !62, !75}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !226, file: !6, line: 133, baseType: !307, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !6, line: 16, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !6, line: 18, size: 960, elements: !310)
!310 = !{!311, !312, !324, !325, !326, !327, !328, !329, !330, !331, !336, !337, !338, !339, !340, !341, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !309, file: !6, line: 19, baseType: !15, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !309, file: !6, line: 21, baseType: !313, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !315, line: 297, size: 128, elements: !316)
!315 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!316 = !{!317, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !314, file: !315, line: 298, baseType: !318, size: 16)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !19, line: 409, baseType: !319)
!319 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !314, file: !315, line: 299, baseType: !321, size: 112, offset: 16)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 112, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 14)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !309, file: !6, line: 22, baseType: !18, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !309, file: !6, line: 23, baseType: !59, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !309, file: !6, line: 24, baseType: !91, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !6, line: 26, baseType: !17, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !309, file: !6, line: 28, baseType: !17, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !309, file: !6, line: 29, baseType: !17, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !309, file: !6, line: 30, baseType: !17, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !309, file: !6, line: 38, baseType: !332, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !32, line: 32, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !224}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !309, file: !6, line: 40, baseType: !14, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !309, file: !6, line: 42, baseType: !146, size: 320, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !309, file: !6, line: 43, baseType: !145, size: 32, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !309, file: !6, line: 45, baseType: !59, size: 32, offset: 736)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !309, file: !6, line: 47, baseType: !59, size: 32, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !309, file: !6, line: 49, baseType: !342, size: 32, offset: 800)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !343, line: 16, baseType: !270)
!343 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !309, file: !6, line: 51, baseType: !307, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !309, file: !6, line: 52, baseType: !224, size: 32, offset: 864)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !309, file: !6, line: 54, baseType: !27, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !309, file: !6, line: 56, baseType: !20, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !309, file: !6, line: 57, baseType: !20, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !309, file: !6, line: 58, baseType: !20, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !309, file: !6, line: 60, baseType: !20, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !309, file: !6, line: 61, baseType: !20, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !309, file: !6, line: 62, baseType: !20, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !309, file: !6, line: 63, baseType: !20, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !309, file: !6, line: 64, baseType: !20, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !309, file: !6, line: 65, baseType: !20, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !309, file: !6, line: 66, baseType: !20, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !309, file: !6, line: 67, baseType: !20, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !309, file: !6, line: 70, baseType: !20, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !309, file: !6, line: 72, baseType: !20, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !309, file: !6, line: 73, baseType: !20, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !309, file: !6, line: 74, baseType: !20, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !309, file: !6, line: 76, baseType: !20, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !309, file: !6, line: 77, baseType: !20, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !309, file: !6, line: 78, baseType: !20, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !226, file: !6, line: 135, baseType: !75, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !226, file: !6, line: 137, baseType: !145, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !226, file: !6, line: 139, baseType: !41, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !6, line: 141, baseType: !17, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !226, file: !6, line: 143, baseType: !313, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !226, file: !6, line: 144, baseType: !18, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !226, file: !6, line: 145, baseType: !91, size: 64, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !226, file: !6, line: 147, baseType: !91, size: 64, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !226, file: !6, line: 148, baseType: !374, size: 16, offset: 608)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !375, line: 12, baseType: !376)
!375 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 186, baseType: !319)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !226, file: !6, line: 154, baseType: !313, size: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !226, file: !6, line: 155, baseType: !18, size: 32, offset: 672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !226, file: !6, line: 157, baseType: !68, size: 32, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !226, file: !6, line: 159, baseType: !278, size: 64, offset: 736)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !226, file: !6, line: 161, baseType: !165, size: 32, offset: 800)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !226, file: !6, line: 163, baseType: !27, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !226, file: !6, line: 165, baseType: !20, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !226, file: !6, line: 167, baseType: !20, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !226, file: !6, line: 169, baseType: !20, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !226, file: !6, line: 170, baseType: !20, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !226, file: !6, line: 171, baseType: !20, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !226, file: !6, line: 173, baseType: !20, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !226, file: !6, line: 174, baseType: !20, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !226, file: !6, line: 175, baseType: !20, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !226, file: !6, line: 176, baseType: !20, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !226, file: !6, line: 178, baseType: !20, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !226, file: !6, line: 179, baseType: !20, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !226, file: !6, line: 180, baseType: !20, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !226, file: !6, line: 181, baseType: !20, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !226, file: !6, line: 183, baseType: !20, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !33, file: !34, line: 48, baseType: !224, size: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !33, file: !34, line: 49, baseType: !27, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !33, file: !34, line: 51, baseType: !400, size: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !32, line: 15, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !404, line: 222, size: 800, elements: !405)
!404 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !463, !464, !470, !474, !475, !476, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !403, file: !404, line: 223, baseType: !27, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !403, file: !404, line: 224, baseType: !27, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !404, line: 226, baseType: !23, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !403, file: !404, line: 228, baseType: !27, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !403, file: !404, line: 229, baseType: !27, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !403, file: !404, line: 231, baseType: !27, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !403, file: !404, line: 232, baseType: !25, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !403, file: !404, line: 234, baseType: !14, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !403, file: !404, line: 235, baseType: !415, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !32, line: 22, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !155, line: 77, size: 224, elements: !418)
!418 = !{!419, !420, !421, !460, !461, !462}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !417, file: !155, line: 78, baseType: !91, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !155, line: 79, baseType: !27, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !417, file: !155, line: 80, baseType: !422, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DISubroutineType(types: !424)
!424 = !{!23, !425, !415, !14}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !32, line: 16, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !155, line: 116, size: 384, elements: !428)
!428 = !{!429, !430, !441, !442, !443, !444, !453, !454, !455, !456, !457, !459}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !155, line: 117, baseType: !23, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !427, file: !155, line: 118, baseType: !431, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !433, line: 22, baseType: !434)
!433 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !433, line: 16, size: 160, elements: !435)
!435 = !{!436, !437, !438, !439, !440}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !434, file: !433, line: 17, baseType: !14, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !434, file: !433, line: 18, baseType: !27, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !434, file: !433, line: 19, baseType: !59, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !434, file: !433, line: 20, baseType: !27, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !434, file: !433, line: 21, baseType: !41, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !427, file: !155, line: 120, baseType: !30, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !427, file: !155, line: 121, baseType: !41, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !427, file: !155, line: 122, baseType: !41, size: 32, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !427, file: !155, line: 123, baseType: !445, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !155, line: 103, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 98, size: 1344, elements: !448)
!448 = !{!449, !450, !451, !452}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !447, file: !155, line: 99, baseType: !83, size: 1216)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !447, file: !155, line: 100, baseType: !68, size: 32, offset: 1216)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !447, file: !155, line: 101, baseType: !68, size: 32, offset: 1248)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !447, file: !155, line: 102, baseType: !27, size: 32, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !427, file: !155, line: 124, baseType: !145, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !427, file: !155, line: 126, baseType: !14, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !427, file: !155, line: 127, baseType: !27, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !427, file: !155, line: 128, baseType: !27, size: 32, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !427, file: !155, line: 130, baseType: !458, size: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !155, line: 112, baseType: !422)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !427, file: !155, line: 131, baseType: !23, size: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !417, file: !155, line: 81, baseType: !27, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !417, file: !155, line: 82, baseType: !27, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !417, file: !155, line: 83, baseType: !14, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !404, line: 236, baseType: !27, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !403, file: !404, line: 238, baseType: !465, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !145}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !19, line: 140, baseType: !17)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !403, file: !404, line: 240, baseType: !471, size: 32, offset: 352)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!468, !30}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !403, file: !404, line: 242, baseType: !471, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !403, file: !404, line: 243, baseType: !471, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !403, file: !404, line: 244, baseType: !477, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !30}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !403, file: !404, line: 245, baseType: !477, size: 32, offset: 480)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !403, file: !404, line: 247, baseType: !477, size: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !403, file: !404, line: 249, baseType: !29, size: 32, offset: 544)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !403, file: !404, line: 250, baseType: !29, size: 32, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !403, file: !404, line: 251, baseType: !29, size: 32, offset: 608)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !403, file: !404, line: 252, baseType: !29, size: 32, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !403, file: !404, line: 253, baseType: !29, size: 32, offset: 672)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !403, file: !404, line: 254, baseType: !29, size: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !403, file: !404, line: 255, baseType: !29, size: 32, offset: 736)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !403, file: !404, line: 256, baseType: !29, size: 32, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !33, file: !34, line: 52, baseType: !27, size: 32, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !33, file: !34, line: 53, baseType: !27, size: 32, offset: 608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !33, file: !34, line: 55, baseType: !278, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !33, file: !34, line: 56, baseType: !27, size: 32, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !33, file: !34, line: 58, baseType: !432, size: 160, offset: 736)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !33, file: !34, line: 59, baseType: !432, size: 160, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !33, file: !34, line: 61, baseType: !432, size: 160, offset: 1056)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !33, file: !34, line: 62, baseType: !498, size: 96, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !266, line: 32, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !266, line: 37, size: 96, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !499, file: !266, line: 38, baseType: !272, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !499, file: !266, line: 39, baseType: !272, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !499, file: !266, line: 40, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !266, line: 34, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !272, !272, !272}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !33, file: !34, line: 63, baseType: !265, size: 160, offset: 1312)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !33, file: !34, line: 65, baseType: !510, size: 224, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !511, line: 31, baseType: !512)
!511 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 25, size: 224, elements: !513)
!513 = !{!514, !522, !523, !524, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !512, file: !511, line: 26, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !511, line: 16, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !511, line: 18, size: 96, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !517, file: !511, line: 19, baseType: !14, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !517, file: !511, line: 20, baseType: !27, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !511, line: 21, baseType: !515, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !512, file: !511, line: 27, baseType: !516, size: 96, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !511, line: 28, baseType: !59, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !512, file: !511, line: 29, baseType: !27, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !512, file: !511, line: 30, baseType: !41, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !33, file: !34, line: 66, baseType: !510, size: 224, offset: 1696)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !33, file: !34, line: 68, baseType: !27, size: 32, offset: 1920)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !33, file: !34, line: 69, baseType: !27, size: 32, offset: 1952)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !33, file: !34, line: 71, baseType: !224, size: 32, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !33, file: !34, line: 72, baseType: !230, size: 32, offset: 2016)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !33, file: !34, line: 73, baseType: !230, size: 32, offset: 2048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !33, file: !34, line: 75, baseType: !30, size: 32, offset: 2080)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !33, file: !34, line: 77, baseType: !91, size: 64, offset: 2112)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !33, file: !34, line: 78, baseType: !91, size: 64, offset: 2176)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !33, file: !34, line: 79, baseType: !91, size: 64, offset: 2240)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !33, file: !34, line: 80, baseType: !91, size: 64, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !33, file: !34, line: 81, baseType: !91, size: 64, offset: 2368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !33, file: !34, line: 82, baseType: !91, size: 64, offset: 2432)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !375, line: 34, size: 224, elements: !541)
!541 = !{!542, !543, !544, !546, !565}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !540, file: !375, line: 35, baseType: !318, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !540, file: !375, line: 36, baseType: !374, size: 16, offset: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !540, file: !375, line: 37, baseType: !545, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 191, baseType: !20)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !540, file: !375, line: 38, baseType: !547, size: 128, offset: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !375, line: 23, size: 128, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !547, file: !375, line: 28, baseType: !550, size: 128)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !547, file: !375, line: 24, size: 128, elements: !551)
!551 = !{!552, !557, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !550, file: !375, line: 25, baseType: !553, size: 128)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 128, elements: !555)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 181, baseType: !54)
!555 = !{!556}
!556 = !DISubrange(count: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !550, file: !375, line: 26, baseType: !558, size: 128)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 128, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !550, file: !375, line: 27, baseType: !562, size: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 128, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 4)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !540, file: !375, line: 39, baseType: !545, size: 32, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !375, line: 16, size: 128, elements: !568)
!568 = !{!569, !570, !571, !576}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !567, file: !375, line: 17, baseType: !318, size: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !567, file: !375, line: 18, baseType: !374, size: 16, offset: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !567, file: !375, line: 19, baseType: !572, size: 32, offset: 32)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !375, line: 14, size: 32, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !572, file: !375, line: 14, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !375, line: 13, baseType: !545)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !567, file: !375, line: 20, baseType: !577, size: 64, offset: 64)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 64, elements: !559)
!578 = !{!0}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_os_io_t", file: !289, line: 35, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 26, size: 256, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !580, file: !289, line: 27, baseType: !288, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !580, file: !289, line: 28, baseType: !297, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "udp_recv", scope: !580, file: !289, line: 29, baseType: !288, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !580, file: !289, line: 30, baseType: !295, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "udp_send", scope: !580, file: !289, line: 31, baseType: !295, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "udp_send_chain", scope: !580, file: !289, line: 32, baseType: !302, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !580, file: !289, line: 33, baseType: !302, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !289, line: 34, baseType: !27, size: 32, offset: 224)
!590 = !{i32 2, !"Dwarf Version", i32 4}
!591 = !{i32 2, !"Debug Info Version", i32 3}
!592 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!593 = distinct !DISubprogram(name: "ngx_create_listening", scope: !3, file: !3, line: 20, type: !594, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!307, !425, !313, !18}
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DILocalVariable(name: "cf", arg: 1, scope: !593, file: !3, line: 20, type: !425)
!598 = !DILocalVariable(name: "sockaddr", arg: 2, scope: !593, file: !3, line: 20, type: !313)
!599 = !DILocalVariable(name: "socklen", arg: 3, scope: !593, file: !3, line: 21, type: !18)
!600 = !DILocalVariable(name: "len", scope: !593, file: !3, line: 23, type: !59)
!601 = !DILocalVariable(name: "ls", scope: !593, file: !3, line: 24, type: !307)
!602 = !DILocalVariable(name: "sa", scope: !593, file: !3, line: 25, type: !313)
!603 = !DILocalVariable(name: "text", scope: !593, file: !3, line: 26, type: !604)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 904, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 113)
!607 = !{!608, !608, i64 0}
!608 = !{!"any pointer", !609, i64 0}
!609 = !{!"omnipotent char", !610, i64 0}
!610 = !{!"Simple C/C++ TBAA"}
!611 = !DIExpression()
!612 = !DILocation(line: 20, column: 34, scope: !593)
!613 = !DILocation(line: 20, column: 55, scope: !593)
!614 = !{!615, !615, i64 0}
!615 = !{!"int", !609, i64 0}
!616 = !DILocation(line: 21, column: 15, scope: !593)
!617 = !DILocation(line: 23, column: 5, scope: !593)
!618 = !DILocation(line: 23, column: 23, scope: !593)
!619 = !DILocation(line: 24, column: 5, scope: !593)
!620 = !DILocation(line: 24, column: 23, scope: !593)
!621 = !DILocation(line: 25, column: 5, scope: !593)
!622 = !DILocation(line: 25, column: 23, scope: !593)
!623 = !DILocation(line: 26, column: 5, scope: !593)
!624 = !DILocation(line: 26, column: 23, scope: !593)
!625 = !DILocation(line: 28, column: 26, scope: !593)
!626 = !DILocation(line: 28, column: 30, scope: !593)
!627 = !{!628, !608, i64 8}
!628 = !{!"ngx_conf_s", !608, i64 0, !608, i64 4, !608, i64 8, !608, i64 12, !608, i64 16, !608, i64 20, !608, i64 24, !608, i64 28, !615, i64 32, !615, i64 36, !608, i64 40, !608, i64 44}
!629 = !DILocation(line: 28, column: 37, scope: !593)
!630 = !DILocation(line: 28, column: 10, scope: !593)
!631 = !DILocation(line: 28, column: 8, scope: !593)
!632 = !DILocation(line: 29, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !593, file: !3, line: 29, column: 9)
!634 = !DILocation(line: 29, column: 12, scope: !633)
!635 = !DILocation(line: 29, column: 9, scope: !593)
!636 = !DILocation(line: 30, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !3, line: 29, column: 21)
!638 = !DILocation(line: 33, column: 5, scope: !593)
!639 = !DILocation(line: 35, column: 21, scope: !593)
!640 = !DILocation(line: 35, column: 25, scope: !593)
!641 = !{!628, !608, i64 12}
!642 = !DILocation(line: 35, column: 31, scope: !593)
!643 = !DILocation(line: 35, column: 10, scope: !593)
!644 = !DILocation(line: 35, column: 8, scope: !593)
!645 = !DILocation(line: 36, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !593, file: !3, line: 36, column: 9)
!647 = !DILocation(line: 36, column: 12, scope: !646)
!648 = !DILocation(line: 36, column: 9, scope: !593)
!649 = !DILocation(line: 37, column: 9, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !3, line: 36, column: 21)
!651 = !DILocation(line: 40, column: 5, scope: !593)
!652 = !DILocation(line: 42, column: 20, scope: !593)
!653 = !DILocation(line: 42, column: 5, scope: !593)
!654 = !DILocation(line: 42, column: 9, scope: !593)
!655 = !DILocation(line: 42, column: 18, scope: !593)
!656 = !{!657, !608, i64 4}
!657 = !{!"ngx_listening_s", !615, i64 0, !608, i64 4, !615, i64 8, !615, i64 12, !658, i64 16, !615, i64 24, !615, i64 28, !615, i64 32, !615, i64 36, !608, i64 40, !608, i64 44, !659, i64 48, !608, i64 88, !615, i64 92, !615, i64 96, !615, i64 100, !608, i64 104, !608, i64 108, !615, i64 112, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 116, !615, i64 117, !615, i64 117, !615, i64 117, !615, i64 117, !615, i64 117, !615, i64 117, !615, i64 117, !615, i64 118, !615, i64 118, !615, i64 118}
!658 = !{!"", !615, i64 0, !608, i64 4}
!659 = !{!"ngx_log_s", !615, i64 0, !608, i64 4, !660, i64 8, !660, i64 12, !608, i64 16, !608, i64 20, !608, i64 24, !608, i64 28, !608, i64 32, !608, i64 36}
!660 = !{!"long", !609, i64 0}
!661 = !DILocation(line: 43, column: 19, scope: !593)
!662 = !DILocation(line: 43, column: 5, scope: !593)
!663 = !DILocation(line: 43, column: 9, scope: !593)
!664 = !DILocation(line: 43, column: 17, scope: !593)
!665 = !{!657, !615, i64 8}
!666 = !DILocation(line: 45, column: 25, scope: !593)
!667 = !DILocation(line: 45, column: 29, scope: !593)
!668 = !DILocation(line: 45, column: 38, scope: !593)
!669 = !DILocation(line: 45, column: 11, scope: !593)
!670 = !DILocation(line: 45, column: 9, scope: !593)
!671 = !DILocation(line: 46, column: 25, scope: !593)
!672 = !DILocation(line: 46, column: 5, scope: !593)
!673 = !DILocation(line: 46, column: 9, scope: !593)
!674 = !DILocation(line: 46, column: 19, scope: !593)
!675 = !DILocation(line: 46, column: 23, scope: !593)
!676 = !{!657, !615, i64 16}
!677 = !DILocation(line: 48, column: 13, scope: !593)
!678 = !DILocation(line: 48, column: 17, scope: !593)
!679 = !DILocation(line: 48, column: 27, scope: !593)
!680 = !{!681, !682, i64 0}
!681 = !{!"sockaddr", !682, i64 0, !609, i64 2}
!682 = !{!"short", !609, i64 0}
!683 = !DILocation(line: 48, column: 5, scope: !593)
!684 = !DILocation(line: 51, column: 9, scope: !685)
!685 = distinct !DILexicalBlock(scope: !593, file: !3, line: 48, column: 38)
!686 = !DILocation(line: 51, column: 13, scope: !685)
!687 = !DILocation(line: 51, column: 31, scope: !685)
!688 = !{!657, !615, i64 12}
!689 = !DILocation(line: 52, column: 9, scope: !685)
!690 = !DILocation(line: 56, column: 9, scope: !685)
!691 = !DILocation(line: 56, column: 13, scope: !685)
!692 = !DILocation(line: 56, column: 31, scope: !685)
!693 = !DILocation(line: 57, column: 12, scope: !685)
!694 = !DILocation(line: 58, column: 9, scope: !685)
!695 = !DILocation(line: 61, column: 9, scope: !685)
!696 = !DILocation(line: 61, column: 13, scope: !685)
!697 = !DILocation(line: 61, column: 31, scope: !685)
!698 = !DILocation(line: 62, column: 9, scope: !685)
!699 = !DILocation(line: 64, column: 9, scope: !685)
!700 = !DILocation(line: 64, column: 13, scope: !685)
!701 = !DILocation(line: 64, column: 31, scope: !685)
!702 = !DILocation(line: 65, column: 9, scope: !685)
!703 = !DILocation(line: 68, column: 38, scope: !593)
!704 = !DILocation(line: 68, column: 42, scope: !593)
!705 = !DILocation(line: 68, column: 48, scope: !593)
!706 = !DILocation(line: 68, column: 26, scope: !593)
!707 = !DILocation(line: 68, column: 5, scope: !593)
!708 = !DILocation(line: 68, column: 9, scope: !593)
!709 = !DILocation(line: 68, column: 19, scope: !593)
!710 = !DILocation(line: 68, column: 24, scope: !593)
!711 = !{!657, !608, i64 20}
!712 = !DILocation(line: 69, column: 9, scope: !713)
!713 = distinct !DILexicalBlock(scope: !593, file: !3, line: 69, column: 9)
!714 = !DILocation(line: 69, column: 13, scope: !713)
!715 = !DILocation(line: 69, column: 23, scope: !713)
!716 = !DILocation(line: 69, column: 28, scope: !713)
!717 = !DILocation(line: 69, column: 9, scope: !593)
!718 = !DILocation(line: 70, column: 9, scope: !719)
!719 = distinct !DILexicalBlock(scope: !713, file: !3, line: 69, column: 37)
!720 = !DILocation(line: 73, column: 5, scope: !593)
!721 = !DILocation(line: 75, column: 5, scope: !593)
!722 = !DILocation(line: 75, column: 9, scope: !593)
!723 = !DILocation(line: 75, column: 12, scope: !593)
!724 = !{!657, !615, i64 0}
!725 = !DILocation(line: 76, column: 5, scope: !593)
!726 = !DILocation(line: 76, column: 9, scope: !593)
!727 = !DILocation(line: 76, column: 14, scope: !593)
!728 = !{!657, !615, i64 24}
!729 = !DILocation(line: 78, column: 5, scope: !593)
!730 = !DILocation(line: 78, column: 9, scope: !593)
!731 = !DILocation(line: 78, column: 17, scope: !593)
!732 = !{!657, !615, i64 28}
!733 = !DILocation(line: 79, column: 5, scope: !593)
!734 = !DILocation(line: 79, column: 9, scope: !593)
!735 = !DILocation(line: 79, column: 16, scope: !593)
!736 = !{!657, !615, i64 32}
!737 = !DILocation(line: 80, column: 5, scope: !593)
!738 = !DILocation(line: 80, column: 9, scope: !593)
!739 = !DILocation(line: 80, column: 16, scope: !593)
!740 = !{!657, !615, i64 36}
!741 = !DILocation(line: 90, column: 12, scope: !593)
!742 = !DILocation(line: 90, column: 5, scope: !593)
!743 = !DILocation(line: 91, column: 1, scope: !593)
!744 = distinct !DISubprogram(name: "ngx_clone_listening", scope: !3, file: !3, line: 95, type: !745, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !747)
!745 = !DISubroutineType(types: !746)
!746 = !{!468, !425, !307}
!747 = !{!748, !749}
!748 = !DILocalVariable(name: "cf", arg: 1, scope: !744, file: !3, line: 95, type: !425)
!749 = !DILocalVariable(name: "ls", arg: 2, scope: !744, file: !3, line: 95, type: !307)
!750 = !DILocation(line: 95, column: 33, scope: !744)
!751 = !DILocation(line: 95, column: 54, scope: !744)
!752 = !DILocation(line: 127, column: 5, scope: !744)
!753 = distinct !DISubprogram(name: "ngx_set_inherited_sockets", scope: !3, file: !3, line: 132, type: !472, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !754)
!754 = !{!755, !756, !757, !758, !759}
!755 = !DILocalVariable(name: "cycle", arg: 1, scope: !753, file: !3, line: 132, type: !30)
!756 = !DILocalVariable(name: "len", scope: !753, file: !3, line: 134, type: !59)
!757 = !DILocalVariable(name: "i", scope: !753, file: !3, line: 135, type: !27)
!758 = !DILocalVariable(name: "ls", scope: !753, file: !3, line: 136, type: !307)
!759 = !DILocalVariable(name: "olen", scope: !753, file: !3, line: 137, type: !18)
!760 = !DILocation(line: 132, column: 40, scope: !753)
!761 = !DILocation(line: 134, column: 5, scope: !753)
!762 = !DILocation(line: 134, column: 32, scope: !753)
!763 = !DILocation(line: 135, column: 5, scope: !753)
!764 = !DILocation(line: 135, column: 32, scope: !753)
!765 = !DILocation(line: 136, column: 5, scope: !753)
!766 = !DILocation(line: 136, column: 32, scope: !753)
!767 = !DILocation(line: 137, column: 5, scope: !753)
!768 = !DILocation(line: 137, column: 32, scope: !753)
!769 = !DILocation(line: 151, column: 10, scope: !753)
!770 = !DILocation(line: 151, column: 17, scope: !753)
!771 = !DILocation(line: 151, column: 27, scope: !753)
!772 = !{!773, !608, i64 92}
!773 = !{!"ngx_cycle_s", !608, i64 0, !608, i64 4, !608, i64 8, !659, i64 12, !615, i64 52, !608, i64 56, !608, i64 60, !615, i64 64, !608, i64 68, !615, i64 72, !615, i64 76, !774, i64 80, !615, i64 88, !775, i64 92, !775, i64 112, !775, i64 132, !776, i64 152, !777, i64 164, !778, i64 184, !778, i64 212, !615, i64 240, !615, i64 244, !608, i64 248, !608, i64 252, !608, i64 256, !608, i64 260, !658, i64 264, !658, i64 272, !658, i64 280, !658, i64 288, !658, i64 296, !658, i64 304}
!774 = !{!"ngx_queue_s", !608, i64 0, !608, i64 4}
!775 = !{!"", !608, i64 0, !615, i64 4, !615, i64 8, !615, i64 12, !608, i64 16}
!776 = !{!"ngx_rbtree_s", !608, i64 0, !608, i64 4, !608, i64 8}
!777 = !{!"ngx_rbtree_node_s", !615, i64 0, !608, i64 4, !608, i64 8, !608, i64 12, !609, i64 16, !609, i64 17}
!778 = !{!"", !608, i64 0, !779, i64 4, !615, i64 16, !615, i64 20, !608, i64 24}
!779 = !{!"ngx_list_part_s", !608, i64 0, !615, i64 4, !608, i64 8}
!780 = !DILocation(line: 151, column: 8, scope: !753)
!781 = !DILocation(line: 152, column: 12, scope: !782)
!782 = distinct !DILexicalBlock(scope: !753, file: !3, line: 152, column: 5)
!783 = !DILocation(line: 152, column: 10, scope: !782)
!784 = !DILocation(line: 152, column: 17, scope: !785)
!785 = distinct !DILexicalBlock(scope: !782, file: !3, line: 152, column: 5)
!786 = !DILocation(line: 152, column: 21, scope: !785)
!787 = !DILocation(line: 152, column: 28, scope: !785)
!788 = !DILocation(line: 152, column: 38, scope: !785)
!789 = !{!773, !615, i64 96}
!790 = !DILocation(line: 152, column: 19, scope: !785)
!791 = !DILocation(line: 152, column: 5, scope: !782)
!792 = !DILocation(line: 154, column: 37, scope: !793)
!793 = distinct !DILexicalBlock(scope: !785, file: !3, line: 152, column: 50)
!794 = !DILocation(line: 154, column: 44, scope: !793)
!795 = !{!773, !608, i64 4}
!796 = !DILocation(line: 154, column: 26, scope: !793)
!797 = !DILocation(line: 154, column: 9, scope: !793)
!798 = !DILocation(line: 154, column: 12, scope: !793)
!799 = !DILocation(line: 154, column: 15, scope: !793)
!800 = !DILocation(line: 154, column: 24, scope: !793)
!801 = !DILocation(line: 155, column: 13, scope: !802)
!802 = distinct !DILexicalBlock(scope: !793, file: !3, line: 155, column: 13)
!803 = !DILocation(line: 155, column: 16, scope: !802)
!804 = !DILocation(line: 155, column: 19, scope: !802)
!805 = !DILocation(line: 155, column: 28, scope: !802)
!806 = !DILocation(line: 155, column: 13, scope: !793)
!807 = !DILocation(line: 156, column: 13, scope: !808)
!808 = distinct !DILexicalBlock(scope: !802, file: !3, line: 155, column: 37)
!809 = !DILocation(line: 159, column: 9, scope: !793)
!810 = !DILocation(line: 159, column: 12, scope: !793)
!811 = !DILocation(line: 159, column: 15, scope: !793)
!812 = !DILocation(line: 159, column: 23, scope: !793)
!813 = !DILocation(line: 160, column: 25, scope: !814)
!814 = distinct !DILexicalBlock(scope: !793, file: !3, line: 160, column: 13)
!815 = !DILocation(line: 160, column: 28, scope: !814)
!816 = !DILocation(line: 160, column: 31, scope: !814)
!817 = !DILocation(line: 160, column: 35, scope: !814)
!818 = !DILocation(line: 160, column: 38, scope: !814)
!819 = !DILocation(line: 160, column: 41, scope: !814)
!820 = !DILocation(line: 160, column: 52, scope: !814)
!821 = !DILocation(line: 160, column: 55, scope: !814)
!822 = !DILocation(line: 160, column: 58, scope: !814)
!823 = !DILocation(line: 160, column: 13, scope: !814)
!824 = !DILocation(line: 160, column: 67, scope: !814)
!825 = !DILocation(line: 160, column: 13, scope: !793)
!826 = !DILocation(line: 161, column: 13, scope: !827)
!827 = distinct !DILexicalBlock(scope: !828, file: !3, line: 161, column: 13)
!828 = distinct !DILexicalBlock(scope: !814, file: !3, line: 160, column: 74)
!829 = !{!773, !608, i64 8}
!830 = !{!659, !615, i64 0}
!831 = !DILocation(line: 161, column: 13, scope: !828)
!832 = !DILocation(line: 164, column: 13, scope: !828)
!833 = !DILocation(line: 164, column: 16, scope: !828)
!834 = !DILocation(line: 164, column: 19, scope: !828)
!835 = !DILocation(line: 164, column: 26, scope: !828)
!836 = !DILocation(line: 165, column: 13, scope: !828)
!837 = !DILocation(line: 168, column: 13, scope: !838)
!838 = distinct !DILexicalBlock(scope: !793, file: !3, line: 168, column: 13)
!839 = !DILocation(line: 168, column: 16, scope: !838)
!840 = !DILocation(line: 168, column: 19, scope: !838)
!841 = !DILocation(line: 168, column: 27, scope: !838)
!842 = !DILocation(line: 168, column: 13, scope: !793)
!843 = !DILocation(line: 169, column: 13, scope: !844)
!844 = distinct !DILexicalBlock(scope: !838, file: !3, line: 168, column: 65)
!845 = !DILocation(line: 169, column: 16, scope: !844)
!846 = !DILocation(line: 169, column: 19, scope: !844)
!847 = !DILocation(line: 169, column: 27, scope: !844)
!848 = !DILocation(line: 170, column: 9, scope: !844)
!849 = !DILocation(line: 172, column: 17, scope: !793)
!850 = !DILocation(line: 172, column: 20, scope: !793)
!851 = !DILocation(line: 172, column: 23, scope: !793)
!852 = !DILocation(line: 172, column: 33, scope: !793)
!853 = !DILocation(line: 172, column: 9, scope: !793)
!854 = !DILocation(line: 176, column: 13, scope: !855)
!855 = distinct !DILexicalBlock(scope: !793, file: !3, line: 172, column: 44)
!856 = !DILocation(line: 176, column: 16, scope: !855)
!857 = !DILocation(line: 176, column: 19, scope: !855)
!858 = !DILocation(line: 176, column: 37, scope: !855)
!859 = !DILocation(line: 177, column: 17, scope: !855)
!860 = !DILocation(line: 178, column: 13, scope: !855)
!861 = !DILocation(line: 183, column: 13, scope: !855)
!862 = !DILocation(line: 183, column: 16, scope: !855)
!863 = !DILocation(line: 183, column: 19, scope: !855)
!864 = !DILocation(line: 183, column: 37, scope: !855)
!865 = !DILocation(line: 184, column: 17, scope: !855)
!866 = !DILocation(line: 185, column: 13, scope: !855)
!867 = !DILocation(line: 189, column: 13, scope: !855)
!868 = !DILocation(line: 189, column: 16, scope: !855)
!869 = !DILocation(line: 189, column: 19, scope: !855)
!870 = !DILocation(line: 189, column: 37, scope: !855)
!871 = !DILocation(line: 190, column: 17, scope: !855)
!872 = !DILocation(line: 191, column: 13, scope: !855)
!873 = !DILocation(line: 194, column: 13, scope: !874)
!874 = distinct !DILexicalBlock(scope: !855, file: !3, line: 194, column: 13)
!875 = !DILocation(line: 194, column: 13, scope: !855)
!876 = !DILocation(line: 197, column: 13, scope: !855)
!877 = !DILocation(line: 197, column: 16, scope: !855)
!878 = !DILocation(line: 197, column: 19, scope: !855)
!879 = !DILocation(line: 197, column: 26, scope: !855)
!880 = !DILocation(line: 198, column: 13, scope: !855)
!881 = !DILocation(line: 201, column: 44, scope: !793)
!882 = !DILocation(line: 201, column: 51, scope: !793)
!883 = !DILocation(line: 201, column: 57, scope: !793)
!884 = !DILocation(line: 201, column: 32, scope: !793)
!885 = !DILocation(line: 201, column: 9, scope: !793)
!886 = !DILocation(line: 201, column: 12, scope: !793)
!887 = !DILocation(line: 201, column: 15, scope: !793)
!888 = !DILocation(line: 201, column: 25, scope: !793)
!889 = !DILocation(line: 201, column: 30, scope: !793)
!890 = !DILocation(line: 202, column: 13, scope: !891)
!891 = distinct !DILexicalBlock(scope: !793, file: !3, line: 202, column: 13)
!892 = !DILocation(line: 202, column: 16, scope: !891)
!893 = !DILocation(line: 202, column: 19, scope: !891)
!894 = !DILocation(line: 202, column: 29, scope: !891)
!895 = !DILocation(line: 202, column: 34, scope: !891)
!896 = !DILocation(line: 202, column: 13, scope: !793)
!897 = !DILocation(line: 203, column: 13, scope: !898)
!898 = distinct !DILexicalBlock(scope: !891, file: !3, line: 202, column: 43)
!899 = !DILocation(line: 206, column: 29, scope: !793)
!900 = !DILocation(line: 206, column: 32, scope: !793)
!901 = !DILocation(line: 206, column: 35, scope: !793)
!902 = !DILocation(line: 206, column: 45, scope: !793)
!903 = !DILocation(line: 206, column: 48, scope: !793)
!904 = !DILocation(line: 206, column: 51, scope: !793)
!905 = !DILocation(line: 207, column: 29, scope: !793)
!906 = !DILocation(line: 207, column: 32, scope: !793)
!907 = !DILocation(line: 207, column: 35, scope: !793)
!908 = !DILocation(line: 207, column: 45, scope: !793)
!909 = !DILocation(line: 207, column: 51, scope: !793)
!910 = !DILocation(line: 206, column: 15, scope: !793)
!911 = !DILocation(line: 206, column: 13, scope: !793)
!912 = !DILocation(line: 208, column: 13, scope: !913)
!913 = distinct !DILexicalBlock(scope: !793, file: !3, line: 208, column: 13)
!914 = !DILocation(line: 208, column: 17, scope: !913)
!915 = !DILocation(line: 208, column: 13, scope: !793)
!916 = !DILocation(line: 209, column: 13, scope: !917)
!917 = distinct !DILexicalBlock(scope: !913, file: !3, line: 208, column: 23)
!918 = !DILocation(line: 212, column: 31, scope: !793)
!919 = !DILocation(line: 212, column: 9, scope: !793)
!920 = !DILocation(line: 212, column: 12, scope: !793)
!921 = !DILocation(line: 212, column: 15, scope: !793)
!922 = !DILocation(line: 212, column: 25, scope: !793)
!923 = !DILocation(line: 212, column: 29, scope: !793)
!924 = !DILocation(line: 214, column: 9, scope: !793)
!925 = !DILocation(line: 214, column: 12, scope: !793)
!926 = !DILocation(line: 214, column: 15, scope: !793)
!927 = !DILocation(line: 214, column: 23, scope: !793)
!928 = !DILocation(line: 216, column: 14, scope: !793)
!929 = !DILocation(line: 218, column: 24, scope: !930)
!930 = distinct !DILexicalBlock(scope: !793, file: !3, line: 218, column: 13)
!931 = !DILocation(line: 218, column: 27, scope: !930)
!932 = !DILocation(line: 218, column: 30, scope: !930)
!933 = !DILocation(line: 218, column: 65, scope: !930)
!934 = !DILocation(line: 218, column: 68, scope: !930)
!935 = !DILocation(line: 218, column: 71, scope: !930)
!936 = !DILocation(line: 218, column: 55, scope: !930)
!937 = !DILocation(line: 218, column: 13, scope: !930)
!938 = !DILocation(line: 220, column: 13, scope: !930)
!939 = !DILocation(line: 218, column: 13, scope: !793)
!940 = !DILocation(line: 222, column: 13, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 222, column: 13)
!942 = distinct !DILexicalBlock(scope: !930, file: !3, line: 221, column: 9)
!943 = !DILocation(line: 222, column: 13, scope: !942)
!944 = !DILocation(line: 224, column: 13, scope: !942)
!945 = !DILocation(line: 224, column: 16, scope: !942)
!946 = !DILocation(line: 224, column: 19, scope: !942)
!947 = !DILocation(line: 224, column: 26, scope: !942)
!948 = !DILocation(line: 225, column: 13, scope: !942)
!949 = !DILocation(line: 228, column: 14, scope: !793)
!950 = !DILocation(line: 230, column: 24, scope: !951)
!951 = distinct !DILexicalBlock(scope: !793, file: !3, line: 230, column: 13)
!952 = !DILocation(line: 230, column: 27, scope: !951)
!953 = !DILocation(line: 230, column: 30, scope: !951)
!954 = !DILocation(line: 230, column: 67, scope: !951)
!955 = !DILocation(line: 230, column: 70, scope: !951)
!956 = !DILocation(line: 230, column: 73, scope: !951)
!957 = !DILocation(line: 230, column: 57, scope: !951)
!958 = !DILocation(line: 230, column: 13, scope: !951)
!959 = !DILocation(line: 232, column: 13, scope: !951)
!960 = !DILocation(line: 230, column: 13, scope: !793)
!961 = !DILocation(line: 234, column: 13, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 234, column: 13)
!963 = distinct !DILexicalBlock(scope: !951, file: !3, line: 233, column: 9)
!964 = !DILocation(line: 234, column: 13, scope: !963)
!965 = !DILocation(line: 238, column: 13, scope: !963)
!966 = !DILocation(line: 238, column: 16, scope: !963)
!967 = !DILocation(line: 238, column: 19, scope: !963)
!968 = !DILocation(line: 238, column: 26, scope: !963)
!969 = !DILocation(line: 239, column: 9, scope: !963)
!970 = !DILocation(line: 241, column: 14, scope: !793)
!971 = !DILocation(line: 243, column: 24, scope: !972)
!972 = distinct !DILexicalBlock(scope: !793, file: !3, line: 243, column: 13)
!973 = !DILocation(line: 243, column: 27, scope: !972)
!974 = !DILocation(line: 243, column: 30, scope: !972)
!975 = !DILocation(line: 243, column: 67, scope: !972)
!976 = !DILocation(line: 243, column: 70, scope: !972)
!977 = !DILocation(line: 243, column: 73, scope: !972)
!978 = !DILocation(line: 243, column: 57, scope: !972)
!979 = !DILocation(line: 243, column: 13, scope: !972)
!980 = !DILocation(line: 245, column: 13, scope: !972)
!981 = !DILocation(line: 243, column: 13, scope: !793)
!982 = !DILocation(line: 247, column: 13, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 247, column: 13)
!984 = distinct !DILexicalBlock(scope: !972, file: !3, line: 246, column: 9)
!985 = !DILocation(line: 247, column: 13, scope: !984)
!986 = !DILocation(line: 251, column: 13, scope: !984)
!987 = !DILocation(line: 251, column: 16, scope: !984)
!988 = !DILocation(line: 251, column: 19, scope: !984)
!989 = !DILocation(line: 251, column: 26, scope: !984)
!990 = !DILocation(line: 252, column: 9, scope: !984)
!991 = !DILocation(line: 294, column: 13, scope: !992)
!992 = distinct !DILexicalBlock(scope: !793, file: !3, line: 294, column: 13)
!993 = !DILocation(line: 294, column: 16, scope: !992)
!994 = !DILocation(line: 294, column: 19, scope: !992)
!995 = !DILocation(line: 294, column: 24, scope: !992)
!996 = !DILocation(line: 294, column: 13, scope: !793)
!997 = !DILocation(line: 295, column: 13, scope: !998)
!998 = distinct !DILexicalBlock(scope: !992, file: !3, line: 294, column: 40)
!999 = !DILocation(line: 378, column: 5, scope: !793)
!1000 = !DILocation(line: 152, column: 46, scope: !785)
!1001 = !DILocation(line: 152, column: 5, scope: !785)
!1002 = distinct !{!1002, !791, !1003}
!1003 = !DILocation(line: 378, column: 5, scope: !782)
!1004 = !DILocation(line: 380, column: 5, scope: !753)
!1005 = !DILocation(line: 381, column: 1, scope: !753)
!1006 = distinct !DISubprogram(name: "ngx_open_listening_sockets", scope: !3, file: !3, line: 385, type: !472, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1016, !1017, !1018, !1019, !1028, !1031}
!1008 = !DILocalVariable(name: "cycle", arg: 1, scope: !1006, file: !3, line: 385, type: !30)
!1009 = !DILocalVariable(name: "reuseaddr", scope: !1006, file: !3, line: 387, type: !17)
!1010 = !DILocalVariable(name: "i", scope: !1006, file: !3, line: 388, type: !27)
!1011 = !DILocalVariable(name: "tries", scope: !1006, file: !3, line: 388, type: !27)
!1012 = !DILocalVariable(name: "failed", scope: !1006, file: !3, line: 388, type: !27)
!1013 = !DILocalVariable(name: "err", scope: !1006, file: !3, line: 389, type: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !1015, line: 16, baseType: !17)
!1015 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1016 = !DILocalVariable(name: "log", scope: !1006, file: !3, line: 390, type: !145)
!1017 = !DILocalVariable(name: "s", scope: !1006, file: !3, line: 391, type: !15)
!1018 = !DILocalVariable(name: "ls", scope: !1006, file: !3, line: 392, type: !307)
!1019 = !DILocalVariable(name: "ipv6only", scope: !1020, file: !3, line: 507, type: !17)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 506, column: 56)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 506, column: 17)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 409, column: 54)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 409, column: 9)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 409, column: 9)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 403, column: 37)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 403, column: 5)
!1027 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 403, column: 5)
!1028 = !DILocalVariable(name: "mode", scope: !1029, file: !3, line: 570, type: !112)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 569, column: 55)
!1030 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 569, column: 17)
!1031 = !DILocalVariable(name: "name", scope: !1029, file: !3, line: 571, type: !51)
!1032 = !DILocation(line: 385, column: 41, scope: !1006)
!1033 = !DILocation(line: 387, column: 5, scope: !1006)
!1034 = !DILocation(line: 387, column: 23, scope: !1006)
!1035 = !DILocation(line: 388, column: 5, scope: !1006)
!1036 = !DILocation(line: 388, column: 23, scope: !1006)
!1037 = !DILocation(line: 388, column: 26, scope: !1006)
!1038 = !DILocation(line: 388, column: 33, scope: !1006)
!1039 = !DILocation(line: 389, column: 5, scope: !1006)
!1040 = !DILocation(line: 389, column: 23, scope: !1006)
!1041 = !DILocation(line: 390, column: 5, scope: !1006)
!1042 = !DILocation(line: 390, column: 23, scope: !1006)
!1043 = !DILocation(line: 391, column: 5, scope: !1006)
!1044 = !DILocation(line: 391, column: 23, scope: !1006)
!1045 = !DILocation(line: 392, column: 5, scope: !1006)
!1046 = !DILocation(line: 392, column: 23, scope: !1006)
!1047 = !DILocation(line: 394, column: 15, scope: !1006)
!1048 = !DILocation(line: 396, column: 12, scope: !1006)
!1049 = !DILocation(line: 399, column: 11, scope: !1006)
!1050 = !DILocation(line: 399, column: 18, scope: !1006)
!1051 = !DILocation(line: 399, column: 9, scope: !1006)
!1052 = !DILocation(line: 403, column: 16, scope: !1027)
!1053 = !DILocation(line: 403, column: 10, scope: !1027)
!1054 = !DILocation(line: 403, column: 21, scope: !1026)
!1055 = !DILocation(line: 403, column: 5, scope: !1027)
!1056 = !DILocation(line: 404, column: 16, scope: !1025)
!1057 = !DILocation(line: 408, column: 14, scope: !1025)
!1058 = !DILocation(line: 408, column: 21, scope: !1025)
!1059 = !DILocation(line: 408, column: 31, scope: !1025)
!1060 = !DILocation(line: 408, column: 12, scope: !1025)
!1061 = !DILocation(line: 409, column: 16, scope: !1024)
!1062 = !DILocation(line: 409, column: 14, scope: !1024)
!1063 = !DILocation(line: 409, column: 21, scope: !1023)
!1064 = !DILocation(line: 409, column: 25, scope: !1023)
!1065 = !DILocation(line: 409, column: 32, scope: !1023)
!1066 = !DILocation(line: 409, column: 42, scope: !1023)
!1067 = !DILocation(line: 409, column: 23, scope: !1023)
!1068 = !DILocation(line: 409, column: 9, scope: !1024)
!1069 = !DILocation(line: 411, column: 17, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 411, column: 17)
!1071 = !DILocation(line: 411, column: 20, scope: !1070)
!1072 = !DILocation(line: 411, column: 23, scope: !1070)
!1073 = !DILocation(line: 411, column: 17, scope: !1022)
!1074 = !DILocation(line: 412, column: 17, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 411, column: 31)
!1076 = !DILocation(line: 440, column: 17, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 440, column: 17)
!1078 = !DILocation(line: 440, column: 20, scope: !1077)
!1079 = !DILocation(line: 440, column: 23, scope: !1077)
!1080 = !DILocation(line: 440, column: 26, scope: !1077)
!1081 = !DILocation(line: 440, column: 17, scope: !1022)
!1082 = !DILocation(line: 441, column: 17, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 440, column: 48)
!1084 = !DILocation(line: 444, column: 17, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 444, column: 17)
!1086 = !DILocation(line: 444, column: 20, scope: !1085)
!1087 = !DILocation(line: 444, column: 23, scope: !1085)
!1088 = !DILocation(line: 444, column: 17, scope: !1022)
!1089 = !DILocation(line: 450, column: 17, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 444, column: 34)
!1091 = !DILocation(line: 453, column: 28, scope: !1022)
!1092 = !DILocation(line: 453, column: 31, scope: !1022)
!1093 = !DILocation(line: 453, column: 34, scope: !1022)
!1094 = !DILocation(line: 453, column: 44, scope: !1022)
!1095 = !DILocation(line: 453, column: 55, scope: !1022)
!1096 = !DILocation(line: 453, column: 58, scope: !1022)
!1097 = !DILocation(line: 453, column: 61, scope: !1022)
!1098 = !DILocation(line: 453, column: 17, scope: !1022)
!1099 = !DILocation(line: 453, column: 15, scope: !1022)
!1100 = !DILocation(line: 455, column: 17, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 455, column: 17)
!1102 = !DILocation(line: 455, column: 19, scope: !1101)
!1103 = !DILocation(line: 455, column: 17, scope: !1022)
!1104 = !DILocation(line: 456, column: 17, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 456, column: 17)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 455, column: 41)
!1107 = !DILocation(line: 456, column: 17, scope: !1106)
!1108 = !DILocation(line: 458, column: 17, scope: !1106)
!1109 = !DILocation(line: 461, column: 28, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 461, column: 17)
!1111 = !DILocation(line: 462, column: 28, scope: !1110)
