; ModuleID = 'src/core/ngx_conf_file.c'
source_filename = "src/core/ngx_conf_file.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, {}*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_conf_commands", scope: !2, file: !3, line: 19, type: !539, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !515, globals: !531)
!3 = !DIFile(filename: "src/core/ngx_conf_file.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 165, size: 32, elements: !511)
!6 = distinct !DISubprogram(name: "ngx_conf_parse", scope: !3, file: !3, line: 158, type: !7, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !501)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !11, !500}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!10 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !13, line: 16, baseType: !14)
!13 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !15, line: 116, size: 384, elements: !16)
!15 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!16 = !{!17, !18, !213, !482, !483, !484, !493, !494, !495, !496, !497, !499}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 117, baseType: !9, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !15, line: 118, baseType: !19, size: 32, offset: 32)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !21, line: 22, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 16, size: 160, elements: !23)
!23 = !{!24, !26, !32, !34, !35}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !22, file: !21, line: 17, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !22, file: !21, line: 18, baseType: !27, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !29)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 125, baseType: !31)
!30 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !21, line: 19, baseType: !33, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 120, baseType: !31)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !22, file: !21, line: 20, baseType: !27, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !22, file: !21, line: 21, baseType: !36, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !13, line: 18, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !39, line: 57, size: 320, elements: !40)
!39 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !{!41, !53, !54, !55, !193, !200, !212}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !38, file: !39, line: 58, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !39, line: 54, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 49, size: 128, elements: !44)
!44 = !{!45, !50, !51, !52}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !43, file: !39, line: 50, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !48, line: 64, baseType: !49)
!48 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !43, file: !39, line: 51, baseType: !46, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !43, file: !39, line: 52, baseType: !36, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !43, file: !39, line: 53, baseType: !27, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !38, file: !39, line: 59, baseType: !33, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !38, file: !39, line: 60, baseType: !36, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !38, file: !39, line: 61, baseType: !56, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !13, line: 19, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !59, line: 59, size: 64, elements: !60)
!59 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = !{!61, !192}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !58, file: !59, line: 60, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !59, line: 18, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !59, line: 20, size: 352, elements: !65)
!65 = !{!66, !67, !68, !71, !72, !73, !74, !76, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !64, file: !59, line: 21, baseType: !46, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !64, file: !59, line: 22, baseType: !46, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !64, file: !59, line: 23, baseType: !69, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !30, line: 222, baseType: !70)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !64, file: !59, line: 24, baseType: !69, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !64, file: !59, line: 26, baseType: !46, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !64, file: !59, line: 27, baseType: !46, size: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !64, file: !59, line: 28, baseType: !75, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !59, line: 16, baseType: !25)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !64, file: !59, line: 29, baseType: !77, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !13, line: 23, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !80, line: 16, size: 1216, elements: !81)
!80 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = !{!82, !85, !92, !137, !138, !139, !177, !178}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !79, file: !80, line: 17, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !84, line: 16, baseType: !70)
!84 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !80, line: 18, baseType: !86, size: 64, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !87, line: 19, baseType: !88)
!87 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 16, size: 64, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !88, file: !87, line: 17, baseType: !33, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !87, line: 18, baseType: !46, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !79, file: !80, line: 19, baseType: !93, size: 960, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !84, line: 17, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !95, line: 4, size: 960, elements: !96)
!95 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!96 = !{!97, !99, !100, !102, !103, !105, !106, !108, !110, !112, !113, !114, !115, !116, !117, !120, !121, !123, !124, !130, !131, !132}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !94, file: !95, line: 6, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !30, line: 232, baseType: !31)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !94, file: !95, line: 7, baseType: !98, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !94, file: !95, line: 8, baseType: !101, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !30, line: 227, baseType: !31)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !94, file: !95, line: 9, baseType: !101, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !94, file: !95, line: 10, baseType: !104, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !30, line: 217, baseType: !31)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !94, file: !95, line: 11, baseType: !104, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !94, file: !95, line: 13, baseType: !107, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !30, line: 212, baseType: !31)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !94, file: !95, line: 14, baseType: !109, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !30, line: 304, baseType: !31)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !94, file: !95, line: 15, baseType: !111, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !30, line: 309, baseType: !31)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !94, file: !95, line: 16, baseType: !31, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !94, file: !95, line: 17, baseType: !98, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !94, file: !95, line: 18, baseType: !98, size: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !94, file: !95, line: 19, baseType: !69, size: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !94, file: !95, line: 20, baseType: !69, size: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !94, file: !95, line: 21, baseType: !118, size: 32, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !30, line: 237, baseType: !119)
!119 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !94, file: !95, line: 22, baseType: !118, size: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !94, file: !95, line: 23, baseType: !122, size: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !30, line: 242, baseType: !70)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !94, file: !95, line: 24, baseType: !122, size: 32, offset: 544)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !94, file: !95, line: 26, baseType: !125, size: 64, offset: 576)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !30, line: 288, size: 64, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !125, file: !30, line: 288, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !30, line: 75, baseType: !119)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !125, file: !30, line: 288, baseType: !119, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !94, file: !95, line: 27, baseType: !125, size: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !94, file: !95, line: 28, baseType: !125, size: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !94, file: !95, line: 29, baseType: !133, size: 192, offset: 768)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 192, elements: !135)
!134 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!135 = !{!136}
!136 = !DISubrange(count: 3)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !79, file: !80, line: 21, baseType: !69, size: 32, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !79, file: !80, line: 22, baseType: !69, size: 32, offset: 1120)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !79, file: !80, line: 24, baseType: !140, size: 32, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !13, line: 20, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !143, line: 50, size: 320, elements: !144)
!143 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!144 = !{!145, !146, !158, !162, !163, !168, !169, !174, !175, !176}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !142, file: !143, line: 51, baseType: !27, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !142, file: !143, line: 52, baseType: !147, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !13, line: 21, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !15, line: 89, size: 160, elements: !150)
!150 = !{!151, !152, !153, !157}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !149, file: !15, line: 90, baseType: !83, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !15, line: 91, baseType: !86, size: 64, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !149, file: !15, line: 93, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !147, !140}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !15, line: 94, baseType: !25, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !142, file: !143, line: 54, baseType: !159, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !160, line: 98, baseType: !161)
!160 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!161 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !142, file: !143, line: 56, baseType: !128, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !142, file: !143, line: 58, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !143, line: 45, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{!46, !140, !46, !33}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !143, line: 59, baseType: !25, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !142, file: !143, line: 61, baseType: !170, size: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !143, line: 46, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !140, !27, !46, !33}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !142, file: !143, line: 62, baseType: !25, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !142, file: !143, line: 70, baseType: !9, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !143, line: 72, baseType: !140, size: 32, offset: 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !79, file: !80, line: 37, baseType: !31, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !79, file: !80, line: 38, baseType: !31, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !64, file: !59, line: 30, baseType: !62, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !64, file: !59, line: 34, baseType: !31, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !64, file: !59, line: 40, baseType: !31, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !64, file: !59, line: 43, baseType: !31, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !64, file: !59, line: 45, baseType: !31, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !64, file: !59, line: 46, baseType: !31, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !64, file: !59, line: 47, baseType: !31, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !64, file: !59, line: 48, baseType: !31, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !64, file: !59, line: 49, baseType: !31, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !64, file: !59, line: 50, baseType: !31, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !64, file: !59, line: 52, baseType: !31, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !64, file: !59, line: 53, baseType: !31, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !64, file: !59, line: 55, baseType: !70, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !59, line: 61, baseType: !56, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !38, file: !39, line: 62, baseType: !194, size: 32, offset: 224)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !39, line: 41, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !39, line: 43, size: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !39, line: 44, baseType: !194, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !196, file: !39, line: 45, baseType: !25, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !38, file: !39, line: 63, baseType: !201, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !39, line: 32, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !39, line: 34, size: 96, elements: !204)
!204 = !{!205, !210, !211}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !203, file: !39, line: 35, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !39, line: 30, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !25}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !39, line: 36, baseType: !25, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !39, line: 37, baseType: !201, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !38, file: !39, line: 64, baseType: !140, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !14, file: !15, line: 120, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !13, line: 17, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !217, line: 38, size: 2496, elements: !218)
!217 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!218 = !{!219, !223, !224, !225, !226, !227, !363, !364, !365, !423, !424, !425, !426, !427, !428, !429, !430, !451, !452, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !216, file: !217, line: 39, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !216, file: !217, line: 40, baseType: !36, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !216, file: !217, line: 42, baseType: !140, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !216, file: !217, line: 43, baseType: !141, size: 320, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !216, file: !217, line: 45, baseType: !27, size: 32, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !216, file: !217, line: 47, baseType: !228, size: 32, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !13, line: 26, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !232, line: 121, size: 896, elements: !233)
!232 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!233 = !{!234, !235, !239, !240, !243, !250, !252, !257, !262, !324, !325, !326, !327, !328, !329, !330, !331, !332, !336, !337, !338, !339, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !232, line: 122, baseType: !25, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !231, file: !232, line: 123, baseType: !236, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !13, line: 24, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !13, line: 24, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !231, file: !232, line: 124, baseType: !236, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !231, file: !232, line: 126, baseType: !241, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !242, line: 17, baseType: !70)
!242 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !231, file: !232, line: 128, baseType: !244, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !245, line: 19, baseType: !246)
!245 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !229, !46, !33}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !30, line: 135, baseType: !70)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !231, file: !232, line: 129, baseType: !251, size: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !245, line: 22, baseType: !246)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !231, file: !232, line: 130, baseType: !253, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !245, line: 20, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!249, !229, !56, !69}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !231, file: !232, line: 131, baseType: !258, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !245, line: 23, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!56, !229, !56, !69}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !231, file: !232, line: 133, baseType: !263, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !232, line: 16, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !232, line: 18, size: 960, elements: !266)
!266 = !{!267, !268, !280, !282, !283, !284, !285, !286, !287, !288, !293, !294, !295, !296, !297, !298, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !265, file: !232, line: 19, baseType: !241, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !265, file: !232, line: 21, baseType: !269, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !271, line: 297, size: 128, elements: !272)
!271 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!272 = !{!273, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !270, file: !271, line: 298, baseType: !274, size: 16)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !30, line: 409, baseType: !275)
!275 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !270, file: !271, line: 299, baseType: !277, size: 112, offset: 16)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 14)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !265, file: !232, line: 22, baseType: !281, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !30, line: 404, baseType: !31)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !265, file: !232, line: 23, baseType: !33, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !265, file: !232, line: 24, baseType: !86, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !232, line: 26, baseType: !70, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !265, file: !232, line: 28, baseType: !70, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !265, file: !232, line: 29, baseType: !70, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !265, file: !232, line: 30, baseType: !70, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !265, file: !232, line: 38, baseType: !289, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !13, line: 32, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !229}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !265, file: !232, line: 40, baseType: !25, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !265, file: !232, line: 42, baseType: !141, size: 320, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !265, file: !232, line: 43, baseType: !140, size: 32, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !265, file: !232, line: 45, baseType: !33, size: 32, offset: 736)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !265, file: !232, line: 47, baseType: !33, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !265, file: !232, line: 49, baseType: !299, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !300, line: 16, baseType: !301)
!300 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !302, line: 16, baseType: !27)
!302 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!303 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !265, file: !232, line: 51, baseType: !263, size: 32, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !265, file: !232, line: 52, baseType: !229, size: 32, offset: 864)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !265, file: !232, line: 54, baseType: !27, size: 32, offset: 896)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !265, file: !232, line: 56, baseType: !31, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !265, file: !232, line: 57, baseType: !31, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !265, file: !232, line: 58, baseType: !31, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !265, file: !232, line: 60, baseType: !31, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !265, file: !232, line: 61, baseType: !31, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !265, file: !232, line: 62, baseType: !31, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !265, file: !232, line: 63, baseType: !31, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !265, file: !232, line: 64, baseType: !31, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !265, file: !232, line: 65, baseType: !31, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !265, file: !232, line: 66, baseType: !31, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !265, file: !232, line: 67, baseType: !31, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !265, file: !232, line: 70, baseType: !31, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !265, file: !232, line: 72, baseType: !31, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !265, file: !232, line: 73, baseType: !31, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !265, file: !232, line: 74, baseType: !31, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !265, file: !232, line: 76, baseType: !31, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !265, file: !232, line: 77, baseType: !31, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !265, file: !232, line: 78, baseType: !31, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !231, file: !232, line: 135, baseType: !69, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !231, file: !232, line: 137, baseType: !140, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !231, file: !232, line: 139, baseType: !36, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !232, line: 141, baseType: !70, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !231, file: !232, line: 143, baseType: !269, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !231, file: !232, line: 144, baseType: !281, size: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !231, file: !232, line: 145, baseType: !86, size: 64, offset: 480)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !231, file: !232, line: 147, baseType: !86, size: 64, offset: 544)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !231, file: !232, line: 148, baseType: !333, size: 16, offset: 608)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !334, line: 12, baseType: !335)
!334 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 186, baseType: !275)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !231, file: !232, line: 154, baseType: !269, size: 32, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !231, file: !232, line: 155, baseType: !281, size: 32, offset: 672)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !231, file: !232, line: 157, baseType: !62, size: 32, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !231, file: !232, line: 159, baseType: !340, size: 64, offset: 736)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !341, line: 16, baseType: !342)
!341 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !341, line: 18, size: 64, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !342, file: !341, line: 19, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !341, line: 20, baseType: !345, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !231, file: !232, line: 161, baseType: !159, size: 32, offset: 800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !231, file: !232, line: 163, baseType: !27, size: 32, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !231, file: !232, line: 165, baseType: !31, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !231, file: !232, line: 167, baseType: !31, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !231, file: !232, line: 169, baseType: !31, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !231, file: !232, line: 170, baseType: !31, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !231, file: !232, line: 171, baseType: !31, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !231, file: !232, line: 173, baseType: !31, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !231, file: !232, line: 174, baseType: !31, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !231, file: !232, line: 175, baseType: !31, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !231, file: !232, line: 176, baseType: !31, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !231, file: !232, line: 178, baseType: !31, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !231, file: !232, line: 179, baseType: !31, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !231, file: !232, line: 180, baseType: !31, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !231, file: !232, line: 181, baseType: !31, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !231, file: !232, line: 183, baseType: !31, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !216, file: !217, line: 48, baseType: !229, size: 32, offset: 480)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !216, file: !217, line: 49, baseType: !27, size: 32, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !216, file: !217, line: 51, baseType: !366, size: 32, offset: 544)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !13, line: 15, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !370, line: 222, size: 800, elements: !371)
!370 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !381, !382, !396, !397, !403, !407, !408, !409, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !369, file: !370, line: 223, baseType: !27, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !369, file: !370, line: 224, baseType: !27, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !369, file: !370, line: 226, baseType: !9, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !369, file: !370, line: 228, baseType: !27, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !369, file: !370, line: 229, baseType: !27, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !369, file: !370, line: 231, baseType: !27, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !369, file: !370, line: 232, baseType: !379, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !369, file: !370, line: 234, baseType: !25, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !369, file: !370, line: 235, baseType: !383, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !13, line: 22, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !15, line: 77, size: 224, elements: !386)
!386 = !{!387, !388, !389, !393, !394, !395}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !15, line: 78, baseType: !86, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !15, line: 79, baseType: !27, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !385, file: !15, line: 80, baseType: !390, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DISubroutineType(types: !392)
!392 = !{!9, !11, !383, !25}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !385, file: !15, line: 81, baseType: !27, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !385, file: !15, line: 82, baseType: !27, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !385, file: !15, line: 83, baseType: !25, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !370, line: 236, baseType: !27, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !369, file: !370, line: 238, baseType: !398, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{!401, !140}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !30, line: 140, baseType: !70)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !369, file: !370, line: 240, baseType: !404, size: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DISubroutineType(types: !406)
!406 = !{!401, !214}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !369, file: !370, line: 242, baseType: !404, size: 32, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !369, file: !370, line: 243, baseType: !404, size: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !369, file: !370, line: 244, baseType: !410, size: 32, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !214}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !369, file: !370, line: 245, baseType: !410, size: 32, offset: 480)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !369, file: !370, line: 247, baseType: !410, size: 32, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !369, file: !370, line: 249, baseType: !29, size: 32, offset: 544)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !369, file: !370, line: 250, baseType: !29, size: 32, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !369, file: !370, line: 251, baseType: !29, size: 32, offset: 608)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !369, file: !370, line: 252, baseType: !29, size: 32, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !369, file: !370, line: 253, baseType: !29, size: 32, offset: 672)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !369, file: !370, line: 254, baseType: !29, size: 32, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !369, file: !370, line: 255, baseType: !29, size: 32, offset: 736)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !369, file: !370, line: 256, baseType: !29, size: 32, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !216, file: !217, line: 52, baseType: !27, size: 32, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !216, file: !217, line: 53, baseType: !27, size: 32, offset: 608)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !216, file: !217, line: 55, baseType: !340, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !216, file: !217, line: 56, baseType: !27, size: 32, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !216, file: !217, line: 58, baseType: !20, size: 160, offset: 736)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !216, file: !217, line: 59, baseType: !20, size: 160, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !216, file: !217, line: 61, baseType: !20, size: 160, offset: 1056)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !216, file: !217, line: 62, baseType: !431, size: 96, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !302, line: 32, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !302, line: 37, size: 96, elements: !433)
!433 = !{!434, !445, !446}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !432, file: !302, line: 38, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !302, line: 20, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !302, line: 22, size: 160, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !437, file: !302, line: 23, baseType: !301, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !437, file: !302, line: 24, baseType: !435, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !437, file: !302, line: 25, baseType: !435, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !437, file: !302, line: 26, baseType: !435, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !437, file: !302, line: 27, baseType: !47, size: 8, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !302, line: 28, baseType: !47, size: 8, offset: 136)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !432, file: !302, line: 39, baseType: !435, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !432, file: !302, line: 40, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !302, line: 34, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !435, !435, !435}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !216, file: !217, line: 63, baseType: !436, size: 160, offset: 1312)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !216, file: !217, line: 65, baseType: !453, size: 224, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !454, line: 31, baseType: !455)
!454 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 25, size: 224, elements: !456)
!456 = !{!457, !465, !466, !467, !468}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !455, file: !454, line: 26, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !454, line: 16, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !454, line: 18, size: 96, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !460, file: !454, line: 19, baseType: !25, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !460, file: !454, line: 20, baseType: !27, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !454, line: 21, baseType: !458, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !455, file: !454, line: 27, baseType: !459, size: 96, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !455, file: !454, line: 28, baseType: !33, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !455, file: !454, line: 29, baseType: !27, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !455, file: !454, line: 30, baseType: !36, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !216, file: !217, line: 66, baseType: !453, size: 224, offset: 1696)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !216, file: !217, line: 68, baseType: !27, size: 32, offset: 1920)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !216, file: !217, line: 69, baseType: !27, size: 32, offset: 1952)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !216, file: !217, line: 71, baseType: !229, size: 32, offset: 1984)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !216, file: !217, line: 72, baseType: !236, size: 32, offset: 2016)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !216, file: !217, line: 73, baseType: !236, size: 32, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !216, file: !217, line: 75, baseType: !214, size: 32, offset: 2080)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !216, file: !217, line: 77, baseType: !86, size: 64, offset: 2112)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !216, file: !217, line: 78, baseType: !86, size: 64, offset: 2176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !216, file: !217, line: 79, baseType: !86, size: 64, offset: 2240)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !216, file: !217, line: 80, baseType: !86, size: 64, offset: 2304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !216, file: !217, line: 81, baseType: !86, size: 64, offset: 2368)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !216, file: !217, line: 82, baseType: !86, size: 64, offset: 2432)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !14, file: !15, line: 121, baseType: !36, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !14, file: !15, line: 122, baseType: !36, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !14, file: !15, line: 123, baseType: !485, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !15, line: 103, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 98, size: 1344, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !487, file: !15, line: 99, baseType: !78, size: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !487, file: !15, line: 100, baseType: !62, size: 32, offset: 1216)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !487, file: !15, line: 101, baseType: !62, size: 32, offset: 1248)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !487, file: !15, line: 102, baseType: !27, size: 32, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !14, file: !15, line: 124, baseType: !140, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !14, file: !15, line: 126, baseType: !25, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !14, file: !15, line: 127, baseType: !27, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !14, file: !15, line: 128, baseType: !27, size: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !14, file: !15, line: 130, baseType: !498, size: 32, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !15, line: 112, baseType: !390)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !14, file: !15, line: 131, baseType: !9, size: 32, offset: 352)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510}
!502 = !DILocalVariable(name: "cf", arg: 1, scope: !6, file: !3, line: 158, type: !11)
!503 = !DILocalVariable(name: "filename", arg: 2, scope: !6, file: !3, line: 158, type: !500)
!504 = !DILocalVariable(name: "rv", scope: !6, file: !3, line: 160, type: !9)
!505 = !DILocalVariable(name: "fd", scope: !6, file: !3, line: 161, type: !83)
!506 = !DILocalVariable(name: "rc", scope: !6, file: !3, line: 162, type: !401)
!507 = !DILocalVariable(name: "buf", scope: !6, file: !3, line: 163, type: !63)
!508 = !DILocalVariable(name: "prev", scope: !6, file: !3, line: 164, type: !485)
!509 = !DILocalVariable(name: "conf_file", scope: !6, file: !3, line: 164, type: !486)
!510 = !DILocalVariable(name: "type", scope: !6, file: !3, line: 169, type: !5)
!511 = !{!512, !513, !514}
!512 = !DIEnumerator(name: "parse_file", value: 0)
!513 = !DIEnumerator(name: "parse_block", value: 1)
!514 = !DIEnumerator(name: "parse_param", value: 2)
!515 = !{!379, !25, !9, !516, !46, !500, !518, !519, !520, !33, !521, !69, !522, !299, !523, !128, !524, !530, !27, !222, !249, !47}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !28, line: 80, baseType: !402)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !59, line: 68, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 65, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !526, file: !59, line: 66, baseType: !401, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !526, file: !59, line: 67, baseType: !33, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!531 = !{!532, !0, !534}
!532 = !DIGlobalVariableExpression(var: !533)
!533 = distinct !DIGlobalVariable(name: "ngx_conf_module", scope: !2, file: !3, line: 32, type: !368, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535)
!535 = distinct !DIGlobalVariable(name: "argument_number", scope: !2, file: !3, line: 50, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 256, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 8)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 448, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 2)
!542 = !{i32 2, !"Dwarf Version", i32 4}
!543 = !{i32 2, !"Debug Info Version", i32 3}
!544 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!545 = distinct !DISubprogram(name: "ngx_conf_flush_files", scope: !3, file: !3, line: 955, type: !411, isLocal: true, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DILocalVariable(name: "cycle", arg: 1, scope: !545, file: !3, line: 955, type: !214)
!548 = !DILocalVariable(name: "i", scope: !545, file: !3, line: 957, type: !27)
!549 = !DILocalVariable(name: "part", scope: !545, file: !3, line: 958, type: !458)
!550 = !DILocalVariable(name: "file", scope: !545, file: !3, line: 959, type: !147)
!551 = !{!552, !552, i64 0}
!552 = !{!"any pointer", !553, i64 0}
!553 = !{!"omnipotent char", !554, i64 0}
!554 = !{!"Simple C/C++ TBAA"}
!555 = !DIExpression()
!556 = !DILocation(line: 955, column: 35, scope: !545)
!557 = !DILocation(line: 957, column: 5, scope: !545)
!558 = !DILocation(line: 957, column: 23, scope: !545)
!559 = !DILocation(line: 958, column: 5, scope: !545)
!560 = !DILocation(line: 958, column: 23, scope: !545)
!561 = !DILocation(line: 959, column: 5, scope: !545)
!562 = !DILocation(line: 959, column: 23, scope: !545)
!563 = !DILocation(line: 963, column: 13, scope: !545)
!564 = !DILocation(line: 963, column: 20, scope: !545)
!565 = !DILocation(line: 963, column: 31, scope: !545)
!566 = !DILocation(line: 963, column: 10, scope: !545)
!567 = !DILocation(line: 964, column: 12, scope: !545)
!568 = !DILocation(line: 964, column: 18, scope: !545)
!569 = !{!570, !552, i64 0}
!570 = !{!"ngx_list_part_s", !552, i64 0, !571, i64 4, !552, i64 8}
!571 = !{!"int", !553, i64 0}
!572 = !DILocation(line: 964, column: 10, scope: !545)
!573 = !DILocation(line: 966, column: 12, scope: !574)
!574 = distinct !DILexicalBlock(scope: !545, file: !3, line: 966, column: 5)
!575 = !{!571, !571, i64 0}
!576 = !DILocation(line: 966, column: 10, scope: !574)
!577 = !DILocation(line: 968, column: 13, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !3, line: 968, column: 13)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 966, column: 35)
!580 = distinct !DILexicalBlock(scope: !574, file: !3, line: 966, column: 5)
!581 = !DILocation(line: 968, column: 18, scope: !578)
!582 = !DILocation(line: 968, column: 24, scope: !578)
!583 = !{!570, !571, i64 4}
!584 = !DILocation(line: 968, column: 15, scope: !578)
!585 = !DILocation(line: 968, column: 13, scope: !579)
!586 = !DILocation(line: 969, column: 17, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !3, line: 969, column: 17)
!588 = distinct !DILexicalBlock(scope: !578, file: !3, line: 968, column: 31)
!589 = !DILocation(line: 969, column: 23, scope: !587)
!590 = !{!570, !552, i64 8}
!591 = !DILocation(line: 969, column: 28, scope: !587)
!592 = !DILocation(line: 969, column: 17, scope: !588)
!593 = !DILocation(line: 970, column: 17, scope: !594)
!594 = distinct !DILexicalBlock(scope: !587, file: !3, line: 969, column: 37)
!595 = !DILocation(line: 972, column: 20, scope: !588)
!596 = !DILocation(line: 972, column: 26, scope: !588)
!597 = !DILocation(line: 972, column: 18, scope: !588)
!598 = !DILocation(line: 973, column: 20, scope: !588)
!599 = !DILocation(line: 973, column: 26, scope: !588)
!600 = !DILocation(line: 973, column: 18, scope: !588)
!601 = !DILocation(line: 974, column: 15, scope: !588)
!602 = !DILocation(line: 975, column: 9, scope: !588)
!603 = !DILocation(line: 977, column: 13, scope: !604)
!604 = distinct !DILexicalBlock(scope: !579, file: !3, line: 977, column: 13)
!605 = !DILocation(line: 977, column: 18, scope: !604)
!606 = !DILocation(line: 977, column: 21, scope: !604)
!607 = !{!608, !552, i64 12}
!608 = !{!"ngx_open_file_s", !571, i64 0, !609, i64 4, !552, i64 12, !552, i64 16}
!609 = !{!"", !571, i64 0, !552, i64 4}
!610 = !DILocation(line: 977, column: 13, scope: !579)
!611 = !DILocation(line: 978, column: 13, scope: !612)
!612 = distinct !DILexicalBlock(scope: !604, file: !3, line: 977, column: 28)
!613 = !DILocation(line: 978, column: 18, scope: !612)
!614 = !DILocation(line: 978, column: 21, scope: !612)
!615 = !DILocation(line: 978, column: 28, scope: !612)
!616 = !DILocation(line: 978, column: 33, scope: !612)
!617 = !DILocation(line: 978, column: 37, scope: !612)
!618 = !DILocation(line: 978, column: 44, scope: !612)
!619 = !{!620, !552, i64 8}
!620 = !{!"ngx_cycle_s", !552, i64 0, !552, i64 4, !552, i64 8, !621, i64 12, !571, i64 52, !552, i64 56, !552, i64 60, !571, i64 64, !552, i64 68, !571, i64 72, !571, i64 76, !623, i64 80, !571, i64 88, !624, i64 92, !624, i64 112, !624, i64 132, !625, i64 152, !626, i64 164, !627, i64 184, !627, i64 212, !571, i64 240, !571, i64 244, !552, i64 248, !552, i64 252, !552, i64 256, !552, i64 260, !609, i64 264, !609, i64 272, !609, i64 280, !609, i64 288, !609, i64 296, !609, i64 304}
!621 = !{!"ngx_log_s", !571, i64 0, !552, i64 4, !622, i64 8, !622, i64 12, !552, i64 16, !552, i64 20, !552, i64 24, !552, i64 28, !552, i64 32, !552, i64 36}
!622 = !{!"long", !553, i64 0}
!623 = !{!"ngx_queue_s", !552, i64 0, !552, i64 4}
!624 = !{!"", !552, i64 0, !571, i64 4, !571, i64 8, !571, i64 12, !552, i64 16}
!625 = !{!"ngx_rbtree_s", !552, i64 0, !552, i64 4, !552, i64 8}
!626 = !{!"ngx_rbtree_node_s", !571, i64 0, !552, i64 4, !552, i64 8, !552, i64 12, !553, i64 16, !553, i64 17}
!627 = !{!"", !552, i64 0, !570, i64 4, !571, i64 16, !571, i64 20, !552, i64 24}
!628 = !DILocation(line: 979, column: 9, scope: !612)
!629 = !DILocation(line: 980, column: 5, scope: !579)
!630 = !DILocation(line: 966, column: 31, scope: !580)
!631 = !DILocation(line: 966, column: 5, scope: !580)
!632 = distinct !{!632, !633, !634}
!633 = !DILocation(line: 966, column: 5, scope: !574)
!634 = !DILocation(line: 980, column: 5, scope: !574)
!635 = !DILocation(line: 981, column: 1, scope: !545)
!636 = distinct !DISubprogram(name: "ngx_conf_param", scope: !3, file: !3, line: 63, type: !637, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!9, !11}
!639 = !{!640, !641, !642, !643, !644}
!640 = !DILocalVariable(name: "cf", arg: 1, scope: !636, file: !3, line: 63, type: !11)
!641 = !DILocalVariable(name: "rv", scope: !636, file: !3, line: 65, type: !9)
!642 = !DILocalVariable(name: "param", scope: !636, file: !3, line: 66, type: !500)
!643 = !DILocalVariable(name: "b", scope: !636, file: !3, line: 67, type: !63)
!644 = !DILocalVariable(name: "conf_file", scope: !636, file: !3, line: 68, type: !486)
!645 = !DILocation(line: 63, column: 28, scope: !636)
!646 = !DILocation(line: 65, column: 5, scope: !636)
!647 = !DILocation(line: 65, column: 23, scope: !636)
!648 = !DILocation(line: 66, column: 5, scope: !636)
!649 = !DILocation(line: 66, column: 23, scope: !636)
!650 = !DILocation(line: 67, column: 5, scope: !636)
!651 = !DILocation(line: 67, column: 23, scope: !636)
!652 = !DILocation(line: 68, column: 5, scope: !636)
!653 = !DILocation(line: 68, column: 23, scope: !636)
!654 = !DILocation(line: 70, column: 14, scope: !636)
!655 = !DILocation(line: 70, column: 18, scope: !636)
!656 = !{!657, !552, i64 8}
!657 = !{!"ngx_conf_s", !552, i64 0, !552, i64 4, !552, i64 8, !552, i64 12, !552, i64 16, !552, i64 20, !552, i64 24, !552, i64 28, !571, i64 32, !571, i64 36, !552, i64 40, !552, i64 44}
!658 = !DILocation(line: 70, column: 25, scope: !636)
!659 = !DILocation(line: 70, column: 11, scope: !636)
!660 = !DILocation(line: 72, column: 9, scope: !661)
!661 = distinct !DILexicalBlock(scope: !636, file: !3, line: 72, column: 9)
!662 = !DILocation(line: 72, column: 16, scope: !661)
!663 = !{!609, !571, i64 0}
!664 = !DILocation(line: 72, column: 20, scope: !661)
!665 = !DILocation(line: 72, column: 9, scope: !636)
!666 = !DILocation(line: 73, column: 9, scope: !667)
!667 = distinct !DILexicalBlock(scope: !661, file: !3, line: 72, column: 26)
!668 = !DILocation(line: 76, column: 5, scope: !636)
!669 = !DILocation(line: 78, column: 5, scope: !636)
!670 = !DILocation(line: 80, column: 15, scope: !636)
!671 = !DILocation(line: 80, column: 22, scope: !636)
!672 = !{!609, !552, i64 4}
!673 = !DILocation(line: 80, column: 7, scope: !636)
!674 = !DILocation(line: 80, column: 13, scope: !636)
!675 = !{!676, !552, i64 16}
!676 = !{!"ngx_buf_s", !552, i64 0, !552, i64 4, !571, i64 8, !571, i64 12, !552, i64 16, !552, i64 20, !552, i64 24, !552, i64 28, !552, i64 32, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 36, !571, i64 37, !571, i64 37, !571, i64 37, !571, i64 40}
!677 = !DILocation(line: 81, column: 13, scope: !636)
!678 = !DILocation(line: 81, column: 20, scope: !636)
!679 = !DILocation(line: 81, column: 7, scope: !636)
!680 = !DILocation(line: 81, column: 11, scope: !636)
!681 = !{!676, !552, i64 0}
!682 = !DILocation(line: 82, column: 14, scope: !636)
!683 = !DILocation(line: 82, column: 21, scope: !636)
!684 = !DILocation(line: 82, column: 28, scope: !636)
!685 = !DILocation(line: 82, column: 35, scope: !636)
!686 = !DILocation(line: 82, column: 26, scope: !636)
!687 = !DILocation(line: 82, column: 7, scope: !636)
!688 = !DILocation(line: 82, column: 12, scope: !636)
!689 = !{!676, !552, i64 4}
!690 = !DILocation(line: 83, column: 15, scope: !636)
!691 = !DILocation(line: 83, column: 7, scope: !636)
!692 = !DILocation(line: 83, column: 11, scope: !636)
!693 = !{!676, !552, i64 20}
!694 = !DILocation(line: 84, column: 7, scope: !636)
!695 = !DILocation(line: 84, column: 17, scope: !636)
!696 = !DILocation(line: 86, column: 15, scope: !636)
!697 = !DILocation(line: 86, column: 20, scope: !636)
!698 = !DILocation(line: 86, column: 23, scope: !636)
!699 = !{!700, !571, i64 0}
!700 = !{!"", !701, i64 0, !552, i64 152, !552, i64 156, !571, i64 160}
!701 = !{!"ngx_file_s", !571, i64 0, !609, i64 4, !702, i64 16, !571, i64 136, !571, i64 140, !552, i64 144, !571, i64 148, !571, i64 148}
!702 = !{!"stat", !571, i64 0, !571, i64 4, !571, i64 8, !571, i64 12, !571, i64 16, !571, i64 20, !571, i64 24, !571, i64 28, !571, i64 32, !571, i64 36, !571, i64 40, !571, i64 44, !571, i64 48, !571, i64 52, !622, i64 56, !622, i64 60, !571, i64 64, !571, i64 68, !703, i64 72, !703, i64 80, !703, i64 88, !553, i64 96}
!703 = !{!"timespec", !622, i64 0, !622, i64 4}
!704 = !DILocation(line: 87, column: 15, scope: !636)
!705 = !DILocation(line: 87, column: 20, scope: !636)
!706 = !DILocation(line: 87, column: 25, scope: !636)
!707 = !DILocation(line: 87, column: 30, scope: !636)
!708 = !{!700, !552, i64 8}
!709 = !DILocation(line: 88, column: 15, scope: !636)
!710 = !DILocation(line: 88, column: 20, scope: !636)
!711 = !{!700, !571, i64 160}
!712 = !DILocation(line: 90, column: 5, scope: !636)
!713 = !DILocation(line: 90, column: 9, scope: !636)
!714 = !DILocation(line: 90, column: 19, scope: !636)
!715 = !{!657, !552, i64 20}
!716 = !DILocation(line: 91, column: 5, scope: !636)
!717 = !DILocation(line: 91, column: 9, scope: !636)
!718 = !DILocation(line: 91, column: 20, scope: !636)
!719 = !DILocation(line: 91, column: 27, scope: !636)
!720 = !{!700, !552, i64 152}
!721 = !DILocation(line: 93, column: 25, scope: !636)
!722 = !DILocation(line: 93, column: 10, scope: !636)
!723 = !DILocation(line: 93, column: 8, scope: !636)
!724 = !DILocation(line: 95, column: 5, scope: !636)
!725 = !DILocation(line: 95, column: 9, scope: !636)
!726 = !DILocation(line: 95, column: 19, scope: !636)
!727 = !DILocation(line: 97, column: 12, scope: !636)
!728 = !DILocation(line: 97, column: 5, scope: !636)
!729 = !DILocation(line: 98, column: 1, scope: !636)
!730 = !DILocation(line: 158, column: 28, scope: !6)
!731 = !DILocation(line: 158, column: 43, scope: !6)
!732 = !DILocation(line: 160, column: 5, scope: !6)
!733 = !DILocation(line: 160, column: 23, scope: !6)
!734 = !DILocation(line: 161, column: 5, scope: !6)
!735 = !DILocation(line: 161, column: 23, scope: !6)
!736 = !DILocation(line: 162, column: 5, scope: !6)
!737 = !DILocation(line: 162, column: 23, scope: !6)
!738 = !DILocation(line: 163, column: 5, scope: !6)
!739 = !DILocation(line: 163, column: 23, scope: !6)
!740 = !DILocation(line: 164, column: 5, scope: !6)
!741 = !DILocation(line: 164, column: 23, scope: !6)
!742 = !DILocation(line: 164, column: 29, scope: !6)
!743 = !DILocation(line: 165, column: 5, scope: !6)
!744 = !DILocation(line: 169, column: 7, scope: !6)
!745 = !DILocation(line: 172, column: 8, scope: !6)
!746 = !DILocation(line: 173, column: 10, scope: !6)
!747 = !DILocation(line: 176, column: 9, scope: !748)
!748 = distinct !DILexicalBlock(scope: !6, file: !3, line: 176, column: 9)
!749 = !DILocation(line: 176, column: 9, scope: !6)
!750 = !DILocation(line: 180, column: 14, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !3, line: 176, column: 19)
!752 = !DILocation(line: 180, column: 12, scope: !751)
!753 = !DILocation(line: 181, column: 13, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 181, column: 13)
!755 = !DILocation(line: 181, column: 16, scope: !754)
!756 = !DILocation(line: 181, column: 13, scope: !751)
!757 = !DILocation(line: 182, column: 47, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !3, line: 181, column: 37)
!759 = !DILocation(line: 182, column: 51, scope: !758)
!760 = !DILocation(line: 184, column: 32, scope: !758)
!761 = !DILocation(line: 184, column: 42, scope: !758)
!762 = !DILocation(line: 182, column: 13, scope: !758)
!763 = !DILocation(line: 185, column: 13, scope: !758)
!764 = !DILocation(line: 188, column: 16, scope: !751)
!765 = !DILocation(line: 188, column: 20, scope: !751)
!766 = !DILocation(line: 188, column: 14, scope: !751)
!767 = !DILocation(line: 190, column: 9, scope: !751)
!768 = !DILocation(line: 190, column: 13, scope: !751)
!769 = !DILocation(line: 190, column: 23, scope: !751)
!770 = !DILocation(line: 192, column: 13, scope: !771)
!771 = distinct !DILexicalBlock(scope: !751, file: !3, line: 192, column: 13)
!772 = !DILocation(line: 192, column: 56, scope: !771)
!773 = !DILocation(line: 192, column: 13, scope: !751)
!774 = !DILocation(line: 193, column: 13, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 193, column: 13)
!776 = distinct !DILexicalBlock(scope: !771, file: !3, line: 192, column: 75)
!777 = !{!657, !552, i64 24}
!778 = !{!621, !571, i64 0}
!779 = !DILocation(line: 193, column: 13, scope: !776)
!780 = !DILocation(line: 195, column: 9, scope: !776)
!781 = !DILocation(line: 197, column: 9, scope: !751)
!782 = !DILocation(line: 197, column: 13, scope: !751)
!783 = !DILocation(line: 197, column: 24, scope: !751)
!784 = !DILocation(line: 197, column: 31, scope: !751)
!785 = !DILocation(line: 199, column: 48, scope: !751)
!786 = !DILocation(line: 199, column: 52, scope: !751)
!787 = !DILocation(line: 199, column: 21, scope: !751)
!788 = !DILocation(line: 199, column: 13, scope: !751)
!789 = !DILocation(line: 199, column: 19, scope: !751)
!790 = !DILocation(line: 200, column: 17, scope: !791)
!791 = distinct !DILexicalBlock(scope: !751, file: !3, line: 200, column: 13)
!792 = !DILocation(line: 200, column: 23, scope: !791)
!793 = !DILocation(line: 200, column: 13, scope: !751)
!794 = !DILocation(line: 201, column: 13, scope: !795)
!795 = distinct !DILexicalBlock(scope: !791, file: !3, line: 200, column: 32)
!796 = !DILocation(line: 204, column: 23, scope: !751)
!797 = !DILocation(line: 204, column: 13, scope: !751)
!798 = !DILocation(line: 204, column: 17, scope: !751)
!799 = !DILocation(line: 205, column: 24, scope: !751)
!800 = !DILocation(line: 205, column: 13, scope: !751)
!801 = !DILocation(line: 205, column: 18, scope: !751)
!802 = !DILocation(line: 206, column: 23, scope: !751)
!803 = !DILocation(line: 206, column: 28, scope: !751)
!804 = !DILocation(line: 206, column: 13, scope: !751)
!805 = !DILocation(line: 206, column: 17, scope: !751)
!806 = !DILocation(line: 207, column: 13, scope: !751)
!807 = !DILocation(line: 207, column: 23, scope: !751)
!808 = !DILocation(line: 209, column: 34, scope: !751)
!809 = !DILocation(line: 209, column: 9, scope: !751)
!810 = !DILocation(line: 209, column: 13, scope: !751)
!811 = !DILocation(line: 209, column: 24, scope: !751)
!812 = !DILocation(line: 209, column: 29, scope: !751)
!813 = !DILocation(line: 209, column: 32, scope: !751)
!814 = !DILocation(line: 210, column: 40, scope: !751)
!815 = !DILocation(line: 210, column: 50, scope: !751)
!816 = !DILocation(line: 210, column: 9, scope: !751)
!817 = !DILocation(line: 210, column: 13, scope: !751)
!818 = !DILocation(line: 210, column: 24, scope: !751)
!819 = !DILocation(line: 210, column: 29, scope: !751)
!820 = !DILocation(line: 210, column: 34, scope: !751)
!821 = !DILocation(line: 210, column: 38, scope: !751)
!822 = !{!700, !571, i64 4}
!823 = !DILocation(line: 211, column: 41, scope: !751)
!824 = !DILocation(line: 211, column: 51, scope: !751)
!825 = !DILocation(line: 211, column: 9, scope: !751)
!826 = !DILocation(line: 211, column: 13, scope: !751)
!827 = !DILocation(line: 211, column: 24, scope: !751)
!828 = !DILocation(line: 211, column: 29, scope: !751)
!829 = !DILocation(line: 211, column: 34, scope: !751)
!830 = !DILocation(line: 211, column: 39, scope: !751)
!831 = !DILocation(line: 212, column: 9, scope: !751)
!832 = !DILocation(line: 212, column: 13, scope: !751)
!833 = !DILocation(line: 212, column: 24, scope: !751)
!834 = !DILocation(line: 212, column: 29, scope: !751)
!835 = !DILocation(line: 212, column: 36, scope: !751)
!836 = !{!700, !571, i64 136}
!837 = !DILocation(line: 213, column: 35, scope: !751)
!838 = !DILocation(line: 213, column: 39, scope: !751)
!839 = !DILocation(line: 213, column: 9, scope: !751)
!840 = !DILocation(line: 213, column: 13, scope: !751)
!841 = !DILocation(line: 213, column: 24, scope: !751)
!842 = !DILocation(line: 213, column: 29, scope: !751)
!843 = !DILocation(line: 213, column: 33, scope: !751)
!844 = !{!700, !552, i64 144}
!845 = !DILocation(line: 214, column: 9, scope: !751)
!846 = !DILocation(line: 214, column: 13, scope: !751)
!847 = !DILocation(line: 214, column: 24, scope: !751)
!848 = !DILocation(line: 214, column: 29, scope: !751)
!849 = !DILocation(line: 216, column: 14, scope: !751)
!850 = !{!553, !553, i64 0}
!851 = !DILocation(line: 218, column: 13, scope: !852)
!852 = distinct !DILexicalBlock(scope: !751, file: !3, line: 218, column: 13)
!853 = !DILocation(line: 218, column: 13, scope: !751)
!854 = !DILocation(line: 224, column: 35, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 224, column: 17)
!856 = distinct !DILexicalBlock(scope: !852, file: !3, line: 223, column: 9)
!857 = !DILocation(line: 224, column: 39, scope: !855)
!858 = !DILocation(line: 224, column: 17, scope: !855)
!859 = !DILocation(line: 224, column: 49, scope: !855)
!860 = !DILocation(line: 224, column: 17, scope: !856)
!861 = !DILocation(line: 225, column: 17, scope: !862)
!862 = distinct !DILexicalBlock(scope: !855, file: !3, line: 224, column: 60)
!863 = !DILocation(line: 228, column: 9, scope: !856)
!864 = !DILocation(line: 229, column: 13, scope: !865)
!865 = distinct !DILexicalBlock(scope: !852, file: !3, line: 228, column: 16)
!866 = !DILocation(line: 229, column: 17, scope: !865)
!867 = !DILocation(line: 229, column: 28, scope: !865)
!868 = !DILocation(line: 229, column: 33, scope: !865)
!869 = !{!700, !552, i64 156}
!870 = !DILocation(line: 232, column: 5, scope: !751)
!871 = !DILocation(line: 232, column: 16, scope: !872)
!872 = distinct !DILexicalBlock(scope: !748, file: !3, line: 232, column: 16)
!873 = !DILocation(line: 232, column: 20, scope: !872)
!874 = !DILocation(line: 232, column: 31, scope: !872)
!875 = !DILocation(line: 232, column: 36, scope: !872)
!876 = !DILocation(line: 232, column: 39, scope: !872)
!877 = !DILocation(line: 232, column: 16, scope: !748)
!878 = !DILocation(line: 234, column: 14, scope: !879)
!879 = distinct !DILexicalBlock(scope: !872, file: !3, line: 232, column: 60)
!880 = !DILocation(line: 236, column: 5, scope: !879)
!881 = !DILocation(line: 237, column: 14, scope: !882)
!882 = distinct !DILexicalBlock(scope: !872, file: !3, line: 236, column: 12)
!883 = !DILocation(line: 241, column: 5, scope: !6)
!884 = !DILocation(line: 242, column: 34, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 241, column: 16)
!886 = distinct !DILexicalBlock(scope: !887, file: !3, line: 241, column: 5)
!887 = distinct !DILexicalBlock(scope: !6, file: !3, line: 241, column: 5)
!888 = !DILocation(line: 242, column: 14, scope: !885)
!889 = !DILocation(line: 242, column: 12, scope: !885)
!890 = !DILocation(line: 254, column: 13, scope: !891)
!891 = distinct !DILexicalBlock(scope: !885, file: !3, line: 254, column: 13)
!892 = !DILocation(line: 254, column: 16, scope: !891)
!893 = !DILocation(line: 254, column: 13, scope: !885)
!894 = !DILocation(line: 255, column: 13, scope: !895)
!895 = distinct !DILexicalBlock(scope: !891, file: !3, line: 254, column: 30)
!896 = !DILocation(line: 258, column: 13, scope: !897)
!897 = distinct !DILexicalBlock(scope: !885, file: !3, line: 258, column: 13)
!898 = !DILocation(line: 258, column: 16, scope: !897)
!899 = !DILocation(line: 258, column: 13, scope: !885)
!900 = !DILocation(line: 260, column: 17, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !3, line: 260, column: 17)
!902 = distinct !DILexicalBlock(scope: !897, file: !3, line: 258, column: 40)
!903 = !DILocation(line: 260, column: 22, scope: !901)
!904 = !DILocation(line: 260, column: 17, scope: !902)
!905 = !DILocation(line: 261, column: 51, scope: !906)
!906 = distinct !DILexicalBlock(scope: !901, file: !3, line: 260, column: 38)
!907 = !DILocation(line: 261, column: 17, scope: !906)
!908 = !DILocation(line: 262, column: 17, scope: !906)
!909 = !DILocation(line: 265, column: 13, scope: !902)
!910 = !DILocation(line: 268, column: 13, scope: !911)
!911 = distinct !DILexicalBlock(scope: !885, file: !3, line: 268, column: 13)
!912 = !DILocation(line: 268, column: 16, scope: !911)
!913 = !DILocation(line: 268, column: 13, scope: !885)
!914 = !DILocation(line: 270, column: 17, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 270, column: 17)
!916 = distinct !DILexicalBlock(scope: !911, file: !3, line: 268, column: 39)
!917 = !DILocation(line: 270, column: 22, scope: !915)
!918 = !DILocation(line: 270, column: 17, scope: !916)
!919 = !DILocation(line: 271, column: 51, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !3, line: 270, column: 38)
!921 = !DILocation(line: 271, column: 17, scope: !920)
!922 = !DILocation(line: 273, column: 17, scope: !920)
!923 = !DILocation(line: 276, column: 13, scope: !916)
!924 = !DILocation(line: 279, column: 13, scope: !925)
!925 = distinct !DILexicalBlock(scope: !885, file: !3, line: 279, column: 13)
!926 = !DILocation(line: 279, column: 16, scope: !925)
!927 = !DILocation(line: 279, column: 13, scope: !885)
!928 = !DILocation(line: 281, column: 17, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 281, column: 17)
!930 = distinct !DILexicalBlock(scope: !925, file: !3, line: 279, column: 41)
!931 = !DILocation(line: 281, column: 22, scope: !929)
!932 = !DILocation(line: 281, column: 17, scope: !930)
!933 = !DILocation(line: 282, column: 51, scope: !934)
!934 = distinct !DILexicalBlock(scope: !929, file: !3, line: 281, column: 38)
!935 = !DILocation(line: 282, column: 17, scope: !934)
!936 = !DILocation(line: 285, column: 17, scope: !934)
!937 = !DILocation(line: 287, column: 9, scope: !930)
!938 = !DILocation(line: 291, column: 13, scope: !939)
!939 = distinct !DILexicalBlock(scope: !885, file: !3, line: 291, column: 13)
!940 = !DILocation(line: 291, column: 17, scope: !939)
!941 = !{!657, !552, i64 40}
!942 = !DILocation(line: 291, column: 13, scope: !885)
!943 = !DILocation(line: 298, column: 17, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !3, line: 298, column: 17)
!945 = distinct !DILexicalBlock(scope: !939, file: !3, line: 291, column: 26)
!946 = !DILocation(line: 298, column: 20, scope: !944)
!947 = !DILocation(line: 298, column: 17, scope: !945)
!948 = !DILocation(line: 299, column: 51, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !3, line: 298, column: 45)
!950 = !DILocation(line: 299, column: 17, scope: !949)
!951 = !DILocation(line: 300, column: 17, scope: !949)
!952 = !DILocation(line: 303, column: 20, scope: !945)
!953 = !DILocation(line: 303, column: 24, scope: !945)
!954 = !DILocation(line: 303, column: 33, scope: !945)
!955 = !DILocation(line: 303, column: 43, scope: !945)
!956 = !DILocation(line: 303, column: 47, scope: !945)
!957 = !{!657, !552, i64 44}
!958 = !DILocation(line: 303, column: 18, scope: !945)
!959 = !DILocation(line: 303, column: 16, scope: !945)
!960 = !DILocation(line: 304, column: 17, scope: !961)
!961 = distinct !DILexicalBlock(scope: !945, file: !3, line: 304, column: 17)
!962 = !DILocation(line: 304, column: 20, scope: !961)
!963 = !DILocation(line: 304, column: 17, scope: !945)
!964 = !DILocation(line: 305, column: 17, scope: !965)
!965 = distinct !DILexicalBlock(scope: !961, file: !3, line: 304, column: 36)
!966 = distinct !{!966, !967, !968}
!967 = !DILocation(line: 241, column: 5, scope: !887)
!968 = !DILocation(line: 323, column: 5, scope: !887)
!969 = !DILocation(line: 308, column: 17, scope: !970)
!970 = distinct !DILexicalBlock(scope: !945, file: !3, line: 308, column: 17)
!971 = !DILocation(line: 308, column: 20, scope: !970)
!972 = !DILocation(line: 308, column: 17, scope: !945)
!973 = !DILocation(line: 309, column: 17, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !3, line: 308, column: 39)
!975 = !DILocation(line: 312, column: 47, scope: !945)
!976 = !DILocation(line: 312, column: 54, scope: !945)
!977 = !DILocation(line: 312, column: 13, scope: !945)
!978 = !DILocation(line: 314, column: 13, scope: !945)
!979 = !DILocation(line: 318, column: 31, scope: !885)
!980 = !DILocation(line: 318, column: 35, scope: !885)
!981 = !DILocation(line: 318, column: 14, scope: !885)
!982 = !DILocation(line: 318, column: 12, scope: !885)
!983 = !DILocation(line: 320, column: 13, scope: !984)
!984 = distinct !DILexicalBlock(scope: !885, file: !3, line: 320, column: 13)
!985 = !DILocation(line: 320, column: 16, scope: !984)
!986 = !DILocation(line: 320, column: 13, scope: !885)
!987 = !DILocation(line: 321, column: 13, scope: !988)
!988 = distinct !DILexicalBlock(scope: !984, file: !3, line: 320, column: 30)
!989 = !DILocation(line: 241, column: 5, scope: !886)
!990 = !DILocation(line: 327, column: 8, scope: !6)
!991 = !DILocation(line: 327, column: 5, scope: !6)
!992 = !DILocation(line: 331, column: 9, scope: !993)
!993 = distinct !DILexicalBlock(scope: !6, file: !3, line: 331, column: 9)
!994 = !DILocation(line: 331, column: 9, scope: !6)
!995 = !DILocation(line: 332, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 332, column: 13)
!997 = distinct !DILexicalBlock(scope: !993, file: !3, line: 331, column: 19)
!998 = !DILocation(line: 332, column: 17, scope: !996)
!999 = !DILocation(line: 332, column: 28, scope: !996)
!1000 = !DILocation(line: 332, column: 36, scope: !996)
!1001 = !DILocation(line: 332, column: 13, scope: !997)
!1002 = !DILocation(line: 333, column: 22, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !996, file: !3, line: 332, column: 43)
!1004 = !DILocation(line: 333, column: 26, scope: !1003)
!1005 = !DILocation(line: 333, column: 37, scope: !1003)
!1006 = !DILocation(line: 333, column: 45, scope: !1003)
!1007 = !DILocation(line: 333, column: 13, scope: !1003)
!1008 = !DILocation(line: 334, column: 9, scope: !1003)
!1009 = !DILocation(line: 336, column: 28, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !997, file: !3, line: 336, column: 13)
!1011 = !DILocation(line: 336, column: 13, scope: !1010)
!1012 = !DILocation(line: 336, column: 32, scope: !1010)
!1013 = !DILocation(line: 336, column: 13, scope: !997)
!1014 = !DILocation(line: 337, column: 13, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 337, column: 13)
!1016 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 336, column: 51)
!1017 = !DILocation(line: 337, column: 13, scope: !1016)
!1018 = !DILocation(line: 340, column: 16, scope: !1016)
!1019 = !DILocation(line: 341, column: 9, scope: !1016)
!1020 = !DILocation(line: 343, column: 25, scope: !997)
!1021 = !DILocation(line: 343, column: 9, scope: !997)
!1022 = !DILocation(line: 343, column: 13, scope: !997)
!1023 = !DILocation(line: 343, column: 23, scope: !997)
!1024 = !DILocation(line: 344, column: 5, scope: !997)
!1025 = !DILocation(line: 346, column: 9, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !6, file: !3, line: 346, column: 9)
!1027 = !DILocation(line: 346, column: 12, scope: !1026)
!1028 = !DILocation(line: 346, column: 9, scope: !6)
!1029 = !DILocation(line: 347, column: 9, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 346, column: 26)
!1031 = !DILocation(line: 350, column: 5, scope: !6)
!1032 = !DILocation(line: 351, column: 1, scope: !6)
!1033 = distinct !DISubprogram(name: "ngx_conf_log_error", scope: !3, file: !3, line: 985, type: !1034, isLocal: false, isDefinition: true, scopeLine: 987, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1038)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{null, !27, !11, !1036, !379, null}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !1037, line: 16, baseType: !70)
!1037 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1047, !1048, !1049}
!1039 = !DILocalVariable(name: "level", arg: 1, scope: !1033, file: !3, line: 985, type: !27)
!1040 = !DILocalVariable(name: "cf", arg: 2, scope: !1033, file: !3, line: 985, type: !11)
!1041 = !DILocalVariable(name: "err", arg: 3, scope: !1033, file: !3, line: 985, type: !1036)
!1042 = !DILocalVariable(name: "fmt", arg: 4, scope: !1033, file: !3, line: 986, type: !379)
!1043 = !DILocalVariable(name: "errstr", scope: !1033, file: !3, line: 988, type: !1044)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8192, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 1024)
!1047 = !DILocalVariable(name: "p", scope: !1033, file: !3, line: 988, type: !46)
!1048 = !DILocalVariable(name: "last", scope: !1033, file: !3, line: 988, type: !46)
!1049 = !DILocalVariable(name: "args", scope: !1033, file: !3, line: 989, type: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !30, line: 7, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 989, baseType: !1052)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 4)
!1055 = !DILocation(line: 985, column: 31, scope: !1033)
!1056 = !DILocation(line: 985, column: 50, scope: !1033)
!1057 = !DILocation(line: 985, column: 64, scope: !1033)
!1058 = !DILocation(line: 986, column: 17, scope: !1033)
!1059 = !DILocation(line: 988, column: 5, scope: !1033)
!1060 = !DILocation(line: 988, column: 14, scope: !1033)
!1061 = !DILocation(line: 988, column: 44, scope: !1033)
!1062 = !DILocation(line: 988, column: 48, scope: !1033)
!1063 = !DILocation(line: 989, column: 5, scope: !1033)
!1064 = !DILocation(line: 989, column: 14, scope: !1033)
!1065 = !DILocation(line: 991, column: 12, scope: !1033)
!1066 = !DILocation(line: 991, column: 19, scope: !1033)
!1067 = !DILocation(line: 991, column: 10, scope: !1033)
!1068 = !DILocation(line: 993, column: 5, scope: !1033)
!1069 = !DILocation(line: 994, column: 23, scope: !1033)
!1070 = !DILocation(line: 994, column: 31, scope: !1033)
!1071 = !DILocation(line: 994, column: 37, scope: !1033)
!1072 = !DILocation(line: 994, column: 42, scope: !1033)
!1073 = !DILocation(line: 994, column: 9, scope: !1033)
!1074 = !DILocation(line: 994, column: 7, scope: !1033)
!1075 = !DILocation(line: 995, column: 5, scope: !1033)
!1076 = !DILocation(line: 997, column: 9, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 997, column: 9)
!1078 = !DILocation(line: 997, column: 9, scope: !1033)
!1079 = !DILocation(line: 998, column: 27, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 997, column: 14)
!1081 = !DILocation(line: 998, column: 30, scope: !1080)
!1082 = !DILocation(line: 998, column: 36, scope: !1080)
!1083 = !DILocation(line: 998, column: 13, scope: !1080)
!1084 = !DILocation(line: 998, column: 11, scope: !1080)
!1085 = !DILocation(line: 999, column: 5, scope: !1080)
!1086 = !DILocation(line: 1001, column: 9, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1001, column: 9)
!1088 = !DILocation(line: 1001, column: 13, scope: !1087)
!1089 = !DILocation(line: 1001, column: 23, scope: !1087)
!1090 = !DILocation(line: 1001, column: 9, scope: !1033)
!1091 = !DILocation(line: 1002, column: 9, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 1002, column: 9)
!1093 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 1001, column: 32)
!1094 = !DILocation(line: 1002, column: 9, scope: !1093)
!1095 = !DILocation(line: 1003, column: 9, scope: !1093)
!1096 = !DILocation(line: 1006, column: 9, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1006, column: 9)
!1098 = !DILocation(line: 1006, column: 13, scope: !1097)
!1099 = !DILocation(line: 1006, column: 24, scope: !1097)
!1100 = !DILocation(line: 1006, column: 29, scope: !1097)
!1101 = !DILocation(line: 1006, column: 32, scope: !1097)
!1102 = !DILocation(line: 1006, column: 9, scope: !1033)
!1103 = !DILocation(line: 1007, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 1007, column: 9)
!1105 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 1006, column: 53)
!1106 = !DILocation(line: 1007, column: 9, scope: !1105)
!1107 = !DILocation(line: 1009, column: 9, scope: !1105)
!1108 = !DILocation(line: 1012, column: 5, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1012, column: 5)
!1110 = !DILocation(line: 1012, column: 5, scope: !1033)
!1111 = !DILocation(line: 1015, column: 1, scope: !1033)
!1112 = distinct !DISubprogram(name: "ngx_conf_add_dump", scope: !3, file: !3, line: 102, type: !1113, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1115)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!401, !11, !500}
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1122, !1123, !1130}
!1116 = !DILocalVariable(name: "cf", arg: 1, scope: !1112, file: !3, line: 102, type: !11)
!1117 = !DILocalVariable(name: "filename", arg: 2, scope: !1112, file: !3, line: 102, type: !500)
!1118 = !DILocalVariable(name: "size", scope: !1112, file: !3, line: 104, type: !69)
!1119 = !DILocalVariable(name: "p", scope: !1112, file: !3, line: 105, type: !46)
!1120 = !DILocalVariable(name: "hash", scope: !1112, file: !3, line: 106, type: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 191, baseType: !31)
!1122 = !DILocalVariable(name: "buf", scope: !1112, file: !3, line: 107, type: !62)
!1123 = !DILocalVariable(name: "sn", scope: !1112, file: !3, line: 108, type: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_node_t", file: !87, line: 218, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 215, size: 224, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1126, file: !87, line: 216, baseType: !436, size: 160)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1126, file: !87, line: 217, baseType: !86, size: 64, offset: 160)
!1130 = !DILocalVariable(name: "cd", scope: !1112, file: !3, line: 109, type: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_dump_t", file: !15, line: 109, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 106, size: 96, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1133, file: !15, line: 107, baseType: !86, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1133, file: !15, line: 108, baseType: !62, size: 32, offset: 64)
!1137 = !DILocation(line: 102, column: 31, scope: !1112)
!1138 = !DILocation(line: 102, column: 46, scope: !1112)
!1139 = !DILocation(line: 104, column: 5, scope: !1112)
!1140 = !DILocation(line: 104, column: 23, scope: !1112)
!1141 = !DILocation(line: 105, column: 5, scope: !1112)
!1142 = !DILocation(line: 105, column: 23, scope: !1112)
!1143 = !DILocation(line: 106, column: 5, scope: !1112)
!1144 = !DILocation(line: 106, column: 23, scope: !1112)
!1145 = !DILocation(line: 107, column: 5, scope: !1112)
!1146 = !DILocation(line: 107, column: 23, scope: !1112)
!1147 = !DILocation(line: 108, column: 5, scope: !1112)
!1148 = !DILocation(line: 108, column: 23, scope: !1112)
!1149 = !DILocation(line: 109, column: 5, scope: !1112)
!1150 = !DILocation(line: 109, column: 23, scope: !1112)
!1151 = !DILocation(line: 111, column: 27, scope: !1112)
!1152 = !DILocation(line: 111, column: 37, scope: !1112)
!1153 = !DILocation(line: 111, column: 43, scope: !1112)
!1154 = !DILocation(line: 111, column: 53, scope: !1112)
!1155 = !DILocation(line: 111, column: 12, scope: !1112)
!1156 = !DILocation(line: 111, column: 10, scope: !1112)
!1157 = !DILocation(line: 113, column: 33, scope: !1112)
!1158 = !DILocation(line: 113, column: 37, scope: !1112)
!1159 = !DILocation(line: 113, column: 44, scope: !1112)
!1160 = !DILocation(line: 113, column: 64, scope: !1112)
!1161 = !DILocation(line: 113, column: 74, scope: !1112)
!1162 = !DILocation(line: 113, column: 10, scope: !1112)
!1163 = !DILocation(line: 113, column: 8, scope: !1112)
!1164 = !DILocation(line: 115, column: 9, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 115, column: 9)
!1166 = !DILocation(line: 115, column: 9, scope: !1112)
!1167 = !DILocation(line: 116, column: 9, scope: !1168)
