; ModuleID = 'src/core/ngx_array.c'
source_filename = "src/core/ngx_array.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_array.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !7, line: 64, baseType: !8)
!7 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!12 = distinct !DISubprogram(name: "ngx_array_create", scope: !1, file: !1, line: 13, type: !13, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !208)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !31, !22, !28}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !17, line: 22, baseType: !18)
!17 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 16, size: 160, elements: !19)
!19 = !{!20, !21, !27, !29, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !18, file: !17, line: 17, baseType: !4, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !18, file: !17, line: 18, baseType: !22, size: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !23, line: 79, baseType: !24)
!23 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !25, line: 125, baseType: !26)
!25 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !18, file: !17, line: 19, baseType: !28, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !25, line: 120, baseType: !26)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !18, file: !17, line: 20, baseType: !22, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !18, file: !17, line: 21, baseType: !31, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !33, line: 18, baseType: !34)
!33 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !35, line: 57, size: 320, elements: !36)
!35 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = !{!37, !45, !46, !47, !188, !195, !207}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !34, file: !35, line: 58, baseType: !38, size: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !35, line: 54, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 49, size: 128, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !39, file: !35, line: 50, baseType: !5, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !39, file: !35, line: 51, baseType: !5, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !35, line: 52, baseType: !31, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !39, file: !35, line: 53, baseType: !22, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !34, file: !35, line: 59, baseType: !28, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !34, file: !35, line: 60, baseType: !31, size: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !34, file: !35, line: 61, baseType: !48, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !33, line: 19, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !51, line: 59, size: 64, elements: !52)
!51 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = !{!53, !187}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !50, file: !51, line: 60, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !51, line: 18, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !51, line: 20, size: 352, elements: !57)
!57 = !{!58, !59, !60, !63, !64, !65, !66, !68, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !56, file: !51, line: 21, baseType: !5, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !56, file: !51, line: 22, baseType: !5, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !56, file: !51, line: 23, baseType: !61, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !25, line: 222, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !56, file: !51, line: 24, baseType: !61, size: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !56, file: !51, line: 26, baseType: !5, size: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !56, file: !51, line: 27, baseType: !5, size: 32, offset: 160)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !56, file: !51, line: 28, baseType: !67, size: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !51, line: 16, baseType: !4)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !56, file: !51, line: 29, baseType: !69, size: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !33, line: 23, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !72, line: 16, size: 1216, elements: !73)
!72 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!73 = !{!74, !77, !84, !129, !130, !131, !172, !173}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !71, file: !72, line: 17, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !76, line: 16, baseType: !62)
!76 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 18, baseType: !78, size: 64, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !79, line: 19, baseType: !80)
!79 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 16, size: 64, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !80, file: !79, line: 17, baseType: !28, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !79, line: 18, baseType: !5, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !71, file: !72, line: 19, baseType: !85, size: 960, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !76, line: 17, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 4, size: 960, elements: !88)
!87 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!88 = !{!89, !91, !92, !94, !95, !97, !98, !100, !102, !104, !105, !106, !107, !108, !109, !112, !113, !115, !116, !122, !123, !124}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 6, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !25, line: 232, baseType: !26)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !86, file: !87, line: 7, baseType: !90, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 8, baseType: !93, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !25, line: 227, baseType: !26)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !86, file: !87, line: 9, baseType: !93, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !86, file: !87, line: 10, baseType: !96, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !25, line: 217, baseType: !26)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !86, file: !87, line: 11, baseType: !96, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !86, file: !87, line: 13, baseType: !99, size: 32, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !25, line: 212, baseType: !26)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !86, file: !87, line: 14, baseType: !101, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !25, line: 304, baseType: !26)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !86, file: !87, line: 15, baseType: !103, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !25, line: 309, baseType: !26)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !86, file: !87, line: 16, baseType: !26, size: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !86, file: !87, line: 17, baseType: !90, size: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !86, file: !87, line: 18, baseType: !90, size: 32, offset: 352)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !86, file: !87, line: 19, baseType: !61, size: 32, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !86, file: !87, line: 20, baseType: !61, size: 32, offset: 416)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !86, file: !87, line: 21, baseType: !110, size: 32, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !25, line: 237, baseType: !111)
!111 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !86, file: !87, line: 22, baseType: !110, size: 32, offset: 480)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !86, file: !87, line: 23, baseType: !114, size: 32, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !25, line: 242, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !86, file: !87, line: 24, baseType: !114, size: 32, offset: 544)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !86, file: !87, line: 26, baseType: !117, size: 64, offset: 576)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !25, line: 288, size: 64, elements: !118)
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !117, file: !25, line: 288, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !25, line: 75, baseType: !111)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !117, file: !25, line: 288, baseType: !111, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !86, file: !87, line: 27, baseType: !117, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !86, file: !87, line: 28, baseType: !117, size: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !86, file: !87, line: 29, baseType: !125, size: 192, offset: 768)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 192, elements: !127)
!126 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !71, file: !72, line: 21, baseType: !61, size: 32, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !71, file: !72, line: 22, baseType: !61, size: 32, offset: 1120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !71, file: !72, line: 24, baseType: !132, size: 32, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !33, line: 20, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !135, line: 50, size: 320, elements: !136)
!135 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!136 = !{!137, !138, !151, !155, !156, !161, !162, !167, !168, !171}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !134, file: !135, line: 51, baseType: !22, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !134, file: !135, line: 52, baseType: !139, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !33, line: 21, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !142, line: 89, size: 160, elements: !143)
!142 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!143 = !{!144, !145, !146, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !141, file: !142, line: 90, baseType: !75, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 91, baseType: !78, size: 64, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !141, file: !142, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !139, !132}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !142, line: 94, baseType: !4, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !134, file: !135, line: 54, baseType: !152, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !153, line: 98, baseType: !154)
!153 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!154 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !134, file: !135, line: 56, baseType: !120, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !134, file: !135, line: 58, baseType: !157, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !135, line: 45, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!5, !132, !5, !28}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !135, line: 59, baseType: !4, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !134, file: !135, line: 61, baseType: !163, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !135, line: 46, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !132, !22, !5, !28}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !134, file: !135, line: 62, baseType: !4, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !134, file: !135, line: 70, baseType: !169, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !135, line: 72, baseType: !132, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !71, file: !72, line: 37, baseType: !26, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !71, file: !72, line: 38, baseType: !26, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !56, file: !51, line: 30, baseType: !54, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !56, file: !51, line: 34, baseType: !26, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !56, file: !51, line: 40, baseType: !26, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !56, file: !51, line: 43, baseType: !26, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !56, file: !51, line: 45, baseType: !26, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !56, file: !51, line: 46, baseType: !26, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !56, file: !51, line: 47, baseType: !26, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !56, file: !51, line: 48, baseType: !26, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !56, file: !51, line: 49, baseType: !26, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !56, file: !51, line: 50, baseType: !26, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !56, file: !51, line: 52, baseType: !26, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !56, file: !51, line: 53, baseType: !26, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !56, file: !51, line: 55, baseType: !62, size: 32, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !51, line: 61, baseType: !48, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !34, file: !35, line: 62, baseType: !189, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !35, line: 41, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !35, line: 43, size: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !35, line: 44, baseType: !189, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !191, file: !35, line: 45, baseType: !4, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !34, file: !35, line: 63, baseType: !196, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !35, line: 32, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !35, line: 34, size: 96, elements: !199)
!199 = !{!200, !205, !206}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !198, file: !35, line: 35, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !35, line: 30, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !4}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !35, line: 36, baseType: !4, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !35, line: 37, baseType: !196, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !34, file: !35, line: 64, baseType: !132, size: 32, offset: 288)
!208 = !{!209, !210, !211, !212}
!209 = !DILocalVariable(name: "p", arg: 1, scope: !12, file: !1, line: 13, type: !31)
!210 = !DILocalVariable(name: "n", arg: 2, scope: !12, file: !1, line: 13, type: !22)
!211 = !DILocalVariable(name: "size", arg: 3, scope: !12, file: !1, line: 13, type: !28)
!212 = !DILocalVariable(name: "a", scope: !12, file: !1, line: 15, type: !15)
!213 = !{!214, !214, i64 0}
!214 = !{!"any pointer", !215, i64 0}
!215 = !{!"omnipotent char", !216, i64 0}
!216 = !{!"Simple C/C++ TBAA"}
!217 = !DIExpression()
!218 = !DILocation(line: 13, column: 30, scope: !12)
!219 = !{!220, !220, i64 0}
!220 = !{!"int", !215, i64 0}
!221 = !DILocation(line: 13, column: 44, scope: !12)
!222 = !DILocation(line: 13, column: 54, scope: !12)
!223 = !DILocation(line: 15, column: 5, scope: !12)
!224 = !DILocation(line: 15, column: 18, scope: !12)
!225 = !DILocation(line: 17, column: 20, scope: !12)
!226 = !DILocation(line: 17, column: 9, scope: !12)
!227 = !DILocation(line: 17, column: 7, scope: !12)
!228 = !DILocation(line: 18, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !12, file: !1, line: 18, column: 9)
!230 = !DILocation(line: 18, column: 11, scope: !229)
!231 = !DILocation(line: 18, column: 9, scope: !12)
!232 = !DILocation(line: 19, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !1, line: 18, column: 20)
!234 = !DILocation(line: 22, column: 24, scope: !235)
!235 = distinct !DILexicalBlock(scope: !12, file: !1, line: 22, column: 9)
!236 = !DILocation(line: 22, column: 27, scope: !235)
!237 = !DILocation(line: 22, column: 30, scope: !235)
!238 = !DILocation(line: 22, column: 33, scope: !235)
!239 = !DILocation(line: 22, column: 9, scope: !235)
!240 = !DILocation(line: 22, column: 39, scope: !235)
!241 = !DILocation(line: 22, column: 9, scope: !12)
!242 = !DILocation(line: 23, column: 9, scope: !243)
!243 = distinct !DILexicalBlock(scope: !235, file: !1, line: 22, column: 50)
!244 = !DILocation(line: 26, column: 12, scope: !12)
!245 = !DILocation(line: 26, column: 5, scope: !12)
!246 = !DILocation(line: 27, column: 1, scope: !12)
!247 = distinct !DISubprogram(name: "ngx_array_init", scope: !17, file: !17, line: 32, type: !248, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !252)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !15, !31, !22, !28}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !23, line: 78, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !25, line: 140, baseType: !62)
!252 = !{!253, !254, !255, !256}
!253 = !DILocalVariable(name: "array", arg: 1, scope: !247, file: !17, line: 32, type: !15)
!254 = !DILocalVariable(name: "pool", arg: 2, scope: !247, file: !17, line: 32, type: !31)
!255 = !DILocalVariable(name: "n", arg: 3, scope: !247, file: !17, line: 32, type: !22)
!256 = !DILocalVariable(name: "size", arg: 4, scope: !247, file: !17, line: 32, type: !28)
!257 = !DILocation(line: 32, column: 29, scope: !247)
!258 = !DILocation(line: 32, column: 48, scope: !247)
!259 = !DILocation(line: 32, column: 65, scope: !247)
!260 = !DILocation(line: 32, column: 75, scope: !247)
!261 = !DILocation(line: 39, column: 5, scope: !247)
!262 = !DILocation(line: 39, column: 12, scope: !247)
!263 = !DILocation(line: 39, column: 18, scope: !247)
!264 = !{!265, !220, i64 4}
!265 = !{!"", !214, i64 0, !220, i64 4, !220, i64 8, !220, i64 12, !214, i64 16}
!266 = !DILocation(line: 40, column: 19, scope: !247)
!267 = !DILocation(line: 40, column: 5, scope: !247)
!268 = !DILocation(line: 40, column: 12, scope: !247)
!269 = !DILocation(line: 40, column: 17, scope: !247)
!270 = !{!265, !220, i64 8}
!271 = !DILocation(line: 41, column: 21, scope: !247)
!272 = !DILocation(line: 41, column: 5, scope: !247)
!273 = !DILocation(line: 41, column: 12, scope: !247)
