; ModuleID = 'src/core/ngx_proxy_protocol.c'
source_filename = "src/core/ngx_proxy_protocol.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_connection_s = type { i8*, %struct.ngx_event_s*, %struct.ngx_event_s*, i32, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, i8*, i32)*, i32 (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, %struct.ngx_chain_s* (%struct.ngx_connection_s*, %struct.ngx_chain_s*, i32)*, %struct.ngx_listening_s*, i32, %struct.ngx_log_s*, %struct.ngx_pool_s*, i32, %struct.sockaddr*, i32, %struct.ngx_str_t, %struct.ngx_str_t, i16, %struct.sockaddr*, i32, %struct.ngx_buf_s*, %struct.ngx_queue_s, i32, i32, i32 }
%struct.ngx_event_s = type opaque
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_listening_s = type { i32, %struct.sockaddr*, i32, i32, %struct.ngx_str_t, i32, i32, i32, i32, void (%struct.ngx_connection_s*)*, i8*, %struct.ngx_log_s, %struct.ngx_log_s*, i32, i32, i32, %struct.ngx_listening_s*, %struct.ngx_connection_s*, i32, i24 }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_proxy_protocol.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !7, !8, !13, !16, !18}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !9, line: 12, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 186, baseType: !12)
!11 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !14, line: 64, baseType: !15)
!14 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 120, baseType: !17)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!19 = !{i32 2, !"Dwarf Version", i32 4}
!20 = !{i32 2, !"Debug Info Version", i32 3}
!21 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!22 = distinct !DISubprogram(name: "ngx_proxy_protocol_read", scope: !1, file: !1, line: 13, type: !23, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !334)
!23 = !DISubroutineType(types: !24)
!24 = !{!18, !25, !18, !18}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !27, line: 26, baseType: !28)
!27 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !29, line: 121, size: 896, elements: !30)
!29 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!30 = !{!31, !32, !36, !37, !41, !48, !50, !196, !201, !262, !263, !264, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !28, file: !29, line: 122, baseType: !7, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !28, file: !29, line: 123, baseType: !33, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !27, line: 24, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !27, line: 24, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !28, file: !29, line: 124, baseType: !33, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !28, file: !29, line: 126, baseType: !38, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !39, line: 17, baseType: !40)
!39 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !28, file: !29, line: 128, baseType: !42, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !43, line: 19, baseType: !44)
!43 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !25, !18, !16}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !11, line: 135, baseType: !40)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !28, file: !29, line: 129, baseType: !49, size: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !43, line: 22, baseType: !44)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !28, file: !29, line: 130, baseType: !51, size: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !43, line: 20, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!47, !25, !55, !68}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !27, line: 19, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !58, line: 59, size: 64, elements: !59)
!58 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!59 = !{!60, !195}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !57, file: !58, line: 60, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !58, line: 18, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !58, line: 20, size: 352, elements: !64)
!64 = !{!65, !66, !67, !69, !70, !71, !72, !74, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !63, file: !58, line: 21, baseType: !18, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !63, file: !58, line: 22, baseType: !18, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !63, file: !58, line: 23, baseType: !68, size: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !11, line: 222, baseType: !40)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !63, file: !58, line: 24, baseType: !68, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !63, file: !58, line: 26, baseType: !18, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !63, file: !58, line: 27, baseType: !18, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !63, file: !58, line: 28, baseType: !73, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !58, line: 16, baseType: !7)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !63, file: !58, line: 29, baseType: !75, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !27, line: 23, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !78, line: 16, size: 1216, elements: !79)
!78 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!79 = !{!80, !83, !90, !135, !136, !137, !180, !181}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !77, file: !78, line: 17, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !82, line: 16, baseType: !40)
!82 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !78, line: 18, baseType: !84, size: 64, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !85, line: 19, baseType: !86)
!85 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 16, size: 64, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !86, file: !85, line: 17, baseType: !16, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !85, line: 18, baseType: !18, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !77, file: !78, line: 19, baseType: !91, size: 960, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !82, line: 17, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !93, line: 4, size: 960, elements: !94)
!93 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!94 = !{!95, !97, !98, !100, !101, !103, !104, !106, !108, !110, !111, !112, !113, !114, !115, !118, !119, !121, !122, !128, !129, !130}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !92, file: !93, line: 6, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !11, line: 232, baseType: !17)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !92, file: !93, line: 7, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !92, file: !93, line: 8, baseType: !99, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !11, line: 227, baseType: !17)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !92, file: !93, line: 9, baseType: !99, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !92, file: !93, line: 10, baseType: !102, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !11, line: 217, baseType: !17)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !92, file: !93, line: 11, baseType: !102, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !92, file: !93, line: 13, baseType: !105, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !11, line: 212, baseType: !17)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !92, file: !93, line: 14, baseType: !107, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !11, line: 304, baseType: !17)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !92, file: !93, line: 15, baseType: !109, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !11, line: 309, baseType: !17)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !92, file: !93, line: 16, baseType: !17, size: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !92, file: !93, line: 17, baseType: !96, size: 32, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !92, file: !93, line: 18, baseType: !96, size: 32, offset: 352)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !92, file: !93, line: 19, baseType: !68, size: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !92, file: !93, line: 20, baseType: !68, size: 32, offset: 416)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !92, file: !93, line: 21, baseType: !116, size: 32, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !11, line: 237, baseType: !117)
!117 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !92, file: !93, line: 22, baseType: !116, size: 32, offset: 480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !92, file: !93, line: 23, baseType: !120, size: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !11, line: 242, baseType: !40)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !92, file: !93, line: 24, baseType: !120, size: 32, offset: 544)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !92, file: !93, line: 26, baseType: !123, size: 64, offset: 576)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !11, line: 288, size: 64, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !123, file: !11, line: 288, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !11, line: 75, baseType: !117)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !123, file: !11, line: 288, baseType: !117, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !92, file: !93, line: 27, baseType: !123, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !92, file: !93, line: 28, baseType: !123, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !92, file: !93, line: 29, baseType: !131, size: 192, offset: 768)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !133)
!132 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!133 = !{!134}
!134 = !DISubrange(count: 3)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !77, file: !78, line: 21, baseType: !68, size: 32, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !77, file: !78, line: 22, baseType: !68, size: 32, offset: 1120)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !77, file: !78, line: 24, baseType: !138, size: 32, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !27, line: 20, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !141, line: 50, size: 320, elements: !142)
!141 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!142 = !{!143, !147, !160, !164, !165, !170, !171, !176, !177, !179}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !140, file: !141, line: 51, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !145, line: 79, baseType: !146)
!145 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !11, line: 125, baseType: !17)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !140, file: !141, line: 52, baseType: !148, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !27, line: 21, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !151, line: 89, size: 160, elements: !152)
!151 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!152 = !{!153, !154, !155, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !150, file: !151, line: 90, baseType: !81, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !151, line: 91, baseType: !84, size: 64, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !150, file: !151, line: 93, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !148, !138}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !151, line: 94, baseType: !7, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !140, file: !141, line: 54, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !162, line: 98, baseType: !163)
!162 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!163 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !140, file: !141, line: 56, baseType: !126, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !140, file: !141, line: 58, baseType: !166, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !141, line: 45, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{!18, !138, !18, !16}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 59, baseType: !7, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !140, file: !141, line: 61, baseType: !172, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !141, line: 46, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !138, !144, !18, !16}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !140, file: !141, line: 62, baseType: !7, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !140, file: !141, line: 70, baseType: !178, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !141, line: 72, baseType: !138, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !77, file: !78, line: 37, baseType: !17, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !77, file: !78, line: 38, baseType: !17, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !63, file: !58, line: 30, baseType: !61, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !63, file: !58, line: 34, baseType: !17, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !63, file: !58, line: 40, baseType: !17, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !63, file: !58, line: 43, baseType: !17, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !63, file: !58, line: 45, baseType: !17, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !63, file: !58, line: 46, baseType: !17, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !63, file: !58, line: 47, baseType: !17, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !63, file: !58, line: 48, baseType: !17, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !63, file: !58, line: 49, baseType: !17, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !63, file: !58, line: 50, baseType: !17, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !63, file: !58, line: 52, baseType: !17, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !63, file: !58, line: 53, baseType: !17, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !63, file: !58, line: 55, baseType: !40, size: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !58, line: 61, baseType: !55, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !28, file: !29, line: 131, baseType: !197, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !43, line: 23, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!55, !25, !55, !68}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !28, file: !29, line: 133, baseType: !202, size: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !29, line: 16, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !29, line: 18, size: 960, elements: !205)
!205 = !{!206, !207, !218, !220, !221, !222, !223, !224, !225, !226, !231, !232, !233, !234, !235, !236, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !204, file: !29, line: 19, baseType: !38, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !204, file: !29, line: 21, baseType: !208, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !210, line: 297, size: 128, elements: !211)
!210 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !209, file: !210, line: 298, baseType: !213, size: 16)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !11, line: 409, baseType: !12)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !209, file: !210, line: 299, baseType: !215, size: 112, offset: 16)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 112, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 14)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !204, file: !29, line: 22, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !11, line: 404, baseType: !17)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !204, file: !29, line: 23, baseType: !16, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !204, file: !29, line: 24, baseType: !84, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !29, line: 26, baseType: !40, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !204, file: !29, line: 28, baseType: !40, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !204, file: !29, line: 29, baseType: !40, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !204, file: !29, line: 30, baseType: !40, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !204, file: !29, line: 38, baseType: !227, size: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !27, line: 32, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !25}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !204, file: !29, line: 40, baseType: !7, size: 32, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !204, file: !29, line: 42, baseType: !139, size: 320, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !204, file: !29, line: 43, baseType: !138, size: 32, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !204, file: !29, line: 45, baseType: !16, size: 32, offset: 736)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !204, file: !29, line: 47, baseType: !16, size: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !204, file: !29, line: 49, baseType: !237, size: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !238, line: 16, baseType: !239)
!238 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !240, line: 16, baseType: !144)
!240 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !204, file: !29, line: 51, baseType: !202, size: 32, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !204, file: !29, line: 52, baseType: !25, size: 32, offset: 864)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !204, file: !29, line: 54, baseType: !144, size: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !204, file: !29, line: 56, baseType: !17, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !204, file: !29, line: 57, baseType: !17, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !204, file: !29, line: 58, baseType: !17, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !204, file: !29, line: 60, baseType: !17, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !204, file: !29, line: 61, baseType: !17, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !204, file: !29, line: 62, baseType: !17, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !204, file: !29, line: 63, baseType: !17, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !204, file: !29, line: 64, baseType: !17, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !204, file: !29, line: 65, baseType: !17, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !204, file: !29, line: 66, baseType: !17, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !204, file: !29, line: 67, baseType: !17, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !204, file: !29, line: 70, baseType: !17, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !204, file: !29, line: 72, baseType: !17, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !204, file: !29, line: 73, baseType: !17, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !204, file: !29, line: 74, baseType: !17, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !204, file: !29, line: 76, baseType: !17, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !204, file: !29, line: 77, baseType: !17, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !204, file: !29, line: 78, baseType: !17, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !28, file: !29, line: 135, baseType: !68, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !28, file: !29, line: 137, baseType: !138, size: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !28, file: !29, line: 139, baseType: !265, size: 32, offset: 352)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !27, line: 18, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !268, line: 57, size: 320, elements: !269)
!268 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!269 = !{!270, !278, !279, !280, !281, !288, !300}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !267, file: !268, line: 58, baseType: !271, size: 128)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !268, line: 54, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !268, line: 49, size: 128, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !272, file: !268, line: 50, baseType: !18, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !272, file: !268, line: 51, baseType: !18, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !268, line: 52, baseType: !265, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !272, file: !268, line: 53, baseType: !144, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !267, file: !268, line: 59, baseType: !16, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !267, file: !268, line: 60, baseType: !265, size: 32, offset: 160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !267, file: !268, line: 61, baseType: !55, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !267, file: !268, line: 62, baseType: !282, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !268, line: 41, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !268, line: 43, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !268, line: 44, baseType: !282, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !284, file: !268, line: 45, baseType: !7, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !267, file: !268, line: 63, baseType: !289, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !268, line: 32, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !268, line: 34, size: 96, elements: !292)
!292 = !{!293, !298, !299}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !291, file: !268, line: 35, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !268, line: 30, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !7}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !268, line: 36, baseType: !7, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !268, line: 37, baseType: !289, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !267, file: !268, line: 64, baseType: !138, size: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !28, file: !29, line: 141, baseType: !40, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !28, file: !29, line: 143, baseType: !208, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !28, file: !29, line: 144, baseType: !219, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !28, file: !29, line: 145, baseType: !84, size: 64, offset: 480)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !28, file: !29, line: 147, baseType: !84, size: 64, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !28, file: !29, line: 148, baseType: !8, size: 16, offset: 608)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !28, file: !29, line: 154, baseType: !208, size: 32, offset: 640)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !28, file: !29, line: 155, baseType: !219, size: 32, offset: 672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !28, file: !29, line: 157, baseType: !61, size: 32, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !28, file: !29, line: 159, baseType: !311, size: 64, offset: 736)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !312, line: 16, baseType: !313)
!312 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !312, line: 18, size: 64, elements: !314)
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !312, line: 19, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !312, line: 20, baseType: !316, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !28, file: !29, line: 161, baseType: !161, size: 32, offset: 800)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !28, file: !29, line: 163, baseType: !144, size: 32, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !28, file: !29, line: 165, baseType: !17, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !28, file: !29, line: 167, baseType: !17, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !28, file: !29, line: 169, baseType: !17, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !28, file: !29, line: 170, baseType: !17, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !28, file: !29, line: 171, baseType: !17, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !28, file: !29, line: 173, baseType: !17, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !28, file: !29, line: 174, baseType: !17, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !28, file: !29, line: 175, baseType: !17, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !28, file: !29, line: 176, baseType: !17, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !28, file: !29, line: 178, baseType: !17, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !28, file: !29, line: 179, baseType: !17, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !28, file: !29, line: 180, baseType: !17, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !28, file: !29, line: 181, baseType: !17, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !28, file: !29, line: 183, baseType: !17, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343}
!335 = !DILocalVariable(name: "c", arg: 1, scope: !22, file: !1, line: 13, type: !25)
!336 = !DILocalVariable(name: "buf", arg: 2, scope: !22, file: !1, line: 13, type: !18)
!337 = !DILocalVariable(name: "last", arg: 3, scope: !22, file: !1, line: 13, type: !18)
!338 = !DILocalVariable(name: "len", scope: !22, file: !1, line: 15, type: !16)
!339 = !DILocalVariable(name: "ch", scope: !22, file: !1, line: 16, type: !13)
!340 = !DILocalVariable(name: "p", scope: !22, file: !1, line: 16, type: !18)
!341 = !DILocalVariable(name: "addr", scope: !22, file: !1, line: 16, type: !18)
!342 = !DILocalVariable(name: "port", scope: !22, file: !1, line: 16, type: !18)
!343 = !DILocalVariable(name: "n", scope: !22, file: !1, line: 17, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !145, line: 78, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !11, line: 140, baseType: !40)
!346 = !{!347, !347, i64 0}
!347 = !{!"any pointer", !348, i64 0}
!348 = !{!"omnipotent char", !349, i64 0}
!349 = !{!"Simple C/C++ TBAA"}
!350 = !DIExpression()
!351 = !DILocation(line: 13, column: 43, scope: !22)
!352 = !DILocation(line: 13, column: 54, scope: !22)
!353 = !DILocation(line: 13, column: 67, scope: !22)
!354 = !DILocation(line: 15, column: 5, scope: !22)
!355 = !DILocation(line: 15, column: 16, scope: !22)
!356 = !DILocation(line: 16, column: 5, scope: !22)
!357 = !DILocation(line: 16, column: 16, scope: !22)
!358 = !DILocation(line: 16, column: 21, scope: !22)
!359 = !DILocation(line: 16, column: 25, scope: !22)
!360 = !DILocation(line: 16, column: 32, scope: !22)
!361 = !DILocation(line: 17, column: 5, scope: !22)
!362 = !DILocation(line: 17, column: 16, scope: !22)
!363 = !DILocation(line: 19, column: 9, scope: !22)
!364 = !DILocation(line: 19, column: 7, scope: !22)
!365 = !DILocation(line: 20, column: 11, scope: !22)
!366 = !DILocation(line: 20, column: 18, scope: !22)
!367 = !DILocation(line: 20, column: 16, scope: !22)
!368 = !DILocation(line: 20, column: 9, scope: !22)
!369 = !{!370, !370, i64 0}
!370 = !{!"int", !348, i64 0}
!371 = !DILocation(line: 22, column: 9, scope: !372)
!372 = distinct !DILexicalBlock(scope: !22, file: !1, line: 22, column: 9)
!373 = !DILocation(line: 22, column: 13, scope: !372)
!374 = !DILocation(line: 22, column: 17, scope: !372)
!375 = !DILocation(line: 22, column: 20, scope: !372)
!376 = !DILocation(line: 22, column: 48, scope: !372)
!377 = !DILocation(line: 22, column: 9, scope: !22)
!378 = !DILocation(line: 23, column: 9, scope: !379)
!379 = distinct !DILexicalBlock(scope: !372, file: !1, line: 22, column: 54)
!380 = !DILocation(line: 26, column: 7, scope: !22)
!381 = !DILocation(line: 27, column: 9, scope: !22)
!382 = !DILocation(line: 29, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !22, file: !1, line: 29, column: 9)
!384 = !DILocation(line: 29, column: 13, scope: !383)
!385 = !DILocation(line: 29, column: 18, scope: !383)
!386 = !DILocation(line: 29, column: 21, scope: !383)
!387 = !DILocation(line: 29, column: 50, scope: !383)
!388 = !DILocation(line: 29, column: 9, scope: !22)
!389 = !DILocation(line: 32, column: 11, scope: !390)
!390 = distinct !DILexicalBlock(scope: !383, file: !1, line: 29, column: 56)
!391 = !DILocation(line: 33, column: 9, scope: !390)
!392 = !DILocation(line: 36, column: 9, scope: !393)
!393 = distinct !DILexicalBlock(scope: !22, file: !1, line: 36, column: 9)
!394 = !DILocation(line: 36, column: 13, scope: !393)
!395 = !DILocation(line: 36, column: 17, scope: !393)
!396 = !DILocation(line: 36, column: 20, scope: !393)
!397 = !DILocation(line: 36, column: 45, scope: !393)
!398 = !DILocation(line: 37, column: 9, scope: !393)
!399 = !DILocation(line: 37, column: 13, scope: !393)
