; ModuleID = 'src/core/ngx_syslog.c'
source_filename = "src/core/ngx_syslog.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "facilities", scope: !2, file: !3, line: 23, type: !138, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !22)
!3 = !DIFile(filename: "src/core/ngx_syslog.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !11, !12, !16, !19, !18, !13}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !7, line: 79, baseType: !8)
!7 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !9, line: 125, baseType: !10)
!9 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !14, line: 64, baseType: !15)
!14 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !17, line: 17, baseType: !18)
!17 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!0, !23, !29, !136}
!23 = !DIGlobalVariableExpression(var: !24)
!24 = distinct !DIGlobalVariable(name: "severities", scope: !2, file: !3, line: 31, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 288, elements: !27)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!27 = !{!28}
!28 = !DISubrange(count: 9)
!29 = !DIGlobalVariableExpression(var: !30)
!30 = distinct !DIGlobalVariable(name: "ngx_syslog_dummy_event", scope: !2, file: !3, line: 36, type: !31, isLocal: true, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !32, line: 24, baseType: !33)
!32 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !34, line: 30, size: 384, elements: !35)
!34 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !64, !65, !115, !128}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !34, line: 31, baseType: !11, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !33, file: !34, line: 33, baseType: !10, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !33, file: !34, line: 35, baseType: !10, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !33, file: !34, line: 38, baseType: !10, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !33, file: !34, line: 44, baseType: !10, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !33, file: !34, line: 46, baseType: !10, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !33, file: !34, line: 49, baseType: !10, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !33, file: !34, line: 51, baseType: !10, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !33, file: !34, line: 54, baseType: !10, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !33, file: !34, line: 56, baseType: !10, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !33, file: !34, line: 57, baseType: !10, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !33, file: !34, line: 59, baseType: !10, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !33, file: !34, line: 60, baseType: !10, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !33, file: !34, line: 62, baseType: !10, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !33, file: !34, line: 64, baseType: !10, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !33, file: !34, line: 67, baseType: !10, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !33, file: !34, line: 69, baseType: !10, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !33, file: !34, line: 71, baseType: !10, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !33, file: !34, line: 74, baseType: !10, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !33, file: !34, line: 75, baseType: !10, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !33, file: !34, line: 77, baseType: !10, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !33, file: !34, line: 107, baseType: !10, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !33, file: !34, line: 110, baseType: !59, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !32, line: 31, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !33, file: !34, line: 117, baseType: !6, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !33, file: !34, line: 119, baseType: !66, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !32, line: 20, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !69, line: 50, size: 320, elements: !70)
!69 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!70 = !{!71, !72, !94, !98, !101, !106, !107, !112, !113, !114}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !68, file: !69, line: 51, baseType: !6, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !68, file: !69, line: 52, baseType: !73, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !32, line: 21, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !76, line: 89, size: 160, elements: !77)
!76 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!77 = !{!78, !81, !89, !93}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !75, file: !76, line: 90, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !80, line: 16, baseType: !18)
!80 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !75, file: !76, line: 91, baseType: !82, size: 64, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !83, line: 19, baseType: !84)
!83 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 16, size: 64, elements: !85)
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !83, line: 17, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !9, line: 120, baseType: !10)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !83, line: 18, baseType: !12, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !75, file: !76, line: 93, baseType: !90, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !73, !66}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !76, line: 94, baseType: !11, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !68, file: !69, line: 54, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !96, line: 98, baseType: !97)
!96 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!97 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !68, file: !69, line: 56, baseType: !99, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !9, line: 75, baseType: !100)
!100 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !68, file: !69, line: 58, baseType: !102, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !69, line: 45, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DISubroutineType(types: !105)
!105 = !{!12, !66, !12, !87}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !69, line: 59, baseType: !11, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !68, file: !69, line: 61, baseType: !108, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !69, line: 46, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !66, !6, !12, !87}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !68, file: !69, line: 62, baseType: !11, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !68, file: !69, line: 70, baseType: !26, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !69, line: 72, baseType: !66, size: 32, offset: 288)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !33, file: !34, line: 121, baseType: !116, size: 160, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !117, line: 20, baseType: !118)
!117 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !117, line: 22, size: 160, elements: !119)
!119 = !{!120, !122, !124, !125, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !118, file: !117, line: 23, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !117, line: 16, baseType: !6)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !118, file: !117, line: 24, baseType: !123, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !118, file: !117, line: 25, baseType: !123, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !118, file: !117, line: 26, baseType: !123, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !118, file: !117, line: 27, baseType: !13, size: 8, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !117, line: 28, baseType: !13, size: 8, offset: 136)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !33, file: !34, line: 124, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !130, line: 16, baseType: !131)
!130 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !130, line: 18, size: 64, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !131, file: !130, line: 19, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !130, line: 20, baseType: !134, size: 32, offset: 32)
!136 = !DIGlobalVariableExpression(var: !137)
!137 = distinct !DIGlobalVariable(name: "ngx_syslog_dummy_log", scope: !2, file: !3, line: 35, type: !67, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 800, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 25)
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!144 = distinct !DISubprogram(name: "ngx_syslog_process_conf", scope: !3, file: !3, line: 40, type: !145, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !569)
!145 = !DISubroutineType(types: !146)
!146 = !{!26, !147, !549}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !32, line: 16, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !76, line: 116, size: 384, elements: !150)
!150 = !{!151, !152, !288, !531, !532, !533, !542, !543, !544, !545, !546, !548}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !76, line: 117, baseType: !26, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !149, file: !76, line: 118, baseType: !153, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !155, line: 22, baseType: !156)
!155 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 16, size: 160, elements: !157)
!157 = !{!158, !159, !160, !161, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !156, file: !155, line: 17, baseType: !11, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !156, file: !155, line: 18, baseType: !6, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !155, line: 19, baseType: !87, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !156, file: !155, line: 20, baseType: !6, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !156, file: !155, line: 21, baseType: !163, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !32, line: 18, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !166, line: 57, size: 320, elements: !167)
!166 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!167 = !{!168, !176, !177, !178, !268, !275, !287}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !165, file: !166, line: 58, baseType: !169, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !166, line: 54, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 49, size: 128, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !170, file: !166, line: 50, baseType: !12, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !170, file: !166, line: 51, baseType: !12, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !166, line: 52, baseType: !163, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !170, file: !166, line: 53, baseType: !6, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !165, file: !166, line: 59, baseType: !87, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !165, file: !166, line: 60, baseType: !163, size: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !165, file: !166, line: 61, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !32, line: 19, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !182, line: 59, size: 64, elements: !183)
!182 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!183 = !{!184, !267}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !181, file: !182, line: 60, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !182, line: 18, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !182, line: 20, size: 352, elements: !188)
!188 = !{!189, !190, !191, !193, !194, !195, !196, !198, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !187, file: !182, line: 21, baseType: !12, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !187, file: !182, line: 22, baseType: !12, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !187, file: !182, line: 23, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !9, line: 222, baseType: !18)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !187, file: !182, line: 24, baseType: !192, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !187, file: !182, line: 26, baseType: !12, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !187, file: !182, line: 27, baseType: !12, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !187, file: !182, line: 28, baseType: !197, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !182, line: 16, baseType: !11)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !187, file: !182, line: 29, baseType: !199, size: 32, offset: 224)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !32, line: 23, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !202, line: 16, size: 1216, elements: !203)
!202 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!203 = !{!204, !205, !206, !249, !250, !251, !252, !253}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !201, file: !202, line: 17, baseType: !79, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !202, line: 18, baseType: !82, size: 64, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !201, file: !202, line: 19, baseType: !207, size: 960, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !80, line: 17, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !209, line: 4, size: 960, elements: !210)
!209 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!210 = !{!211, !213, !214, !216, !217, !219, !220, !222, !224, !226, !227, !228, !229, !230, !231, !233, !234, !236, !237, !242, !243, !244}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !208, file: !209, line: 6, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !9, line: 232, baseType: !10)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !208, file: !209, line: 7, baseType: !212, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !208, file: !209, line: 8, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !9, line: 227, baseType: !10)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !208, file: !209, line: 9, baseType: !215, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !208, file: !209, line: 10, baseType: !218, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !9, line: 217, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !208, file: !209, line: 11, baseType: !218, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !208, file: !209, line: 13, baseType: !221, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !9, line: 212, baseType: !10)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !208, file: !209, line: 14, baseType: !223, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !9, line: 304, baseType: !10)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !208, file: !209, line: 15, baseType: !225, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !9, line: 309, baseType: !10)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !208, file: !209, line: 16, baseType: !10, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !208, file: !209, line: 17, baseType: !212, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !208, file: !209, line: 18, baseType: !212, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !208, file: !209, line: 19, baseType: !192, size: 32, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !208, file: !209, line: 20, baseType: !192, size: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !208, file: !209, line: 21, baseType: !232, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !9, line: 237, baseType: !100)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !208, file: !209, line: 22, baseType: !232, size: 32, offset: 480)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !208, file: !209, line: 23, baseType: !235, size: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !9, line: 242, baseType: !18)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !208, file: !209, line: 24, baseType: !235, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !208, file: !209, line: 26, baseType: !238, size: 64, offset: 576)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !9, line: 288, size: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !238, file: !9, line: 288, baseType: !99, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !238, file: !9, line: 288, baseType: !100, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !208, file: !209, line: 27, baseType: !238, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !208, file: !209, line: 28, baseType: !238, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !208, file: !209, line: 29, baseType: !245, size: 192, offset: 768)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 192, elements: !247)
!246 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!247 = !{!248}
!248 = !DISubrange(count: 3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !201, file: !202, line: 21, baseType: !192, size: 32, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !201, file: !202, line: 22, baseType: !192, size: 32, offset: 1120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !201, file: !202, line: 24, baseType: !66, size: 32, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !201, file: !202, line: 37, baseType: !10, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !201, file: !202, line: 38, baseType: !10, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !187, file: !182, line: 30, baseType: !185, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !187, file: !182, line: 34, baseType: !10, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !187, file: !182, line: 40, baseType: !10, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !187, file: !182, line: 43, baseType: !10, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !187, file: !182, line: 45, baseType: !10, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !187, file: !182, line: 46, baseType: !10, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !187, file: !182, line: 47, baseType: !10, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !187, file: !182, line: 48, baseType: !10, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !187, file: !182, line: 49, baseType: !10, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !187, file: !182, line: 50, baseType: !10, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !187, file: !182, line: 52, baseType: !10, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !187, file: !182, line: 53, baseType: !10, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !187, file: !182, line: 55, baseType: !18, size: 32, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !182, line: 61, baseType: !179, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !165, file: !166, line: 62, baseType: !269, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !166, line: 41, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !166, line: 43, size: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !166, line: 44, baseType: !269, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !271, file: !166, line: 45, baseType: !11, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !165, file: !166, line: 63, baseType: !276, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !166, line: 32, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !166, line: 34, size: 96, elements: !279)
!279 = !{!280, !285, !286}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !278, file: !166, line: 35, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !166, line: 30, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !11}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !166, line: 36, baseType: !11, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !166, line: 37, baseType: !276, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !165, file: !166, line: 64, baseType: !66, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !149, file: !76, line: 120, baseType: !289, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !32, line: 17, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !292, line: 38, size: 2496, elements: !293)
!292 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!293 = !{!294, !298, !299, !300, !301, !302, !424, !425, !426, !482, !483, !484, !485, !486, !487, !488, !489, !500, !501, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !291, file: !292, line: 39, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !291, file: !292, line: 40, baseType: !163, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !291, file: !292, line: 42, baseType: !66, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !291, file: !292, line: 43, baseType: !67, size: 320, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !291, file: !292, line: 45, baseType: !6, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !291, file: !292, line: 47, baseType: !303, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !32, line: 26, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !307, line: 121, size: 896, elements: !308)
!307 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!308 = !{!309, !310, !311, !312, !313, !320, !322, !327, !332, !392, !393, !394, !395, !396, !397, !398, !399, !400, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !307, line: 122, baseType: !11, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !306, file: !307, line: 123, baseType: !63, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !306, file: !307, line: 124, baseType: !63, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !306, file: !307, line: 126, baseType: !16, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !306, file: !307, line: 128, baseType: !314, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !315, line: 19, baseType: !316)
!315 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !304, !12, !87}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !9, line: 135, baseType: !18)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !306, file: !307, line: 129, baseType: !321, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !315, line: 22, baseType: !316)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !306, file: !307, line: 130, baseType: !323, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !315, line: 20, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{!319, !304, !179, !192}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !306, file: !307, line: 131, baseType: !328, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !315, line: 23, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!179, !304, !179, !192}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !306, file: !307, line: 133, baseType: !333, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !307, line: 16, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !307, line: 18, size: 960, elements: !336)
!336 = !{!337, !338, !350, !352, !353, !354, !355, !356, !357, !358, !363, !364, !365, !366, !367, !368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !335, file: !307, line: 19, baseType: !16, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !335, file: !307, line: 21, baseType: !339, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !341, line: 297, size: 128, elements: !342)
!341 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !{!343, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !340, file: !341, line: 298, baseType: !344, size: 16)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !9, line: 409, baseType: !345)
!345 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !340, file: !341, line: 299, baseType: !347, size: 112, offset: 16)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 112, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 14)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !335, file: !307, line: 22, baseType: !351, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !9, line: 404, baseType: !10)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !335, file: !307, line: 23, baseType: !87, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !335, file: !307, line: 24, baseType: !82, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !307, line: 26, baseType: !18, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !335, file: !307, line: 28, baseType: !18, size: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !335, file: !307, line: 29, baseType: !18, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !335, file: !307, line: 30, baseType: !18, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !335, file: !307, line: 38, baseType: !359, size: 32, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !32, line: 32, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !304}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !335, file: !307, line: 40, baseType: !11, size: 32, offset: 352)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !335, file: !307, line: 42, baseType: !67, size: 320, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !335, file: !307, line: 43, baseType: !66, size: 32, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !335, file: !307, line: 45, baseType: !87, size: 32, offset: 736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !335, file: !307, line: 47, baseType: !87, size: 32, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !335, file: !307, line: 49, baseType: !369, size: 32, offset: 800)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !370, line: 16, baseType: !121)
!370 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !335, file: !307, line: 51, baseType: !333, size: 32, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !335, file: !307, line: 52, baseType: !304, size: 32, offset: 864)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !335, file: !307, line: 54, baseType: !6, size: 32, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !335, file: !307, line: 56, baseType: !10, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !335, file: !307, line: 57, baseType: !10, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !335, file: !307, line: 58, baseType: !10, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !335, file: !307, line: 60, baseType: !10, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !335, file: !307, line: 61, baseType: !10, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !335, file: !307, line: 62, baseType: !10, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !335, file: !307, line: 63, baseType: !10, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !335, file: !307, line: 64, baseType: !10, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !335, file: !307, line: 65, baseType: !10, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !335, file: !307, line: 66, baseType: !10, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !335, file: !307, line: 67, baseType: !10, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !335, file: !307, line: 70, baseType: !10, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !335, file: !307, line: 72, baseType: !10, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !335, file: !307, line: 73, baseType: !10, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !335, file: !307, line: 74, baseType: !10, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !335, file: !307, line: 76, baseType: !10, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !335, file: !307, line: 77, baseType: !10, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !335, file: !307, line: 78, baseType: !10, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !306, file: !307, line: 135, baseType: !192, size: 32, offset: 288)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !306, file: !307, line: 137, baseType: !66, size: 32, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !306, file: !307, line: 139, baseType: !163, size: 32, offset: 352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !307, line: 141, baseType: !18, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !306, file: !307, line: 143, baseType: !339, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !306, file: !307, line: 144, baseType: !351, size: 32, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !306, file: !307, line: 145, baseType: !82, size: 64, offset: 480)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !306, file: !307, line: 147, baseType: !82, size: 64, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !306, file: !307, line: 148, baseType: !401, size: 16, offset: 608)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !402, line: 12, baseType: !403)
!402 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 186, baseType: !345)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !306, file: !307, line: 154, baseType: !339, size: 32, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !306, file: !307, line: 155, baseType: !351, size: 32, offset: 672)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !306, file: !307, line: 157, baseType: !185, size: 32, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !306, file: !307, line: 159, baseType: !129, size: 64, offset: 736)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !306, file: !307, line: 161, baseType: !95, size: 32, offset: 800)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !306, file: !307, line: 163, baseType: !6, size: 32, offset: 832)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !306, file: !307, line: 165, baseType: !10, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !306, file: !307, line: 167, baseType: !10, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !306, file: !307, line: 169, baseType: !10, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !306, file: !307, line: 170, baseType: !10, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !306, file: !307, line: 171, baseType: !10, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !306, file: !307, line: 173, baseType: !10, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !306, file: !307, line: 174, baseType: !10, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !306, file: !307, line: 175, baseType: !10, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !306, file: !307, line: 176, baseType: !10, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !306, file: !307, line: 178, baseType: !10, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !306, file: !307, line: 179, baseType: !10, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !306, file: !307, line: 180, baseType: !10, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !306, file: !307, line: 181, baseType: !10, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !306, file: !307, line: 183, baseType: !10, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !291, file: !292, line: 48, baseType: !304, size: 32, offset: 480)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !291, file: !292, line: 49, baseType: !6, size: 32, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !291, file: !292, line: 51, baseType: !427, size: 32, offset: 544)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !32, line: 15, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !431, line: 222, size: 800, elements: !432)
!431 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !455, !456, !462, !466, !467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !430, file: !431, line: 223, baseType: !6, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !430, file: !431, line: 224, baseType: !6, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !431, line: 226, baseType: !26, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !430, file: !431, line: 228, baseType: !6, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !430, file: !431, line: 229, baseType: !6, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !430, file: !431, line: 231, baseType: !6, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !430, file: !431, line: 232, baseType: !19, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !430, file: !431, line: 234, baseType: !11, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !430, file: !431, line: 235, baseType: !442, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !32, line: 22, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !76, line: 77, size: 224, elements: !445)
!445 = !{!446, !447, !448, !452, !453, !454}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !444, file: !76, line: 78, baseType: !82, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !76, line: 79, baseType: !6, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !444, file: !76, line: 80, baseType: !449, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DISubroutineType(types: !451)
!451 = !{!26, !147, !442, !11}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !444, file: !76, line: 81, baseType: !6, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !444, file: !76, line: 82, baseType: !6, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !444, file: !76, line: 83, baseType: !11, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !431, line: 236, baseType: !6, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !430, file: !431, line: 238, baseType: !457, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !66}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !7, line: 78, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !9, line: 140, baseType: !18)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !430, file: !431, line: 240, baseType: !463, size: 32, offset: 352)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DISubroutineType(types: !465)
!465 = !{!460, !289}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !430, file: !431, line: 242, baseType: !463, size: 32, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !430, file: !431, line: 243, baseType: !463, size: 32, offset: 416)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !430, file: !431, line: 244, baseType: !469, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !289}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !430, file: !431, line: 245, baseType: !469, size: 32, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !430, file: !431, line: 247, baseType: !469, size: 32, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !430, file: !431, line: 249, baseType: !8, size: 32, offset: 544)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !430, file: !431, line: 250, baseType: !8, size: 32, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !430, file: !431, line: 251, baseType: !8, size: 32, offset: 608)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !430, file: !431, line: 252, baseType: !8, size: 32, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !430, file: !431, line: 253, baseType: !8, size: 32, offset: 672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !430, file: !431, line: 254, baseType: !8, size: 32, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !430, file: !431, line: 255, baseType: !8, size: 32, offset: 736)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !430, file: !431, line: 256, baseType: !8, size: 32, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !291, file: !292, line: 52, baseType: !6, size: 32, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !291, file: !292, line: 53, baseType: !6, size: 32, offset: 608)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !291, file: !292, line: 55, baseType: !129, size: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !291, file: !292, line: 56, baseType: !6, size: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !291, file: !292, line: 58, baseType: !154, size: 160, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !291, file: !292, line: 59, baseType: !154, size: 160, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !291, file: !292, line: 61, baseType: !154, size: 160, offset: 1056)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !291, file: !292, line: 62, baseType: !490, size: 96, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !117, line: 32, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !117, line: 37, size: 96, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !491, file: !117, line: 38, baseType: !123, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !491, file: !117, line: 39, baseType: !123, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !491, file: !117, line: 40, baseType: !496, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !117, line: 34, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !123, !123, !123}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !291, file: !292, line: 63, baseType: !116, size: 160, offset: 1312)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !291, file: !292, line: 65, baseType: !502, size: 224, offset: 1472)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !503, line: 31, baseType: !504)
!503 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 25, size: 224, elements: !505)
!505 = !{!506, !514, !515, !516, !517}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !504, file: !503, line: 26, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !503, line: 16, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !503, line: 18, size: 96, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !509, file: !503, line: 19, baseType: !11, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !509, file: !503, line: 20, baseType: !6, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !503, line: 21, baseType: !507, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !504, file: !503, line: 27, baseType: !508, size: 96, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !504, file: !503, line: 28, baseType: !87, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !504, file: !503, line: 29, baseType: !6, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !504, file: !503, line: 30, baseType: !163, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !291, file: !292, line: 66, baseType: !502, size: 224, offset: 1696)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !291, file: !292, line: 68, baseType: !6, size: 32, offset: 1920)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !291, file: !292, line: 69, baseType: !6, size: 32, offset: 1952)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !291, file: !292, line: 71, baseType: !304, size: 32, offset: 1984)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !291, file: !292, line: 72, baseType: !63, size: 32, offset: 2016)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !291, file: !292, line: 73, baseType: !63, size: 32, offset: 2048)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !291, file: !292, line: 75, baseType: !289, size: 32, offset: 2080)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !291, file: !292, line: 77, baseType: !82, size: 64, offset: 2112)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !291, file: !292, line: 78, baseType: !82, size: 64, offset: 2176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !291, file: !292, line: 79, baseType: !82, size: 64, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !291, file: !292, line: 80, baseType: !82, size: 64, offset: 2304)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !291, file: !292, line: 81, baseType: !82, size: 64, offset: 2368)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !291, file: !292, line: 82, baseType: !82, size: 64, offset: 2432)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !149, file: !76, line: 121, baseType: !163, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !149, file: !76, line: 122, baseType: !163, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !149, file: !76, line: 123, baseType: !534, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !76, line: 103, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 98, size: 1344, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !536, file: !76, line: 99, baseType: !200, size: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !536, file: !76, line: 100, baseType: !185, size: 32, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !536, file: !76, line: 101, baseType: !185, size: 32, offset: 1248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !536, file: !76, line: 102, baseType: !6, size: 32, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !149, file: !76, line: 124, baseType: !66, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !149, file: !76, line: 126, baseType: !11, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !149, file: !76, line: 127, baseType: !6, size: 32, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !149, file: !76, line: 128, baseType: !6, size: 32, offset: 288)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !149, file: !76, line: 130, baseType: !547, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !76, line: 112, baseType: !449)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !149, file: !76, line: 131, baseType: !26, size: 32, offset: 352)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_syslog_peer_t", file: !551, line: 21, baseType: !552)
!551 = !DIFile(filename: "src/core/ngx_syslog.h", directory: "/home/sam/Projects/nginx-1.12.2")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 11, size: 1216, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !566, !567, !568}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !552, file: !551, line: 12, baseType: !163, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "facility", scope: !552, file: !551, line: 13, baseType: !6, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !552, file: !551, line: 14, baseType: !6, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !552, file: !551, line: 15, baseType: !82, size: 64, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !552, file: !551, line: 17, baseType: !559, size: 128, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !560, line: 78, baseType: !561)
!560 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 74, size: 128, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !561, file: !560, line: 75, baseType: !339, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !561, file: !560, line: 76, baseType: !351, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !561, file: !560, line: 77, baseType: !82, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !552, file: !551, line: 18, baseType: !305, size: 896, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !552, file: !551, line: 19, baseType: !10, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nohostname", scope: !552, file: !551, line: 20, baseType: !10, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!569 = !{!570, !571}
!570 = !DILocalVariable(name: "cf", arg: 1, scope: !144, file: !3, line: 40, type: !147)
!571 = !DILocalVariable(name: "peer", arg: 2, scope: !144, file: !3, line: 40, type: !549)
!572 = !{!573, !573, i64 0}
!573 = !{!"any pointer", !574, i64 0}
!574 = !{!"omnipotent char", !575, i64 0}
!575 = !{!"Simple C/C++ TBAA"}
!576 = !DIExpression()
!577 = !DILocation(line: 40, column: 37, scope: !144)
!578 = !DILocation(line: 40, column: 60, scope: !144)
!579 = !DILocation(line: 42, column: 18, scope: !144)
!580 = !DILocation(line: 42, column: 22, scope: !144)
!581 = !{!582, !573, i64 12}
!582 = !{!"ngx_conf_s", !573, i64 0, !573, i64 4, !573, i64 8, !573, i64 12, !573, i64 16, !573, i64 20, !573, i64 24, !573, i64 28, !583, i64 32, !583, i64 36, !573, i64 40, !573, i64 44}
!583 = !{!"int", !574, i64 0}
!584 = !DILocation(line: 42, column: 5, scope: !144)
!585 = !DILocation(line: 42, column: 11, scope: !144)
!586 = !DILocation(line: 42, column: 16, scope: !144)
!587 = !{!588, !573, i64 0}
!588 = !{!"", !573, i64 0, !583, i64 4, !583, i64 8, !589, i64 12, !590, i64 20, !591, i64 36, !583, i64 148, !583, i64 148}
!589 = !{!"", !583, i64 0, !573, i64 4}
!590 = !{!"", !573, i64 0, !583, i64 4, !589, i64 8}
!591 = !{!"ngx_connection_s", !573, i64 0, !573, i64 4, !573, i64 8, !583, i64 12, !573, i64 16, !573, i64 20, !573, i64 24, !573, i64 28, !573, i64 32, !583, i64 36, !573, i64 40, !573, i64 44, !583, i64 48, !573, i64 52, !583, i64 56, !589, i64 60, !589, i64 68, !592, i64 76, !573, i64 80, !583, i64 84, !573, i64 88, !593, i64 92, !594, i64 100, !583, i64 104, !583, i64 108, !583, i64 109, !583, i64 109, !583, i64 109, !583, i64 109, !583, i64 109, !583, i64 109, !583, i64 110, !583, i64 110, !583, i64 110, !583, i64 110, !583, i64 110, !583, i64 110, !583, i64 111}
!592 = !{!"short", !574, i64 0}
!593 = !{!"ngx_queue_s", !573, i64 0, !573, i64 4}
!594 = !{!"long", !574, i64 0}
!595 = !DILocation(line: 43, column: 5, scope: !144)
!596 = !DILocation(line: 43, column: 11, scope: !144)
!597 = !DILocation(line: 43, column: 20, scope: !144)
!598 = !{!588, !583, i64 4}
!599 = !DILocation(line: 44, column: 5, scope: !144)
!600 = !DILocation(line: 44, column: 11, scope: !144)
!601 = !DILocation(line: 44, column: 20, scope: !144)
!602 = !{!588, !583, i64 8}
!603 = !DILocation(line: 46, column: 31, scope: !604)
!604 = distinct !DILexicalBlock(scope: !144, file: !3, line: 46, column: 9)
!605 = !DILocation(line: 46, column: 35, scope: !604)
!606 = !DILocation(line: 46, column: 9, scope: !604)
!607 = !DILocation(line: 46, column: 41, scope: !604)
!608 = !DILocation(line: 46, column: 9, scope: !144)
!609 = !DILocation(line: 47, column: 9, scope: !610)
!610 = distinct !DILexicalBlock(scope: !604, file: !3, line: 46, column: 57)
!611 = !DILocation(line: 50, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !144, file: !3, line: 50, column: 9)
!613 = !DILocation(line: 50, column: 15, scope: !612)
!614 = !DILocation(line: 50, column: 22, scope: !612)
!615 = !{!588, !573, i64 20}
!616 = !DILocation(line: 50, column: 31, scope: !612)
!617 = !DILocation(line: 50, column: 9, scope: !144)
!618 = !DILocation(line: 51, column: 43, scope: !619)
!619 = distinct !DILexicalBlock(scope: !612, file: !3, line: 50, column: 40)
!620 = !DILocation(line: 51, column: 9, scope: !619)
!621 = !DILocation(line: 53, column: 9, scope: !619)
!622 = !DILocation(line: 56, column: 9, scope: !623)
!623 = distinct !DILexicalBlock(scope: !144, file: !3, line: 56, column: 9)
!624 = !DILocation(line: 56, column: 15, scope: !623)
!625 = !DILocation(line: 56, column: 24, scope: !623)
!626 = !DILocation(line: 56, column: 9, scope: !144)
!627 = !DILocation(line: 57, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !623, file: !3, line: 56, column: 48)
!629 = !DILocation(line: 57, column: 15, scope: !628)
!630 = !DILocation(line: 57, column: 24, scope: !628)
!631 = !DILocation(line: 58, column: 5, scope: !628)
!632 = !DILocation(line: 60, column: 9, scope: !633)
!633 = distinct !DILexicalBlock(scope: !144, file: !3, line: 60, column: 9)
!634 = !DILocation(line: 60, column: 15, scope: !633)
!635 = !DILocation(line: 60, column: 24, scope: !633)
!636 = !DILocation(line: 60, column: 9, scope: !144)
!637 = !DILocation(line: 61, column: 9, scope: !638)
!638 = distinct !DILexicalBlock(scope: !633, file: !3, line: 60, column: 48)
!639 = !DILocation(line: 61, column: 15, scope: !638)
!640 = !DILocation(line: 61, column: 24, scope: !638)
!641 = !DILocation(line: 62, column: 5, scope: !638)
!642 = !DILocation(line: 64, column: 9, scope: !643)
!643 = distinct !DILexicalBlock(scope: !144, file: !3, line: 64, column: 9)
!644 = !DILocation(line: 64, column: 15, scope: !643)
!645 = !DILocation(line: 64, column: 19, scope: !643)
!646 = !{!588, !573, i64 16}
!647 = !DILocation(line: 64, column: 24, scope: !643)
!648 = !DILocation(line: 64, column: 9, scope: !144)
!649 = !DILocation(line: 65, column: 9, scope: !650)
!650 = distinct !DILexicalBlock(scope: !643, file: !3, line: 64, column: 33)
!651 = !{!589, !583, i64 0}
!652 = !{!589, !573, i64 4}
!653 = !DILocation(line: 66, column: 5, scope: !650)
!654 = !DILocation(line: 68, column: 5, scope: !144)
!655 = !DILocation(line: 68, column: 11, scope: !144)
!656 = !DILocation(line: 68, column: 16, scope: !144)
!657 = !DILocation(line: 68, column: 19, scope: !144)
!658 = !{!588, !583, i64 48}
!659 = !DILocation(line: 70, column: 5, scope: !144)
!660 = !DILocation(line: 71, column: 1, scope: !144)
!661 = distinct !DISubprogram(name: "ngx_syslog_parse_args", scope: !3, file: !3, line: 75, type: !145, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !671, !745}
!663 = !DILocalVariable(name: "cf", arg: 1, scope: !661, file: !3, line: 75, type: !147)
!664 = !DILocalVariable(name: "peer", arg: 2, scope: !661, file: !3, line: 75, type: !549)
!665 = !DILocalVariable(name: "p", scope: !661, file: !3, line: 77, type: !12)
!666 = !DILocalVariable(name: "comma", scope: !661, file: !3, line: 77, type: !12)
!667 = !DILocalVariable(name: "c", scope: !661, file: !3, line: 77, type: !13)
!668 = !DILocalVariable(name: "len", scope: !661, file: !3, line: 78, type: !87)
!669 = !DILocalVariable(name: "value", scope: !661, file: !3, line: 79, type: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!671 = !DILocalVariable(name: "u", scope: !661, file: !3, line: 80, type: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_url_t", file: !560, line: 105, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !560, line: 81, size: 1376, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !741, !743, !744}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !673, file: !560, line: 82, baseType: !82, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !673, file: !560, line: 83, baseType: !82, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "port_text", scope: !673, file: !560, line: 84, baseType: !82, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !673, file: !560, line: 85, baseType: !82, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !673, file: !560, line: 87, baseType: !401, size: 16, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "default_port", scope: !673, file: !560, line: 88, baseType: !401, size: 16, offset: 272)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !673, file: !560, line: 89, baseType: !18, size: 32, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !673, file: !560, line: 91, baseType: !10, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "uri_part", scope: !673, file: !560, line: 92, baseType: !10, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "no_resolve", scope: !673, file: !560, line: 93, baseType: !10, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "no_port", scope: !673, file: !560, line: 95, baseType: !10, size: 1, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !673, file: !560, line: 96, baseType: !10, size: 1, offset: 324, flags: DIFlagBitField, extraData: i64 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !673, file: !560, line: 98, baseType: !351, size: 32, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !673, file: !560, line: 99, baseType: !689, size: 896, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_sockaddr_t", file: !560, line: 44, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !560, line: 35, size: 896, elements: !691)
!691 = !{!692, !693, !709, !732}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !690, file: !560, line: 36, baseType: !340, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in", scope: !690, file: !560, line: 37, baseType: !694, size: 128)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !402, line: 16, size: 128, elements: !695)
!695 = !{!696, !697, !698, !704}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !694, file: !402, line: 17, baseType: !344, size: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !694, file: !402, line: 18, baseType: !401, size: 16, offset: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !694, file: !402, line: 19, baseType: !699, size: 32, offset: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !402, line: 14, size: 32, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !699, file: !402, line: 14, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !402, line: 13, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 191, baseType: !10)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !694, file: !402, line: 20, baseType: !705, size: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !707)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 181, baseType: !15)
!707 = !{!708}
!708 = !DISubrange(count: 8)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in6", scope: !690, file: !560, line: 39, baseType: !710, size: 224)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !402, line: 34, size: 224, elements: !711)
!711 = !{!712, !713, !714, !715, !731}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !710, file: !402, line: 35, baseType: !344, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !710, file: !402, line: 36, baseType: !401, size: 16, offset: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !710, file: !402, line: 37, baseType: !703, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !710, file: !402, line: 38, baseType: !716, size: 128, offset: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !402, line: 23, size: 128, elements: !717)
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !716, file: !402, line: 28, baseType: !719, size: 128)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !402, line: 24, size: 128, elements: !720)
!720 = !{!721, !725, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !719, file: !402, line: 25, baseType: !722, size: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !719, file: !402, line: 26, baseType: !726, size: 128)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 128, elements: !707)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !719, file: !402, line: 27, baseType: !728, size: 128)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 128, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 4)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !710, file: !402, line: 39, baseType: !703, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_un", scope: !690, file: !560, line: 42, baseType: !733, size: 880)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !734, line: 17, size: 880, elements: !735)
!734 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/un.h", directory: "/home/sam/Projects/nginx-1.12.2")
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !733, file: !734, line: 18, baseType: !344, size: 16)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !733, file: !734, line: 19, baseType: !738, size: 864, offset: 16)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 864, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 108)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !673, file: !560, line: 101, baseType: !742, size: 32, offset: 1280)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs", scope: !673, file: !560, line: 102, baseType: !6, size: 32, offset: 1312)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !673, file: !560, line: 104, baseType: !26, size: 32, offset: 1344)
!745 = !DILocalVariable(name: "i", scope: !661, file: !3, line: 81, type: !6)
!746 = !DILocation(line: 75, column: 35, scope: !661)
!747 = !DILocation(line: 75, column: 58, scope: !661)
!748 = !DILocation(line: 77, column: 5, scope: !661)
!749 = !DILocation(line: 77, column: 18, scope: !661)
!750 = !DILocation(line: 77, column: 22, scope: !661)
!751 = !DILocation(line: 77, column: 29, scope: !661)
!752 = !DILocation(line: 78, column: 5, scope: !661)
!753 = !DILocation(line: 78, column: 18, scope: !661)
!754 = !DILocation(line: 79, column: 5, scope: !661)
!755 = !DILocation(line: 79, column: 18, scope: !661)
!756 = !DILocation(line: 80, column: 5, scope: !661)
!757 = !DILocation(line: 80, column: 18, scope: !661)
!758 = !DILocation(line: 81, column: 5, scope: !661)
!759 = !DILocation(line: 81, column: 18, scope: !661)
!760 = !DILocation(line: 83, column: 13, scope: !661)
!761 = !DILocation(line: 83, column: 17, scope: !661)
!762 = !{!582, !573, i64 4}
!763 = !DILocation(line: 83, column: 23, scope: !661)
!764 = !{!765, !573, i64 0}
!765 = !{!"", !573, i64 0, !583, i64 4, !583, i64 8, !583, i64 12, !573, i64 16}
!766 = !DILocation(line: 83, column: 11, scope: !661)
!767 = !DILocation(line: 85, column: 9, scope: !661)
!768 = !DILocation(line: 85, column: 18, scope: !661)
!769 = !DILocation(line: 85, column: 23, scope: !661)
!770 = !DILocation(line: 85, column: 43, scope: !661)
!771 = !DILocation(line: 85, column: 7, scope: !661)
!772 = !DILocation(line: 87, column: 5, scope: !661)
!773 = !DILocation(line: 88, column: 28, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 87, column: 16)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 87, column: 5)
!776 = distinct !DILexicalBlock(scope: !661, file: !3, line: 87, column: 5)
!777 = !DILocation(line: 88, column: 15, scope: !774)
!778 = !DILocation(line: 90, column: 13, scope: !779)
!779 = distinct !DILexicalBlock(scope: !774, file: !3, line: 90, column: 13)
!780 = !DILocation(line: 90, column: 19, scope: !779)
!781 = !DILocation(line: 90, column: 13, scope: !774)
!782 = !DILocation(line: 91, column: 19, scope: !783)
!783 = distinct !DILexicalBlock(scope: !779, file: !3, line: 90, column: 28)
!784 = !DILocation(line: 91, column: 27, scope: !783)
!785 = !DILocation(line: 91, column: 25, scope: !783)
!786 = !DILocation(line: 91, column: 17, scope: !783)
!787 = !{!583, !583, i64 0}
!788 = !DILocation(line: 92, column: 14, scope: !783)
!789 = !DILocation(line: 92, column: 20, scope: !783)
!790 = !{!574, !574, i64 0}
!791 = !DILocation(line: 94, column: 9, scope: !783)
!792 = !DILocation(line: 95, column: 19, scope: !793)
!793 = distinct !DILexicalBlock(scope: !779, file: !3, line: 94, column: 16)
!794 = !DILocation(line: 95, column: 28, scope: !793)
!795 = !DILocation(line: 95, column: 35, scope: !793)
!796 = !DILocation(line: 95, column: 44, scope: !793)
!797 = !DILocation(line: 95, column: 33, scope: !793)
!798 = !DILocation(line: 95, column: 50, scope: !793)
!799 = !DILocation(line: 95, column: 48, scope: !793)
!800 = !DILocation(line: 95, column: 17, scope: !793)
!801 = !DILocation(line: 98, column: 13, scope: !802)
!802 = distinct !DILexicalBlock(scope: !774, file: !3, line: 98, column: 13)
!803 = !DILocation(line: 98, column: 42, scope: !802)
!804 = !DILocation(line: 98, column: 13, scope: !774)
!805 = !DILocation(line: 100, column: 17, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 100, column: 17)
!807 = distinct !DILexicalBlock(scope: !802, file: !3, line: 98, column: 48)
!808 = !DILocation(line: 100, column: 23, scope: !806)
!809 = !DILocation(line: 100, column: 30, scope: !806)
!810 = !DILocation(line: 100, column: 39, scope: !806)
!811 = !DILocation(line: 100, column: 17, scope: !807)
!812 = !DILocation(line: 101, column: 51, scope: !813)
