; ModuleID = 'src/core/ngx_slab.c'
source_filename = "src/core/ngx_slab.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_slab_max_size", scope: !2, file: !3, line: 80, type: !27, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !34)
!3 = !DIFile(filename: "src/core/ngx_slab.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !9, !18, !22, !27, !15, !32, !33}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 120, baseType: !8)
!7 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !11, line: 16, baseType: !12)
!11 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !11, line: 18, size: 96, elements: !13)
!13 = !{!14, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !12, file: !11, line: 19, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !7, line: 125, baseType: !8)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !11, line: 20, baseType: !9, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !12, file: !11, line: 21, baseType: !15, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !20, line: 64, baseType: !21)
!20 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !11, line: 31, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 25, size: 128, elements: !25)
!25 = !{!26, !29, !30, !31}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !24, file: !11, line: 26, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !28, line: 79, baseType: !15)
!28 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !24, file: !11, line: 27, baseType: !27, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !24, file: !11, line: 29, baseType: !27, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !24, file: !11, line: 30, baseType: !27, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!34 = !{!0, !35, !37}
!35 = !DIGlobalVariableExpression(var: !36)
!36 = distinct !DIGlobalVariable(name: "ngx_slab_exact_size", scope: !2, file: !3, line: 81, type: !27, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38)
!38 = distinct !DIGlobalVariable(name: "ngx_slab_exact_shift", scope: !2, file: !3, line: 82, type: !27, isLocal: true, isDefinition: true)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!42 = distinct !DISubprogram(name: "ngx_slab_init", scope: !3, file: !3, line: 86, type: !43, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !95)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !11, line: 59, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 34, size: 800, elements: !48)
!48 = !{!49, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !90, !91, !92, !93, !94}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !47, file: !11, line: 35, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !51, line: 21, baseType: !52)
!51 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 16, size: 64, elements: !53)
!53 = !{!54, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !52, file: !51, line: 17, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !56, line: 106, baseType: !57)
!56 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !56, line: 98, baseType: !59)
!59 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !52, file: !51, line: 19, baseType: !55, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !47, file: !11, line: 37, baseType: !6, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !47, file: !11, line: 38, baseType: !6, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !47, file: !11, line: 40, baseType: !9, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !47, file: !11, line: 41, baseType: !9, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !47, file: !11, line: 42, baseType: !10, size: 96, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !47, file: !11, line: 44, baseType: !22, size: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !47, file: !11, line: 45, baseType: !27, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !47, file: !11, line: 47, baseType: !18, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !47, file: !11, line: 48, baseType: !18, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !47, file: !11, line: 50, baseType: !71, size: 256, offset: 416)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !51, line: 37, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 24, size: 256, elements: !73)
!73 = !{!74, !76, !77, !78, !89}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !72, file: !51, line: 26, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !72, file: !51, line: 28, baseType: !75, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !72, file: !51, line: 29, baseType: !27, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !72, file: !51, line: 30, baseType: !79, size: 128, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !80, line: 19, baseType: !81)
!80 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !80, line: 17, size: 128, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !81, file: !80, line: 18, baseType: !84, size: 128)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !87)
!85 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !72, file: !51, line: 36, baseType: !27, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !47, file: !11, line: 52, baseType: !18, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !47, file: !11, line: 53, baseType: !19, size: 8, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !47, file: !11, line: 55, baseType: !8, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !11, line: 57, baseType: !33, size: 32, offset: 736)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !47, file: !11, line: 58, baseType: !33, size: 32, offset: 768)
!95 = !{!96, !97, !98, !99, !102, !103, !104, !105, !106}
!96 = !DILocalVariable(name: "pool", arg: 1, scope: !42, file: !3, line: 86, type: !45)
!97 = !DILocalVariable(name: "p", scope: !42, file: !3, line: 88, type: !18)
!98 = !DILocalVariable(name: "size", scope: !42, file: !3, line: 89, type: !6)
!99 = !DILocalVariable(name: "m", scope: !42, file: !3, line: 90, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !28, line: 78, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !7, line: 140, baseType: !86)
!102 = !DILocalVariable(name: "i", scope: !42, file: !3, line: 91, type: !27)
!103 = !DILocalVariable(name: "n", scope: !42, file: !3, line: 91, type: !27)
!104 = !DILocalVariable(name: "pages", scope: !42, file: !3, line: 91, type: !27)
!105 = !DILocalVariable(name: "slots", scope: !42, file: !3, line: 92, type: !9)
!106 = !DILocalVariable(name: "page", scope: !42, file: !3, line: 92, type: !9)
!107 = !{!108, !108, i64 0}
!108 = !{!"any pointer", !109, i64 0}
!109 = !{!"omnipotent char", !110, i64 0}
!110 = !{!"Simple C/C++ TBAA"}
!111 = !DIExpression()
!112 = !DILocation(line: 86, column: 32, scope: !42)
!113 = !DILocation(line: 88, column: 5, scope: !42)
!114 = !DILocation(line: 88, column: 23, scope: !42)
!115 = !DILocation(line: 89, column: 5, scope: !42)
!116 = !DILocation(line: 89, column: 23, scope: !42)
!117 = !DILocation(line: 90, column: 5, scope: !42)
!118 = !DILocation(line: 90, column: 23, scope: !42)
!119 = !DILocation(line: 91, column: 5, scope: !42)
!120 = !DILocation(line: 91, column: 23, scope: !42)
!121 = !DILocation(line: 91, column: 26, scope: !42)
!122 = !DILocation(line: 91, column: 29, scope: !42)
!123 = !DILocation(line: 92, column: 5, scope: !42)
!124 = !DILocation(line: 92, column: 23, scope: !42)
!125 = !DILocation(line: 92, column: 31, scope: !42)
!126 = !DILocation(line: 95, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !42, file: !3, line: 95, column: 9)
!128 = !{!129, !129, i64 0}
!129 = !{!"int", !109, i64 0}
!130 = !DILocation(line: 95, column: 27, scope: !127)
!131 = !DILocation(line: 95, column: 9, scope: !42)
!132 = !DILocation(line: 96, column: 29, scope: !133)
!133 = distinct !DILexicalBlock(scope: !127, file: !3, line: 95, column: 33)
!134 = !DILocation(line: 96, column: 42, scope: !133)
!135 = !DILocation(line: 96, column: 27, scope: !133)
!136 = !DILocation(line: 97, column: 31, scope: !133)
!137 = !DILocation(line: 97, column: 44, scope: !133)
!138 = !DILocation(line: 97, column: 29, scope: !133)
!139 = !DILocation(line: 98, column: 18, scope: !140)
!140 = distinct !DILexicalBlock(scope: !133, file: !3, line: 98, column: 9)
!141 = !DILocation(line: 98, column: 16, scope: !140)
!142 = !DILocation(line: 98, column: 14, scope: !140)
!143 = !DILocation(line: 98, column: 41, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !3, line: 98, column: 9)
!145 = !DILocation(line: 98, column: 9, scope: !140)
!146 = !DILocation(line: 100, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !3, line: 98, column: 72)
!148 = !DILocation(line: 98, column: 68, scope: !144)
!149 = !DILocation(line: 98, column: 9, scope: !144)
!150 = distinct !{!150, !145, !151}
!151 = !DILocation(line: 100, column: 9, scope: !140)
!152 = !DILocation(line: 101, column: 5, scope: !133)
!153 = !DILocation(line: 104, column: 36, scope: !42)
!154 = !DILocation(line: 104, column: 42, scope: !42)
!155 = !{!156, !129, i64 12}
!156 = !{!"", !157, i64 0, !129, i64 8, !129, i64 12, !108, i64 16, !108, i64 20, !159, i64 24, !108, i64 36, !129, i64 40, !108, i64 44, !108, i64 48, !160, i64 52, !108, i64 84, !109, i64 88, !129, i64 89, !108, i64 92, !108, i64 96}
!157 = !{!"", !158, i64 0, !158, i64 4}
!158 = !{!"long", !109, i64 0}
!159 = !{!"ngx_slab_page_s", !129, i64 0, !108, i64 4, !129, i64 8}
