; ModuleID = 'src/core/ngx_resolver.c'
source_filename = "src/core/ngx_resolver.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_time_t = type { i32, i32, i32 }
%struct.ngx_rbtree_s = type { %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, void (%struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*)* }
%struct.ngx_rbtree_node_s = type { i32, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, %struct.ngx_rbtree_node_s*, i8, i8 }
%struct.ngx_event_actions_t = type { i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_event_s*, i32, i32)*, i32 (%struct.ngx_connection_s*)*, i32 (%struct.ngx_connection_s*, i32)*, i32 (void (%struct.ngx_event_s*)*)*, i32 (%struct.ngx_cycle_s*, i32, i32)*, i32 (%struct.ngx_cycle_s*, i32)*, void (%struct.ngx_cycle_s*)* }
%struct.ngx_event_s = type { i8*, i24, void (%struct.ngx_event_s*)*, i32, %struct.ngx_log_s*, %struct.ngx_rbtree_node_s, %struct.ngx_queue_s }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_str_t = type { i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "errors", scope: !2, file: !3, line: 4339, type: !512, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ngx_resolver_strerror", scope: !3, file: !3, line: 4337, type: !4, isLocal: false, isDefinition: true, scopeLine: 4338, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !510)
!3 = !DIFile(filename: "src/core/ngx_resolver.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !9, line: 78, baseType: !10)
!9 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !11, line: 140, baseType: !12)
!11 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !15, globals: !509)
!14 = !{}
!15 = !{!16, !17, !19, !21, !25, !36, !65, !76, !78, !23, !84, !110, !82, !469, !99, !485, !493, !495, !134, !497, !124}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !11, line: 75, baseType: !20)
!20 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !22, line: 13, baseType: !23)
!22 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 191, baseType: !24)
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !27, line: 297, size: 128, elements: !28)
!27 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!28 = !{!29, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !26, file: !27, line: 298, baseType: !30, size: 16)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !11, line: 409, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !26, file: !27, line: 299, baseType: !33, size: 112, offset: 16)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 14)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !22, line: 34, size: 224, elements: !38)
!38 = !{!39, !40, !43, !44, !64}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !37, file: !22, line: 35, baseType: !30, size: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !37, file: !22, line: 36, baseType: !41, size: 16, offset: 16)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !22, line: 12, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 186, baseType: !31)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !37, file: !22, line: 37, baseType: !23, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !37, file: !22, line: 38, baseType: !45, size: 128, offset: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !22, line: 23, size: 128, elements: !46)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !45, file: !22, line: 28, baseType: !48, size: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !45, file: !22, line: 24, size: 128, elements: !49)
!49 = !{!50, !56, !60}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !48, file: !22, line: 25, baseType: !51, size: 128)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !54)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 181, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55}
!55 = !DISubrange(count: 16)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !48, file: !22, line: 26, baseType: !57, size: 128)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !48, file: !22, line: 27, baseType: !61, size: 128)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 4)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !37, file: !22, line: 39, baseType: !23, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !22, line: 16, size: 128, elements: !67)
!67 = !{!68, !69, !70, !74}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !66, file: !22, line: 17, baseType: !30, size: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !66, file: !22, line: 18, baseType: !41, size: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !66, file: !22, line: 19, baseType: !71, size: 32, offset: 32)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !22, line: 14, size: 32, elements: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !71, file: !22, line: 14, baseType: !21, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !66, file: !22, line: 20, baseType: !75, size: 64, offset: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !58)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !77, line: 65, baseType: !31)
!77 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !79, line: 16, baseType: !80)
!79 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !81, line: 16, baseType: !82)
!81 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !9, line: 79, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !11, line: 125, baseType: !24)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_node_t", file: !86, line: 145, baseType: !87)
!86 = !DIFile(filename: "src/core/ngx_resolver.h", directory: "/home/sam/Projects/nginx-1.12.2")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 92, size: 928, elements: !88)
!88 = !{!89, !101, !109, !111, !112, !113, !114, !115, !116, !139, !140, !141, !142, !143, !149, !150, !151, !152, !153, !154, !155, !156}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !87, file: !86, line: 93, baseType: !90, size: 160)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !81, line: 20, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !81, line: 22, size: 160, elements: !92)
!92 = !{!93, !94, !96, !97, !98, !100}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !91, file: !81, line: 23, baseType: !80, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !91, file: !81, line: 24, baseType: !95, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !91, file: !81, line: 25, baseType: !95, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !91, file: !81, line: 26, baseType: !95, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !91, file: !81, line: 27, baseType: !99, size: 8, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !77, line: 64, baseType: !53)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !81, line: 28, baseType: !99, size: 8, offset: 136)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !87, file: !86, line: 94, baseType: !102, size: 64, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !103, line: 16, baseType: !104)
!103 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !103, line: 18, size: 64, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !103, line: 19, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !103, line: 20, baseType: !107, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !86, line: 97, baseType: !110, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "addr6", scope: !87, file: !86, line: 101, baseType: !45, size: 128, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !87, file: !86, line: 104, baseType: !76, size: 16, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !87, file: !86, line: 105, baseType: !76, size: 16, offset: 400)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !87, file: !86, line: 107, baseType: !110, size: 32, offset: 416)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "query6", scope: !87, file: !86, line: 109, baseType: !110, size: 32, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !87, file: !86, line: 117, baseType: !117, size: 32, offset: 480)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !86, line: 112, size: 32, elements: !118)
!118 = !{!119, !120, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !117, file: !86, line: 113, baseType: !21, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !117, file: !86, line: 114, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cname", scope: !117, file: !86, line: 115, baseType: !110, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "srvs", scope: !117, file: !86, line: 116, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_srv_t", file: !86, line: 75, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 70, size: 128, elements: !127)
!127 = !{!128, !136, !137, !138}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !86, line: 71, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !130, line: 19, baseType: !131)
!130 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 16, size: 64, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !130, line: 17, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 120, baseType: !24)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !130, line: 18, baseType: !110, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !126, file: !86, line: 72, baseType: !76, size: 16, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !126, file: !86, line: 73, baseType: !76, size: 16, offset: 80)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !126, file: !86, line: 74, baseType: !76, size: 16, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !87, file: !86, line: 119, baseType: !99, size: 8, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs", scope: !87, file: !86, line: 120, baseType: !76, size: 16, offset: 528)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nsrvs", scope: !87, file: !86, line: 121, baseType: !76, size: 16, offset: 544)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cnlen", scope: !87, file: !86, line: 122, baseType: !76, size: 16, offset: 560)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "u6", scope: !87, file: !86, line: 128, baseType: !144, size: 128, offset: 576)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !86, line: 125, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "addr6", scope: !144, file: !86, line: 126, baseType: !45, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "addrs6", scope: !144, file: !86, line: 127, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs6", scope: !87, file: !86, line: 130, baseType: !76, size: 16, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !87, file: !86, line: 133, baseType: !19, size: 32, offset: 736)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !87, file: !86, line: 134, baseType: !19, size: 32, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !87, file: !86, line: 135, baseType: !23, size: 32, offset: 800)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !87, file: !86, line: 137, baseType: !24, size: 1, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tcp6", scope: !87, file: !86, line: 139, baseType: !24, size: 1, offset: 833, flags: DIFlagBitField, extraData: i64 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "last_connection", scope: !87, file: !86, line: 142, baseType: !82, size: 32, offset: 864)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "waiting", scope: !87, file: !86, line: 144, baseType: !157, size: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_ctx_t", file: !86, line: 56, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_resolver_ctx_s", file: !86, line: 195, size: 960, elements: !160)
!160 = !{!161, !162, !416, !417, !418, !419, !420, !421, !422, !423, !434, !435, !436, !437, !438, !459, !464, !465, !466, !467, !468}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !86, line: 196, baseType: !157, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !159, file: !86, line: 197, baseType: !163, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_t", file: !86, line: 40, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_resolver_s", file: !86, line: 148, size: 2048, elements: !166)
!166 = !{!167, !245, !246, !247, !248, !383, !384, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !165, file: !86, line: 150, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !170, line: 24, baseType: !171)
!170 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !172, line: 30, size: 384, elements: !173)
!172 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !201, !202, !243, !244}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !172, line: 31, baseType: !16, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !171, file: !172, line: 33, baseType: !24, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !171, file: !172, line: 35, baseType: !24, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !171, file: !172, line: 38, baseType: !24, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !171, file: !172, line: 44, baseType: !24, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !171, file: !172, line: 46, baseType: !24, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !171, file: !172, line: 49, baseType: !24, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !171, file: !172, line: 51, baseType: !24, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !171, file: !172, line: 54, baseType: !24, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !171, file: !172, line: 56, baseType: !24, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !171, file: !172, line: 57, baseType: !24, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !171, file: !172, line: 59, baseType: !24, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !171, file: !172, line: 60, baseType: !24, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !171, file: !172, line: 62, baseType: !24, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !171, file: !172, line: 64, baseType: !24, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !171, file: !172, line: 67, baseType: !24, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !171, file: !172, line: 69, baseType: !24, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !171, file: !172, line: 71, baseType: !24, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !171, file: !172, line: 74, baseType: !24, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !171, file: !172, line: 75, baseType: !24, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !171, file: !172, line: 77, baseType: !24, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !171, file: !172, line: 107, baseType: !24, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !171, file: !172, line: 110, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !170, line: 31, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !168}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !171, file: !172, line: 117, baseType: !82, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !171, file: !172, line: 119, baseType: !203, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !170, line: 20, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !206, line: 50, size: 320, elements: !207)
!206 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!207 = !{!208, !209, !224, !228, !229, !234, !235, !240, !241, !242}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !205, file: !206, line: 51, baseType: !82, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !205, file: !206, line: 52, baseType: !210, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !170, line: 21, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !213, line: 89, size: 160, elements: !214)
!213 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!214 = !{!215, !218, !219, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !212, file: !213, line: 90, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !217, line: 16, baseType: !12)
!217 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !213, line: 91, baseType: !129, size: 64, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !212, file: !213, line: 93, baseType: !220, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !210, !203}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !213, line: 94, baseType: !16, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !205, file: !206, line: 54, baseType: !225, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !226, line: 98, baseType: !227)
!226 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!227 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !205, file: !206, line: 56, baseType: !19, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !205, file: !206, line: 58, baseType: !230, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !206, line: 45, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{!110, !203, !110, !134}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !205, file: !206, line: 59, baseType: !16, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !205, file: !206, line: 61, baseType: !236, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !206, line: 46, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !203, !82, !110, !134}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !205, file: !206, line: 62, baseType: !16, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !205, file: !206, line: 70, baseType: !6, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !206, line: 72, baseType: !203, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !171, file: !172, line: 121, baseType: !90, size: 160, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !171, file: !172, line: 124, baseType: !102, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !165, file: !86, line: 151, baseType: !16, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !165, file: !86, line: 152, baseType: !203, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !165, file: !86, line: 155, baseType: !8, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !165, file: !86, line: 158, baseType: !249, size: 160, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !250, line: 22, baseType: !251)
!250 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !250, line: 16, size: 160, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !251, file: !250, line: 17, baseType: !16, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !251, file: !250, line: 18, baseType: !82, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !251, file: !250, line: 19, baseType: !134, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !251, file: !250, line: 20, baseType: !82, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !251, file: !250, line: 21, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !170, line: 18, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !261, line: 57, size: 320, elements: !262)
!261 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!262 = !{!263, !271, !272, !273, !363, !370, !382}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !260, file: !261, line: 58, baseType: !264, size: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !261, line: 54, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 49, size: 128, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !265, file: !261, line: 50, baseType: !110, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !265, file: !261, line: 51, baseType: !110, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !261, line: 52, baseType: !258, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !265, file: !261, line: 53, baseType: !82, size: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !260, file: !261, line: 59, baseType: !134, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !260, file: !261, line: 60, baseType: !258, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !260, file: !261, line: 61, baseType: !274, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !170, line: 19, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !277, line: 59, size: 64, elements: !278)
!277 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!278 = !{!279, !362}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !277, line: 60, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !277, line: 18, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !277, line: 20, size: 352, elements: !283)
!283 = !{!284, !285, !286, !288, !289, !290, !291, !293, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !282, file: !277, line: 21, baseType: !110, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !282, file: !277, line: 22, baseType: !110, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !282, file: !277, line: 23, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !11, line: 222, baseType: !12)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !282, file: !277, line: 24, baseType: !287, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !282, file: !277, line: 26, baseType: !110, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !282, file: !277, line: 27, baseType: !110, size: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !282, file: !277, line: 28, baseType: !292, size: 32, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !277, line: 16, baseType: !16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !282, file: !277, line: 29, baseType: !294, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !170, line: 23, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !297, line: 16, size: 1216, elements: !298)
!297 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!298 = !{!299, !300, !301, !344, !345, !346, !347, !348}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !296, file: !297, line: 17, baseType: !216, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !297, line: 18, baseType: !129, size: 64, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !296, file: !297, line: 19, baseType: !302, size: 960, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !217, line: 17, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !304, line: 4, size: 960, elements: !305)
!304 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!305 = !{!306, !308, !309, !311, !312, !314, !315, !317, !319, !321, !322, !323, !324, !325, !326, !328, !329, !331, !332, !337, !338, !339}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !303, file: !304, line: 6, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !11, line: 232, baseType: !24)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !303, file: !304, line: 7, baseType: !307, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !303, file: !304, line: 8, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !11, line: 227, baseType: !24)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !303, file: !304, line: 9, baseType: !310, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !303, file: !304, line: 10, baseType: !313, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !11, line: 217, baseType: !24)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !303, file: !304, line: 11, baseType: !313, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !303, file: !304, line: 13, baseType: !316, size: 32, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !11, line: 212, baseType: !24)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !303, file: !304, line: 14, baseType: !318, size: 32, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !11, line: 304, baseType: !24)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !303, file: !304, line: 15, baseType: !320, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !11, line: 309, baseType: !24)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !303, file: !304, line: 16, baseType: !24, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !303, file: !304, line: 17, baseType: !307, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !303, file: !304, line: 18, baseType: !307, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !303, file: !304, line: 19, baseType: !287, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !303, file: !304, line: 20, baseType: !287, size: 32, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !303, file: !304, line: 21, baseType: !327, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !11, line: 237, baseType: !20)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !303, file: !304, line: 22, baseType: !327, size: 32, offset: 480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !303, file: !304, line: 23, baseType: !330, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !11, line: 242, baseType: !12)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !303, file: !304, line: 24, baseType: !330, size: 32, offset: 544)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !303, file: !304, line: 26, baseType: !333, size: 64, offset: 576)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !11, line: 288, size: 64, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !333, file: !11, line: 288, baseType: !19, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !333, file: !11, line: 288, baseType: !20, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !303, file: !304, line: 27, baseType: !333, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !303, file: !304, line: 28, baseType: !333, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !303, file: !304, line: 29, baseType: !340, size: 192, offset: 768)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 192, elements: !342)
!341 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !296, file: !297, line: 21, baseType: !287, size: 32, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !296, file: !297, line: 22, baseType: !287, size: 32, offset: 1120)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !296, file: !297, line: 24, baseType: !203, size: 32, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !296, file: !297, line: 37, baseType: !24, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !296, file: !297, line: 38, baseType: !24, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !282, file: !277, line: 30, baseType: !280, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !282, file: !277, line: 34, baseType: !24, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !282, file: !277, line: 40, baseType: !24, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !282, file: !277, line: 43, baseType: !24, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !282, file: !277, line: 45, baseType: !24, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !282, file: !277, line: 46, baseType: !24, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !282, file: !277, line: 47, baseType: !24, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !282, file: !277, line: 48, baseType: !24, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !282, file: !277, line: 49, baseType: !24, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !282, file: !277, line: 50, baseType: !24, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !282, file: !277, line: 52, baseType: !24, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !282, file: !277, line: 53, baseType: !24, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !282, file: !277, line: 55, baseType: !12, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !277, line: 61, baseType: !274, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !260, file: !261, line: 62, baseType: !364, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !261, line: 41, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !261, line: 43, size: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !261, line: 44, baseType: !364, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !366, file: !261, line: 45, baseType: !16, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !260, file: !261, line: 63, baseType: !371, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !261, line: 32, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !261, line: 34, size: 96, elements: !374)
!374 = !{!375, !380, !381}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !373, file: !261, line: 35, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !261, line: 30, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !16}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !373, file: !261, line: 36, baseType: !16, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !373, file: !261, line: 37, baseType: !371, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !260, file: !261, line: 64, baseType: !203, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "last_connection", scope: !165, file: !86, line: 159, baseType: !82, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name_rbtree", scope: !165, file: !86, line: 161, baseType: !385, size: 96, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !81, line: 32, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !81, line: 37, size: 96, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !386, file: !81, line: 38, baseType: !95, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !386, file: !81, line: 39, baseType: !95, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !386, file: !81, line: 40, baseType: !391, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !81, line: 34, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !95, !95, !95}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name_sentinel", scope: !165, file: !86, line: 162, baseType: !90, size: 160, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "srv_rbtree", scope: !165, file: !86, line: 164, baseType: !385, size: 96, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "srv_sentinel", scope: !165, file: !86, line: 165, baseType: !90, size: 160, offset: 672)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "addr_rbtree", scope: !165, file: !86, line: 167, baseType: !385, size: 96, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "addr_sentinel", scope: !165, file: !86, line: 168, baseType: !90, size: 160, offset: 928)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "name_resend_queue", scope: !165, file: !86, line: 170, baseType: !102, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "srv_resend_queue", scope: !165, file: !86, line: 171, baseType: !102, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "addr_resend_queue", scope: !165, file: !86, line: 172, baseType: !102, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name_expire_queue", scope: !165, file: !86, line: 174, baseType: !102, size: 64, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "srv_expire_queue", scope: !165, file: !86, line: 175, baseType: !102, size: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "addr_expire_queue", scope: !165, file: !86, line: 176, baseType: !102, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !165, file: !86, line: 179, baseType: !82, size: 32, offset: 1472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "addr6_rbtree", scope: !165, file: !86, line: 180, baseType: !385, size: 96, offset: 1504)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "addr6_sentinel", scope: !165, file: !86, line: 181, baseType: !90, size: 160, offset: 1600)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "addr6_resend_queue", scope: !165, file: !86, line: 182, baseType: !102, size: 64, offset: 1760)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "addr6_expire_queue", scope: !165, file: !86, line: 183, baseType: !102, size: 64, offset: 1824)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "resend_timeout", scope: !165, file: !86, line: 186, baseType: !19, size: 32, offset: 1888)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timeout", scope: !165, file: !86, line: 187, baseType: !19, size: 32, offset: 1920)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "expire", scope: !165, file: !86, line: 188, baseType: !19, size: 32, offset: 1952)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !165, file: !86, line: 189, baseType: !19, size: 32, offset: 1984)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !165, file: !86, line: 191, baseType: !82, size: 32, offset: 2016)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !159, file: !86, line: 198, baseType: !84, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !159, file: !86, line: 201, baseType: !8, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !159, file: !86, line: 203, baseType: !8, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !86, line: 204, baseType: !129, size: 64, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "service", scope: !159, file: !86, line: 205, baseType: !129, size: 64, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !159, file: !86, line: 207, baseType: !19, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs", scope: !159, file: !86, line: 208, baseType: !82, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !159, file: !86, line: 209, baseType: !424, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_addr_t", file: !86, line: 67, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 61, size: 160, elements: !427)
!427 = !{!428, !429, !431, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !426, file: !86, line: 62, baseType: !25, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !426, file: !86, line: 63, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !11, line: 404, baseType: !24)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !86, line: 64, baseType: !129, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !426, file: !86, line: 65, baseType: !76, size: 16, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !426, file: !86, line: 66, baseType: !76, size: 16, offset: 144)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !159, file: !86, line: 210, baseType: !425, size: 160, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !159, file: !86, line: 211, baseType: !66, size: 128, offset: 544)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !159, file: !86, line: 213, baseType: !82, size: 32, offset: 672)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nsrvs", scope: !159, file: !86, line: 214, baseType: !82, size: 32, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "srvs", scope: !159, file: !86, line: 215, baseType: !439, size: 32, offset: 736)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_srv_name_t", file: !86, line: 89, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 78, size: 256, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !86, line: 79, baseType: !129, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !441, file: !86, line: 80, baseType: !76, size: 16, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !441, file: !86, line: 81, baseType: !76, size: 16, offset: 80)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !441, file: !86, line: 82, baseType: !76, size: 16, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !441, file: !86, line: 84, baseType: !157, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !441, file: !86, line: 85, baseType: !8, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs", scope: !441, file: !86, line: 87, baseType: !82, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !441, file: !86, line: 88, baseType: !451, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_addr_t", file: !453, line: 78, baseType: !454)
!453 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 74, size: 128, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !454, file: !453, line: 75, baseType: !25, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !454, file: !453, line: 76, baseType: !430, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !453, line: 77, baseType: !129, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !159, file: !86, line: 217, baseType: !460, size: 32, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_handler_pt", file: !86, line: 58, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !157}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !86, line: 218, baseType: !16, size: 32, offset: 800)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !86, line: 219, baseType: !78, size: 32, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "quick", scope: !159, file: !86, line: 221, baseType: !82, size: 32, offset: 864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "recursion", scope: !159, file: !86, line: 222, baseType: !82, size: 32, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !159, file: !86, line: 223, baseType: !168, size: 32, offset: 928)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_hdr_t", file: !3, line: 32, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 19, size: 96, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ident_hi", scope: !471, file: !3, line: 20, baseType: !99, size: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ident_lo", scope: !471, file: !3, line: 21, baseType: !99, size: 8, offset: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags_hi", scope: !471, file: !3, line: 22, baseType: !99, size: 8, offset: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags_lo", scope: !471, file: !3, line: 23, baseType: !99, size: 8, offset: 24)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nqs_hi", scope: !471, file: !3, line: 24, baseType: !99, size: 8, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nqs_lo", scope: !471, file: !3, line: 25, baseType: !99, size: 8, offset: 40)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nan_hi", scope: !471, file: !3, line: 26, baseType: !99, size: 8, offset: 48)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nan_lo", scope: !471, file: !3, line: 27, baseType: !99, size: 8, offset: 56)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nns_hi", scope: !471, file: !3, line: 28, baseType: !99, size: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nns_lo", scope: !471, file: !3, line: 29, baseType: !99, size: 8, offset: 72)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nar_hi", scope: !471, file: !3, line: 30, baseType: !99, size: 8, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nar_lo", scope: !471, file: !3, line: 31, baseType: !99, size: 8, offset: 88)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_qs_t", file: !3, line: 40, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 32, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type_hi", scope: !487, file: !3, line: 36, baseType: !99, size: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type_lo", scope: !487, file: !3, line: 37, baseType: !99, size: 8, offset: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "class_hi", scope: !487, file: !3, line: 38, baseType: !99, size: 8, offset: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "class_lo", scope: !487, file: !3, line: 39, baseType: !99, size: 8, offset: 24)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !79, line: 17, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !81, line: 17, baseType: !8)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !496, line: 17, baseType: !12)
!496 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_an_t", file: !3, line: 51, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 43, size: 80, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !507, !508}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type_hi", scope: !499, file: !3, line: 44, baseType: !99, size: 8)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type_lo", scope: !499, file: !3, line: 45, baseType: !99, size: 8, offset: 8)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "class_hi", scope: !499, file: !3, line: 46, baseType: !99, size: 8, offset: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "class_lo", scope: !499, file: !3, line: 47, baseType: !99, size: 8, offset: 24)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !499, file: !3, line: 48, baseType: !506, size: 32, offset: 32)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !62)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "len_hi", scope: !499, file: !3, line: 49, baseType: !99, size: 8, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "len_lo", scope: !499, file: !3, line: 50, baseType: !99, size: 8, offset: 72)
!509 = !{!0}
!510 = !{!511}
!511 = !DILocalVariable(name: "err", arg: 1, scope: !2, file: !3, line: 4337, type: !8)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 5)
!515 = !{i32 2, !"Dwarf Version", i32 4}
!516 = !{i32 2, !"Debug Info Version", i32 3}
!517 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!518 = distinct !DISubprogram(name: "ngx_resolver_create", scope: !3, file: !3, line: 133, type: !519, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !761)
!519 = !DISubroutineType(types: !520)
!520 = !{!163, !521, !760, !82}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !170, line: 16, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !213, line: 116, size: 384, elements: !524)
!524 = !{!525, !526, !528, !742, !743, !744, !753, !754, !755, !756, !757, !759}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !213, line: 117, baseType: !6, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !523, file: !213, line: 118, baseType: !527, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !523, file: !213, line: 120, baseType: !529, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !170, line: 17, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !532, line: 38, size: 2496, elements: !533)
!532 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!533 = !{!534, !538, !539, !540, !541, !542, !647, !648, !649, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !531, file: !532, line: 39, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !531, file: !532, line: 40, baseType: !258, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !531, file: !532, line: 42, baseType: !203, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !531, file: !532, line: 43, baseType: !204, size: 320, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !531, file: !532, line: 45, baseType: !82, size: 32, offset: 416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !531, file: !532, line: 47, baseType: !543, size: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !170, line: 26, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !547, line: 121, size: 896, elements: !548)
!547 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!548 = !{!549, !550, !551, !552, !553, !560, !562, !567, !572, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !546, file: !547, line: 122, baseType: !16, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !546, file: !547, line: 123, baseType: !168, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !546, file: !547, line: 124, baseType: !168, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !546, file: !547, line: 126, baseType: !495, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !546, file: !547, line: 128, baseType: !554, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !555, line: 19, baseType: !556)
!555 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DISubroutineType(types: !558)
!558 = !{!559, !544, !110, !134}
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !11, line: 135, baseType: !12)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !546, file: !547, line: 129, baseType: !561, size: 32, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !555, line: 22, baseType: !556)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !546, file: !547, line: 130, baseType: !563, size: 32, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !555, line: 20, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{!559, !544, !274, !287}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !546, file: !547, line: 131, baseType: !568, size: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !555, line: 23, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{!274, !544, !274, !287}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !546, file: !547, line: 133, baseType: !573, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !547, line: 16, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !547, line: 18, size: 960, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !575, file: !547, line: 19, baseType: !495, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !575, file: !547, line: 21, baseType: !25, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !575, file: !547, line: 22, baseType: !430, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !575, file: !547, line: 23, baseType: !134, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !575, file: !547, line: 24, baseType: !129, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !547, line: 26, baseType: !12, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !575, file: !547, line: 28, baseType: !12, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !575, file: !547, line: 29, baseType: !12, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !575, file: !547, line: 30, baseType: !12, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !575, file: !547, line: 38, baseType: !587, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !170, line: 32, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !544}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !575, file: !547, line: 40, baseType: !16, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !575, file: !547, line: 42, baseType: !204, size: 320, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !575, file: !547, line: 43, baseType: !203, size: 32, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !575, file: !547, line: 45, baseType: !134, size: 32, offset: 736)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !575, file: !547, line: 47, baseType: !134, size: 32, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !575, file: !547, line: 49, baseType: !78, size: 32, offset: 800)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !575, file: !547, line: 51, baseType: !573, size: 32, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !575, file: !547, line: 52, baseType: !544, size: 32, offset: 864)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !575, file: !547, line: 54, baseType: !82, size: 32, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !575, file: !547, line: 56, baseType: !24, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !575, file: !547, line: 57, baseType: !24, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !575, file: !547, line: 58, baseType: !24, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !575, file: !547, line: 60, baseType: !24, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !575, file: !547, line: 61, baseType: !24, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !575, file: !547, line: 62, baseType: !24, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !575, file: !547, line: 63, baseType: !24, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !575, file: !547, line: 64, baseType: !24, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !575, file: !547, line: 65, baseType: !24, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !575, file: !547, line: 66, baseType: !24, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !575, file: !547, line: 67, baseType: !24, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !575, file: !547, line: 70, baseType: !24, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !575, file: !547, line: 72, baseType: !24, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !575, file: !547, line: 73, baseType: !24, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !575, file: !547, line: 74, baseType: !24, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !575, file: !547, line: 76, baseType: !24, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !575, file: !547, line: 77, baseType: !24, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !575, file: !547, line: 78, baseType: !24, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !546, file: !547, line: 135, baseType: !287, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !546, file: !547, line: 137, baseType: !203, size: 32, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !546, file: !547, line: 139, baseType: !258, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !547, line: 141, baseType: !12, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !546, file: !547, line: 143, baseType: !25, size: 32, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !546, file: !547, line: 144, baseType: !430, size: 32, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !546, file: !547, line: 145, baseType: !129, size: 64, offset: 480)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !546, file: !547, line: 147, baseType: !129, size: 64, offset: 544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !546, file: !547, line: 148, baseType: !41, size: 16, offset: 608)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !546, file: !547, line: 154, baseType: !25, size: 32, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !546, file: !547, line: 155, baseType: !430, size: 32, offset: 672)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !546, file: !547, line: 157, baseType: !280, size: 32, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !546, file: !547, line: 159, baseType: !102, size: 64, offset: 736)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !546, file: !547, line: 161, baseType: !225, size: 32, offset: 800)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !546, file: !547, line: 163, baseType: !82, size: 32, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !546, file: !547, line: 165, baseType: !24, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !546, file: !547, line: 167, baseType: !24, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !546, file: !547, line: 169, baseType: !24, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !546, file: !547, line: 170, baseType: !24, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !546, file: !547, line: 171, baseType: !24, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !546, file: !547, line: 173, baseType: !24, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !546, file: !547, line: 174, baseType: !24, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !546, file: !547, line: 175, baseType: !24, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !546, file: !547, line: 176, baseType: !24, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !546, file: !547, line: 178, baseType: !24, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !546, file: !547, line: 179, baseType: !24, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !546, file: !547, line: 180, baseType: !24, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !546, file: !547, line: 181, baseType: !24, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !546, file: !547, line: 183, baseType: !24, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !531, file: !532, line: 48, baseType: !544, size: 32, offset: 480)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !531, file: !532, line: 49, baseType: !82, size: 32, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !531, file: !532, line: 51, baseType: !650, size: 32, offset: 544)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !170, line: 15, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !654, line: 222, size: 800, elements: !655)
!654 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !678, !679, !683, !687, !688, !689, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !653, file: !654, line: 223, baseType: !82, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !653, file: !654, line: 224, baseType: !82, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !654, line: 226, baseType: !6, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !653, file: !654, line: 228, baseType: !82, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !653, file: !654, line: 229, baseType: !82, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !653, file: !654, line: 231, baseType: !82, size: 32, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !653, file: !654, line: 232, baseType: !17, size: 32, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !653, file: !654, line: 234, baseType: !16, size: 32, offset: 224)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !653, file: !654, line: 235, baseType: !665, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !170, line: 22, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !213, line: 77, size: 224, elements: !668)
!668 = !{!669, !670, !671, !675, !676, !677}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !213, line: 78, baseType: !129, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !213, line: 79, baseType: !82, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !667, file: !213, line: 80, baseType: !672, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DISubroutineType(types: !674)
!674 = !{!6, !521, !665, !16}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !667, file: !213, line: 81, baseType: !82, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !667, file: !213, line: 82, baseType: !82, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !667, file: !213, line: 83, baseType: !16, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !654, line: 236, baseType: !82, size: 32, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !653, file: !654, line: 238, baseType: !680, size: 32, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DISubroutineType(types: !682)
!682 = !{!8, !203}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !653, file: !654, line: 240, baseType: !684, size: 32, offset: 352)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DISubroutineType(types: !686)
!686 = !{!8, !529}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !653, file: !654, line: 242, baseType: !684, size: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !653, file: !654, line: 243, baseType: !684, size: 32, offset: 416)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !653, file: !654, line: 244, baseType: !690, size: 32, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !529}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !653, file: !654, line: 245, baseType: !690, size: 32, offset: 480)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !653, file: !654, line: 247, baseType: !690, size: 32, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !653, file: !654, line: 249, baseType: !83, size: 32, offset: 544)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !653, file: !654, line: 250, baseType: !83, size: 32, offset: 576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !653, file: !654, line: 251, baseType: !83, size: 32, offset: 608)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !653, file: !654, line: 252, baseType: !83, size: 32, offset: 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !653, file: !654, line: 253, baseType: !83, size: 32, offset: 672)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !653, file: !654, line: 254, baseType: !83, size: 32, offset: 704)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !653, file: !654, line: 255, baseType: !83, size: 32, offset: 736)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !653, file: !654, line: 256, baseType: !83, size: 32, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !531, file: !532, line: 52, baseType: !82, size: 32, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !531, file: !532, line: 53, baseType: !82, size: 32, offset: 608)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !531, file: !532, line: 55, baseType: !102, size: 64, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !531, file: !532, line: 56, baseType: !82, size: 32, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !531, file: !532, line: 58, baseType: !249, size: 160, offset: 736)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !531, file: !532, line: 59, baseType: !249, size: 160, offset: 896)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !531, file: !532, line: 61, baseType: !249, size: 160, offset: 1056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !531, file: !532, line: 62, baseType: !385, size: 96, offset: 1216)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !531, file: !532, line: 63, baseType: !90, size: 160, offset: 1312)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !531, file: !532, line: 65, baseType: !713, size: 224, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !714, line: 31, baseType: !715)
!714 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 25, size: 224, elements: !716)
!716 = !{!717, !725, !726, !727, !728}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !715, file: !714, line: 26, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !714, line: 16, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !714, line: 18, size: 96, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !720, file: !714, line: 19, baseType: !16, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !720, file: !714, line: 20, baseType: !82, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !714, line: 21, baseType: !718, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !715, file: !714, line: 27, baseType: !719, size: 96, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !715, file: !714, line: 28, baseType: !134, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !715, file: !714, line: 29, baseType: !82, size: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !715, file: !714, line: 30, baseType: !258, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !531, file: !532, line: 66, baseType: !713, size: 224, offset: 1696)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !531, file: !532, line: 68, baseType: !82, size: 32, offset: 1920)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !531, file: !532, line: 69, baseType: !82, size: 32, offset: 1952)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !531, file: !532, line: 71, baseType: !544, size: 32, offset: 1984)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !531, file: !532, line: 72, baseType: !168, size: 32, offset: 2016)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !531, file: !532, line: 73, baseType: !168, size: 32, offset: 2048)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !531, file: !532, line: 75, baseType: !529, size: 32, offset: 2080)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !531, file: !532, line: 77, baseType: !129, size: 64, offset: 2112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !531, file: !532, line: 78, baseType: !129, size: 64, offset: 2176)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !531, file: !532, line: 79, baseType: !129, size: 64, offset: 2240)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !531, file: !532, line: 80, baseType: !129, size: 64, offset: 2304)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !531, file: !532, line: 81, baseType: !129, size: 64, offset: 2368)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !531, file: !532, line: 82, baseType: !129, size: 64, offset: 2432)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !523, file: !213, line: 121, baseType: !258, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !523, file: !213, line: 122, baseType: !258, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !523, file: !213, line: 123, baseType: !745, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !213, line: 103, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 98, size: 1344, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !747, file: !213, line: 99, baseType: !295, size: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !747, file: !213, line: 100, baseType: !280, size: 32, offset: 1216)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !747, file: !213, line: 101, baseType: !280, size: 32, offset: 1248)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !747, file: !213, line: 102, baseType: !82, size: 32, offset: 1280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !523, file: !213, line: 124, baseType: !203, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !523, file: !213, line: 126, baseType: !16, size: 32, offset: 224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !523, file: !213, line: 127, baseType: !82, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !523, file: !213, line: 128, baseType: !82, size: 32, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !523, file: !213, line: 130, baseType: !758, size: 32, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !213, line: 112, baseType: !672)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !523, file: !213, line: 131, baseType: !6, size: 32, offset: 352)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!761 = !{!762, !763, !764, !765, !766, !802, !803, !804, !805, !806}
!762 = !DILocalVariable(name: "cf", arg: 1, scope: !518, file: !3, line: 133, type: !521)
!763 = !DILocalVariable(name: "names", arg: 2, scope: !518, file: !3, line: 133, type: !760)
!764 = !DILocalVariable(name: "n", arg: 3, scope: !518, file: !3, line: 133, type: !82)
!765 = !DILocalVariable(name: "s", scope: !518, file: !3, line: 135, type: !129)
!766 = !DILocalVariable(name: "u", scope: !518, file: !3, line: 136, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_url_t", file: !453, line: 105, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 81, size: 1376, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !799, !800, !801}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !768, file: !453, line: 82, baseType: !129, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !768, file: !453, line: 83, baseType: !129, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "port_text", scope: !768, file: !453, line: 84, baseType: !129, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !768, file: !453, line: 85, baseType: !129, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !768, file: !453, line: 87, baseType: !41, size: 16, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "default_port", scope: !768, file: !453, line: 88, baseType: !41, size: 16, offset: 272)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !768, file: !453, line: 89, baseType: !12, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !768, file: !453, line: 91, baseType: !24, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "uri_part", scope: !768, file: !453, line: 92, baseType: !24, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "no_resolve", scope: !768, file: !453, line: 93, baseType: !24, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "no_port", scope: !768, file: !453, line: 95, baseType: !24, size: 1, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !768, file: !453, line: 96, baseType: !24, size: 1, offset: 324, flags: DIFlagBitField, extraData: i64 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !768, file: !453, line: 98, baseType: !430, size: 32, offset: 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !768, file: !453, line: 99, baseType: !784, size: 896, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_sockaddr_t", file: !453, line: 44, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !453, line: 35, size: 896, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !785, file: !453, line: 36, baseType: !26, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in", scope: !785, file: !453, line: 37, baseType: !66, size: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_in6", scope: !785, file: !453, line: 39, baseType: !37, size: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr_un", scope: !785, file: !453, line: 42, baseType: !791, size: 880)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !792, line: 17, size: 880, elements: !793)
!792 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/un.h", directory: "/home/sam/Projects/nginx-1.12.2")
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !791, file: !792, line: 18, baseType: !30, size: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !791, file: !792, line: 19, baseType: !796, size: 864, offset: 16)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 864, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 108)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !768, file: !453, line: 101, baseType: !451, size: 32, offset: 1280)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "naddrs", scope: !768, file: !453, line: 102, baseType: !82, size: 32, offset: 1312)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !768, file: !453, line: 104, baseType: !6, size: 32, offset: 1344)
!802 = !DILocalVariable(name: "i", scope: !518, file: !3, line: 137, type: !82)
!803 = !DILocalVariable(name: "j", scope: !518, file: !3, line: 137, type: !82)
!804 = !DILocalVariable(name: "r", scope: !518, file: !3, line: 138, type: !163)
!805 = !DILocalVariable(name: "cln", scope: !518, file: !3, line: 139, type: !371)
!806 = !DILocalVariable(name: "rec", scope: !518, file: !3, line: 140, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_resolver_connection_t", file: !86, line: 53, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 43, size: 608, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !809, file: !86, line: 44, baseType: !544, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !809, file: !86, line: 45, baseType: !544, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !809, file: !86, line: 46, baseType: !25, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !809, file: !86, line: 47, baseType: !430, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !809, file: !86, line: 48, baseType: !129, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !809, file: !86, line: 49, baseType: !204, size: 320, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !809, file: !86, line: 50, baseType: !280, size: 32, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !809, file: !86, line: 51, baseType: !280, size: 32, offset: 544)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !809, file: !86, line: 52, baseType: !163, size: 32, offset: 576)
!820 = !{!821, !821, i64 0}
!821 = !{!"any pointer", !822, i64 0}
!822 = !{!"omnipotent char", !823, i64 0}
!823 = !{!"Simple C/C++ TBAA"}
!824 = !DIExpression()
!825 = !DILocation(line: 133, column: 33, scope: !518)
!826 = !DILocation(line: 133, column: 48, scope: !518)
!827 = !{!828, !828, i64 0}
!828 = !{!"int", !822, i64 0}
!829 = !DILocation(line: 133, column: 66, scope: !518)
!830 = !DILocation(line: 135, column: 5, scope: !518)
!831 = !DILocation(line: 135, column: 33, scope: !518)
!832 = !DILocation(line: 136, column: 5, scope: !518)
!833 = !DILocation(line: 136, column: 33, scope: !518)
!834 = !DILocation(line: 137, column: 5, scope: !518)
!835 = !DILocation(line: 137, column: 33, scope: !518)
!836 = !DILocation(line: 137, column: 36, scope: !518)
!837 = !DILocation(line: 138, column: 5, scope: !518)
!838 = !DILocation(line: 138, column: 33, scope: !518)
!839 = !DILocation(line: 139, column: 5, scope: !518)
!840 = !DILocation(line: 139, column: 33, scope: !518)
!841 = !DILocation(line: 140, column: 5, scope: !518)
!842 = !DILocation(line: 140, column: 33, scope: !518)
!843 = !DILocation(line: 142, column: 32, scope: !518)
!844 = !DILocation(line: 142, column: 36, scope: !518)
!845 = !{!846, !821, i64 12}
!846 = !{!"ngx_conf_s", !821, i64 0, !821, i64 4, !821, i64 8, !821, i64 12, !821, i64 16, !821, i64 20, !821, i64 24, !821, i64 28, !828, i64 32, !828, i64 36, !821, i64 40, !821, i64 44}
!847 = !DILocation(line: 142, column: 11, scope: !518)
!848 = !DILocation(line: 142, column: 9, scope: !518)
!849 = !DILocation(line: 143, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !518, file: !3, line: 143, column: 9)
!851 = !DILocation(line: 143, column: 13, scope: !850)
!852 = !DILocation(line: 143, column: 9, scope: !518)
!853 = !DILocation(line: 144, column: 9, scope: !854)
!854 = distinct !DILexicalBlock(scope: !850, file: !3, line: 143, column: 22)
!855 = !DILocation(line: 147, column: 5, scope: !518)
!856 = !DILocation(line: 147, column: 10, scope: !518)
!857 = !DILocation(line: 147, column: 18, scope: !518)
!858 = !{!859, !821, i64 0}
!859 = !{!"ngx_pool_cleanup_s", !821, i64 0, !821, i64 4, !821, i64 8}
!860 = !DILocation(line: 149, column: 44, scope: !518)
!861 = !DILocation(line: 149, column: 48, scope: !518)
!862 = !{!846, !821, i64 24}
!863 = !DILocation(line: 149, column: 9, scope: !518)
!864 = !DILocation(line: 149, column: 7, scope: !518)
!865 = !DILocation(line: 150, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !518, file: !3, line: 150, column: 9)
!867 = !DILocation(line: 150, column: 11, scope: !866)
!868 = !DILocation(line: 150, column: 9, scope: !518)
!869 = !DILocation(line: 151, column: 9, scope: !870)
!870 = distinct !DILexicalBlock(scope: !866, file: !3, line: 150, column: 20)
!871 = !DILocation(line: 154, column: 17, scope: !518)
!872 = !DILocation(line: 154, column: 5, scope: !518)
!873 = !DILocation(line: 154, column: 10, scope: !518)
!874 = !DILocation(line: 154, column: 15, scope: !518)
!875 = !{!859, !821, i64 4}
!876 = !DILocation(line: 156, column: 48, scope: !518)
!877 = !DILocation(line: 156, column: 52, scope: !518)
!878 = !DILocation(line: 156, column: 16, scope: !518)
!879 = !DILocation(line: 156, column: 5, scope: !518)
!880 = !DILocation(line: 156, column: 8, scope: !518)
!881 = !DILocation(line: 156, column: 14, scope: !518)
!882 = !{!883, !821, i64 0}
!883 = !{!"ngx_resolver_s", !821, i64 0, !821, i64 4, !821, i64 8, !828, i64 12, !884, i64 16, !828, i64 36, !885, i64 40, !886, i64 52, !885, i64 72, !886, i64 84, !885, i64 104, !886, i64 116, !887, i64 136, !887, i64 144, !887, i64 152, !887, i64 160, !887, i64 168, !887, i64 176, !828, i64 184, !885, i64 188, !886, i64 200, !887, i64 220, !887, i64 228, !888, i64 236, !888, i64 240, !888, i64 244, !888, i64 248, !828, i64 252}
