; ModuleID = 'src/core/ngx_log.c'
source_filename = "src/core/ngx_log.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_core_module_t = type { %struct.ngx_str_t, i8* (%struct.ngx_cycle_s*)*, i8* (%struct.ngx_cycle_s*, i8*)* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_errlog_module_ctx", scope: !2, file: !3, line: 47, type: !527, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !14)
!3 = !DIFile(filename: "src/core/ngx_log.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !10, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !8, line: 64, baseType: !9)
!8 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !{!15, !500, !502, !508, !510, !0, !512, !517, !522}
!15 = !DIGlobalVariableExpression(var: !16)
!16 = distinct !DIGlobalVariable(name: "ngx_errlog_module", scope: !2, file: !3, line: 54, type: !17, isLocal: false, isDefinition: true)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !18, line: 15, baseType: !19)
!18 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !20, line: 222, size: 800, elements: !21)
!20 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!21 = !{!22, !28, !29, !31, !32, !33, !34, !35, !36, !473, !474, !480, !484, !485, !486, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !19, file: !20, line: 223, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !24, line: 79, baseType: !25)
!24 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !26, line: 125, baseType: !27)
!26 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !19, file: !20, line: 224, baseType: !23, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !20, line: 226, baseType: !30, size: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !19, file: !20, line: 228, baseType: !23, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !19, file: !20, line: 229, baseType: !23, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !19, file: !20, line: 231, baseType: !23, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !19, file: !20, line: 232, baseType: !10, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !19, file: !20, line: 234, baseType: !13, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !19, file: !20, line: 235, baseType: !37, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !18, line: 22, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !40, line: 77, size: 224, elements: !41)
!40 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!41 = !{!42, !50, !51, !470, !471, !472}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 78, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !44, line: 19, baseType: !45)
!44 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 16, size: 64, elements: !46)
!46 = !{!47, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !44, line: 17, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 120, baseType: !27)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !44, line: 18, baseType: !6, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !40, line: 79, baseType: !23, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !39, file: !40, line: 80, baseType: !52, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!30, !55, !37, !13}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !18, line: 16, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !40, line: 116, size: 384, elements: !58)
!58 = !{!59, !60, !238, !452, !453, !454, !463, !464, !465, !466, !467, !469}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !40, line: 117, baseType: !30, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !57, file: !40, line: 118, baseType: !61, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !63, line: 22, baseType: !64)
!63 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !63, line: 16, size: 160, elements: !65)
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !64, file: !63, line: 17, baseType: !13, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !64, file: !63, line: 18, baseType: !23, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !64, file: !63, line: 19, baseType: !48, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !64, file: !63, line: 20, baseType: !23, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !64, file: !63, line: 21, baseType: !71, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !18, line: 18, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !74, line: 57, size: 320, elements: !75)
!74 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = !{!76, !84, !85, !86, !218, !225, !237}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !73, file: !74, line: 58, baseType: !77, size: 128)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !74, line: 54, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 49, size: 128, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !78, file: !74, line: 50, baseType: !6, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !78, file: !74, line: 51, baseType: !6, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !74, line: 52, baseType: !71, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !78, file: !74, line: 53, baseType: !23, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !73, file: !74, line: 59, baseType: !48, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !73, file: !74, line: 60, baseType: !71, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !73, file: !74, line: 61, baseType: !87, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !18, line: 19, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !90, line: 59, size: 64, elements: !91)
!90 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!91 = !{!92, !217}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !89, file: !90, line: 60, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !90, line: 18, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !90, line: 20, size: 352, elements: !96)
!96 = !{!97, !98, !99, !102, !103, !104, !105, !107, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !95, file: !90, line: 21, baseType: !6, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !95, file: !90, line: 22, baseType: !6, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !95, file: !90, line: 23, baseType: !100, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !26, line: 222, baseType: !101)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !95, file: !90, line: 24, baseType: !100, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !95, file: !90, line: 26, baseType: !6, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !95, file: !90, line: 27, baseType: !6, size: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !95, file: !90, line: 28, baseType: !106, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !90, line: 16, baseType: !13)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !95, file: !90, line: 29, baseType: !108, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !18, line: 23, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !111, line: 16, size: 1216, elements: !112)
!111 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!112 = !{!113, !116, !117, !162, !163, !164, !202, !203}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !110, file: !111, line: 17, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !115, line: 16, baseType: !101)
!115 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 18, baseType: !43, size: 64, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !110, file: !111, line: 19, baseType: !118, size: 960, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !115, line: 17, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !120, line: 4, size: 960, elements: !121)
!120 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!121 = !{!122, !124, !125, !127, !128, !130, !131, !133, !135, !137, !138, !139, !140, !141, !142, !145, !146, !148, !149, !155, !156, !157}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !119, file: !120, line: 6, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !26, line: 232, baseType: !27)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !119, file: !120, line: 7, baseType: !123, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !119, file: !120, line: 8, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !26, line: 227, baseType: !27)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !119, file: !120, line: 9, baseType: !126, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !119, file: !120, line: 10, baseType: !129, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !26, line: 217, baseType: !27)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !119, file: !120, line: 11, baseType: !129, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !119, file: !120, line: 13, baseType: !132, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !26, line: 212, baseType: !27)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !119, file: !120, line: 14, baseType: !134, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !26, line: 304, baseType: !27)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !119, file: !120, line: 15, baseType: !136, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !26, line: 309, baseType: !27)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !119, file: !120, line: 16, baseType: !27, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !119, file: !120, line: 17, baseType: !123, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !119, file: !120, line: 18, baseType: !123, size: 32, offset: 352)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !119, file: !120, line: 19, baseType: !100, size: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !119, file: !120, line: 20, baseType: !100, size: 32, offset: 416)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !119, file: !120, line: 21, baseType: !143, size: 32, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !26, line: 237, baseType: !144)
!144 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !119, file: !120, line: 22, baseType: !143, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !119, file: !120, line: 23, baseType: !147, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !26, line: 242, baseType: !101)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !119, file: !120, line: 24, baseType: !147, size: 32, offset: 544)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !119, file: !120, line: 26, baseType: !150, size: 64, offset: 576)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !26, line: 288, size: 64, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !150, file: !26, line: 288, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !26, line: 75, baseType: !144)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !150, file: !26, line: 288, baseType: !144, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !119, file: !120, line: 27, baseType: !150, size: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !119, file: !120, line: 28, baseType: !150, size: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !119, file: !120, line: 29, baseType: !158, size: 192, offset: 768)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 192, elements: !160)
!159 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !110, file: !111, line: 21, baseType: !100, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !110, file: !111, line: 22, baseType: !100, size: 32, offset: 1120)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !110, file: !111, line: 24, baseType: !165, size: 32, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !18, line: 20, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !168, line: 50, size: 320, elements: !169)
!168 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!169 = !{!170, !171, !183, !187, !188, !193, !194, !199, !200, !201}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !167, file: !168, line: 51, baseType: !23, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !167, file: !168, line: 52, baseType: !172, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !18, line: 21, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !40, line: 89, size: 160, elements: !175)
!175 = !{!176, !177, !178, !182}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !174, file: !40, line: 90, baseType: !114, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !40, line: 91, baseType: !43, size: 64, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !174, file: !40, line: 93, baseType: !179, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !172, !165}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !40, line: 94, baseType: !13, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !167, file: !168, line: 54, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !185, line: 98, baseType: !186)
!185 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!186 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !167, file: !168, line: 56, baseType: !153, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !167, file: !168, line: 58, baseType: !189, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !168, line: 45, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!6, !165, !6, !48}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !168, line: 59, baseType: !13, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !167, file: !168, line: 61, baseType: !195, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !168, line: 46, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !165, !23, !6, !48}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !167, file: !168, line: 62, baseType: !13, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !167, file: !168, line: 70, baseType: !30, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !168, line: 72, baseType: !165, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !110, file: !111, line: 37, baseType: !27, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !110, file: !111, line: 38, baseType: !27, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !95, file: !90, line: 30, baseType: !93, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !95, file: !90, line: 34, baseType: !27, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !95, file: !90, line: 40, baseType: !27, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !95, file: !90, line: 43, baseType: !27, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !95, file: !90, line: 45, baseType: !27, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !95, file: !90, line: 46, baseType: !27, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !95, file: !90, line: 47, baseType: !27, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !95, file: !90, line: 48, baseType: !27, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !95, file: !90, line: 49, baseType: !27, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !95, file: !90, line: 50, baseType: !27, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !95, file: !90, line: 52, baseType: !27, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !95, file: !90, line: 53, baseType: !27, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !95, file: !90, line: 55, baseType: !101, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !90, line: 61, baseType: !87, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !73, file: !74, line: 62, baseType: !219, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !74, line: 41, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !74, line: 43, size: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !74, line: 44, baseType: !219, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !221, file: !74, line: 45, baseType: !13, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !73, file: !74, line: 63, baseType: !226, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !74, line: 32, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !74, line: 34, size: 96, elements: !229)
!229 = !{!230, !235, !236}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !228, file: !74, line: 35, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !74, line: 30, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !13}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !74, line: 36, baseType: !13, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !74, line: 37, baseType: !226, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !73, file: !74, line: 64, baseType: !165, size: 32, offset: 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !57, file: !40, line: 120, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !18, line: 17, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !242, line: 38, size: 2496, elements: !243)
!242 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!243 = !{!244, !248, !249, !250, !251, !252, !388, !389, !390, !393, !394, !395, !396, !397, !398, !399, !400, !421, !422, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !241, file: !242, line: 39, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !241, file: !242, line: 40, baseType: !71, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !242, line: 42, baseType: !165, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !241, file: !242, line: 43, baseType: !166, size: 320, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !241, file: !242, line: 45, baseType: !23, size: 32, offset: 416)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !241, file: !242, line: 47, baseType: !253, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !18, line: 26, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !257, line: 121, size: 896, elements: !258)
!257 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!258 = !{!259, !260, !264, !265, !268, !275, !277, !282, !287, !349, !350, !351, !352, !353, !354, !355, !356, !357, !361, !362, !363, !364, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !257, line: 122, baseType: !13, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !256, file: !257, line: 123, baseType: !261, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !18, line: 24, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !18, line: 24, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !256, file: !257, line: 124, baseType: !261, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !256, file: !257, line: 126, baseType: !266, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !267, line: 17, baseType: !101)
!267 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !256, file: !257, line: 128, baseType: !269, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !270, line: 19, baseType: !271)
!270 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !254, !6, !48}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 135, baseType: !101)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !256, file: !257, line: 129, baseType: !276, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !270, line: 22, baseType: !271)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !256, file: !257, line: 130, baseType: !278, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !270, line: 20, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!274, !254, !87, !100}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !256, file: !257, line: 131, baseType: !283, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !270, line: 23, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DISubroutineType(types: !286)
!286 = !{!87, !254, !87, !100}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !256, file: !257, line: 133, baseType: !288, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !257, line: 16, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !257, line: 18, size: 960, elements: !291)
!291 = !{!292, !293, !305, !307, !308, !309, !310, !311, !312, !313, !318, !319, !320, !321, !322, !323, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !290, file: !257, line: 19, baseType: !266, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !290, file: !257, line: 21, baseType: !294, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !296, line: 297, size: 128, elements: !297)
!296 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!297 = !{!298, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !295, file: !296, line: 298, baseType: !299, size: 16)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !26, line: 409, baseType: !300)
!300 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !295, file: !296, line: 299, baseType: !302, size: 112, offset: 16)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 112, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 14)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !290, file: !257, line: 22, baseType: !306, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !26, line: 404, baseType: !27)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !290, file: !257, line: 23, baseType: !48, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !290, file: !257, line: 24, baseType: !43, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !257, line: 26, baseType: !101, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !290, file: !257, line: 28, baseType: !101, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !290, file: !257, line: 29, baseType: !101, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !290, file: !257, line: 30, baseType: !101, size: 32, offset: 288)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !290, file: !257, line: 38, baseType: !314, size: 32, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !18, line: 32, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !254}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !290, file: !257, line: 40, baseType: !13, size: 32, offset: 352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !290, file: !257, line: 42, baseType: !166, size: 320, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !290, file: !257, line: 43, baseType: !165, size: 32, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !290, file: !257, line: 45, baseType: !48, size: 32, offset: 736)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !290, file: !257, line: 47, baseType: !48, size: 32, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !290, file: !257, line: 49, baseType: !324, size: 32, offset: 800)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !325, line: 16, baseType: !326)
!325 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !327, line: 16, baseType: !23)
!327 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !290, file: !257, line: 51, baseType: !288, size: 32, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !290, file: !257, line: 52, baseType: !254, size: 32, offset: 864)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !290, file: !257, line: 54, baseType: !23, size: 32, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !290, file: !257, line: 56, baseType: !27, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !290, file: !257, line: 57, baseType: !27, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !290, file: !257, line: 58, baseType: !27, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !290, file: !257, line: 60, baseType: !27, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !290, file: !257, line: 61, baseType: !27, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !290, file: !257, line: 62, baseType: !27, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !290, file: !257, line: 63, baseType: !27, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !290, file: !257, line: 64, baseType: !27, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !290, file: !257, line: 65, baseType: !27, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !290, file: !257, line: 66, baseType: !27, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !290, file: !257, line: 67, baseType: !27, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !290, file: !257, line: 70, baseType: !27, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !290, file: !257, line: 72, baseType: !27, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !290, file: !257, line: 73, baseType: !27, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !290, file: !257, line: 74, baseType: !27, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !290, file: !257, line: 76, baseType: !27, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !290, file: !257, line: 77, baseType: !27, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !290, file: !257, line: 78, baseType: !27, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !256, file: !257, line: 135, baseType: !100, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !256, file: !257, line: 137, baseType: !165, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !257, line: 139, baseType: !71, size: 32, offset: 352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !257, line: 141, baseType: !101, size: 32, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !256, file: !257, line: 143, baseType: !294, size: 32, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !256, file: !257, line: 144, baseType: !306, size: 32, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !256, file: !257, line: 145, baseType: !43, size: 64, offset: 480)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !256, file: !257, line: 147, baseType: !43, size: 64, offset: 544)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !256, file: !257, line: 148, baseType: !358, size: 16, offset: 608)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !359, line: 12, baseType: !360)
!359 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 186, baseType: !300)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !256, file: !257, line: 154, baseType: !294, size: 32, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !256, file: !257, line: 155, baseType: !306, size: 32, offset: 672)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !256, file: !257, line: 157, baseType: !93, size: 32, offset: 704)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !256, file: !257, line: 159, baseType: !365, size: 64, offset: 736)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !366, line: 16, baseType: !367)
!366 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !366, line: 18, size: 64, elements: !368)
!368 = !{!369, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !366, line: 19, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !366, line: 20, baseType: !370, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !256, file: !257, line: 161, baseType: !184, size: 32, offset: 800)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !256, file: !257, line: 163, baseType: !23, size: 32, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !256, file: !257, line: 165, baseType: !27, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !256, file: !257, line: 167, baseType: !27, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !256, file: !257, line: 169, baseType: !27, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !256, file: !257, line: 170, baseType: !27, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !256, file: !257, line: 171, baseType: !27, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !256, file: !257, line: 173, baseType: !27, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !256, file: !257, line: 174, baseType: !27, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !256, file: !257, line: 175, baseType: !27, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !256, file: !257, line: 176, baseType: !27, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !256, file: !257, line: 178, baseType: !27, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !256, file: !257, line: 179, baseType: !27, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !256, file: !257, line: 180, baseType: !27, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !256, file: !257, line: 181, baseType: !27, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !256, file: !257, line: 183, baseType: !27, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !241, file: !242, line: 48, baseType: !254, size: 32, offset: 480)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !241, file: !242, line: 49, baseType: !23, size: 32, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !241, file: !242, line: 51, baseType: !391, size: 32, offset: 544)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !241, file: !242, line: 52, baseType: !23, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !241, file: !242, line: 53, baseType: !23, size: 32, offset: 608)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !241, file: !242, line: 55, baseType: !365, size: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !241, file: !242, line: 56, baseType: !23, size: 32, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !241, file: !242, line: 58, baseType: !62, size: 160, offset: 736)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !241, file: !242, line: 59, baseType: !62, size: 160, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !241, file: !242, line: 61, baseType: !62, size: 160, offset: 1056)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !241, file: !242, line: 62, baseType: !401, size: 96, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !327, line: 32, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !327, line: 37, size: 96, elements: !403)
!403 = !{!404, !415, !416}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !402, file: !327, line: 38, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !327, line: 20, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !327, line: 22, size: 160, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !407, file: !327, line: 23, baseType: !326, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !407, file: !327, line: 24, baseType: !405, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !407, file: !327, line: 25, baseType: !405, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !407, file: !327, line: 26, baseType: !405, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !407, file: !327, line: 27, baseType: !7, size: 8, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !407, file: !327, line: 28, baseType: !7, size: 8, offset: 136)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !402, file: !327, line: 39, baseType: !405, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !402, file: !327, line: 40, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !327, line: 34, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !405, !405, !405}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !241, file: !242, line: 63, baseType: !406, size: 160, offset: 1312)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !241, file: !242, line: 65, baseType: !423, size: 224, offset: 1472)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !424, line: 31, baseType: !425)
!424 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 25, size: 224, elements: !426)
!426 = !{!427, !435, !436, !437, !438}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !425, file: !424, line: 26, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !424, line: 16, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !424, line: 18, size: 96, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !430, file: !424, line: 19, baseType: !13, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !430, file: !424, line: 20, baseType: !23, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !424, line: 21, baseType: !428, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !425, file: !424, line: 27, baseType: !429, size: 96, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !424, line: 28, baseType: !48, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !425, file: !424, line: 29, baseType: !23, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !425, file: !424, line: 30, baseType: !71, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !241, file: !242, line: 66, baseType: !423, size: 224, offset: 1696)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !241, file: !242, line: 68, baseType: !23, size: 32, offset: 1920)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !241, file: !242, line: 69, baseType: !23, size: 32, offset: 1952)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !241, file: !242, line: 71, baseType: !254, size: 32, offset: 1984)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !241, file: !242, line: 72, baseType: !261, size: 32, offset: 2016)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !241, file: !242, line: 73, baseType: !261, size: 32, offset: 2048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !241, file: !242, line: 75, baseType: !239, size: 32, offset: 2080)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !241, file: !242, line: 77, baseType: !43, size: 64, offset: 2112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !241, file: !242, line: 78, baseType: !43, size: 64, offset: 2176)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !241, file: !242, line: 79, baseType: !43, size: 64, offset: 2240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !241, file: !242, line: 80, baseType: !43, size: 64, offset: 2304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !241, file: !242, line: 81, baseType: !43, size: 64, offset: 2368)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !241, file: !242, line: 82, baseType: !43, size: 64, offset: 2432)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !57, file: !40, line: 121, baseType: !71, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !57, file: !40, line: 122, baseType: !71, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !57, file: !40, line: 123, baseType: !455, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !40, line: 103, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 98, size: 1344, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !457, file: !40, line: 99, baseType: !109, size: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !457, file: !40, line: 100, baseType: !93, size: 32, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !457, file: !40, line: 101, baseType: !93, size: 32, offset: 1248)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !457, file: !40, line: 102, baseType: !23, size: 32, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !57, file: !40, line: 124, baseType: !165, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !57, file: !40, line: 126, baseType: !13, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !57, file: !40, line: 127, baseType: !23, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !57, file: !40, line: 128, baseType: !23, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !57, file: !40, line: 130, baseType: !468, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !40, line: 112, baseType: !52)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !57, file: !40, line: 131, baseType: !30, size: 32, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !39, file: !40, line: 81, baseType: !23, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !39, file: !40, line: 82, baseType: !23, size: 32, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !39, file: !40, line: 83, baseType: !13, size: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !19, file: !20, line: 236, baseType: !23, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !19, file: !20, line: 238, baseType: !475, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !165}
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !24, line: 78, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !26, line: 140, baseType: !101)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !19, file: !20, line: 240, baseType: !481, size: 32, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{!478, !239}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !19, file: !20, line: 242, baseType: !481, size: 32, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !19, file: !20, line: 243, baseType: !481, size: 32, offset: 416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !19, file: !20, line: 244, baseType: !487, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !239}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !19, file: !20, line: 245, baseType: !487, size: 32, offset: 480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !19, file: !20, line: 247, baseType: !487, size: 32, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !19, file: !20, line: 249, baseType: !25, size: 32, offset: 544)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !19, file: !20, line: 250, baseType: !25, size: 32, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !19, file: !20, line: 251, baseType: !25, size: 32, offset: 608)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !19, file: !20, line: 252, baseType: !25, size: 32, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !19, file: !20, line: 253, baseType: !25, size: 32, offset: 672)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !19, file: !20, line: 254, baseType: !25, size: 32, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !19, file: !20, line: 255, baseType: !25, size: 32, offset: 736)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !19, file: !20, line: 256, baseType: !25, size: 32, offset: 768)
!500 = !DIGlobalVariableExpression(var: !501)
!501 = distinct !DIGlobalVariable(name: "ngx_use_stderr", scope: !2, file: !3, line: 72, type: !23, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503)
!503 = distinct !DIGlobalVariable(name: "error_log", scope: !504, file: !3, line: 407, type: !43, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "ngx_log_open_default", scope: !3, file: !3, line: 404, type: !482, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !505)
!505 = !{!506, !507}
!506 = !DILocalVariable(name: "cycle", arg: 1, scope: !504, file: !3, line: 404, type: !239)
!507 = !DILocalVariable(name: "log", scope: !504, file: !3, line: 406, type: !165)
!508 = !DIGlobalVariableExpression(var: !509)
!509 = distinct !DIGlobalVariable(name: "ngx_log", scope: !2, file: !3, line: 70, type: !166, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511)
!511 = distinct !DIGlobalVariable(name: "ngx_log_file", scope: !2, file: !3, line: 71, type: !173, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513)
!513 = distinct !DIGlobalVariable(name: "ngx_errlog_commands", scope: !2, file: !3, line: 34, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 448, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 2)
!517 = !DIGlobalVariableExpression(var: !518)
!518 = distinct !DIGlobalVariable(name: "err_levels", scope: !2, file: !3, line: 75, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 576, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 9)
!522 = !DIGlobalVariableExpression(var: !523)
!523 = distinct !DIGlobalVariable(name: "debug_levels", scope: !2, file: !3, line: 87, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 224, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 7)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_module_t", file: !20, line: 264, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 260, size: 128, elements: !529)
!529 = !{!530, !531, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !20, line: 261, baseType: !43, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !528, file: !20, line: 262, baseType: !532, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{!13, !239}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !528, file: !20, line: 263, baseType: !536, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{!30, !239, !13}
!539 = !{i32 2, !"Dwarf Version", i32 4}
!540 = !{i32 2, !"Debug Info Version", i32 3}
!541 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!542 = distinct !DISubprogram(name: "ngx_log_error_core", scope: !3, file: !3, line: 96, type: !543, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !547)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !23, !165, !545, !10, null}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !546, line: 16, baseType: !101)
!546 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!547 = !{!548, !549, !550, !551, !552, !558, !559, !560, !561, !562, !563, !564}
!548 = !DILocalVariable(name: "level", arg: 1, scope: !542, file: !3, line: 96, type: !23)
!549 = !DILocalVariable(name: "log", arg: 2, scope: !542, file: !3, line: 96, type: !165)
!550 = !DILocalVariable(name: "err", arg: 3, scope: !542, file: !3, line: 96, type: !545)
!551 = !DILocalVariable(name: "fmt", arg: 4, scope: !542, file: !3, line: 97, type: !10)
!552 = !DILocalVariable(name: "args", scope: !542, file: !3, line: 108, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !26, line: 7, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 108, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 128, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 4)
!558 = !DILocalVariable(name: "p", scope: !542, file: !3, line: 110, type: !6)
!559 = !DILocalVariable(name: "last", scope: !542, file: !3, line: 110, type: !6)
!560 = !DILocalVariable(name: "msg", scope: !542, file: !3, line: 110, type: !6)
!561 = !DILocalVariable(name: "n", scope: !542, file: !3, line: 111, type: !274)
!562 = !DILocalVariable(name: "wrote_stderr", scope: !542, file: !3, line: 112, type: !23)
!563 = !DILocalVariable(name: "debug_connection", scope: !542, file: !3, line: 112, type: !23)
!564 = !DILocalVariable(name: "errstr", scope: !542, file: !3, line: 113, type: !565)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16384, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 2048)
!568 = !{!569, !569, i64 0}
!569 = !{!"int", !570, i64 0}
!570 = !{!"omnipotent char", !571, i64 0}
!571 = !{!"Simple C/C++ TBAA"}
!572 = !DIExpression()
!573 = !DILocation(line: 96, column: 31, scope: !542)
!574 = !{!575, !575, i64 0}
!575 = !{!"any pointer", !570, i64 0}
!576 = !DILocation(line: 96, column: 49, scope: !542)
!577 = !DILocation(line: 96, column: 64, scope: !542)
!578 = !DILocation(line: 97, column: 17, scope: !542)
!579 = !DILocation(line: 108, column: 5, scope: !542)
!580 = !DILocation(line: 108, column: 18, scope: !542)
!581 = !DILocation(line: 110, column: 5, scope: !542)
!582 = !DILocation(line: 110, column: 18, scope: !542)
!583 = !DILocation(line: 110, column: 22, scope: !542)
!584 = !DILocation(line: 110, column: 29, scope: !542)
!585 = !DILocation(line: 111, column: 5, scope: !542)
!586 = !DILocation(line: 111, column: 18, scope: !542)
!587 = !DILocation(line: 112, column: 5, scope: !542)
!588 = !DILocation(line: 112, column: 18, scope: !542)
!589 = !DILocation(line: 112, column: 32, scope: !542)
!590 = !DILocation(line: 113, column: 5, scope: !542)
!591 = !DILocation(line: 113, column: 18, scope: !542)
!592 = !DILocation(line: 115, column: 12, scope: !542)
!593 = !DILocation(line: 115, column: 19, scope: !542)
!594 = !DILocation(line: 115, column: 10, scope: !542)
!595 = !DILocation(line: 117, column: 9, scope: !542)
!596 = !{!597, !575, i64 4}
!597 = !{!"", !569, i64 0, !575, i64 4}
!598 = !{!597, !569, i64 0}
!599 = !DILocation(line: 117, column: 7, scope: !542)
!600 = !DILocation(line: 120, column: 22, scope: !542)
!601 = !DILocation(line: 120, column: 25, scope: !542)
!602 = !DILocation(line: 120, column: 53, scope: !542)
!603 = !DILocation(line: 120, column: 42, scope: !542)
!604 = !DILocation(line: 120, column: 9, scope: !542)
!605 = !DILocation(line: 120, column: 7, scope: !542)
!606 = !DILocation(line: 123, column: 22, scope: !542)
!607 = !DILocation(line: 123, column: 25, scope: !542)
!608 = !DILocation(line: 124, column: 21, scope: !542)
!609 = !DILocation(line: 123, column: 9, scope: !542)
!610 = !DILocation(line: 123, column: 7, scope: !542)
!611 = !DILocation(line: 126, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !542, file: !3, line: 126, column: 9)
!613 = !DILocation(line: 126, column: 14, scope: !612)
!614 = !{!615, !616, i64 8}
!615 = !{!"ngx_log_s", !569, i64 0, !575, i64 4, !616, i64 8, !616, i64 12, !575, i64 16, !575, i64 20, !575, i64 24, !575, i64 28, !575, i64 32, !575, i64 36}
!616 = !{!"long", !570, i64 0}
!617 = !DILocation(line: 126, column: 9, scope: !542)
!618 = !DILocation(line: 127, column: 26, scope: !619)
!619 = distinct !DILexicalBlock(scope: !612, file: !3, line: 126, column: 26)
!620 = !DILocation(line: 127, column: 29, scope: !619)
!621 = !DILocation(line: 127, column: 44, scope: !619)
!622 = !DILocation(line: 127, column: 49, scope: !619)
!623 = !DILocation(line: 127, column: 13, scope: !619)
!624 = !DILocation(line: 127, column: 11, scope: !619)
!625 = !DILocation(line: 128, column: 5, scope: !619)
!626 = !DILocation(line: 130, column: 11, scope: !542)
!627 = !DILocation(line: 130, column: 9, scope: !542)
!628 = !DILocation(line: 134, column: 5, scope: !542)
!629 = !DILocation(line: 135, column: 23, scope: !542)
!630 = !DILocation(line: 135, column: 26, scope: !542)
!631 = !DILocation(line: 135, column: 32, scope: !542)
!632 = !DILocation(line: 135, column: 37, scope: !542)
!633 = !DILocation(line: 135, column: 9, scope: !542)
!634 = !DILocation(line: 135, column: 7, scope: !542)
!635 = !DILocation(line: 136, column: 5, scope: !542)
!636 = !DILocation(line: 144, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !542, file: !3, line: 144, column: 9)
!638 = !DILocation(line: 144, column: 9, scope: !542)
!639 = !DILocation(line: 145, column: 27, scope: !640)
!640 = distinct !DILexicalBlock(scope: !637, file: !3, line: 144, column: 14)
!641 = !DILocation(line: 145, column: 30, scope: !640)
!642 = !DILocation(line: 145, column: 36, scope: !640)
!643 = !DILocation(line: 145, column: 13, scope: !640)
!644 = !DILocation(line: 145, column: 11, scope: !640)
!645 = !DILocation(line: 146, column: 5, scope: !640)
!646 = !DILocation(line: 148, column: 9, scope: !647)
!647 = distinct !DILexicalBlock(scope: !542, file: !3, line: 148, column: 9)
!648 = !DILocation(line: 148, column: 15, scope: !647)
!649 = !DILocation(line: 148, column: 32, scope: !647)
!650 = !DILocation(line: 148, column: 35, scope: !647)
!651 = !DILocation(line: 148, column: 40, scope: !647)
!652 = !{!615, !575, i64 16}
!653 = !DILocation(line: 148, column: 9, scope: !542)
!654 = !DILocation(line: 149, column: 13, scope: !655)
!655 = distinct !DILexicalBlock(scope: !647, file: !3, line: 148, column: 49)
!656 = !DILocation(line: 149, column: 18, scope: !655)
!657 = !DILocation(line: 149, column: 26, scope: !655)
!658 = !DILocation(line: 149, column: 31, scope: !655)
!659 = !DILocation(line: 149, column: 34, scope: !655)
!660 = !DILocation(line: 149, column: 41, scope: !655)
!661 = !DILocation(line: 149, column: 39, scope: !655)
!662 = !DILocation(line: 149, column: 11, scope: !655)
!663 = !DILocation(line: 150, column: 5, scope: !655)
!664 = !DILocation(line: 152, column: 9, scope: !665)
!665 = distinct !DILexicalBlock(scope: !542, file: !3, line: 152, column: 9)
!666 = !DILocation(line: 152, column: 13, scope: !665)
!667 = !DILocation(line: 152, column: 18, scope: !665)
!668 = !DILocation(line: 152, column: 11, scope: !665)
!669 = !DILocation(line: 152, column: 9, scope: !542)
!670 = !DILocation(line: 153, column: 13, scope: !671)
!671 = distinct !DILexicalBlock(scope: !665, file: !3, line: 152, column: 39)
!672 = !DILocation(line: 153, column: 18, scope: !671)
!673 = !DILocation(line: 153, column: 11, scope: !671)
!674 = !DILocation(line: 154, column: 5, scope: !671)
!675 = !DILocation(line: 156, column: 5, scope: !542)
!676 = !{!570, !570, i64 0}
!677 = !DILocation(line: 158, column: 18, scope: !542)
!678 = !DILocation(line: 159, column: 25, scope: !542)
!679 = !DILocation(line: 159, column: 30, scope: !542)
!680 = !{!615, !569, i64 0}
!681 = !DILocation(line: 159, column: 40, scope: !542)
!682 = !DILocation(line: 159, column: 68, scope: !542)
!683 = !DILocation(line: 159, column: 22, scope: !542)
!684 = !DILocation(line: 161, column: 5, scope: !542)
!685 = !DILocation(line: 161, column: 12, scope: !542)
!686 = !DILocation(line: 163, column: 13, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !3, line: 163, column: 13)
!688 = distinct !DILexicalBlock(scope: !542, file: !3, line: 161, column: 17)
!689 = !DILocation(line: 163, column: 18, scope: !687)
!690 = !DILocation(line: 163, column: 30, scope: !687)
!691 = !DILocation(line: 163, column: 28, scope: !687)
!692 = !DILocation(line: 163, column: 36, scope: !687)
!693 = !DILocation(line: 163, column: 40, scope: !687)
!694 = !DILocation(line: 163, column: 13, scope: !688)
!695 = !DILocation(line: 164, column: 13, scope: !696)
!696 = distinct !DILexicalBlock(scope: !687, file: !3, line: 163, column: 58)
!697 = !DILocation(line: 167, column: 13, scope: !698)
!698 = distinct !DILexicalBlock(scope: !688, file: !3, line: 167, column: 13)
!699 = !DILocation(line: 167, column: 18, scope: !698)
!700 = !{!615, !575, i64 24}
!701 = !DILocation(line: 167, column: 13, scope: !688)
!702 = !DILocation(line: 168, column: 13, scope: !703)
!703 = distinct !DILexicalBlock(scope: !698, file: !3, line: 167, column: 26)
!704 = !DILocation(line: 168, column: 18, scope: !703)
!705 = !DILocation(line: 168, column: 25, scope: !703)
!706 = !DILocation(line: 168, column: 30, scope: !703)
!707 = !DILocation(line: 168, column: 37, scope: !703)
!708 = !DILocation(line: 168, column: 45, scope: !703)
!709 = !DILocation(line: 168, column: 49, scope: !703)
!710 = !DILocation(line: 168, column: 47, scope: !703)
!711 = !DILocation(line: 169, column: 13, scope: !703)
!712 = !DILocation(line: 172, column: 13, scope: !713)
!713 = distinct !DILexicalBlock(scope: !688, file: !3, line: 172, column: 13)
!714 = !{!715, !616, i64 0}
!715 = !{!"", !616, i64 0, !569, i64 4, !569, i64 8}
!716 = !DILocation(line: 172, column: 27, scope: !713)
!717 = !DILocation(line: 172, column: 32, scope: !713)
!718 = !{!615, !616, i64 12}
!719 = !DILocation(line: 172, column: 24, scope: !713)
!720 = !DILocation(line: 172, column: 13, scope: !688)
!721 = !DILocation(line: 180, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !713, file: !3, line: 172, column: 48)
!723 = !DILocation(line: 183, column: 26, scope: !688)
!724 = !DILocation(line: 183, column: 31, scope: !688)
!725 = !{!615, !575, i64 4}
!726 = !DILocation(line: 183, column: 37, scope: !688)
!727 = !{!728, !569, i64 0}
!728 = !{!"ngx_open_file_s", !569, i64 0, !597, i64 4, !575, i64 12, !575, i64 16}
!729 = !DILocation(line: 183, column: 41, scope: !688)
!730 = !DILocation(line: 183, column: 49, scope: !688)
!731 = !DILocation(line: 183, column: 53, scope: !688)
!732 = !DILocation(line: 183, column: 51, scope: !688)
!733 = !DILocation(line: 183, column: 13, scope: !688)
!734 = !DILocation(line: 183, column: 11, scope: !688)
!735 = !DILocation(line: 185, column: 13, scope: !736)
!736 = distinct !DILexicalBlock(scope: !688, file: !3, line: 185, column: 13)
!737 = !DILocation(line: 185, column: 15, scope: !736)
!738 = !DILocation(line: 185, column: 21, scope: !736)
!739 = !DILocation(line: 185, column: 24, scope: !736)
!740 = !DILocation(line: 185, column: 34, scope: !736)
!741 = !DILocation(line: 185, column: 13, scope: !688)
!742 = !DILocation(line: 186, column: 35, scope: !743)
!743 = distinct !DILexicalBlock(scope: !736, file: !3, line: 185, column: 49)
!744 = !DILocation(line: 186, column: 13, scope: !743)
!745 = !DILocation(line: 186, column: 18, scope: !743)
!746 = !DILocation(line: 186, column: 33, scope: !743)
!747 = !DILocation(line: 187, column: 9, scope: !743)
!748 = !DILocation(line: 189, column: 13, scope: !749)
!749 = distinct !DILexicalBlock(scope: !688, file: !3, line: 189, column: 13)
!750 = !DILocation(line: 189, column: 18, scope: !749)
!751 = !DILocation(line: 189, column: 24, scope: !749)
!752 = !DILocation(line: 189, column: 27, scope: !749)
!753 = !DILocation(line: 189, column: 13, scope: !688)
!754 = !DILocation(line: 190, column: 26, scope: !755)
!755 = distinct !DILexicalBlock(scope: !749, file: !3, line: 189, column: 42)
!756 = !DILocation(line: 191, column: 9, scope: !755)
!757 = !DILocation(line: 189, column: 30, scope: !749)
!758 = !DILocation(line: 195, column: 15, scope: !688)
!759 = !DILocation(line: 195, column: 20, scope: !688)
!760 = !{!615, !575, i64 36}
!761 = !DILocation(line: 195, column: 13, scope: !688)
!762 = distinct !{!762, !684, !763}
!763 = !DILocation(line: 196, column: 5, scope: !542)
!764 = !DILocation(line: 198, column: 10, scope: !765)
!765 = distinct !DILexicalBlock(scope: !542, file: !3, line: 198, column: 9)
!766 = !DILocation(line: 199, column: 9, scope: !765)
!767 = !DILocation(line: 199, column: 12, scope: !765)
!768 = !DILocation(line: 199, column: 18, scope: !765)
!769 = !DILocation(line: 200, column: 9, scope: !765)
!770 = !DILocation(line: 200, column: 12, scope: !765)
!771 = !DILocation(line: 198, column: 9, scope: !542)
!772 = !DILocation(line: 202, column: 9, scope: !773)
!773 = distinct !DILexicalBlock(scope: !765, file: !3, line: 201, column: 5)
!774 = !DILocation(line: 205, column: 28, scope: !542)
!775 = !DILocation(line: 205, column: 17, scope: !542)
!776 = !DILocation(line: 205, column: 35, scope: !542)
!777 = !DILocation(line: 205, column: 15, scope: !542)
!778 = !DILocation(line: 205, column: 39, scope: !542)
!779 = !DILocation(line: 205, column: 9, scope: !542)
!780 = !DILocation(line: 207, column: 24, scope: !542)
!781 = !DILocation(line: 207, column: 57, scope: !542)
!782 = !DILocation(line: 207, column: 46, scope: !542)
!783 = !DILocation(line: 207, column: 12, scope: !542)
!784 = !DILocation(line: 209, column: 42, scope: !542)
!785 = !DILocation(line: 209, column: 47, scope: !542)
!786 = !DILocation(line: 209, column: 51, scope: !542)
!787 = !DILocation(line: 209, column: 49, scope: !542)
!788 = !DILocation(line: 209, column: 12, scope: !542)
!789 = !DILocation(line: 210, column: 1, scope: !542)
!790 = distinct !DISubprogram(name: "ngx_log_errno", scope: !3, file: !3, line: 288, type: !791, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!6, !6, !6, !545}
!793 = !{!794, !795, !796}
!794 = !DILocalVariable(name: "buf", arg: 1, scope: !790, file: !3, line: 288, type: !6)
!795 = !DILocalVariable(name: "last", arg: 2, scope: !790, file: !3, line: 288, type: !6)
!796 = !DILocalVariable(name: "err", arg: 3, scope: !790, file: !3, line: 288, type: !545)
!797 = !DILocation(line: 288, column: 23, scope: !790)
!798 = !DILocation(line: 288, column: 36, scope: !790)
!799 = !DILocation(line: 288, column: 52, scope: !790)
!800 = !DILocation(line: 290, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !790, file: !3, line: 290, column: 9)
!802 = !DILocation(line: 290, column: 15, scope: !801)
!803 = !DILocation(line: 290, column: 20, scope: !801)
!804 = !DILocation(line: 290, column: 13, scope: !801)
!805 = !DILocation(line: 290, column: 9, scope: !790)
!806 = !DILocation(line: 294, column: 15, scope: !807)
!807 = distinct !DILexicalBlock(scope: !801, file: !3, line: 290, column: 26)
!808 = !DILocation(line: 294, column: 20, scope: !807)
!809 = !DILocation(line: 294, column: 13, scope: !807)
!810 = !DILocation(line: 295, column: 13, scope: !807)
!811 = !DILocation(line: 295, column: 16, scope: !807)
!812 = !DILocation(line: 296, column: 13, scope: !807)
!813 = !DILocation(line: 296, column: 16, scope: !807)
!814 = !DILocation(line: 297, column: 13, scope: !807)
!815 = !DILocation(line: 297, column: 16, scope: !807)
!816 = !DILocation(line: 298, column: 5, scope: !807)
!817 = !DILocation(line: 304, column: 24, scope: !790)
!818 = !DILocation(line: 304, column: 29, scope: !790)
!819 = !DILocation(line: 304, column: 45, scope: !790)
!820 = !DILocation(line: 304, column: 11, scope: !790)
!821 = !DILocation(line: 304, column: 9, scope: !790)
!822 = !DILocation(line: 307, column: 24, scope: !790)
!823 = !DILocation(line: 307, column: 29, scope: !790)
!824 = !DILocation(line: 307, column: 34, scope: !790)
!825 = !DILocation(line: 307, column: 41, scope: !790)
!826 = !DILocation(line: 307, column: 39, scope: !790)
!827 = !DILocation(line: 307, column: 11, scope: !790)
!828 = !DILocation(line: 307, column: 9, scope: !790)
!829 = !DILocation(line: 309, column: 9, scope: !830)
!830 = distinct !DILexicalBlock(scope: !790, file: !3, line: 309, column: 9)
!831 = !DILocation(line: 309, column: 15, scope: !830)
!832 = !DILocation(line: 309, column: 13, scope: !830)
!833 = !DILocation(line: 309, column: 9, scope: !790)
!834 = !DILocation(line: 310, column: 13, scope: !835)
!835 = distinct !DILexicalBlock(scope: !830, file: !3, line: 309, column: 21)
!836 = !DILocation(line: 310, column: 16, scope: !835)
!837 = !DILocation(line: 311, column: 5, scope: !835)
!838 = !DILocation(line: 313, column: 12, scope: !790)
!839 = !DILocation(line: 313, column: 5, scope: !790)
!840 = distinct !DISubprogram(name: "ngx_write_fd", scope: !115, file: !115, line: 145, type: !841, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!274, !114, !13, !48}
!843 = !{!844, !845, !846}
!844 = !DILocalVariable(name: "fd", arg: 1, scope: !840, file: !115, line: 145, type: !114)
!845 = !DILocalVariable(name: "buf", arg: 2, scope: !840, file: !115, line: 145, type: !13)
!846 = !DILocalVariable(name: "n", arg: 3, scope: !840, file: !115, line: 145, type: !48)
!847 = !DILocation(line: 145, column: 23, scope: !840)
!848 = !DILocation(line: 145, column: 33, scope: !840)
!849 = !DILocation(line: 145, column: 45, scope: !840)
!850 = !DILocation(line: 147, column: 18, scope: !840)
!851 = !DILocation(line: 147, column: 22, scope: !840)
!852 = !DILocation(line: 147, column: 27, scope: !840)
!853 = !DILocation(line: 147, column: 12, scope: !840)
!854 = !DILocation(line: 147, column: 5, scope: !840)
!855 = distinct !DISubprogram(name: "ngx_log_abort", scope: !3, file: !3, line: 243, type: !856, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !545, !10, null}
!858 = !{!859, !860, !861, !862, !863}
!859 = !DILocalVariable(name: "err", arg: 1, scope: !855, file: !3, line: 243, type: !545)
!860 = !DILocalVariable(name: "fmt", arg: 2, scope: !855, file: !3, line: 243, type: !10)
!861 = !DILocalVariable(name: "p", scope: !855, file: !3, line: 245, type: !6)
!862 = !DILocalVariable(name: "args", scope: !855, file: !3, line: 246, type: !553)
!863 = !DILocalVariable(name: "errstr", scope: !855, file: !3, line: 247, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 1024)
!867 = !DILocation(line: 243, column: 25, scope: !855)
!868 = !DILocation(line: 243, column: 42, scope: !855)
!869 = !DILocation(line: 245, column: 5, scope: !855)
!870 = !DILocation(line: 245, column: 15, scope: !855)
!871 = !DILocation(line: 246, column: 5, scope: !855)
!872 = !DILocation(line: 246, column: 15, scope: !855)
!873 = !DILocation(line: 247, column: 5, scope: !855)
!874 = !DILocation(line: 247, column: 15, scope: !855)
!875 = !DILocation(line: 249, column: 5, scope: !855)
!876 = !DILocation(line: 250, column: 9, scope: !855)
!877 = !DILocation(line: 250, column: 7, scope: !855)
!878 = !DILocation(line: 251, column: 5, scope: !855)
!879 = !DILocation(line: 253, column: 5, scope: !880)
!880 = distinct !DILexicalBlock(scope: !855, file: !3, line: 253, column: 5)
!881 = !{!882, !575, i64 8}
!882 = !{!"ngx_cycle_s", !575, i64 0, !575, i64 4, !575, i64 8, !615, i64 12, !569, i64 52, !575, i64 56, !575, i64 60, !569, i64 64, !575, i64 68, !569, i64 72, !569, i64 76, !883, i64 80, !569, i64 88, !884, i64 92, !884, i64 112, !884, i64 132, !885, i64 152, !886, i64 164, !887, i64 184, !887, i64 212, !569, i64 240, !569, i64 244, !575, i64 248, !575, i64 252, !575, i64 256, !575, i64 260, !597, i64 264, !597, i64 272, !597, i64 280, !597, i64 288, !597, i64 296, !597, i64 304}
!883 = !{!"ngx_queue_s", !575, i64 0, !575, i64 4}
!884 = !{!"", !575, i64 0, !569, i64 4, !569, i64 8, !569, i64 12, !575, i64 16}
!885 = !{!"ngx_rbtree_s", !575, i64 0, !575, i64 4, !575, i64 8}
!886 = !{!"ngx_rbtree_node_s", !569, i64 0, !575, i64 4, !575, i64 8, !575, i64 12, !570, i64 16, !570, i64 17}
!887 = !{!"", !575, i64 0, !888, i64 4, !569, i64 16, !569, i64 20, !575, i64 24}
!888 = !{!"ngx_list_part_s", !575, i64 0, !569, i64 4, !575, i64 8}
!889 = !DILocation(line: 253, column: 5, scope: !855)
!890 = !DILocation(line: 255, column: 1, scope: !855)
!891 = distinct !DISubprogram(name: "ngx_log_stderr", scope: !3, file: !3, line: 259, type: !856, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !892)
!892 = !{!893, !894, !895, !896, !897, !898}
!893 = !DILocalVariable(name: "err", arg: 1, scope: !891, file: !3, line: 259, type: !545)
!894 = !DILocalVariable(name: "fmt", arg: 2, scope: !891, file: !3, line: 259, type: !10)
!895 = !DILocalVariable(name: "p", scope: !891, file: !3, line: 261, type: !6)
!896 = !DILocalVariable(name: "last", scope: !891, file: !3, line: 261, type: !6)
!897 = !DILocalVariable(name: "args", scope: !891, file: !3, line: 262, type: !553)
!898 = !DILocalVariable(name: "errstr", scope: !891, file: !3, line: 263, type: !565)
!899 = !DILocation(line: 259, column: 26, scope: !891)
!900 = !DILocation(line: 259, column: 43, scope: !891)
!901 = !DILocation(line: 261, column: 5, scope: !891)
!902 = !DILocation(line: 261, column: 15, scope: !891)
!903 = !DILocation(line: 261, column: 19, scope: !891)
!904 = !DILocation(line: 262, column: 5, scope: !891)
!905 = !DILocation(line: 262, column: 15, scope: !891)
!906 = !DILocation(line: 263, column: 5, scope: !891)
!907 = !DILocation(line: 263, column: 15, scope: !891)
!908 = !DILocation(line: 265, column: 12, scope: !891)
!909 = !DILocation(line: 265, column: 19, scope: !891)
!910 = !DILocation(line: 265, column: 10, scope: !891)
!911 = !DILocation(line: 267, column: 9, scope: !891)
!912 = !DILocation(line: 267, column: 7, scope: !891)
!913 = !DILocation(line: 269, column: 5, scope: !891)
!914 = !DILocation(line: 270, column: 23, scope: !891)
!915 = !DILocation(line: 270, column: 26, scope: !891)
!916 = !DILocation(line: 270, column: 32, scope: !891)
!917 = !DILocation(line: 270, column: 37, scope: !891)
!918 = !DILocation(line: 270, column: 9, scope: !891)
!919 = !DILocation(line: 270, column: 7, scope: !891)
!920 = !DILocation(line: 271, column: 5, scope: !891)
!921 = !DILocation(line: 273, column: 9, scope: !922)
!922 = distinct !DILexicalBlock(scope: !891, file: !3, line: 273, column: 9)
!923 = !DILocation(line: 273, column: 9, scope: !891)
!924 = !DILocation(line: 274, column: 27, scope: !925)
!925 = distinct !DILexicalBlock(scope: !922, file: !3, line: 273, column: 14)
!926 = !DILocation(line: 274, column: 30, scope: !925)
!927 = !DILocation(line: 274, column: 36, scope: !925)
!928 = !DILocation(line: 274, column: 13, scope: !925)
!929 = !DILocation(line: 274, column: 11, scope: !925)
!930 = !DILocation(line: 275, column: 5, scope: !925)
!931 = !DILocation(line: 277, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !891, file: !3, line: 277, column: 9)
!933 = !DILocation(line: 277, column: 13, scope: !932)
!934 = !DILocation(line: 277, column: 18, scope: !932)
!935 = !DILocation(line: 277, column: 11, scope: !932)
!936 = !DILocation(line: 277, column: 9, scope: !891)
!937 = !DILocation(line: 278, column: 13, scope: !938)
!938 = distinct !DILexicalBlock(scope: !932, file: !3, line: 277, column: 39)
!939 = !DILocation(line: 278, column: 18, scope: !938)
!940 = !DILocation(line: 278, column: 11, scope: !938)
!941 = !DILocation(line: 279, column: 5, scope: !938)
!942 = !DILocation(line: 281, column: 5, scope: !891)
!943 = !DILocation(line: 283, column: 42, scope: !891)
!944 = !DILocation(line: 283, column: 50, scope: !891)
!945 = !DILocation(line: 283, column: 54, scope: !891)
!946 = !DILocation(line: 283, column: 52, scope: !891)
!947 = !DILocation(line: 283, column: 12, scope: !891)
!948 = !DILocation(line: 284, column: 1, scope: !891)
!949 = distinct !DISubprogram(name: "ngx_log_init", scope: !3, file: !3, line: 318, type: !950, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !952)
!950 = !DISubroutineType(types: !951)
!951 = !{!165, !6}
!952 = !{!953, !954, !955, !956, !957}
!953 = !DILocalVariable(name: "prefix", arg: 1, scope: !949, file: !3, line: 318, type: !6)
!954 = !DILocalVariable(name: "p", scope: !949, file: !3, line: 320, type: !6)
!955 = !DILocalVariable(name: "name", scope: !949, file: !3, line: 320, type: !6)
!956 = !DILocalVariable(name: "nlen", scope: !949, file: !3, line: 321, type: !48)
!957 = !DILocalVariable(name: "plen", scope: !949, file: !3, line: 321, type: !48)
!958 = !DILocation(line: 318, column: 22, scope: !949)
!959 = !DILocation(line: 320, column: 5, scope: !949)
!960 = !DILocation(line: 320, column: 14, scope: !949)
!961 = !DILocation(line: 320, column: 18, scope: !949)
!962 = !DILocation(line: 321, column: 5, scope: !949)
!963 = !DILocation(line: 321, column: 14, scope: !949)
!964 = !DILocation(line: 321, column: 20, scope: !949)
!965 = !DILocation(line: 323, column: 18, scope: !949)
!966 = !DILocation(line: 324, column: 23, scope: !949)
!967 = !DILocation(line: 326, column: 10, scope: !949)
!968 = !DILocation(line: 333, column: 12, scope: !949)
!969 = !DILocation(line: 333, column: 10, scope: !949)
!970 = !DILocation(line: 335, column: 9, scope: !971)
!971 = distinct !DILexicalBlock(scope: !949, file: !3, line: 335, column: 9)
!972 = !DILocation(line: 335, column: 14, scope: !971)
!973 = !DILocation(line: 335, column: 9, scope: !949)
!974 = !DILocation(line: 336, column: 25, scope: !975)
!975 = distinct !DILexicalBlock(scope: !971, file: !3, line: 335, column: 20)
!976 = !DILocation(line: 337, column: 9, scope: !975)
!977 = !DILocation(line: 340, column: 7, scope: !949)
!978 = !DILocation(line: 345, column: 9, scope: !979)
!979 = distinct !DILexicalBlock(scope: !949, file: !3, line: 345, column: 9)
!980 = !DILocation(line: 345, column: 17, scope: !979)
!981 = !DILocation(line: 345, column: 9, scope: !949)
!982 = !DILocation(line: 348, column: 13, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !3, line: 348, column: 13)
!984 = distinct !DILexicalBlock(scope: !979, file: !3, line: 345, column: 25)
!985 = !DILocation(line: 348, column: 13, scope: !984)
!986 = !DILocation(line: 349, column: 20, scope: !987)
!987 = distinct !DILexicalBlock(scope: !983, file: !3, line: 348, column: 21)
!988 = !DILocation(line: 349, column: 18, scope: !987)
!989 = !DILocation(line: 351, column: 9, scope: !987)
!990 = !DILocation(line: 353, column: 20, scope: !991)
!991 = distinct !DILexicalBlock(scope: !983, file: !3, line: 351, column: 16)
!992 = !DILocation(line: 354, column: 20, scope: !991)
!993 = !DILocation(line: 354, column: 18, scope: !991)
!994 = !DILocation(line: 360, column: 13, scope: !995)
!995 = distinct !DILexicalBlock(scope: !984, file: !3, line: 360, column: 13)
!996 = !DILocation(line: 360, column: 13, scope: !984)
!997 = !DILocation(line: 361, column: 27, scope: !998)
!998 = distinct !DILexicalBlock(scope: !995, file: !3, line: 360, column: 19)
!999 = !DILocation(line: 361, column: 34, scope: !998)
!1000 = !DILocation(line: 361, column: 32, scope: !998)
!1001 = !DILocation(line: 361, column: 39, scope: !998)
!1002 = !DILocation(line: 361, column: 20, scope: !998)
!1003 = !DILocation(line: 361, column: 18, scope: !998)
!1004 = !DILocation(line: 362, column: 17, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !998, file: !3, line: 362, column: 17)
!1006 = !DILocation(line: 362, column: 22, scope: !1005)
!1007 = !DILocation(line: 362, column: 17, scope: !998)
!1008 = !DILocation(line: 363, column: 17, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 362, column: 31)
!1010 = !DILocation(line: 366, column: 17, scope: !998)
!1011 = !DILocation(line: 366, column: 15, scope: !998)
!1012 = !DILocation(line: 368, column: 18, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !998, file: !3, line: 368, column: 17)
!1014 = !DILocation(line: 368, column: 17, scope: !998)
!1015 = !DILocation(line: 369, column: 19, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 368, column: 48)
!1017 = !DILocation(line: 369, column: 22, scope: !1016)
!1018 = !DILocation(line: 370, column: 13, scope: !1016)
!1019 = !DILocation(line: 372, column: 25, scope: !998)
!1020 = !DILocation(line: 372, column: 59, scope: !998)
!1021 = !DILocation(line: 372, column: 64, scope: !998)
!1022 = !DILocation(line: 372, column: 13, scope: !998)
!1023 = !DILocation(line: 374, column: 17, scope: !998)
!1024 = !DILocation(line: 374, column: 15, scope: !998)
!1025 = !DILocation(line: 375, column: 9, scope: !998)
!1026 = !DILocation(line: 376, column: 5, scope: !984)
!1027 = !DILocation(line: 378, column: 23, scope: !949)
!1028 = !DILocation(line: 378, column: 21, scope: !949)
!1029 = !DILocation(line: 382, column: 22, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !949, file: !3, line: 382, column: 9)
!1031 = !DILocation(line: 382, column: 25, scope: !1030)
!1032 = !DILocation(line: 382, column: 9, scope: !949)
!1033 = !DILocation(line: 383, column: 24, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 382, column: 46)
!1035 = !DILocation(line: 385, column: 58, scope: !1034)
!1036 = !DILocation(line: 383, column: 9, scope: !1034)
!1037 = !DILocation(line: 392, column: 25, scope: !1034)
!1038 = !DILocation(line: 393, column: 5, scope: !1034)
!1039 = !DILocation(line: 395, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !949, file: !3, line: 395, column: 9)
!1041 = !DILocation(line: 395, column: 9, scope: !949)
!1042 = !DILocation(line: 396, column: 18, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 395, column: 12)
!1044 = !DILocation(line: 396, column: 9, scope: !1043)
!1045 = !DILocation(line: 397, column: 5, scope: !1043)
!1046 = !DILocation(line: 399, column: 5, scope: !949)
!1047 = !DILocation(line: 400, column: 1, scope: !949)
!1048 = !DILocation(line: 404, column: 35, scope: !504)
!1049 = !DILocation(line: 406, column: 5, scope: !504)
!1050 = !DILocation(line: 406, column: 24, scope: !504)
!1051 = !DILocation(line: 409, column: 31, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !504, file: !3, line: 409, column: 9)
!1053 = !DILocation(line: 409, column: 38, scope: !1052)
!1054 = !DILocation(line: 409, column: 9, scope: !1052)
!1055 = !DILocation(line: 409, column: 47, scope: !1052)
!1056 = !DILocation(line: 409, column: 9, scope: !504)
!1057 = !DILocation(line: 410, column: 9, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 409, column: 56)
!1059 = !DILocation(line: 413, column: 9, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !504, file: !3, line: 413, column: 9)
!1061 = !DILocation(line: 413, column: 16, scope: !1060)
!1062 = !DILocation(line: 413, column: 24, scope: !1060)
!1063 = !{!882, !569, i64 12}
!1064 = !DILocation(line: 413, column: 34, scope: !1060)
!1065 = !DILocation(line: 413, column: 9, scope: !504)
!1066 = !DILocation(line: 416, column: 27, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 413, column: 40)
!1068 = !DILocation(line: 416, column: 34, scope: !1067)
!1069 = !{!882, !575, i64 4}
!1070 = !DILocation(line: 416, column: 15, scope: !1067)
!1071 = !DILocation(line: 416, column: 13, scope: !1067)
!1072 = !DILocation(line: 417, column: 13, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 417, column: 13)
!1074 = !DILocation(line: 417, column: 17, scope: !1073)
!1075 = !DILocation(line: 417, column: 13, scope: !1067)
!1076 = !DILocation(line: 418, column: 13, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 417, column: 26)
!1078 = !DILocation(line: 421, column: 5, scope: !1067)
!1079 = !DILocation(line: 423, column: 16, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 421, column: 12)
!1081 = !DILocation(line: 423, column: 23, scope: !1080)
!1082 = !DILocation(line: 423, column: 13, scope: !1080)
!1083 = !DILocation(line: 426, column: 5, scope: !504)
!1084 = !DILocation(line: 426, column: 10, scope: !504)
!1085 = !DILocation(line: 426, column: 20, scope: !504)
!1086 = !DILocation(line: 428, column: 36, scope: !504)
!1087 = !DILocation(line: 428, column: 17, scope: !504)
!1088 = !DILocation(line: 428, column: 5, scope: !504)
!1089 = !DILocation(line: 428, column: 10, scope: !504)
!1090 = !DILocation(line: 428, column: 15, scope: !504)
!1091 = !DILocation(line: 429, column: 9, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !504, file: !3, line: 429, column: 9)
!1093 = !DILocation(line: 429, column: 14, scope: !1092)
!1094 = !DILocation(line: 429, column: 19, scope: !1092)
!1095 = !DILocation(line: 429, column: 9, scope: !504)
!1096 = !DILocation(line: 430, column: 9, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 429, column: 28)
!1098 = !DILocation(line: 433, column: 9, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !504, file: !3, line: 433, column: 9)
!1100 = !DILocation(line: 433, column: 17, scope: !1099)
!1101 = !DILocation(line: 433, column: 24, scope: !1099)
!1102 = !DILocation(line: 433, column: 13, scope: !1099)
!1103 = !DILocation(line: 433, column: 9, scope: !504)
!1104 = !DILocation(line: 434, column: 25, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 433, column: 33)
!1106 = !DILocation(line: 434, column: 32, scope: !1105)
!1107 = !DILocation(line: 434, column: 41, scope: !1105)
!1108 = !DILocation(line: 434, column: 9, scope: !1105)
!1109 = !DILocation(line: 435, column: 5, scope: !1105)
!1110 = !DILocation(line: 437, column: 5, scope: !504)
!1111 = !DILocation(line: 438, column: 1, scope: !504)
!1112 = distinct !DISubprogram(name: "ngx_log_get_file_log", scope: !3, file: !3, line: 467, type: !1113, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1115)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!165, !165}
!1115 = !{!1116, !1117}
!1116 = !DILocalVariable(name: "head", arg: 1, scope: !1112, file: !3, line: 467, type: !165)
!1117 = !DILocalVariable(name: "log", scope: !1112, file: !3, line: 469, type: !165)
!1118 = !DILocation(line: 467, column: 33, scope: !1112)
!1119 = !DILocation(line: 469, column: 5, scope: !1112)
!1120 = !DILocation(line: 469, column: 17, scope: !1112)
!1121 = !DILocation(line: 471, column: 16, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 471, column: 5)
!1123 = !DILocation(line: 471, column: 14, scope: !1122)
!1124 = !DILocation(line: 471, column: 10, scope: !1122)
!1125 = !DILocation(line: 471, column: 22, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 471, column: 5)
!1127 = !DILocation(line: 471, column: 5, scope: !1122)
!1128 = !DILocation(line: 472, column: 13, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 472, column: 13)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 471, column: 44)
!1131 = !DILocation(line: 472, column: 18, scope: !1129)
!1132 = !DILocation(line: 472, column: 23, scope: !1129)
!1133 = !DILocation(line: 472, column: 13, scope: !1130)
!1134 = !DILocation(line: 473, column: 20, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 472, column: 32)
!1136 = !DILocation(line: 473, column: 13, scope: !1135)
!1137 = !DILocation(line: 475, column: 5, scope: !1130)
!1138 = !DILocation(line: 471, column: 33, scope: !1126)
!1139 = !DILocation(line: 471, column: 38, scope: !1126)
!1140 = !DILocation(line: 471, column: 31, scope: !1126)
!1141 = !DILocation(line: 471, column: 5, scope: !1126)
!1142 = distinct !{!1142, !1127, !1143}
!1143 = !DILocation(line: 475, column: 5, scope: !1122)
!1144 = !DILocation(line: 477, column: 5, scope: !1112)
!1145 = !DILocation(line: 478, column: 1, scope: !1112)
!1146 = distinct !DISubprogram(name: "ngx_log_insert", scope: !3, file: !3, line: 680, type: !1147, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1149)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !165, !165}
!1149 = !{!1150, !1151, !1152}
!1150 = !DILocalVariable(name: "log", arg: 1, scope: !1146, file: !3, line: 680, type: !165)
!1151 = !DILocalVariable(name: "new_log", arg: 2, scope: !1146, file: !3, line: 680, type: !165)
!1152 = !DILocalVariable(name: "tmp", scope: !1146, file: !3, line: 682, type: !166)
!1153 = !DILocation(line: 680, column: 27, scope: !1146)
!1154 = !DILocation(line: 680, column: 43, scope: !1146)
!1155 = !DILocation(line: 682, column: 5, scope: !1146)
!1156 = !DILocation(line: 682, column: 16, scope: !1146)
!1157 = !DILocation(line: 684, column: 9, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 684, column: 9)
!1159 = !DILocation(line: 684, column: 18, scope: !1158)
!1160 = !DILocation(line: 684, column: 30, scope: !1158)
!1161 = !DILocation(line: 684, column: 35, scope: !1158)
!1162 = !DILocation(line: 684, column: 28, scope: !1158)
!1163 = !DILocation(line: 684, column: 9, scope: !1146)
!1164 = !DILocation(line: 691, column: 16, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 684, column: 46)
!1166 = !DILocation(line: 691, column: 15, scope: !1165)
!1167 = !{i64 0, i64 4, !568, i64 4, i64 4, !574, i64 8, i64 4, !1168, i64 12, i64 4, !1168, i64 16, i64 4, !574, i64 20, i64 4, !574, i64 24, i64 4, !574, i64 28, i64 4, !574, i64 32, i64 4, !574, i64 36, i64 4, !574}
!1168 = !{!616, !616, i64 0}
!1169 = !DILocation(line: 692, column: 10, scope: !1165)
!1170 = !DILocation(line: 692, column: 17, scope: !1165)
