; ModuleID = 'src/core/ngx_radix_tree.c'
source_filename = "src/core/ngx_radix_tree.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_radix_tree_t = type { %struct.ngx_radix_node_s*, %struct.ngx_pool_s*, %struct.ngx_radix_node_s*, i8*, i32 }
%struct.ngx_radix_node_s = type { %struct.ngx_radix_node_s*, %struct.ngx_radix_node_s*, %struct.ngx_radix_node_s*, i32 }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_radix_tree.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_radix_node_t", file: !10, line: 18, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_radix_tree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_radix_node_s", file: !10, line: 20, size: 128, elements: !12)
!12 = !{!13, !14, !15, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !11, file: !10, line: 21, baseType: !8, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !11, file: !10, line: 22, baseType: !8, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !11, file: !10, line: 23, baseType: !8, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !11, file: !10, line: 24, baseType: !5, size: 32, offset: 96)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!20 = distinct !DISubprogram(name: "ngx_radix_tree_create", scope: !1, file: !1, line: 16, type: !21, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !218)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !29, !216}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_radix_tree_t", file: !10, line: 34, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 28, size: 160, elements: !26)
!26 = !{!27, !28, !213, !214, !215}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !25, file: !10, line: 29, baseType: !8, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !25, file: !10, line: 30, baseType: !29, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !31, line: 18, baseType: !32)
!31 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !33, line: 57, size: 320, elements: !34)
!33 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!34 = !{!35, !49, !51, !52, !193, !200, !212}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !32, file: !33, line: 58, baseType: !36, size: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !33, line: 54, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 49, size: 128, elements: !38)
!38 = !{!39, !44, !45, !46}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !37, file: !33, line: 50, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !42, line: 64, baseType: !43)
!42 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !37, file: !33, line: 51, baseType: !40, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !33, line: 52, baseType: !29, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !37, file: !33, line: 53, baseType: !47, size: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !48, line: 79, baseType: !5)
!48 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !32, file: !33, line: 59, baseType: !50, size: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !7)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !32, file: !33, line: 60, baseType: !29, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !32, file: !33, line: 61, baseType: !53, size: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !31, line: 19, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !56, line: 59, size: 64, elements: !57)
!56 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!57 = !{!58, !192}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !55, file: !56, line: 60, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !56, line: 18, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !56, line: 20, size: 352, elements: !62)
!62 = !{!63, !64, !65, !68, !69, !70, !71, !73, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !61, file: !56, line: 21, baseType: !40, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !61, file: !56, line: 22, baseType: !40, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !61, file: !56, line: 23, baseType: !66, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !67)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !61, file: !56, line: 24, baseType: !66, size: 32, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !61, file: !56, line: 26, baseType: !40, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !61, file: !56, line: 27, baseType: !40, size: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !61, file: !56, line: 28, baseType: !72, size: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !56, line: 16, baseType: !4)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !61, file: !56, line: 29, baseType: !74, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !31, line: 23, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !77, line: 16, size: 1216, elements: !78)
!77 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!78 = !{!79, !82, !89, !134, !135, !136, !177, !178}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !76, file: !77, line: 17, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !81, line: 16, baseType: !67)
!81 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !77, line: 18, baseType: !83, size: 64, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !84, line: 19, baseType: !85)
!84 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 16, size: 64, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, file: !84, line: 17, baseType: !50, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !84, line: 18, baseType: !40, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !76, file: !77, line: 19, baseType: !90, size: 960, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !81, line: 17, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !92, line: 4, size: 960, elements: !93)
!92 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = !{!94, !96, !97, !99, !100, !102, !103, !105, !107, !109, !110, !111, !112, !113, !114, !117, !118, !120, !121, !127, !128, !129}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !91, file: !92, line: 6, baseType: !95, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !7)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !91, file: !92, line: 7, baseType: !95, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !91, file: !92, line: 8, baseType: !98, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !7)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !91, file: !92, line: 9, baseType: !98, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !91, file: !92, line: 10, baseType: !101, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !7)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !91, file: !92, line: 11, baseType: !101, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !91, file: !92, line: 13, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !91, file: !92, line: 14, baseType: !106, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !7)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !91, file: !92, line: 15, baseType: !108, size: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !7)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !91, file: !92, line: 16, baseType: !7, size: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !91, file: !92, line: 17, baseType: !95, size: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !91, file: !92, line: 18, baseType: !95, size: 32, offset: 352)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !91, file: !92, line: 19, baseType: !66, size: 32, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !91, file: !92, line: 20, baseType: !66, size: 32, offset: 416)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !91, file: !92, line: 21, baseType: !115, size: 32, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !116)
!116 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !91, file: !92, line: 22, baseType: !115, size: 32, offset: 480)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !91, file: !92, line: 23, baseType: !119, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !67)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !91, file: !92, line: 24, baseType: !119, size: 32, offset: 544)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !91, file: !92, line: 26, baseType: !122, size: 64, offset: 576)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !123)
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !122, file: !6, line: 288, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !116)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !122, file: !6, line: 288, baseType: !116, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !91, file: !92, line: 27, baseType: !122, size: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !91, file: !92, line: 28, baseType: !122, size: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !91, file: !92, line: 29, baseType: !130, size: 192, offset: 768)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, elements: !132)
!131 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!132 = !{!133}
!133 = !DISubrange(count: 3)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !76, file: !77, line: 21, baseType: !66, size: 32, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !76, file: !77, line: 22, baseType: !66, size: 32, offset: 1120)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !76, file: !77, line: 24, baseType: !137, size: 32, offset: 1152)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !31, line: 20, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !140, line: 50, size: 320, elements: !141)
!140 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!141 = !{!142, !143, !156, !160, !161, !166, !167, !172, !173, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !139, file: !140, line: 51, baseType: !47, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !139, file: !140, line: 52, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !31, line: 21, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !147, line: 89, size: 160, elements: !148)
!147 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!148 = !{!149, !150, !151, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !146, file: !147, line: 90, baseType: !80, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !147, line: 91, baseType: !83, size: 64, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !146, file: !147, line: 93, baseType: !152, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !144, !137}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 94, baseType: !4, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !139, file: !140, line: 54, baseType: !157, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !158, line: 98, baseType: !159)
!158 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!159 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !139, file: !140, line: 56, baseType: !125, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !139, file: !140, line: 58, baseType: !162, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !140, line: 45, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{!40, !137, !40, !50}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !140, line: 59, baseType: !4, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !139, file: !140, line: 61, baseType: !168, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !140, line: 46, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !137, !47, !40, !50}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !139, file: !140, line: 62, baseType: !4, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !139, file: !140, line: 70, baseType: !174, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !140, line: 72, baseType: !137, size: 32, offset: 288)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !76, file: !77, line: 37, baseType: !7, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !76, file: !77, line: 38, baseType: !7, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !61, file: !56, line: 30, baseType: !59, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !61, file: !56, line: 34, baseType: !7, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !61, file: !56, line: 40, baseType: !7, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !61, file: !56, line: 43, baseType: !7, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !61, file: !56, line: 45, baseType: !7, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !61, file: !56, line: 46, baseType: !7, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !61, file: !56, line: 47, baseType: !7, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !61, file: !56, line: 48, baseType: !7, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !61, file: !56, line: 49, baseType: !7, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !61, file: !56, line: 50, baseType: !7, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !61, file: !56, line: 52, baseType: !7, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !61, file: !56, line: 53, baseType: !7, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !61, file: !56, line: 55, baseType: !67, size: 32, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !56, line: 61, baseType: !53, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !32, file: !33, line: 62, baseType: !194, size: 32, offset: 224)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !33, line: 41, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !33, line: 43, size: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !33, line: 44, baseType: !194, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !196, file: !33, line: 45, baseType: !4, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !32, file: !33, line: 63, baseType: !201, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !33, line: 32, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !33, line: 34, size: 96, elements: !204)
!204 = !{!205, !210, !211}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !203, file: !33, line: 35, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !33, line: 30, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !4}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !33, line: 36, baseType: !4, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !33, line: 37, baseType: !201, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !32, file: !33, line: 64, baseType: !137, size: 32, offset: 288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !25, file: !10, line: 31, baseType: !8, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !25, file: !10, line: 32, baseType: !174, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !25, file: !10, line: 33, baseType: !50, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !48, line: 78, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !67)
!218 = !{!219, !220, !221, !223, !224, !225}
!219 = !DILocalVariable(name: "pool", arg: 1, scope: !20, file: !1, line: 16, type: !29)
!220 = !DILocalVariable(name: "preallocate", arg: 2, scope: !20, file: !1, line: 16, type: !216)
!221 = !DILocalVariable(name: "key", scope: !20, file: !1, line: 18, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 191, baseType: !7)
!223 = !DILocalVariable(name: "mask", scope: !20, file: !1, line: 18, type: !222)
!224 = !DILocalVariable(name: "inc", scope: !20, file: !1, line: 18, type: !222)
!225 = !DILocalVariable(name: "tree", scope: !20, file: !1, line: 19, type: !23)
!226 = !{!227, !227, i64 0}
!227 = !{!"any pointer", !228, i64 0}
!228 = !{!"omnipotent char", !229, i64 0}
!229 = !{!"Simple C/C++ TBAA"}
!230 = !DIExpression()
!231 = !DILocation(line: 16, column: 35, scope: !20)
!232 = !{!233, !233, i64 0}
!233 = !{!"int", !228, i64 0}
!234 = !DILocation(line: 16, column: 51, scope: !20)
!235 = !DILocation(line: 18, column: 5, scope: !20)
!236 = !DILocation(line: 18, column: 24, scope: !20)
!237 = !DILocation(line: 18, column: 29, scope: !20)
!238 = !DILocation(line: 18, column: 35, scope: !20)
!239 = !DILocation(line: 19, column: 5, scope: !20)
!240 = !DILocation(line: 19, column: 24, scope: !20)
!241 = !DILocation(line: 21, column: 23, scope: !20)
!242 = !DILocation(line: 21, column: 12, scope: !20)
!243 = !DILocation(line: 21, column: 10, scope: !20)
!244 = !DILocation(line: 22, column: 9, scope: !245)
!245 = distinct !DILexicalBlock(scope: !20, file: !1, line: 22, column: 9)
!246 = !DILocation(line: 22, column: 14, scope: !245)
!247 = !DILocation(line: 22, column: 9, scope: !20)
!248 = !DILocation(line: 23, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !1, line: 22, column: 23)
!250 = !DILocation(line: 26, column: 18, scope: !20)
!251 = !DILocation(line: 26, column: 5, scope: !20)
!252 = !DILocation(line: 26, column: 11, scope: !20)
!253 = !DILocation(line: 26, column: 16, scope: !20)
!254 = !{!255, !227, i64 4}
!255 = !{!"", !227, i64 0, !227, i64 4, !227, i64 8, !227, i64 12, !233, i64 16}
!256 = !DILocation(line: 27, column: 5, scope: !20)
!257 = !DILocation(line: 27, column: 11, scope: !20)
!258 = !DILocation(line: 27, column: 16, scope: !20)
!259 = !{!255, !227, i64 8}
!260 = !DILocation(line: 28, column: 5, scope: !20)
!261 = !DILocation(line: 28, column: 11, scope: !20)
!262 = !DILocation(line: 28, column: 17, scope: !20)
!263 = !{!255, !227, i64 12}
!264 = !DILocation(line: 29, column: 5, scope: !20)
!265 = !DILocation(line: 29, column: 11, scope: !20)
!266 = !DILocation(line: 29, column: 16, scope: !20)
!267 = !{!255, !233, i64 16}
!268 = !DILocation(line: 31, column: 34, scope: !20)
!269 = !DILocation(line: 31, column: 18, scope: !20)
!270 = !DILocation(line: 31, column: 5, scope: !20)
!271 = !DILocation(line: 31, column: 11, scope: !20)
!272 = !DILocation(line: 31, column: 16, scope: !20)
!273 = !{!255, !227, i64 0}
!274 = !DILocation(line: 32, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !20, file: !1, line: 32, column: 9)
!276 = !DILocation(line: 32, column: 15, scope: !275)
!277 = !DILocation(line: 32, column: 20, scope: !275)
!278 = !DILocation(line: 32, column: 9, scope: !20)
!279 = !DILocation(line: 33, column: 9, scope: !280)
!280 = distinct !DILexicalBlock(scope: !275, file: !1, line: 32, column: 29)
!281 = !DILocation(line: 36, column: 5, scope: !20)
!282 = !DILocation(line: 36, column: 11, scope: !20)
!283 = !DILocation(line: 36, column: 17, scope: !20)
!284 = !DILocation(line: 36, column: 23, scope: !20)
!285 = !{!286, !227, i64 0}
