; ModuleID = 'src/core/ngx_output_chain.c'
source_filename = "src/core/ngx_output_chain.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_output_chain_ctx_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s*, %struct.ngx_chain_s*, i8, i32, %struct.ngx_pool_s*, i32, %struct.ngx_bufs_t, i8*, i32 (i8*, %struct.ngx_chain_s*)*, i8* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_output_chain.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !8, !156, !46, !157}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !10, line: 19, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !12, line: 59, size: 64, elements: !13)
!12 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !{!14, !155}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !11, file: !12, line: 60, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !12, line: 18, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !12, line: 20, size: 352, elements: !18)
!18 = !{!19, !24, !25, !26, !27, !28, !29, !31, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !17, file: !12, line: 21, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !22, line: 64, baseType: !23)
!22 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !17, file: !12, line: 22, baseType: !20, size: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !17, file: !12, line: 23, baseType: !5, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !17, file: !12, line: 24, baseType: !5, size: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !17, file: !12, line: 26, baseType: !20, size: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !17, file: !12, line: 27, baseType: !20, size: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !17, file: !12, line: 28, baseType: !30, size: 32, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !12, line: 16, baseType: !4)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !17, file: !12, line: 29, baseType: !32, size: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !10, line: 23, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !35, line: 16, size: 1216, elements: !36)
!35 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!36 = !{!37, !40, !49, !94, !95, !96, !140, !141}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !34, file: !35, line: 17, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !39, line: 16, baseType: !7)
!39 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !35, line: 18, baseType: !41, size: 64, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !42, line: 19, baseType: !43)
!42 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 16, size: 64, elements: !44)
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !43, file: !42, line: 17, baseType: !46, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !43, file: !42, line: 18, baseType: !20, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !34, file: !35, line: 19, baseType: !50, size: 960, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !39, line: 17, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !52, line: 4, size: 960, elements: !53)
!52 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!53 = !{!54, !56, !57, !59, !60, !62, !63, !65, !67, !69, !70, !71, !72, !73, !74, !77, !78, !80, !81, !87, !88, !89}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !51, file: !52, line: 6, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !47)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !51, file: !52, line: 7, baseType: !55, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !51, file: !52, line: 8, baseType: !58, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !47)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !51, file: !52, line: 9, baseType: !58, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !51, file: !52, line: 10, baseType: !61, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !47)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !51, file: !52, line: 11, baseType: !61, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !51, file: !52, line: 13, baseType: !64, size: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !47)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !51, file: !52, line: 14, baseType: !66, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !47)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !51, file: !52, line: 15, baseType: !68, size: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !47)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !51, file: !52, line: 16, baseType: !47, size: 32, offset: 288)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !51, file: !52, line: 17, baseType: !55, size: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !51, file: !52, line: 18, baseType: !55, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !51, file: !52, line: 19, baseType: !5, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !51, file: !52, line: 20, baseType: !5, size: 32, offset: 416)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !51, file: !52, line: 21, baseType: !75, size: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !76)
!76 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !51, file: !52, line: 22, baseType: !75, size: 32, offset: 480)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !51, file: !52, line: 23, baseType: !79, size: 32, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !7)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !51, file: !52, line: 24, baseType: !79, size: 32, offset: 544)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !51, file: !52, line: 26, baseType: !82, size: 64, offset: 576)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !82, file: !6, line: 288, baseType: !85, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !76)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !82, file: !6, line: 288, baseType: !76, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !51, file: !52, line: 27, baseType: !82, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !51, file: !52, line: 28, baseType: !82, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !51, file: !52, line: 29, baseType: !90, size: 192, offset: 768)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, elements: !92)
!91 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !34, file: !35, line: 21, baseType: !5, size: 32, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !34, file: !35, line: 22, baseType: !5, size: 32, offset: 1120)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !34, file: !35, line: 24, baseType: !97, size: 32, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !10, line: 20, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !100, line: 50, size: 320, elements: !101)
!100 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!101 = !{!102, !106, !119, !123, !124, !129, !130, !135, !136, !139}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !99, file: !100, line: 51, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !104, line: 79, baseType: !105)
!104 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !47)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !99, file: !100, line: 52, baseType: !107, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !10, line: 21, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !110, line: 89, size: 160, elements: !111)
!110 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !{!112, !113, !114, !118}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !109, file: !110, line: 90, baseType: !38, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 91, baseType: !41, size: 64, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !109, file: !110, line: 93, baseType: !115, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !107, !97}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 94, baseType: !4, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !99, file: !100, line: 54, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !121, line: 98, baseType: !122)
!121 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!122 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !99, file: !100, line: 56, baseType: !85, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !99, file: !100, line: 58, baseType: !125, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !100, line: 45, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DISubroutineType(types: !128)
!128 = !{!20, !97, !20, !46}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !100, line: 59, baseType: !4, size: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !99, file: !100, line: 61, baseType: !131, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !100, line: 46, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !97, !103, !20, !46}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !99, file: !100, line: 62, baseType: !4, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !99, file: !100, line: 70, baseType: !137, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 72, baseType: !97, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !34, file: !35, line: 37, baseType: !47, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !34, file: !35, line: 38, baseType: !47, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !17, file: !12, line: 30, baseType: !15, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !17, file: !12, line: 34, baseType: !47, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !17, file: !12, line: 40, baseType: !47, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !17, file: !12, line: 43, baseType: !47, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !17, file: !12, line: 45, baseType: !47, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !17, file: !12, line: 46, baseType: !47, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !17, file: !12, line: 47, baseType: !47, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !17, file: !12, line: 48, baseType: !47, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !17, file: !12, line: 49, baseType: !47, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !17, file: !12, line: 50, baseType: !47, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !17, file: !12, line: 52, baseType: !47, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !17, file: !12, line: 53, baseType: !47, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !17, file: !12, line: 55, baseType: !7, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !12, line: 61, baseType: !8, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !6, line: 135, baseType: !7)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !104, line: 78, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !7)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!162 = distinct !DISubprogram(name: "ngx_output_chain", scope: !1, file: !1, line: 46, type: !163, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !231)
!163 = !DISubroutineType(types: !164)
!164 = !{!157, !165, !8}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_ctx_t", file: !12, line: 71, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_output_chain_ctx_s", file: !12, line: 78, size: 416, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !217, !218, !224, !225, !230}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !167, file: !12, line: 79, baseType: !15, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !167, file: !12, line: 80, baseType: !8, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !167, file: !12, line: 81, baseType: !8, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !167, file: !12, line: 82, baseType: !8, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !167, file: !12, line: 84, baseType: !47, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !167, file: !12, line: 85, baseType: !47, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "unaligned", scope: !167, file: !12, line: 86, baseType: !47, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_memory", scope: !167, file: !12, line: 87, baseType: !47, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "need_in_temp", scope: !167, file: !12, line: 88, baseType: !47, size: 1, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aio", scope: !167, file: !12, line: 89, baseType: !47, size: 1, offset: 133, flags: DIFlagBitField, extraData: i64 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !167, file: !12, line: 104, baseType: !5, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !167, file: !12, line: 106, baseType: !181, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !10, line: 18, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !184, line: 57, size: 320, elements: !185)
!184 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!185 = !{!186, !194, !195, !196, !197, !204, !216}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !183, file: !184, line: 58, baseType: !187, size: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !184, line: 54, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !184, line: 49, size: 128, elements: !189)
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !188, file: !184, line: 50, baseType: !20, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !188, file: !184, line: 51, baseType: !20, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !184, line: 52, baseType: !181, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !188, file: !184, line: 53, baseType: !103, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !183, file: !184, line: 59, baseType: !46, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !183, file: !184, line: 60, baseType: !181, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !183, file: !184, line: 61, baseType: !8, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !183, file: !184, line: 62, baseType: !198, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !184, line: 41, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !184, line: 43, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !184, line: 44, baseType: !198, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !200, file: !184, line: 45, baseType: !4, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !183, file: !184, line: 63, baseType: !205, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !184, line: 32, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !184, line: 34, size: 96, elements: !208)
!208 = !{!209, !214, !215}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !207, file: !184, line: 35, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !184, line: 30, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !4}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !184, line: 36, baseType: !4, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !184, line: 37, baseType: !205, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !183, file: !184, line: 64, baseType: !97, size: 32, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !167, file: !12, line: 107, baseType: !157, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !167, file: !12, line: 108, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !12, line: 68, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 65, size: 64, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !220, file: !12, line: 66, baseType: !157, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !220, file: !12, line: 67, baseType: !46, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !167, file: !12, line: 109, baseType: !30, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "output_filter", scope: !167, file: !12, line: 111, baseType: !226, size: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_output_chain_filter_pt", file: !12, line: 73, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DISubroutineType(types: !229)
!229 = !{!157, !4, !8}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "filter_ctx", scope: !167, file: !12, line: 112, baseType: !4, size: 32, offset: 384)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239}
!232 = !DILocalVariable(name: "ctx", arg: 1, scope: !162, file: !1, line: 46, type: !165)
!233 = !DILocalVariable(name: "in", arg: 2, scope: !162, file: !1, line: 46, type: !8)
!234 = !DILocalVariable(name: "bsize", scope: !162, file: !1, line: 48, type: !5)
!235 = !DILocalVariable(name: "rc", scope: !162, file: !1, line: 49, type: !157)
!236 = !DILocalVariable(name: "last", scope: !162, file: !1, line: 49, type: !157)
!237 = !DILocalVariable(name: "cl", scope: !162, file: !1, line: 50, type: !8)
!238 = !DILocalVariable(name: "out", scope: !162, file: !1, line: 50, type: !8)
!239 = !DILocalVariable(name: "last_out", scope: !162, file: !1, line: 50, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 32)
!241 = !{!242, !242, i64 0}
!242 = !{!"any pointer", !243, i64 0}
!243 = !{!"omnipotent char", !244, i64 0}
!244 = !{!"Simple C/C++ TBAA"}
!245 = !DIExpression()
!246 = !DILocation(line: 46, column: 42, scope: !162)
!247 = !DILocation(line: 46, column: 60, scope: !162)
!248 = !DILocation(line: 48, column: 5, scope: !162)
!249 = !DILocation(line: 48, column: 19, scope: !162)
!250 = !DILocation(line: 49, column: 5, scope: !162)
!251 = !DILocation(line: 49, column: 19, scope: !162)
!252 = !DILocation(line: 49, column: 23, scope: !162)
!253 = !DILocation(line: 50, column: 5, scope: !162)
!254 = !DILocation(line: 50, column: 19, scope: !162)
!255 = !DILocation(line: 50, column: 24, scope: !162)
!256 = !DILocation(line: 50, column: 31, scope: !162)
!257 = !DILocation(line: 52, column: 9, scope: !258)
!258 = distinct !DILexicalBlock(scope: !162, file: !1, line: 52, column: 9)
!259 = !DILocation(line: 52, column: 14, scope: !258)
!260 = !{!261, !242, i64 4}
!261 = !{!"ngx_output_chain_ctx_s", !242, i64 0, !242, i64 4, !242, i64 8, !242, i64 12, !262, i64 16, !262, i64 16, !262, i64 16, !262, i64 16, !262, i64 16, !262, i64 16, !262, i64 20, !242, i64 24, !262, i64 28, !263, i64 32, !242, i64 40, !242, i64 44, !242, i64 48}
!262 = !{!"int", !243, i64 0}
!263 = !{!"", !262, i64 0, !262, i64 4}
!264 = !DILocation(line: 52, column: 17, scope: !258)
!265 = !DILocation(line: 52, column: 25, scope: !258)
!266 = !DILocation(line: 52, column: 28, scope: !258)
!267 = !DILocation(line: 52, column: 33, scope: !258)
!268 = !{!261, !242, i64 12}
!269 = !DILocation(line: 52, column: 38, scope: !258)
!270 = !DILocation(line: 52, column: 9, scope: !162)
!271 = !DILocation(line: 64, column: 13, scope: !272)
!272 = distinct !DILexicalBlock(scope: !273, file: !1, line: 64, column: 13)
!273 = distinct !DILexicalBlock(scope: !258, file: !1, line: 57, column: 5)
!274 = !DILocation(line: 64, column: 16, scope: !272)
!275 = !DILocation(line: 64, column: 13, scope: !273)
!276 = !DILocation(line: 65, column: 20, scope: !277)
!277 = distinct !DILexicalBlock(scope: !272, file: !1, line: 64, column: 25)
!278 = !DILocation(line: 65, column: 25, scope: !277)
!279 = !{!261, !242, i64 44}
!280 = !DILocation(line: 65, column: 39, scope: !277)
!281 = !DILocation(line: 65, column: 44, scope: !277)
!282 = !{!261, !242, i64 48}
!283 = !DILocation(line: 65, column: 56, scope: !277)
!284 = !DILocation(line: 65, column: 13, scope: !277)
!285 = !DILocation(line: 68, column: 13, scope: !286)
!286 = distinct !DILexicalBlock(scope: !273, file: !1, line: 68, column: 13)
!287 = !DILocation(line: 68, column: 17, scope: !286)
!288 = !{!289, !242, i64 4}
!289 = !{!"ngx_chain_s", !242, i64 0, !242, i64 4}
!290 = !DILocation(line: 68, column: 22, scope: !286)
!291 = !DILocation(line: 70, column: 13, scope: !286)
!292 = !DILocation(line: 70, column: 18, scope: !286)
!293 = !DILocation(line: 70, column: 22, scope: !286)
!294 = !{!289, !242, i64 0}
!295 = !DILocation(line: 70, column: 27, scope: !286)
!296 = !DILocation(line: 70, column: 35, scope: !286)
!297 = !DILocation(line: 70, column: 38, scope: !286)
!298 = !DILocation(line: 70, column: 42, scope: !286)
!299 = !DILocation(line: 70, column: 47, scope: !286)
!300 = !{!301, !262, i64 12}
!301 = !{!"ngx_buf_s", !242, i64 0, !242, i64 4, !262, i64 8, !262, i64 12, !242, i64 16, !242, i64 20, !242, i64 24, !242, i64 28, !242, i64 32, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 36, !262, i64 37, !262, i64 37, !262, i64 37, !262, i64 40}
!302 = !DILocation(line: 70, column: 57, scope: !286)
!303 = !DILocation(line: 72, column: 13, scope: !286)
!304 = !DILocation(line: 72, column: 39, scope: !286)
!305 = !DILocation(line: 72, column: 44, scope: !286)
!306 = !DILocation(line: 72, column: 48, scope: !286)
!307 = !DILocation(line: 72, column: 16, scope: !286)
!308 = !DILocation(line: 68, column: 13, scope: !273)
!309 = !DILocation(line: 74, column: 20, scope: !310)
!310 = distinct !DILexicalBlock(scope: !286, file: !1, line: 73, column: 9)
!311 = !DILocation(line: 74, column: 25, scope: !310)
!312 = !DILocation(line: 74, column: 39, scope: !310)
!313 = !DILocation(line: 74, column: 44, scope: !310)
!314 = !DILocation(line: 74, column: 56, scope: !310)
!315 = !DILocation(line: 74, column: 13, scope: !310)
!316 = !DILocation(line: 76, column: 5, scope: !273)
!317 = !DILocation(line: 80, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !162, file: !1, line: 80, column: 9)
!319 = !DILocation(line: 80, column: 9, scope: !162)
!320 = !DILocation(line: 81, column: 39, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !1, line: 81, column: 13)
!322 = distinct !DILexicalBlock(scope: !318, file: !1, line: 80, column: 13)
!323 = !DILocation(line: 81, column: 44, scope: !321)
!324 = !{!261, !242, i64 24}
!325 = !DILocation(line: 81, column: 51, scope: !321)
!326 = !DILocation(line: 81, column: 56, scope: !321)
!327 = !DILocation(line: 81, column: 60, scope: !321)
!328 = !DILocation(line: 81, column: 13, scope: !321)
!329 = !DILocation(line: 81, column: 64, scope: !321)
!330 = !DILocation(line: 81, column: 13, scope: !322)
!331 = !DILocation(line: 82, column: 13, scope: !332)
!332 = distinct !DILexicalBlock(scope: !321, file: !1, line: 81, column: 78)
!333 = !DILocation(line: 84, column: 5, scope: !322)
!334 = !DILocation(line: 86, column: 9, scope: !162)
!335 = !DILocation(line: 87, column: 14, scope: !162)
!336 = !DILocation(line: 88, column: 10, scope: !162)
!337 = !{!262, !262, i64 0}
!338 = !DILocation(line: 90, column: 5, scope: !162)
!339 = !DILocation(line: 98, column: 9, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !1, line: 90, column: 16)
!341 = distinct !DILexicalBlock(scope: !342, file: !1, line: 90, column: 5)
!342 = distinct !DILexicalBlock(scope: !162, file: !1, line: 90, column: 5)
!343 = !DILocation(line: 98, column: 16, scope: !340)
!344 = !DILocation(line: 98, column: 21, scope: !340)
!345 = !DILocation(line: 105, column: 21, scope: !346)
!346 = distinct !DILexicalBlock(scope: !340, file: !1, line: 98, column: 25)
!347 = !{!301, !242, i64 4}
!348 = !{!301, !242, i64 0}
!349 = !{!301, !262, i64 8}
!350 = !DILocation(line: 105, column: 19, scope: !346)
!351 = !DILocation(line: 107, column: 17, scope: !352)
!352 = distinct !DILexicalBlock(scope: !346, file: !1, line: 107, column: 17)
!353 = !DILocation(line: 107, column: 23, scope: !352)
!354 = !DILocation(line: 107, column: 28, scope: !352)
!355 = !DILocation(line: 107, column: 32, scope: !352)
!356 = !DILocation(line: 107, column: 17, scope: !346)
!357 = !DILocation(line: 109, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !1, line: 109, column: 17)
!359 = distinct !DILexicalBlock(scope: !352, file: !1, line: 107, column: 63)
!360 = !{!361, !242, i64 36}
!361 = !{!"ngx_pool_s", !362, i64 0, !262, i64 16, !242, i64 20, !242, i64 24, !242, i64 28, !242, i64 32, !242, i64 36}
!362 = !{!"", !242, i64 0, !242, i64 4, !242, i64 8, !262, i64 12}
!363 = !{!364, !262, i64 0}
!364 = !{!"ngx_log_s", !262, i64 0, !242, i64 4, !365, i64 8, !365, i64 12, !242, i64 16, !242, i64 20, !242, i64 24, !242, i64 28, !242, i64 32, !242, i64 36}
!365 = !{!"long", !243, i64 0}
!366 = !DILocation(line: 109, column: 17, scope: !359)
!367 = !{!301, !242, i64 16}
!368 = !{!301, !242, i64 28}
!369 = !DILocation(line: 122, column: 17, scope: !359)
!370 = !DILocation(line: 124, column: 27, scope: !359)
!371 = !DILocation(line: 124, column: 32, scope: !359)
!372 = !DILocation(line: 124, column: 36, scope: !359)
!373 = !DILocation(line: 124, column: 17, scope: !359)
!374 = !DILocation(line: 124, column: 22, scope: !359)
!375 = !DILocation(line: 124, column: 25, scope: !359)
!376 = !DILocation(line: 126, column: 17, scope: !359)
!377 = distinct !{!377, !339, !378}
!378 = !DILocation(line: 203, column: 9, scope: !340)
!379 = !DILocation(line: 129, column: 40, scope: !380)
!380 = distinct !DILexicalBlock(scope: !346, file: !1, line: 129, column: 17)
!381 = !DILocation(line: 129, column: 45, scope: !380)
!382 = !DILocation(line: 129, column: 50, scope: !380)
!383 = !DILocation(line: 129, column: 54, scope: !380)
!384 = !DILocation(line: 129, column: 17, scope: !380)
!385 = !DILocation(line: 129, column: 17, scope: !346)
!386 = !DILocation(line: 133, column: 22, scope: !387)
!387 = distinct !DILexicalBlock(scope: !380, file: !1, line: 129, column: 60)
!388 = !DILocation(line: 133, column: 27, scope: !387)
!389 = !DILocation(line: 133, column: 20, scope: !387)
!390 = !DILocation(line: 134, column: 27, scope: !387)
!391 = !DILocation(line: 134, column: 31, scope: !387)
!392 = !DILocation(line: 134, column: 17, scope: !387)
!393 = !DILocation(line: 134, column: 22, scope: !387)
!394 = !DILocation(line: 134, column: 25, scope: !387)
!395 = !DILocation(line: 136, column: 29, scope: !387)
!396 = !DILocation(line: 136, column: 18, scope: !387)
!397 = !DILocation(line: 136, column: 27, scope: !387)
!398 = !DILocation(line: 137, column: 29, scope: !387)
!399 = !DILocation(line: 137, column: 33, scope: !387)
!400 = !DILocation(line: 137, column: 26, scope: !387)
!401 = !DILocation(line: 138, column: 17, scope: !387)
!402 = !DILocation(line: 138, column: 21, scope: !387)
!403 = !DILocation(line: 138, column: 26, scope: !387)
!404 = !DILocation(line: 140, column: 17, scope: !387)
!405 = !DILocation(line: 143, column: 17, scope: !406)
!406 = distinct !DILexicalBlock(scope: !346, file: !1, line: 143, column: 17)
!407 = !DILocation(line: 143, column: 22, scope: !406)
!408 = !{!261, !242, i64 0}
!409 = !DILocation(line: 143, column: 26, scope: !406)
!410 = !DILocation(line: 143, column: 17, scope: !346)
!411 = !DILocation(line: 145, column: 54, scope: !412)
!412 = distinct !DILexicalBlock(scope: !406, file: !1, line: 143, column: 35)
!413 = !DILocation(line: 145, column: 59, scope: !412)
!414 = !DILocation(line: 145, column: 22, scope: !412)
!415 = !DILocation(line: 145, column: 20, scope: !412)
!416 = !DILocation(line: 147, column: 21, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !1, line: 147, column: 21)
!418 = !DILocation(line: 147, column: 24, scope: !417)
!419 = !DILocation(line: 147, column: 21, scope: !412)
!420 = !DILocation(line: 148, column: 21, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !1, line: 147, column: 38)
!422 = !DILocation(line: 151, column: 21, scope: !423)
!423 = distinct !DILexicalBlock(scope: !412, file: !1, line: 151, column: 21)
!424 = !DILocation(line: 151, column: 24, scope: !423)
!425 = !DILocation(line: 151, column: 21, scope: !412)
!426 = !DILocation(line: 153, column: 25, scope: !427)
!427 = distinct !DILexicalBlock(scope: !428, file: !1, line: 153, column: 25)
!428 = distinct !DILexicalBlock(scope: !423, file: !1, line: 151, column: 35)
!429 = !DILocation(line: 153, column: 30, scope: !427)
!430 = !{!261, !242, i64 8}
!431 = !DILocation(line: 153, column: 25, scope: !428)
!432 = !DILocation(line: 157, column: 30, scope: !433)
!433 = distinct !DILexicalBlock(scope: !427, file: !1, line: 153, column: 36)
!434 = !DILocation(line: 157, column: 35, scope: !433)
!435 = !DILocation(line: 157, column: 28, scope: !433)
!436 = !DILocation(line: 158, column: 36, scope: !433)
!437 = !DILocation(line: 158, column: 40, scope: !433)
!438 = !DILocation(line: 158, column: 25, scope: !433)
!439 = !DILocation(line: 158, column: 30, scope: !433)
!440 = !DILocation(line: 158, column: 34, scope: !433)
!441 = !DILocation(line: 159, column: 37, scope: !433)
!442 = !DILocation(line: 159, column: 41, scope: !433)
!443 = !DILocation(line: 159, column: 25, scope: !433)
!444 = !DILocation(line: 159, column: 30, scope: !433)
!445 = !DILocation(line: 159, column: 35, scope: !433)
!446 = !DILocation(line: 161, column: 25, scope: !433)
!447 = !{!361, !242, i64 24}
!448 = !DILocation(line: 163, column: 21, scope: !433)
!449 = !DILocation(line: 163, column: 32, scope: !450)
!450 = distinct !DILexicalBlock(scope: !427, file: !1, line: 163, column: 32)
!451 = !DILocation(line: 163, column: 36, scope: !450)
!452 = !DILocation(line: 163, column: 39, scope: !450)
!453 = !DILocation(line: 163, column: 44, scope: !450)
!454 = !{!261, !262, i64 28}
!455 = !DILocation(line: 163, column: 57, scope: !450)
!456 = !DILocation(line: 163, column: 62, scope: !450)
!457 = !DILocation(line: 163, column: 67, scope: !450)
!458 = !{!261, !262, i64 32}
!459 = !DILocation(line: 163, column: 54, scope: !450)
!460 = !DILocation(line: 163, column: 32, scope: !427)
!461 = !DILocation(line: 165, column: 25, scope: !462)
!462 = distinct !DILexicalBlock(scope: !450, file: !1, line: 163, column: 72)
!463 = !DILocation(line: 167, column: 57, scope: !464)
!464 = distinct !DILexicalBlock(scope: !450, file: !1, line: 167, column: 32)
!465 = !DILocation(line: 167, column: 62, scope: !464)
!466 = !DILocation(line: 167, column: 32, scope: !464)
!467 = !DILocation(line: 167, column: 69, scope: !464)
!468 = !DILocation(line: 167, column: 32, scope: !450)
!469 = !DILocation(line: 168, column: 25, scope: !470)
!470 = distinct !DILexicalBlock(scope: !464, file: !1, line: 167, column: 80)
!471 = !DILocation(line: 170, column: 17, scope: !428)
!472 = !DILocation(line: 171, column: 13, scope: !412)
!473 = !DILocation(line: 173, column: 44, scope: !346)
!474 = !DILocation(line: 173, column: 18, scope: !346)
!475 = !DILocation(line: 173, column: 16, scope: !346)
!476 = !DILocation(line: 175, column: 17, scope: !477)
!477 = distinct !DILexicalBlock(scope: !346, file: !1, line: 175, column: 17)
!478 = !DILocation(line: 175, column: 20, scope: !477)
!479 = !DILocation(line: 175, column: 17, scope: !346)
!480 = !DILocation(line: 176, column: 24, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !1, line: 175, column: 34)
!482 = !DILocation(line: 176, column: 17, scope: !481)
!483 = !DILocation(line: 179, column: 17, scope: !484)
!484 = distinct !DILexicalBlock(scope: !346, file: !1, line: 179, column: 17)
!485 = !DILocation(line: 179, column: 20, scope: !484)
!486 = !DILocation(line: 179, column: 17, scope: !346)
!487 = !DILocation(line: 180, column: 21, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 180, column: 21)
!489 = distinct !DILexicalBlock(scope: !484, file: !1, line: 179, column: 34)
!490 = !DILocation(line: 180, column: 21, scope: !489)
!491 = !DILocation(line: 181, column: 21, scope: !492)
!492 = distinct !DILexicalBlock(scope: !488, file: !1, line: 180, column: 26)
!493 = !DILocation(line: 184, column: 24, scope: !489)
!494 = !DILocation(line: 184, column: 17, scope: !489)
!495 = !DILocation(line: 189, column: 17, scope: !496)
!496 = distinct !DILexicalBlock(scope: !346, file: !1, line: 189, column: 17)
!497 = !DILocation(line: 189, column: 44, scope: !496)
!498 = !DILocation(line: 189, column: 17, scope: !346)
!499 = !DILocation(line: 190, column: 27, scope: !500)
!500 = distinct !DILexicalBlock(scope: !496, file: !1, line: 189, column: 50)
!501 = !DILocation(line: 190, column: 32, scope: !500)
!502 = !DILocation(line: 190, column: 36, scope: !500)
!503 = !DILocation(line: 190, column: 17, scope: !500)
!504 = !DILocation(line: 190, column: 22, scope: !500)
!505 = !DILocation(line: 190, column: 25, scope: !500)
!506 = !DILocation(line: 191, column: 13, scope: !500)
!507 = !DILocation(line: 193, column: 39, scope: !346)
!508 = !DILocation(line: 193, column: 44, scope: !346)
!509 = !DILocation(line: 193, column: 18, scope: !346)
!510 = !DILocation(line: 193, column: 16, scope: !346)
!511 = !DILocation(line: 194, column: 17, scope: !512)
!512 = distinct !DILexicalBlock(scope: !346, file: !1, line: 194, column: 17)
!513 = !DILocation(line: 194, column: 20, scope: !512)
!514 = !DILocation(line: 194, column: 17, scope: !346)
!515 = !DILocation(line: 195, column: 17, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !1, line: 194, column: 29)
!517 = !DILocation(line: 198, column: 23, scope: !346)
!518 = !DILocation(line: 198, column: 28, scope: !346)
!519 = !DILocation(line: 198, column: 13, scope: !346)
!520 = !DILocation(line: 198, column: 17, scope: !346)
!521 = !DILocation(line: 198, column: 21, scope: !346)
!522 = !DILocation(line: 199, column: 13, scope: !346)
!523 = !DILocation(line: 199, column: 17, scope: !346)
!524 = !DILocation(line: 199, column: 22, scope: !346)
!525 = !DILocation(line: 200, column: 25, scope: !346)
!526 = !DILocation(line: 200, column: 14, scope: !346)
!527 = !DILocation(line: 200, column: 23, scope: !346)
!528 = !DILocation(line: 201, column: 25, scope: !346)
!529 = !DILocation(line: 201, column: 29, scope: !346)
!530 = !DILocation(line: 201, column: 22, scope: !346)
!531 = !DILocation(line: 202, column: 13, scope: !346)
!532 = !DILocation(line: 202, column: 18, scope: !346)
!533 = !DILocation(line: 202, column: 22, scope: !346)
!534 = !DILocation(line: 205, column: 13, scope: !535)
!535 = distinct !DILexicalBlock(scope: !340, file: !1, line: 205, column: 13)
!536 = !DILocation(line: 205, column: 17, scope: !535)
!537 = !DILocation(line: 205, column: 25, scope: !535)
!538 = !DILocation(line: 205, column: 28, scope: !535)
!539 = !DILocation(line: 205, column: 33, scope: !535)
!540 = !DILocation(line: 205, column: 13, scope: !340)
!541 = !DILocation(line: 207, column: 17, scope: !542)
!542 = distinct !DILexicalBlock(scope: !543, file: !1, line: 207, column: 17)
!543 = distinct !DILexicalBlock(scope: !535, file: !1, line: 205, column: 46)
!544 = !DILocation(line: 207, column: 22, scope: !542)
!545 = !DILocation(line: 207, column: 17, scope: !543)
!546 = !DILocation(line: 208, column: 17, scope: !547)
!547 = distinct !DILexicalBlock(scope: !542, file: !1, line: 207, column: 26)
!548 = !DILocation(line: 211, column: 20, scope: !543)
!549 = !DILocation(line: 211, column: 13, scope: !543)
!550 = !DILocation(line: 214, column: 16, scope: !340)
!551 = !DILocation(line: 214, column: 21, scope: !340)
!552 = !DILocation(line: 214, column: 35, scope: !340)
!553 = !DILocation(line: 214, column: 40, scope: !340)
!554 = !DILocation(line: 214, column: 52, scope: !340)
!555 = !DILocation(line: 214, column: 14, scope: !340)
!556 = !DILocation(line: 216, column: 13, scope: !557)
!557 = distinct !DILexicalBlock(scope: !340, file: !1, line: 216, column: 13)
!558 = !DILocation(line: 216, column: 18, scope: !557)
!559 = !DILocation(line: 216, column: 31, scope: !557)
!560 = !DILocation(line: 216, column: 34, scope: !557)
!561 = !DILocation(line: 216, column: 39, scope: !557)
!562 = !DILocation(line: 216, column: 13, scope: !340)
!563 = !DILocation(line: 217, column: 20, scope: !564)
!564 = distinct !DILexicalBlock(scope: !557, file: !1, line: 216, column: 52)
!565 = !DILocation(line: 217, column: 13, scope: !564)
!566 = !DILocation(line: 220, column: 33, scope: !340)
!567 = !DILocation(line: 220, column: 38, scope: !340)
!568 = !DILocation(line: 220, column: 45, scope: !340)
!569 = !DILocation(line: 220, column: 50, scope: !340)
!570 = !DILocation(line: 220, column: 57, scope: !340)
!571 = !DILocation(line: 220, column: 62, scope: !340)
!572 = !DILocation(line: 221, column: 33, scope: !340)
!573 = !DILocation(line: 221, column: 38, scope: !340)
!574 = !{!261, !242, i64 40}
!575 = !DILocation(line: 220, column: 9, scope: !340)
!576 = !DILocation(line: 222, column: 18, scope: !340)
!577 = !DILocation(line: 90, column: 5, scope: !341)
!578 = distinct !{!578, !579, !580}
!579 = !DILocation(line: 90, column: 5, scope: !342)
!580 = !DILocation(line: 223, column: 5, scope: !342)
!581 = !DILocation(line: 224, column: 1, scope: !162)
!582 = distinct !DISubprogram(name: "ngx_output_chain_as_is", scope: !1, file: !1, line: 228, type: !583, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!157, !165, !15}
!585 = !{!586, !587, !588}
!586 = !DILocalVariable(name: "ctx", arg: 1, scope: !582, file: !1, line: 228, type: !165)
!587 = !DILocalVariable(name: "buf", arg: 2, scope: !582, file: !1, line: 228, type: !15)
!588 = !DILocalVariable(name: "sendfile", scope: !582, file: !1, line: 230, type: !103)
!589 = !DILocation(line: 228, column: 48, scope: !582)
!590 = !DILocation(line: 228, column: 64, scope: !582)
!591 = !DILocation(line: 230, column: 5, scope: !582)
!592 = !DILocation(line: 230, column: 17, scope: !582)
!593 = !DILocation(line: 232, column: 9, scope: !594)
!594 = distinct !DILexicalBlock(scope: !582, file: !1, line: 232, column: 9)
!595 = !DILocation(line: 232, column: 9, scope: !582)
!596 = !DILocation(line: 233, column: 9, scope: !597)
!597 = distinct !DILexicalBlock(scope: !594, file: !1, line: 232, column: 31)
!598 = !DILocation(line: 243, column: 9, scope: !599)
!599 = distinct !DILexicalBlock(scope: !582, file: !1, line: 243, column: 9)
!600 = !DILocation(line: 243, column: 14, scope: !599)
!601 = !DILocation(line: 243, column: 22, scope: !599)
!602 = !DILocation(line: 243, column: 25, scope: !599)
!603 = !DILocation(line: 243, column: 30, scope: !599)
!604 = !DILocation(line: 243, column: 36, scope: !599)
!605 = !DILocation(line: 243, column: 9, scope: !582)
!606 = !DILocation(line: 244, column: 9, scope: !607)
!607 = distinct !DILexicalBlock(scope: !599, file: !1, line: 243, column: 46)
!608 = !DILocation(line: 247, column: 16, scope: !582)
!609 = !DILocation(line: 247, column: 21, scope: !582)
!610 = !DILocation(line: 247, column: 14, scope: !582)
!611 = !DILocation(line: 251, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !582, file: !1, line: 251, column: 9)
!613 = !DILocation(line: 251, column: 14, scope: !612)
!614 = !DILocation(line: 251, column: 22, scope: !612)
!615 = !DILocation(line: 251, column: 25, scope: !612)
!616 = !DILocation(line: 251, column: 30, scope: !612)
!617 = !DILocation(line: 251, column: 39, scope: !612)
!618 = !DILocation(line: 251, column: 9, scope: !582)
!619 = !DILocation(line: 252, column: 18, scope: !620)
!620 = distinct !DILexicalBlock(scope: !612, file: !1, line: 251, column: 62)
!621 = !DILocation(line: 253, column: 5, scope: !620)
!622 = !DILocation(line: 257, column: 10, scope: !623)
!623 = distinct !DILexicalBlock(scope: !582, file: !1, line: 257, column: 9)
!624 = !DILocation(line: 257, column: 9, scope: !582)
!625 = !DILocation(line: 259, column: 14, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !1, line: 259, column: 13)
!627 = distinct !DILexicalBlock(scope: !623, file: !1, line: 257, column: 20)
!628 = !DILocation(line: 259, column: 13, scope: !627)
!629 = !DILocation(line: 260, column: 13, scope: !630)
!630 = distinct !DILexicalBlock(scope: !626, file: !1, line: 259, column: 38)
!631 = !DILocation(line: 263, column: 9, scope: !627)
!632 = !DILocation(line: 263, column: 14, scope: !627)
!633 = !DILocation(line: 263, column: 22, scope: !627)
!634 = !DILocation(line: 264, column: 5, scope: !627)
!635 = !DILocation(line: 272, column: 9, scope: !636)
!636 = distinct !DILexicalBlock(scope: !582, file: !1, line: 272, column: 9)
!637 = !DILocation(line: 272, column: 14, scope: !636)
!638 = !DILocation(line: 272, column: 29, scope: !636)
!639 = !DILocation(line: 272, column: 33, scope: !636)
!640 = !DILocation(line: 272, column: 9, scope: !582)
!641 = !DILocation(line: 273, column: 9, scope: !642)
!642 = distinct !DILexicalBlock(scope: !636, file: !1, line: 272, column: 57)
!643 = !DILocation(line: 276, column: 9, scope: !644)
!644 = distinct !DILexicalBlock(scope: !582, file: !1, line: 276, column: 9)
!645 = !DILocation(line: 276, column: 14, scope: !644)
!646 = !DILocation(line: 276, column: 27, scope: !644)
!647 = !DILocation(line: 276, column: 31, scope: !644)
!648 = !DILocation(line: 276, column: 36, scope: !644)
!649 = !DILocation(line: 276, column: 43, scope: !644)
!650 = !DILocation(line: 276, column: 46, scope: !644)
!651 = !DILocation(line: 276, column: 51, scope: !644)
!652 = !DILocation(line: 276, column: 9, scope: !582)
!653 = !DILocation(line: 277, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !644, file: !1, line: 276, column: 58)
!655 = !DILocation(line: 280, column: 5, scope: !582)
!656 = !DILocation(line: 281, column: 1, scope: !582)
!657 = distinct !DISubprogram(name: "ngx_output_chain_add_copy", scope: !1, file: !1, line: 307, type: !658, isLocal: true, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!157, !181, !240, !8}
!660 = !{!661, !662, !663, !664, !665, !666, !667}
!661 = !DILocalVariable(name: "pool", arg: 1, scope: !657, file: !1, line: 307, type: !181)
!662 = !DILocalVariable(name: "chain", arg: 2, scope: !657, file: !1, line: 307, type: !240)
!663 = !DILocalVariable(name: "in", arg: 3, scope: !657, file: !1, line: 308, type: !8)
!664 = !DILocalVariable(name: "cl", scope: !657, file: !1, line: 310, type: !8)
!665 = !DILocalVariable(name: "ll", scope: !657, file: !1, line: 310, type: !240)
!666 = !DILocalVariable(name: "b", scope: !657, file: !1, line: 312, type: !15)
!667 = !DILocalVariable(name: "buf", scope: !657, file: !1, line: 312, type: !15)
!668 = !DILocation(line: 307, column: 39, scope: !657)
!669 = !DILocation(line: 307, column: 59, scope: !657)
!670 = !DILocation(line: 308, column: 18, scope: !657)
!671 = !DILocation(line: 310, column: 5, scope: !657)
!672 = !DILocation(line: 310, column: 19, scope: !657)
!673 = !DILocation(line: 310, column: 25, scope: !657)
!674 = !DILocation(line: 312, column: 5, scope: !657)
!675 = !DILocation(line: 312, column: 19, scope: !657)
!676 = !DILocation(line: 312, column: 23, scope: !657)
!677 = !DILocation(line: 315, column: 10, scope: !657)
!678 = !DILocation(line: 315, column: 8, scope: !657)
!679 = !DILocation(line: 317, column: 16, scope: !680)
!680 = distinct !DILexicalBlock(scope: !657, file: !1, line: 317, column: 5)
!681 = !DILocation(line: 317, column: 15, scope: !680)
!682 = !DILocation(line: 317, column: 13, scope: !680)
!683 = !DILocation(line: 317, column: 10, scope: !680)
!684 = !DILocation(line: 317, column: 23, scope: !685)
!685 = distinct !DILexicalBlock(scope: !680, file: !1, line: 317, column: 5)
!686 = !DILocation(line: 317, column: 5, scope: !680)
!687 = !DILocation(line: 318, column: 15, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !1, line: 317, column: 42)
!689 = !DILocation(line: 318, column: 19, scope: !688)
!690 = !DILocation(line: 318, column: 12, scope: !688)
!691 = !DILocation(line: 319, column: 5, scope: !688)
!692 = !DILocation(line: 317, column: 32, scope: !685)
!693 = !DILocation(line: 317, column: 36, scope: !685)
!694 = !DILocation(line: 317, column: 30, scope: !685)
!695 = !DILocation(line: 317, column: 5, scope: !685)
!696 = distinct !{!696, !686, !697}
!697 = !DILocation(line: 319, column: 5, scope: !680)
!698 = !DILocation(line: 321, column: 5, scope: !657)
!699 = !DILocation(line: 321, column: 12, scope: !657)
!700 = !DILocation(line: 323, column: 35, scope: !701)
!701 = distinct !DILexicalBlock(scope: !657, file: !1, line: 321, column: 16)
!702 = !DILocation(line: 323, column: 14, scope: !701)
!703 = !DILocation(line: 323, column: 12, scope: !701)
!704 = !DILocation(line: 324, column: 13, scope: !705)
!705 = distinct !DILexicalBlock(scope: !701, file: !1, line: 324, column: 13)
!706 = !DILocation(line: 324, column: 16, scope: !705)
!707 = !DILocation(line: 324, column: 13, scope: !701)
!708 = !DILocation(line: 325, column: 13, scope: !709)
!709 = distinct !DILexicalBlock(scope: !705, file: !1, line: 324, column: 25)
!710 = !DILocation(line: 330, column: 15, scope: !701)
!711 = !DILocation(line: 330, column: 19, scope: !701)
!712 = !DILocation(line: 330, column: 13, scope: !701)
!713 = !DILocation(line: 332, column: 13, scope: !714)
!714 = distinct !DILexicalBlock(scope: !701, file: !1, line: 332, column: 13)
!715 = !DILocation(line: 332, column: 18, scope: !714)
!716 = !DILocation(line: 333, column: 13, scope: !714)
!717 = !DILocation(line: 333, column: 16, scope: !714)
!718 = !DILocation(line: 333, column: 21, scope: !714)
!719 = !DILocation(line: 333, column: 30, scope: !714)
!720 = !DILocation(line: 334, column: 13, scope: !714)
!721 = !DILocation(line: 334, column: 16, scope: !714)
!722 = !DILocation(line: 334, column: 21, scope: !714)
!723 = !DILocation(line: 334, column: 31, scope: !714)
!724 = !DILocation(line: 332, column: 13, scope: !701)
!725 = !DILocation(line: 338, column: 17, scope: !726)
!726 = distinct !DILexicalBlock(scope: !714, file: !1, line: 335, column: 9)
!727 = !DILocation(line: 338, column: 15, scope: !726)
!728 = !DILocation(line: 339, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !726, file: !1, line: 339, column: 17)
!730 = !DILocation(line: 339, column: 19, scope: !729)
!731 = !DILocation(line: 339, column: 17, scope: !726)
!732 = !DILocation(line: 340, column: 17, scope: !733)
!733 = distinct !DILexicalBlock(scope: !729, file: !1, line: 339, column: 28)
!734 = !DILocation(line: 343, column: 13, scope: !726)
!735 = !DILocation(line: 345, column: 17, scope: !736)
!736 = distinct !DILexicalBlock(scope: !726, file: !1, line: 345, column: 17)
!737 = !DILocation(line: 345, column: 17, scope: !726)
!738 = !DILocation(line: 346, column: 61, scope: !739)
!739 = distinct !DILexicalBlock(scope: !736, file: !1, line: 345, column: 41)
!740 = !DILocation(line: 346, column: 66, scope: !739)
!741 = !DILocation(line: 346, column: 59, scope: !739)
!742 = !DILocation(line: 346, column: 17, scope: !739)
!743 = !DILocation(line: 346, column: 22, scope: !739)
!744 = !DILocation(line: 346, column: 26, scope: !739)
!745 = !DILocation(line: 347, column: 27, scope: !739)
!746 = !DILocation(line: 347, column: 32, scope: !739)
!747 = !DILocation(line: 347, column: 17, scope: !739)
!748 = !DILocation(line: 347, column: 20, scope: !739)
!749 = !DILocation(line: 347, column: 25, scope: !739)
!750 = !DILocation(line: 348, column: 13, scope: !739)
!751 = !DILocation(line: 350, column: 13, scope: !726)
!752 = !DILocation(line: 350, column: 18, scope: !726)
!753 = !DILocation(line: 350, column: 27, scope: !726)
!754 = !DILocation(line: 351, column: 13, scope: !726)
!755 = !DILocation(line: 351, column: 16, scope: !726)
!756 = !DILocation(line: 351, column: 26, scope: !726)
!757 = !DILocation(line: 353, column: 23, scope: !726)
!758 = !DILocation(line: 353, column: 13, scope: !726)
!759 = !DILocation(line: 353, column: 17, scope: !726)
!760 = !DILocation(line: 353, column: 21, scope: !726)
!761 = !DILocation(line: 355, column: 9, scope: !726)
!762 = !DILocation(line: 356, column: 23, scope: !763)
!763 = distinct !DILexicalBlock(scope: !714, file: !1, line: 355, column: 16)
!764 = !DILocation(line: 356, column: 13, scope: !763)
!765 = !DILocation(line: 356, column: 17, scope: !763)
!766 = !DILocation(line: 356, column: 21, scope: !763)
!767 = !DILocation(line: 357, column: 18, scope: !763)
!768 = !DILocation(line: 357, column: 22, scope: !763)
!769 = !DILocation(line: 357, column: 16, scope: !763)
!770 = !DILocation(line: 366, column: 9, scope: !701)
!771 = !DILocation(line: 366, column: 13, scope: !701)
!772 = !DILocation(line: 366, column: 18, scope: !701)
!773 = !DILocation(line: 367, column: 15, scope: !701)
!774 = !DILocation(line: 367, column: 10, scope: !701)
!775 = !DILocation(line: 367, column: 13, scope: !701)
!776 = !DILocation(line: 368, column: 15, scope: !701)
!777 = !DILocation(line: 368, column: 19, scope: !701)
!778 = !DILocation(line: 368, column: 12, scope: !701)
!779 = distinct !{!779, !698, !780}
!780 = !DILocation(line: 369, column: 5, scope: !657)
!781 = !DILocation(line: 371, column: 5, scope: !657)
!782 = !DILocation(line: 372, column: 1, scope: !657)
!783 = distinct !DISubprogram(name: "ngx_output_chain_align_file_buf", scope: !1, file: !1, line: 376, type: !784, isLocal: true, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!157, !165, !5}
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "ctx", arg: 1, scope: !783, file: !1, line: 376, type: !165)
!788 = !DILocalVariable(name: "bsize", arg: 2, scope: !783, file: !1, line: 376, type: !5)
!789 = !DILocalVariable(name: "size", scope: !783, file: !1, line: 378, type: !46)
!790 = !DILocalVariable(name: "in", scope: !783, file: !1, line: 379, type: !15)
!791 = !DILocation(line: 376, column: 57, scope: !783)
!792 = !DILocation(line: 376, column: 68, scope: !783)
!793 = !DILocation(line: 378, column: 5, scope: !783)
!794 = !DILocation(line: 378, column: 17, scope: !783)
!795 = !DILocation(line: 379, column: 5, scope: !783)
!796 = !DILocation(line: 379, column: 17, scope: !783)
!797 = !DILocation(line: 381, column: 10, scope: !783)
!798 = !DILocation(line: 381, column: 15, scope: !783)
!799 = !DILocation(line: 381, column: 19, scope: !783)
!800 = !DILocation(line: 381, column: 8, scope: !783)
!801 = !DILocation(line: 383, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !783, file: !1, line: 383, column: 9)
!803 = !DILocation(line: 383, column: 13, scope: !802)
!804 = !DILocation(line: 383, column: 18, scope: !802)
!805 = !DILocation(line: 383, column: 26, scope: !802)
!806 = !DILocation(line: 383, column: 30, scope: !802)
!807 = !DILocation(line: 383, column: 34, scope: !802)
!808 = !DILocation(line: 383, column: 40, scope: !802)
!809 = !DILocation(line: 383, column: 9, scope: !783)
!810 = !DILocation(line: 384, column: 9, scope: !811)
!811 = distinct !DILexicalBlock(scope: !802, file: !1, line: 383, column: 50)
!812 = !DILocation(line: 387, column: 5, scope: !783)
!813 = !DILocation(line: 387, column: 10, scope: !783)
!814 = !DILocation(line: 387, column: 19, scope: !783)
!815 = !DILocation(line: 389, column: 22, scope: !783)
!816 = !DILocation(line: 389, column: 26, scope: !783)
!817 = !DILocation(line: 389, column: 38, scope: !783)
!818 = !DILocation(line: 389, column: 42, scope: !783)
!819 = !DILocation(line: 389, column: 55, scope: !783)
!820 = !DILocation(line: 389, column: 60, scope: !783)
!821 = !{!261, !262, i64 20}
!822 = !DILocation(line: 389, column: 70, scope: !783)
!823 = !DILocation(line: 389, column: 53, scope: !783)
!824 = !DILocation(line: 389, column: 51, scope: !783)
!825 = !DILocation(line: 389, column: 35, scope: !783)
!826 = !DILocation(line: 389, column: 10, scope: !783)
!827 = !DILocation(line: 391, column: 9, scope: !828)
!828 = distinct !DILexicalBlock(scope: !783, file: !1, line: 391, column: 9)
!829 = !DILocation(line: 391, column: 14, scope: !828)
!830 = !DILocation(line: 391, column: 9, scope: !783)
!831 = !DILocation(line: 393, column: 13, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !1, line: 393, column: 13)
!833 = distinct !DILexicalBlock(scope: !828, file: !1, line: 391, column: 20)
!834 = !DILocation(line: 393, column: 30, scope: !832)
!835 = !DILocation(line: 393, column: 35, scope: !832)
!836 = !DILocation(line: 393, column: 40, scope: !832)
!837 = !{!261, !262, i64 36}
!838 = !DILocation(line: 393, column: 19, scope: !832)
!839 = !DILocation(line: 393, column: 13, scope: !833)
!840 = !DILocation(line: 394, column: 13, scope: !841)
!841 = distinct !DILexicalBlock(scope: !832, file: !1, line: 393, column: 46)
!842 = !DILocation(line: 397, column: 25, scope: !833)
!843 = !DILocation(line: 397, column: 14, scope: !833)
!844 = !DILocation(line: 399, column: 5, scope: !833)
!845 = !DILocation(line: 400, column: 25, scope: !846)
!846 = distinct !DILexicalBlock(scope: !828, file: !1, line: 399, column: 12)
!847 = !DILocation(line: 400, column: 30, scope: !846)
!848 = !DILocation(line: 400, column: 42, scope: !846)
!849 = !DILocation(line: 400, column: 40, scope: !846)
!850 = !DILocation(line: 400, column: 14, scope: !846)
!851 = !DILocation(line: 402, column: 21, scope: !852)
!852 = distinct !DILexicalBlock(scope: !846, file: !1, line: 402, column: 13)
!853 = !DILocation(line: 402, column: 28, scope: !852)
!854 = !DILocation(line: 402, column: 26, scope: !852)
!855 = !DILocation(line: 402, column: 13, scope: !846)
!856 = !DILocation(line: 403, column: 29, scope: !857)
!857 = distinct !DILexicalBlock(scope: !852, file: !1, line: 402, column: 35)
!858 = !DILocation(line: 403, column: 18, scope: !857)
!859 = !DILocation(line: 404, column: 9, scope: !857)
!860 = !DILocation(line: 407, column: 36, scope: !783)
!861 = !DILocation(line: 407, column: 41, scope: !783)
!862 = !DILocation(line: 407, column: 47, scope: !783)
!863 = !DILocation(line: 407, column: 16, scope: !783)
!864 = !DILocation(line: 407, column: 5, scope: !783)
!865 = !DILocation(line: 407, column: 10, scope: !783)
!866 = !DILocation(line: 407, column: 14, scope: !783)
!867 = !DILocation(line: 408, column: 9, scope: !868)
!868 = distinct !DILexicalBlock(scope: !783, file: !1, line: 408, column: 9)
!869 = !DILocation(line: 408, column: 14, scope: !868)
!870 = !DILocation(line: 408, column: 18, scope: !868)
!871 = !DILocation(line: 408, column: 9, scope: !783)
!872 = !DILocation(line: 409, column: 9, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !1, line: 408, column: 27)
!874 = !DILocation(line: 418, column: 5, scope: !783)
!875 = !DILocation(line: 418, column: 10, scope: !783)
!876 = !DILocation(line: 418, column: 20, scope: !783)
!877 = !DILocation(line: 421, column: 5, scope: !783)
!878 = !DILocation(line: 422, column: 1, scope: !783)
!879 = distinct !DISubprogram(name: "ngx_output_chain_get_buf", scope: !1, file: !1, line: 426, type: !784, isLocal: true, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !880)
!880 = !{!881, !882, !883, !884, !885, !886}
!881 = !DILocalVariable(name: "ctx", arg: 1, scope: !879, file: !1, line: 426, type: !165)
!882 = !DILocalVariable(name: "bsize", arg: 2, scope: !879, file: !1, line: 426, type: !5)
!883 = !DILocalVariable(name: "size", scope: !879, file: !1, line: 428, type: !46)
!884 = !DILocalVariable(name: "b", scope: !879, file: !1, line: 429, type: !15)
!885 = !DILocalVariable(name: "in", scope: !879, file: !1, line: 429, type: !15)
!886 = !DILocalVariable(name: "recycled", scope: !879, file: !1, line: 430, type: !103)
!887 = !DILocation(line: 426, column: 50, scope: !879)
!888 = !DILocation(line: 426, column: 61, scope: !879)
!889 = !DILocation(line: 428, column: 5, scope: !879)
!890 = !DILocation(line: 428, column: 18, scope: !879)
!891 = !DILocation(line: 429, column: 5, scope: !879)
!892 = !DILocation(line: 429, column: 18, scope: !879)
!893 = !DILocation(line: 429, column: 22, scope: !879)
!894 = !DILocation(line: 430, column: 5, scope: !879)
!895 = !DILocation(line: 430, column: 18, scope: !879)
!896 = !DILocation(line: 432, column: 10, scope: !879)
!897 = !DILocation(line: 432, column: 15, scope: !879)
!898 = !DILocation(line: 432, column: 19, scope: !879)
!899 = !DILocation(line: 432, column: 8, scope: !879)
!900 = !DILocation(line: 433, column: 12, scope: !879)
!901 = !DILocation(line: 433, column: 17, scope: !879)
!902 = !DILocation(line: 433, column: 22, scope: !879)
!903 = !DILocation(line: 433, column: 10, scope: !879)
!904 = !DILocation(line: 434, column: 14, scope: !879)
!905 = !DILocation(line: 436, column: 9, scope: !906)
!906 = distinct !DILexicalBlock(scope: !879, file: !1, line: 436, column: 9)
!907 = !DILocation(line: 436, column: 13, scope: !906)
!908 = !DILocation(line: 436, column: 9, scope: !879)
!909 = !DILocation(line: 438, column: 13, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !1, line: 438, column: 13)
!911 = distinct !DILexicalBlock(scope: !906, file: !1, line: 436, column: 28)
!912 = !DILocation(line: 438, column: 29, scope: !910)
!913 = !DILocation(line: 438, column: 19, scope: !910)
!914 = !DILocation(line: 438, column: 13, scope: !911)
!915 = !DILocation(line: 445, column: 29, scope: !916)
!916 = distinct !DILexicalBlock(scope: !910, file: !1, line: 438, column: 35)
!917 = !DILocation(line: 445, column: 18, scope: !916)
!918 = !DILocation(line: 446, column: 22, scope: !916)
!919 = !DILocation(line: 448, column: 9, scope: !916)
!920 = !DILocation(line: 448, column: 21, scope: !921)
!921 = distinct !DILexicalBlock(scope: !910, file: !1, line: 448, column: 20)
!922 = !DILocation(line: 448, column: 26, scope: !921)
!923 = !DILocation(line: 449, column: 20, scope: !921)
!924 = !DILocation(line: 449, column: 23, scope: !921)
!925 = !DILocation(line: 449, column: 28, scope: !921)
!926 = !DILocation(line: 449, column: 33, scope: !921)
!927 = !DILocation(line: 449, column: 37, scope: !921)
!928 = !DILocation(line: 450, column: 20, scope: !921)
!929 = !DILocation(line: 450, column: 24, scope: !921)
!930 = !DILocation(line: 450, column: 41, scope: !921)
!931 = !DILocation(line: 450, column: 48, scope: !921)
!932 = !DILocation(line: 450, column: 53, scope: !921)
!933 = !DILocation(line: 450, column: 46, scope: !921)
!934 = !DILocation(line: 450, column: 30, scope: !921)
!935 = !DILocation(line: 448, column: 20, scope: !910)
!936 = !DILocation(line: 458, column: 29, scope: !937)
!937 = distinct !DILexicalBlock(scope: !921, file: !1, line: 451, column: 9)
!938 = !DILocation(line: 458, column: 18, scope: !937)
!939 = !DILocation(line: 459, column: 22, scope: !937)
!940 = !DILocation(line: 460, column: 9, scope: !937)
!941 = !DILocation(line: 461, column: 5, scope: !911)
!942 = !DILocation(line: 463, column: 9, scope: !879)
!943 = !DILocation(line: 463, column: 7, scope: !879)
!944 = !DILocation(line: 464, column: 9, scope: !945)
!945 = distinct !DILexicalBlock(scope: !879, file: !1, line: 464, column: 9)
!946 = !DILocation(line: 464, column: 11, scope: !945)
!947 = !DILocation(line: 464, column: 9, scope: !879)
!948 = !DILocation(line: 465, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !1, line: 464, column: 20)
!950 = !DILocation(line: 468, column: 9, scope: !951)
!951 = distinct !DILexicalBlock(scope: !879, file: !1, line: 468, column: 9)
!952 = !DILocation(line: 468, column: 14, scope: !951)
!953 = !DILocation(line: 468, column: 9, scope: !879)
!954 = !DILocation(line: 475, column: 34, scope: !955)
!955 = distinct !DILexicalBlock(scope: !951, file: !1, line: 468, column: 24)
!956 = !DILocation(line: 475, column: 39, scope: !955)
!957 = !DILocation(line: 475, column: 45, scope: !955)
!958 = !DILocation(line: 475, column: 60, scope: !955)
!959 = !DILocation(line: 475, column: 65, scope: !955)
!960 = !DILocation(line: 475, column: 20, scope: !955)
!961 = !DILocation(line: 475, column: 9, scope: !955)
!962 = !DILocation(line: 475, column: 12, scope: !955)
!963 = !DILocation(line: 475, column: 18, scope: !955)
!964 = !DILocation(line: 476, column: 13, scope: !965)
!965 = distinct !DILexicalBlock(scope: !955, file: !1, line: 476, column: 13)
!966 = !DILocation(line: 476, column: 16, scope: !965)
!967 = !DILocation(line: 476, column: 22, scope: !965)
!968 = !DILocation(line: 476, column: 13, scope: !955)
!969 = !DILocation(line: 477, column: 13, scope: !970)
!970 = distinct !DILexicalBlock(scope: !965, file: !1, line: 476, column: 31)
!971 = !DILocation(line: 480, column: 5, scope: !955)
!972 = !DILocation(line: 481, column: 31, scope: !973)
!973 = distinct !DILexicalBlock(scope: !951, file: !1, line: 480, column: 12)
!974 = !DILocation(line: 481, column: 36, scope: !973)
!975 = !DILocation(line: 481, column: 42, scope: !973)
!976 = !DILocation(line: 481, column: 20, scope: !973)
!977 = !DILocation(line: 481, column: 9, scope: !973)
!978 = !DILocation(line: 481, column: 12, scope: !973)
!979 = !DILocation(line: 481, column: 18, scope: !973)
!980 = !DILocation(line: 482, column: 13, scope: !981)
!981 = distinct !DILexicalBlock(scope: !973, file: !1, line: 482, column: 13)
!982 = !DILocation(line: 482, column: 16, scope: !981)
!983 = !DILocation(line: 482, column: 22, scope: !981)
!984 = !DILocation(line: 482, column: 13, scope: !973)
!985 = !DILocation(line: 483, column: 13, scope: !986)
!986 = distinct !DILexicalBlock(scope: !981, file: !1, line: 482, column: 31)
!987 = !DILocation(line: 487, column: 14, scope: !879)
!988 = !DILocation(line: 487, column: 17, scope: !879)
!989 = !DILocation(line: 487, column: 5, scope: !879)
!990 = !DILocation(line: 487, column: 8, scope: !879)
!991 = !DILocation(line: 487, column: 12, scope: !879)
!992 = !DILocation(line: 488, column: 15, scope: !879)
!993 = !DILocation(line: 488, column: 18, scope: !879)
!994 = !DILocation(line: 488, column: 5, scope: !879)
!995 = !DILocation(line: 488, column: 8, scope: !879)
!996 = !DILocation(line: 488, column: 13, scope: !879)
!997 = !DILocation(line: 489, column: 14, scope: !879)
!998 = !DILocation(line: 489, column: 17, scope: !879)
!999 = !DILocation(line: 489, column: 24, scope: !879)
!1000 = !DILocation(line: 489, column: 22, scope: !879)
!1001 = !DILocation(line: 489, column: 5, scope: !879)
!1002 = !DILocation(line: 489, column: 8, scope: !879)
!1003 = !DILocation(line: 489, column: 12, scope: !879)
!1004 = !{!301, !242, i64 20}
!1005 = !DILocation(line: 490, column: 5, scope: !879)
!1006 = !DILocation(line: 490, column: 8, scope: !879)
!1007 = !DILocation(line: 490, column: 18, scope: !879)
!1008 = !DILocation(line: 491, column: 14, scope: !879)
!1009 = !DILocation(line: 491, column: 19, scope: !879)
!1010 = !DILocation(line: 491, column: 5, scope: !879)
!1011 = !DILocation(line: 491, column: 8, scope: !879)
!1012 = !DILocation(line: 491, column: 12, scope: !879)
!1013 = !{!301, !242, i64 24}
!1014 = !DILocation(line: 492, column: 19, scope: !879)
!1015 = !DILocation(line: 492, column: 5, scope: !879)
!1016 = !DILocation(line: 492, column: 8, scope: !879)
!1017 = !DILocation(line: 492, column: 17, scope: !879)
!1018 = !DILocation(line: 494, column: 16, scope: !879)
!1019 = !DILocation(line: 494, column: 5, scope: !879)
!1020 = !DILocation(line: 494, column: 10, scope: !879)
!1021 = !DILocation(line: 494, column: 14, scope: !879)
!1022 = !DILocation(line: 495, column: 5, scope: !879)
!1023 = !DILocation(line: 495, column: 10, scope: !879)
!1024 = !DILocation(line: 495, column: 19, scope: !879)
!1025 = !DILocation(line: 497, column: 5, scope: !879)
!1026 = !DILocation(line: 498, column: 1, scope: !879)
!1027 = distinct !DISubprogram(name: "ngx_output_chain_copy_buf", scope: !1, file: !1, line: 502, type: !1028, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!157, !165}
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1031 = !DILocalVariable(name: "ctx", arg: 1, scope: !1027, file: !1, line: 502, type: !165)
!1032 = !DILocalVariable(name: "size", scope: !1027, file: !1, line: 504, type: !5)
!1033 = !DILocalVariable(name: "n", scope: !1027, file: !1, line: 505, type: !156)
!1034 = !DILocalVariable(name: "src", scope: !1027, file: !1, line: 506, type: !15)
!1035 = !DILocalVariable(name: "dst", scope: !1027, file: !1, line: 506, type: !15)
!1036 = !DILocalVariable(name: "sendfile", scope: !1027, file: !1, line: 507, type: !103)
!1037 = !DILocalVariable(name: "err", scope: !1038, file: !1, line: 602, type: !1042)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 601, column: 29)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 601, column: 13)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 554, column: 12)
!1041 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 525, column: 9)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_err_t", file: !1043, line: 16, baseType: !7)
!1043 = !DIFile(filename: "src/os/unix/ngx_errno.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1044 = !DILocation(line: 502, column: 51, scope: !1027)
!1045 = !DILocation(line: 504, column: 5, scope: !1027)
!1046 = !DILocation(line: 504, column: 18, scope: !1027)
!1047 = !DILocation(line: 505, column: 5, scope: !1027)
!1048 = !DILocation(line: 505, column: 18, scope: !1027)
!1049 = !DILocation(line: 506, column: 5, scope: !1027)
!1050 = !DILocation(line: 506, column: 18, scope: !1027)
!1051 = !DILocation(line: 506, column: 24, scope: !1027)
!1052 = !DILocation(line: 507, column: 5, scope: !1027)
!1053 = !DILocation(line: 507, column: 18, scope: !1027)
!1054 = !DILocation(line: 509, column: 11, scope: !1027)
!1055 = !DILocation(line: 509, column: 16, scope: !1027)
!1056 = !DILocation(line: 509, column: 20, scope: !1027)
!1057 = !DILocation(line: 509, column: 9, scope: !1027)
!1058 = !DILocation(line: 510, column: 11, scope: !1027)
!1059 = !DILocation(line: 510, column: 16, scope: !1027)
!1060 = !DILocation(line: 510, column: 9, scope: !1027)
!1061 = !DILocation(line: 512, column: 12, scope: !1027)
!1062 = !DILocation(line: 512, column: 10, scope: !1027)
!1063 = !DILocation(line: 513, column: 12, scope: !1027)
!1064 = !DILocation(line: 513, column: 10, scope: !1027)
!1065 = !DILocation(line: 515, column: 16, scope: !1027)
!1066 = !DILocation(line: 515, column: 21, scope: !1027)
!1067 = !DILocation(line: 515, column: 30, scope: !1027)
!1068 = !DILocation(line: 515, column: 34, scope: !1027)
!1069 = !DILocation(line: 515, column: 39, scope: !1027)
!1070 = !DILocation(line: 515, column: 33, scope: !1027)
!1071 = !DILocation(line: 515, column: 14, scope: !1027)
!1072 = !DILocation(line: 519, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 519, column: 9)
!1074 = !DILocation(line: 519, column: 14, scope: !1073)
!1075 = !DILocation(line: 519, column: 22, scope: !1073)
!1076 = !DILocation(line: 519, column: 25, scope: !1073)
!1077 = !DILocation(line: 519, column: 30, scope: !1073)
!1078 = !DILocation(line: 519, column: 39, scope: !1073)
!1079 = !DILocation(line: 519, column: 9, scope: !1027)
!1080 = !DILocation(line: 520, column: 18, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 519, column: 62)
!1082 = !DILocation(line: 521, column: 5, scope: !1081)
!1083 = !DILocation(line: 525, column: 9, scope: !1041)
!1084 = !DILocation(line: 525, column: 9, scope: !1027)
!1085 = !DILocation(line: 526, column: 9, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 525, column: 33)
!1087 = !DILocation(line: 527, column: 30, scope: !1086)
!1088 = !DILocation(line: 527, column: 9, scope: !1086)
!1089 = !DILocation(line: 527, column: 14, scope: !1086)
!1090 = !DILocation(line: 527, column: 18, scope: !1086)
!1091 = !DILocation(line: 528, column: 31, scope: !1086)
!1092 = !DILocation(line: 528, column: 9, scope: !1086)
!1093 = !DILocation(line: 528, column: 14, scope: !1086)
!1094 = !DILocation(line: 528, column: 19, scope: !1086)
!1095 = !DILocation(line: 530, column: 13, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1086, file: !1, line: 530, column: 13)
!1097 = !DILocation(line: 530, column: 18, scope: !1096)
!1098 = !DILocation(line: 530, column: 13, scope: !1086)
!1099 = !DILocation(line: 532, column: 17, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 532, column: 17)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 530, column: 27)
!1102 = !DILocation(line: 532, column: 17, scope: !1101)
!1103 = !DILocation(line: 533, column: 17, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !1, line: 532, column: 27)
!1105 = !DILocation(line: 533, column: 22, scope: !1104)
!1106 = !DILocation(line: 533, column: 30, scope: !1104)
!1107 = !DILocation(line: 534, column: 29, scope: !1104)
!1108 = !DILocation(line: 534, column: 34, scope: !1104)
!1109 = !DILocation(line: 534, column: 17, scope: !1104)
!1110 = !DILocation(line: 534, column: 22, scope: !1104)
!1111 = !DILocation(line: 534, column: 27, scope: !1104)
!1112 = !DILocation(line: 535, column: 33, scope: !1104)
!1113 = !DILocation(line: 535, column: 38, scope: !1104)
!1114 = !DILocation(line: 535, column: 17, scope: !1104)
!1115 = !DILocation(line: 535, column: 22, scope: !1104)
!1116 = !DILocation(line: 535, column: 31, scope: !1104)
!1117 = !DILocation(line: 536, column: 34, scope: !1104)
!1118 = !DILocation(line: 536, column: 39, scope: !1104)
!1119 = !DILocation(line: 536, column: 50, scope: !1104)
!1120 = !DILocation(line: 536, column: 48, scope: !1104)
!1121 = !DILocation(line: 536, column: 17, scope: !1104)
!1122 = !DILocation(line: 536, column: 22, scope: !1104)
!1123 = !DILocation(line: 536, column: 32, scope: !1104)
!1124 = !DILocation(line: 538, column: 13, scope: !1104)
!1125 = !DILocation(line: 539, column: 17, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1100, file: !1, line: 538, column: 20)
!1127 = !DILocation(line: 539, column: 22, scope: !1126)
!1128 = !DILocation(line: 539, column: 30, scope: !1126)
!1129 = !DILocation(line: 542, column: 30, scope: !1101)
!1130 = !DILocation(line: 542, column: 13, scope: !1101)
!1131 = !DILocation(line: 542, column: 18, scope: !1101)
!1132 = !DILocation(line: 542, column: 27, scope: !1101)
!1133 = !DILocation(line: 544, column: 9, scope: !1101)
!1134 = !DILocation(line: 545, column: 13, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 544, column: 16)
!1136 = !DILocation(line: 545, column: 18, scope: !1135)
!1137 = !DILocation(line: 545, column: 26, scope: !1135)
!1138 = !DILocation(line: 548, column: 13, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1086, file: !1, line: 548, column: 13)
!1140 = !DILocation(line: 548, column: 18, scope: !1139)
!1141 = !DILocation(line: 548, column: 25, scope: !1139)
!1142 = !DILocation(line: 548, column: 30, scope: !1139)
!1143 = !DILocation(line: 548, column: 22, scope: !1139)
!1144 = !DILocation(line: 548, column: 13, scope: !1086)
!1145 = !DILocation(line: 549, column: 26, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1139, file: !1, line: 548, column: 36)
!1147 = !DILocation(line: 549, column: 31, scope: !1146)
!1148 = !DILocation(line: 549, column: 13, scope: !1146)
!1149 = !DILocation(line: 549, column: 18, scope: !1146)
!1150 = !DILocation(line: 549, column: 24, scope: !1146)
!1151 = !DILocation(line: 550, column: 29, scope: !1146)
!1152 = !DILocation(line: 550, column: 34, scope: !1146)
!1153 = !DILocation(line: 550, column: 13, scope: !1146)
!1154 = !DILocation(line: 550, column: 18, scope: !1146)
!1155 = !DILocation(line: 550, column: 27, scope: !1146)
!1156 = !DILocation(line: 551, column: 34, scope: !1146)
!1157 = !DILocation(line: 551, column: 39, scope: !1146)
!1158 = !DILocation(line: 551, column: 13, scope: !1146)
!1159 = !DILocation(line: 551, column: 18, scope: !1146)
!1160 = !DILocation(line: 551, column: 32, scope: !1146)
!1161 = !DILocation(line: 552, column: 9, scope: !1146)
!1162 = !DILocation(line: 554, column: 5, scope: !1086)
!1163 = !DILocation(line: 558, column: 13, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 558, column: 13)
!1165 = !DILocation(line: 558, column: 18, scope: !1164)
!1166 = !DILocation(line: 558, column: 13, scope: !1040)
!1167 = !DILocation(line: 559, column: 34, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !1, line: 559, column: 17)
!1169 = distinct !DILexicalBlock(scope: !1164, file: !1, line: 558, column: 29)
!1170 = !DILocation(line: 559, column: 39, scope: !1168)
!1171 = !DILocation(line: 559, column: 45, scope: !1168)
!1172 = !{!1173, !262, i64 0}
!1173 = !{!"ngx_file_s", !262, i64 0, !1174, i64 4, !1175, i64 16, !262, i64 136, !262, i64 140, !242, i64 144, !262, i64 148, !262, i64 148}
!1174 = !{!"", !262, i64 0, !242, i64 4}
!1175 = !{!"stat", !262, i64 0, !262, i64 4, !262, i64 8, !262, i64 12, !262, i64 16, !262, i64 20, !262, i64 24, !262, i64 28, !262, i64 32, !262, i64 36, !262, i64 40, !262, i64 44, !262, i64 48, !262, i64 52, !365, i64 56, !365, i64 60, !262, i64 64, !262, i64 68, !1176, i64 72, !1176, i64 80, !1176, i64 88, !243, i64 96}
!1176 = !{!"timespec", !365, i64 0, !365, i64 4}
!1177 = !DILocation(line: 559, column: 17, scope: !1168)
!1178 = !DILocation(line: 559, column: 49, scope: !1168)
!1179 = !DILocation(line: 559, column: 17, scope: !1169)
!1180 = !DILocation(line: 560, column: 17, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !1, line: 560, column: 17)
!1182 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 559, column: 68)
!1183 = !DILocation(line: 560, column: 17, scope: !1182)
!1184 = !{!1173, !242, i64 8}
!1185 = !DILocation(line: 563, column: 13, scope: !1182)
!1186 = !DILocation(line: 564, column: 9, scope: !1169)
!1187 = !DILocation(line: 595, column: 31, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 594, column: 9)
!1189 = !DILocation(line: 595, column: 36, scope: !1188)
!1190 = !DILocation(line: 595, column: 42, scope: !1188)
!1191 = !DILocation(line: 595, column: 47, scope: !1188)
!1192 = !DILocation(line: 595, column: 61, scope: !1188)
!1193 = !DILocation(line: 596, column: 31, scope: !1188)
!1194 = !DILocation(line: 596, column: 36, scope: !1188)
!1195 = !DILocation(line: 595, column: 17, scope: !1188)
!1196 = !DILocation(line: 595, column: 15, scope: !1188)
!1197 = !DILocation(line: 601, column: 13, scope: !1039)
!1198 = !DILocation(line: 601, column: 18, scope: !1039)
!1199 = !DILocation(line: 601, column: 13, scope: !1040)
!1200 = !DILocation(line: 602, column: 13, scope: !1038)
!1201 = !DILocation(line: 602, column: 24, scope: !1038)
!1202 = !DILocation(line: 604, column: 19, scope: !1038)
!1203 = !DILocation(line: 604, column: 17, scope: !1038)
!1204 = !DILocation(line: 606, column: 33, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 606, column: 17)
!1206 = !DILocation(line: 606, column: 38, scope: !1205)
!1207 = !DILocation(line: 606, column: 44, scope: !1205)
!1208 = !DILocation(line: 606, column: 17, scope: !1205)
!1209 = !DILocation(line: 606, column: 48, scope: !1205)
!1210 = !DILocation(line: 606, column: 17, scope: !1038)
!1211 = !DILocation(line: 607, column: 17, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1213, file: !1, line: 607, column: 17)
!1213 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 606, column: 67)
!1214 = !DILocation(line: 607, column: 17, scope: !1213)
!1215 = !DILocation(line: 610, column: 13, scope: !1213)
!1216 = !DILocation(line: 612, column: 13, scope: !1038)
!1217 = !DILocation(line: 614, column: 13, scope: !1038)
!1218 = !DILocation(line: 614, column: 18, scope: !1038)
!1219 = !DILocation(line: 614, column: 28, scope: !1038)
!1220 = !DILocation(line: 615, column: 9, scope: !1039)
!1221 = !DILocation(line: 615, column: 9, scope: !1038)
!1222 = !DILocation(line: 619, column: 13, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 619, column: 13)
!1224 = !DILocation(line: 619, column: 15, scope: !1223)
!1225 = !DILocation(line: 619, column: 13, scope: !1040)
!1226 = !DILocation(line: 620, column: 32, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !1, line: 619, column: 29)
!1228 = !DILocation(line: 620, column: 13, scope: !1227)
!1229 = !DILocation(line: 623, column: 13, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 623, column: 13)
!1231 = !DILocation(line: 623, column: 18, scope: !1230)
!1232 = !DILocation(line: 623, column: 15, scope: !1230)
!1233 = !DILocation(line: 623, column: 13, scope: !1040)
!1234 = !DILocation(line: 624, column: 13, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !1, line: 624, column: 13)
!1236 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 623, column: 24)
!1237 = !DILocation(line: 624, column: 13, scope: !1236)
!1238 = !DILocation(line: 627, column: 13, scope: !1236)
!1239 = !DILocation(line: 630, column: 22, scope: !1040)
!1240 = !DILocation(line: 630, column: 9, scope: !1040)
!1241 = !DILocation(line: 630, column: 14, scope: !1040)
!1242 = !DILocation(line: 630, column: 19, scope: !1040)
!1243 = !DILocation(line: 632, column: 13, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 632, column: 13)
!1245 = !DILocation(line: 632, column: 13, scope: !1040)
!1246 = !DILocation(line: 633, column: 13, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1244, file: !1, line: 632, column: 23)
!1248 = !DILocation(line: 633, column: 18, scope: !1247)
!1249 = !DILocation(line: 633, column: 26, scope: !1247)
!1250 = !DILocation(line: 634, column: 25, scope: !1247)
!1251 = !DILocation(line: 634, column: 30, scope: !1247)
!1252 = !DILocation(line: 634, column: 13, scope: !1247)
!1253 = !DILocation(line: 634, column: 18, scope: !1247)
!1254 = !DILocation(line: 634, column: 23, scope: !1247)
!1255 = !DILocation(line: 635, column: 29, scope: !1247)
!1256 = !DILocation(line: 635, column: 34, scope: !1247)
!1257 = !DILocation(line: 635, column: 13, scope: !1247)
!1258 = !DILocation(line: 635, column: 18, scope: !1247)
!1259 = !DILocation(line: 635, column: 27, scope: !1247)
!1260 = !DILocation(line: 636, column: 30, scope: !1247)
!1261 = !DILocation(line: 636, column: 35, scope: !1247)
!1262 = !DILocation(line: 636, column: 46, scope: !1247)
!1263 = !DILocation(line: 636, column: 44, scope: !1247)
!1264 = !DILocation(line: 636, column: 13, scope: !1247)
!1265 = !DILocation(line: 636, column: 18, scope: !1247)
!1266 = !DILocation(line: 636, column: 28, scope: !1247)
!1267 = !DILocation(line: 638, column: 9, scope: !1247)
!1268 = !DILocation(line: 639, column: 13, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1244, file: !1, line: 638, column: 16)
!1270 = !DILocation(line: 639, column: 18, scope: !1269)
!1271 = !DILocation(line: 639, column: 26, scope: !1269)
!1272 = !DILocation(line: 642, column: 26, scope: !1040)
!1273 = !DILocation(line: 642, column: 9, scope: !1040)
!1274 = !DILocation(line: 642, column: 14, scope: !1040)
!1275 = !DILocation(line: 642, column: 23, scope: !1040)
!1276 = !DILocation(line: 644, column: 13, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 644, column: 13)
!1278 = !DILocation(line: 644, column: 18, scope: !1277)
!1279 = !DILocation(line: 644, column: 30, scope: !1277)
!1280 = !DILocation(line: 644, column: 35, scope: !1277)
!1281 = !DILocation(line: 644, column: 27, scope: !1277)
!1282 = !DILocation(line: 644, column: 13, scope: !1040)
!1283 = !DILocation(line: 645, column: 26, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1277, file: !1, line: 644, column: 46)
!1285 = !DILocation(line: 645, column: 31, scope: !1284)
!1286 = !DILocation(line: 645, column: 13, scope: !1284)
!1287 = !DILocation(line: 645, column: 18, scope: !1284)
!1288 = !DILocation(line: 645, column: 24, scope: !1284)
!1289 = !DILocation(line: 646, column: 29, scope: !1284)
!1290 = !DILocation(line: 646, column: 34, scope: !1284)
!1291 = !DILocation(line: 646, column: 13, scope: !1284)
!1292 = !DILocation(line: 646, column: 18, scope: !1284)
!1293 = !DILocation(line: 646, column: 27, scope: !1284)
!1294 = !DILocation(line: 647, column: 34, scope: !1284)
!1295 = !DILocation(line: 647, column: 39, scope: !1284)
!1296 = !DILocation(line: 647, column: 13, scope: !1284)
!1297 = !DILocation(line: 647, column: 18, scope: !1284)
!1298 = !DILocation(line: 647, column: 32, scope: !1284)
!1299 = !DILocation(line: 648, column: 9, scope: !1284)
!1300 = !DILocation(line: 651, column: 5, scope: !1027)
!1301 = !DILocation(line: 652, column: 1, scope: !1027)
!1302 = distinct !DISubprogram(name: "ngx_chain_writer", scope: !1, file: !1, line: 656, type: !228, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1303)
!1303 = !{!1304, !1305, !1306, !1492, !1493, !1494, !1495, !1496}
!1304 = !DILocalVariable(name: "data", arg: 1, scope: !1302, file: !1, line: 656, type: !4)
!1305 = !DILocalVariable(name: "in", arg: 2, scope: !1302, file: !1, line: 656, type: !8)
!1306 = !DILocalVariable(name: "ctx", scope: !1302, file: !1, line: 658, type: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 32)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_writer_ctx_t", file: !12, line: 122, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 116, size: 160, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1490, !1491}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1309, file: !12, line: 117, baseType: !8, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1309, file: !12, line: 118, baseType: !240, size: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !1309, file: !12, line: 119, baseType: !1314, size: 32, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 32)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !10, line: 26, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !1317, line: 121, size: 896, elements: !1318)
!1317 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1318 = !{!1319, !1320, !1376, !1377, !1380, !1386, !1388, !1393, !1398, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1316, file: !1317, line: 122, baseType: !4, size: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1316, file: !1317, line: 123, baseType: !1321, size: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 32)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !10, line: 24, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !1324, line: 30, size: 384, elements: !1325)
!1324 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1325 = !{!1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1353, !1354, !1355, !1368}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1323, file: !1324, line: 31, baseType: !4, size: 32)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !1323, file: !1324, line: 33, baseType: !47, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1323, file: !1324, line: 35, baseType: !47, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !1323, file: !1324, line: 38, baseType: !47, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1323, file: !1324, line: 44, baseType: !47, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !1323, file: !1324, line: 46, baseType: !47, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !1323, file: !1324, line: 49, baseType: !47, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !1323, file: !1324, line: 51, baseType: !47, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !1323, file: !1324, line: 54, baseType: !47, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !1323, file: !1324, line: 56, baseType: !47, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1323, file: !1324, line: 57, baseType: !47, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !1323, file: !1324, line: 59, baseType: !47, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !1323, file: !1324, line: 60, baseType: !47, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !1323, file: !1324, line: 62, baseType: !47, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !1323, file: !1324, line: 64, baseType: !47, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !1323, file: !1324, line: 67, baseType: !47, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !1323, file: !1324, line: 69, baseType: !47, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !1323, file: !1324, line: 71, baseType: !47, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1323, file: !1324, line: 74, baseType: !47, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !1323, file: !1324, line: 75, baseType: !47, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !1323, file: !1324, line: 77, baseType: !47, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !1323, file: !1324, line: 107, baseType: !47, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1323, file: !1324, line: 110, baseType: !1349, size: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !10, line: 31, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 32)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{null, !1321}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1323, file: !1324, line: 117, baseType: !103, size: 32, offset: 96)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1323, file: !1324, line: 119, baseType: !97, size: 32, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !1323, file: !1324, line: 121, baseType: !1356, size: 160, offset: 160)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !1357, line: 20, baseType: !1358)
!1357 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !1357, line: 22, size: 160, elements: !1359)
!1359 = !{!1360, !1362, !1364, !1365, !1366, !1367}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1358, file: !1357, line: 23, baseType: !1361, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !1357, line: 16, baseType: !103)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1358, file: !1357, line: 24, baseType: !1363, size: 32, offset: 32)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1358, file: !1357, line: 25, baseType: !1363, size: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1358, file: !1357, line: 26, baseType: !1363, size: 32, offset: 96)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1358, file: !1357, line: 27, baseType: !21, size: 8, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1358, file: !1357, line: 28, baseType: !21, size: 8, offset: 136)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !1323, file: !1324, line: 124, baseType: !1369, size: 64, offset: 320)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !1370, line: 16, baseType: !1371)
!1370 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !1370, line: 18, size: 64, elements: !1372)
!1372 = !{!1373, !1375}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1371, file: !1370, line: 19, baseType: !1374, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 32)
