; ModuleID = 'src/core/ngx_buf.c'
source_filename = "src/core/ngx_buf.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.ngx_str_t = type { i32, i8* }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i32, i32 }
%struct.ngx_log_s = type { i32, %struct.ngx_open_file_s*, i32, i32, i8* (%struct.ngx_log_s*, i8*, i32)*, i8*, void (%struct.ngx_log_s*, i32, i8*, i32)*, i8*, i8*, %struct.ngx_log_s* }
%struct.ngx_open_file_s = type { i32, %struct.ngx_str_t, void (%struct.ngx_open_file_s*, %struct.ngx_log_s*)*, i8* }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_pool_large_s = type { %struct.ngx_pool_large_s*, i8* }
%struct.ngx_pool_cleanup_s = type { void (i8*)*, i8*, %struct.ngx_pool_cleanup_s* }
%struct.ngx_bufs_t = type { i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_buf.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !5, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !6, line: 222, baseType: !7)
!6 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 120, baseType: !9)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{i32 2, !"Dwarf Version", i32 4}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!13 = distinct !DISubprogram(name: "ngx_create_temp_buf", scope: !1, file: !1, line: 13, type: !14, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !198)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !156, !8}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !18, line: 18, baseType: !19)
!18 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !18, line: 20, size: 352, elements: !20)
!20 = !{!21, !26, !27, !28, !29, !30, !31, !33, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !18, line: 21, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !24, line: 64, baseType: !25)
!24 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !19, file: !18, line: 22, baseType: !22, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !19, file: !18, line: 23, baseType: !5, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !19, file: !18, line: 24, baseType: !5, size: 32, offset: 96)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !19, file: !18, line: 26, baseType: !22, size: 32, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !19, file: !18, line: 27, baseType: !22, size: 32, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !19, file: !18, line: 28, baseType: !32, size: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !18, line: 16, baseType: !4)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !19, file: !18, line: 29, baseType: !34, size: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !36, line: 23, baseType: !37)
!36 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !38, line: 16, size: 1216, elements: !39)
!38 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!39 = !{!40, !43, !50, !95, !96, !97, !141, !142}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !37, file: !38, line: 17, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !42, line: 16, baseType: !7)
!42 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !38, line: 18, baseType: !44, size: 64, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !45, line: 19, baseType: !46)
!45 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 16, size: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, file: !45, line: 17, baseType: !8, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !45, line: 18, baseType: !22, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !37, file: !38, line: 19, baseType: !51, size: 960, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !42, line: 17, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !53, line: 4, size: 960, elements: !54)
!53 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!54 = !{!55, !57, !58, !60, !61, !63, !64, !66, !68, !70, !71, !72, !73, !74, !75, !78, !79, !81, !82, !88, !89, !90}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !52, file: !53, line: 6, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !6, line: 232, baseType: !9)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !52, file: !53, line: 7, baseType: !56, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !52, file: !53, line: 8, baseType: !59, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !6, line: 227, baseType: !9)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !52, file: !53, line: 9, baseType: !59, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !52, file: !53, line: 10, baseType: !62, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !6, line: 217, baseType: !9)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !52, file: !53, line: 11, baseType: !62, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !52, file: !53, line: 13, baseType: !65, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 212, baseType: !9)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !52, file: !53, line: 14, baseType: !67, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !6, line: 304, baseType: !9)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !52, file: !53, line: 15, baseType: !69, size: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !6, line: 309, baseType: !9)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !52, file: !53, line: 16, baseType: !9, size: 32, offset: 288)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !52, file: !53, line: 17, baseType: !56, size: 32, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !52, file: !53, line: 18, baseType: !56, size: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !52, file: !53, line: 19, baseType: !5, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !52, file: !53, line: 20, baseType: !5, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !52, file: !53, line: 21, baseType: !76, size: 32, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !6, line: 237, baseType: !77)
!77 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !52, file: !53, line: 22, baseType: !76, size: 32, offset: 480)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !52, file: !53, line: 23, baseType: !80, size: 32, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !6, line: 242, baseType: !7)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !52, file: !53, line: 24, baseType: !80, size: 32, offset: 544)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !52, file: !53, line: 26, baseType: !83, size: 64, offset: 576)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !6, line: 288, size: 64, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !83, file: !6, line: 288, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !6, line: 75, baseType: !77)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !83, file: !6, line: 288, baseType: !77, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !52, file: !53, line: 27, baseType: !83, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !52, file: !53, line: 28, baseType: !83, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !52, file: !53, line: 29, baseType: !91, size: 192, offset: 768)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 192, elements: !93)
!92 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!93 = !{!94}
!94 = !DISubrange(count: 3)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !37, file: !38, line: 21, baseType: !5, size: 32, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !37, file: !38, line: 22, baseType: !5, size: 32, offset: 1120)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !37, file: !38, line: 24, baseType: !98, size: 32, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !36, line: 20, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !101, line: 50, size: 320, elements: !102)
!101 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!102 = !{!103, !107, !120, !124, !125, !130, !131, !136, !137, !140}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !100, file: !101, line: 51, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !105, line: 79, baseType: !106)
!105 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !6, line: 125, baseType: !9)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !100, file: !101, line: 52, baseType: !108, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !36, line: 21, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !111, line: 89, size: 160, elements: !112)
!111 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!112 = !{!113, !114, !115, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !110, file: !111, line: 90, baseType: !41, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 91, baseType: !44, size: 64, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !110, file: !111, line: 93, baseType: !116, size: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !108, !98}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !111, line: 94, baseType: !4, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !100, file: !101, line: 54, baseType: !121, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !122, line: 98, baseType: !123)
!122 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!123 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !100, file: !101, line: 56, baseType: !86, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !100, file: !101, line: 58, baseType: !126, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !101, line: 45, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{!22, !98, !22, !8}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !101, line: 59, baseType: !4, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !100, file: !101, line: 61, baseType: !132, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !101, line: 46, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !98, !104, !22, !8}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !100, file: !101, line: 62, baseType: !4, size: 32, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !100, file: !101, line: 70, baseType: !138, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !101, line: 72, baseType: !98, size: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !37, file: !38, line: 37, baseType: !9, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !37, file: !38, line: 38, baseType: !9, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !19, file: !18, line: 30, baseType: !16, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !19, file: !18, line: 34, baseType: !9, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !19, file: !18, line: 40, baseType: !9, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !19, file: !18, line: 43, baseType: !9, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !19, file: !18, line: 45, baseType: !9, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !19, file: !18, line: 46, baseType: !9, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !19, file: !18, line: 47, baseType: !9, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !19, file: !18, line: 48, baseType: !9, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !19, file: !18, line: 49, baseType: !9, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !19, file: !18, line: 50, baseType: !9, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !19, file: !18, line: 52, baseType: !9, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !19, file: !18, line: 53, baseType: !9, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !19, file: !18, line: 55, baseType: !7, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !36, line: 18, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !159, line: 57, size: 320, elements: !160)
!159 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!160 = !{!161, !169, !170, !171, !178, !185, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !158, file: !159, line: 58, baseType: !162, size: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !159, line: 54, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 49, size: 128, elements: !164)
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !163, file: !159, line: 50, baseType: !22, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !163, file: !159, line: 51, baseType: !22, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !159, line: 52, baseType: !156, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !163, file: !159, line: 53, baseType: !104, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !158, file: !159, line: 59, baseType: !8, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !158, file: !159, line: 60, baseType: !156, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !158, file: !159, line: 61, baseType: !172, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !36, line: 19, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !18, line: 59, size: 64, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !174, file: !18, line: 60, baseType: !16, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !18, line: 61, baseType: !172, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !158, file: !159, line: 62, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !159, line: 41, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !159, line: 43, size: 64, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !159, line: 44, baseType: !179, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !181, file: !159, line: 45, baseType: !4, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !158, file: !159, line: 63, baseType: !186, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !159, line: 32, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !159, line: 34, size: 96, elements: !189)
!189 = !{!190, !195, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !188, file: !159, line: 35, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !159, line: 30, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !4}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !159, line: 36, baseType: !4, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !159, line: 37, baseType: !186, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !158, file: !159, line: 64, baseType: !98, size: 32, offset: 288)
!198 = !{!199, !200, !201}
!199 = !DILocalVariable(name: "pool", arg: 1, scope: !13, file: !1, line: 13, type: !156)
!200 = !DILocalVariable(name: "size", arg: 2, scope: !13, file: !1, line: 13, type: !8)
!201 = !DILocalVariable(name: "b", scope: !13, file: !1, line: 15, type: !16)
!202 = !{!203, !203, i64 0}
!203 = !{!"any pointer", !204, i64 0}
!204 = !{!"omnipotent char", !205, i64 0}
!205 = !{!"Simple C/C++ TBAA"}
!206 = !DIExpression()
!207 = !DILocation(line: 13, column: 33, scope: !13)
!208 = !{!209, !209, i64 0}
!209 = !{!"int", !204, i64 0}
!210 = !DILocation(line: 13, column: 46, scope: !13)
!211 = !DILocation(line: 15, column: 5, scope: !13)
!212 = !DILocation(line: 15, column: 16, scope: !13)
!213 = !DILocation(line: 17, column: 9, scope: !13)
!214 = !DILocation(line: 17, column: 7, scope: !13)
!215 = !DILocation(line: 18, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !13, file: !1, line: 18, column: 9)
!217 = !DILocation(line: 18, column: 11, scope: !216)
!218 = !DILocation(line: 18, column: 9, scope: !13)
!219 = !DILocation(line: 19, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !216, file: !1, line: 18, column: 20)
!221 = !DILocation(line: 22, column: 27, scope: !13)
!222 = !DILocation(line: 22, column: 33, scope: !13)
!223 = !DILocation(line: 22, column: 16, scope: !13)
!224 = !DILocation(line: 22, column: 5, scope: !13)
!225 = !DILocation(line: 22, column: 8, scope: !13)
!226 = !DILocation(line: 22, column: 14, scope: !13)
!227 = !{!228, !203, i64 16}
!228 = !{!"ngx_buf_s", !203, i64 0, !203, i64 4, !209, i64 8, !209, i64 12, !203, i64 16, !203, i64 20, !203, i64 24, !203, i64 28, !203, i64 32, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 36, !209, i64 37, !209, i64 37, !209, i64 37, !209, i64 40}
!229 = !DILocation(line: 23, column: 9, scope: !230)
!230 = distinct !DILexicalBlock(scope: !13, file: !1, line: 23, column: 9)
!231 = !DILocation(line: 23, column: 12, scope: !230)
!232 = !DILocation(line: 23, column: 18, scope: !230)
!233 = !DILocation(line: 23, column: 9, scope: !13)
!234 = !DILocation(line: 24, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !230, file: !1, line: 23, column: 27)
!236 = !DILocation(line: 38, column: 14, scope: !13)
!237 = !DILocation(line: 38, column: 17, scope: !13)
!238 = !DILocation(line: 38, column: 5, scope: !13)
!239 = !DILocation(line: 38, column: 8, scope: !13)
!240 = !DILocation(line: 38, column: 12, scope: !13)
!241 = !{!228, !203, i64 0}
!242 = !DILocation(line: 39, column: 15, scope: !13)
!243 = !DILocation(line: 39, column: 18, scope: !13)
!244 = !DILocation(line: 39, column: 5, scope: !13)
!245 = !DILocation(line: 39, column: 8, scope: !13)
!246 = !DILocation(line: 39, column: 13, scope: !13)
!247 = !{!228, !203, i64 4}
!248 = !DILocation(line: 40, column: 14, scope: !13)
!249 = !DILocation(line: 40, column: 17, scope: !13)
!250 = !DILocation(line: 40, column: 24, scope: !13)
!251 = !DILocation(line: 40, column: 22, scope: !13)
!252 = !DILocation(line: 40, column: 5, scope: !13)
!253 = !DILocation(line: 40, column: 8, scope: !13)
!254 = !DILocation(line: 40, column: 12, scope: !13)
!255 = !{!228, !203, i64 20}
!256 = !DILocation(line: 41, column: 5, scope: !13)
!257 = !DILocation(line: 41, column: 8, scope: !13)
!258 = !DILocation(line: 41, column: 18, scope: !13)
!259 = !DILocation(line: 43, column: 12, scope: !13)
!260 = !DILocation(line: 43, column: 5, scope: !13)
!261 = !DILocation(line: 44, column: 1, scope: !13)
!262 = distinct !DISubprogram(name: "ngx_alloc_chain_link", scope: !1, file: !1, line: 48, type: !263, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{!172, !156}
!265 = !{!266, !267}
!266 = !DILocalVariable(name: "pool", arg: 1, scope: !262, file: !1, line: 48, type: !156)
!267 = !DILocalVariable(name: "cl", scope: !262, file: !1, line: 50, type: !172)
!268 = !DILocation(line: 48, column: 34, scope: !262)
!269 = !DILocation(line: 50, column: 5, scope: !262)
!270 = !DILocation(line: 50, column: 19, scope: !262)
!271 = !DILocation(line: 52, column: 10, scope: !262)
!272 = !DILocation(line: 52, column: 16, scope: !262)
!273 = !{!274, !203, i64 24}
!274 = !{!"ngx_pool_s", !275, i64 0, !209, i64 16, !203, i64 20, !203, i64 24, !203, i64 28, !203, i64 32, !203, i64 36}
!275 = !{!"", !203, i64 0, !203, i64 4, !203, i64 8, !209, i64 12}
!276 = !DILocation(line: 52, column: 8, scope: !262)
!277 = !DILocation(line: 54, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !262, file: !1, line: 54, column: 9)
!279 = !DILocation(line: 54, column: 9, scope: !262)
!280 = !DILocation(line: 55, column: 23, scope: !281)
!281 = distinct !DILexicalBlock(scope: !278, file: !1, line: 54, column: 13)
!282 = !DILocation(line: 55, column: 27, scope: !281)
!283 = !{!284, !203, i64 4}
!284 = !{!"ngx_chain_s", !203, i64 0, !203, i64 4}
!285 = !DILocation(line: 55, column: 9, scope: !281)
!286 = !DILocation(line: 55, column: 15, scope: !281)
!287 = !DILocation(line: 55, column: 21, scope: !281)
!288 = !DILocation(line: 56, column: 16, scope: !281)
!289 = !DILocation(line: 56, column: 9, scope: !281)
!290 = !DILocation(line: 59, column: 21, scope: !262)
!291 = !DILocation(line: 59, column: 10, scope: !262)
!292 = !DILocation(line: 59, column: 8, scope: !262)
!293 = !DILocation(line: 60, column: 9, scope: !294)
!294 = distinct !DILexicalBlock(scope: !262, file: !1, line: 60, column: 9)
!295 = !DILocation(line: 60, column: 12, scope: !294)
!296 = !DILocation(line: 60, column: 9, scope: !262)
!297 = !DILocation(line: 61, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !1, line: 60, column: 21)
!299 = !DILocation(line: 64, column: 12, scope: !262)
!300 = !DILocation(line: 64, column: 5, scope: !262)
!301 = !DILocation(line: 65, column: 1, scope: !262)
!302 = distinct !DISubprogram(name: "ngx_create_chain_of_bufs", scope: !1, file: !1, line: 69, type: !303, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !313)
!303 = !DISubroutineType(types: !304)
!304 = !{!172, !156, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_bufs_t", file: !18, line: 68, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 65, size: 64, elements: !308)
!308 = !{!309, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !307, file: !18, line: 66, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !105, line: 78, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !6, line: 140, baseType: !7)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !307, file: !18, line: 67, baseType: !8, size: 32, offset: 32)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321}
!314 = !DILocalVariable(name: "pool", arg: 1, scope: !302, file: !1, line: 69, type: !156)
!315 = !DILocalVariable(name: "bufs", arg: 2, scope: !302, file: !1, line: 69, type: !305)
!316 = !DILocalVariable(name: "p", scope: !302, file: !1, line: 71, type: !22)
!317 = !DILocalVariable(name: "i", scope: !302, file: !1, line: 72, type: !310)
!318 = !DILocalVariable(name: "b", scope: !302, file: !1, line: 73, type: !16)
!319 = !DILocalVariable(name: "chain", scope: !302, file: !1, line: 74, type: !172)
!320 = !DILocalVariable(name: "cl", scope: !302, file: !1, line: 74, type: !172)
!321 = !DILocalVariable(name: "ll", scope: !302, file: !1, line: 74, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!323 = !DILocation(line: 69, column: 38, scope: !302)
!324 = !DILocation(line: 69, column: 56, scope: !302)
!325 = !DILocation(line: 71, column: 5, scope: !302)
!326 = !DILocation(line: 71, column: 19, scope: !302)
!327 = !DILocation(line: 72, column: 5, scope: !302)
!328 = !DILocation(line: 72, column: 19, scope: !302)
!329 = !DILocation(line: 73, column: 5, scope: !302)
!330 = !DILocation(line: 73, column: 19, scope: !302)
!331 = !DILocation(line: 74, column: 5, scope: !302)
!332 = !DILocation(line: 74, column: 19, scope: !302)
!333 = !DILocation(line: 74, column: 27, scope: !302)
!334 = !DILocation(line: 74, column: 33, scope: !302)
!335 = !DILocation(line: 76, column: 20, scope: !302)
!336 = !DILocation(line: 76, column: 26, scope: !302)
!337 = !DILocation(line: 76, column: 32, scope: !302)
!338 = !{!339, !209, i64 0}
!339 = !{!"", !209, i64 0, !209, i64 4}
!340 = !DILocation(line: 76, column: 38, scope: !302)
!341 = !DILocation(line: 76, column: 44, scope: !302)
!342 = !{!339, !209, i64 4}
!343 = !DILocation(line: 76, column: 36, scope: !302)
!344 = !DILocation(line: 76, column: 9, scope: !302)
!345 = !DILocation(line: 76, column: 7, scope: !302)
!346 = !DILocation(line: 77, column: 9, scope: !347)
!347 = distinct !DILexicalBlock(scope: !302, file: !1, line: 77, column: 9)
!348 = !DILocation(line: 77, column: 11, scope: !347)
!349 = !DILocation(line: 77, column: 9, scope: !302)
!350 = !DILocation(line: 78, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !1, line: 77, column: 20)
!352 = !DILocation(line: 81, column: 8, scope: !302)
!353 = !DILocation(line: 83, column: 12, scope: !354)
!354 = distinct !DILexicalBlock(scope: !302, file: !1, line: 83, column: 5)
!355 = !DILocation(line: 83, column: 10, scope: !354)
!356 = !DILocation(line: 83, column: 17, scope: !357)
!357 = distinct !DILexicalBlock(scope: !354, file: !1, line: 83, column: 5)
!358 = !DILocation(line: 83, column: 21, scope: !357)
!359 = !DILocation(line: 83, column: 27, scope: !357)
!360 = !DILocation(line: 83, column: 19, scope: !357)
!361 = !DILocation(line: 83, column: 5, scope: !354)
!362 = !DILocation(line: 85, column: 13, scope: !363)
!363 = distinct !DILexicalBlock(scope: !357, file: !1, line: 83, column: 37)
!364 = !DILocation(line: 85, column: 11, scope: !363)
!365 = !DILocation(line: 86, column: 13, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !1, line: 86, column: 13)
!367 = !DILocation(line: 86, column: 15, scope: !366)
!368 = !DILocation(line: 86, column: 13, scope: !363)
!369 = !DILocation(line: 87, column: 13, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !1, line: 86, column: 24)
!371 = !DILocation(line: 102, column: 18, scope: !363)
!372 = !DILocation(line: 102, column: 9, scope: !363)
!373 = !DILocation(line: 102, column: 12, scope: !363)
!374 = !DILocation(line: 102, column: 16, scope: !363)
!375 = !DILocation(line: 103, column: 19, scope: !363)
!376 = !DILocation(line: 103, column: 9, scope: !363)
!377 = !DILocation(line: 103, column: 12, scope: !363)
