; ModuleID = 'src/core/ngx_cycle.c'
source_filename = "src/core/ngx_cycle.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_time_t = type { i32, i32, i32 }
%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, {}*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_test_config", scope: !2, file: !3, line: 28, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !324)
!3 = !DIFile(filename: "src/core/ngx_cycle.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !24, !25, !28, !32, !255, !29, !257, !63, !16, !260, !262}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !8, line: 20, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 16, size: 96, elements: !10)
!10 = !{!11, !15, !20}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 17, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !13, line: 75, baseType: !14)
!13 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!14 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !9, file: !8, line: 18, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !17, line: 79, baseType: !18)
!17 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !13, line: 125, baseType: !19)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !9, file: !8, line: 19, baseType: !21, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !17, line: 78, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !13, line: 140, baseType: !23)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !30, line: 64, baseType: !31)
!30 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_conf_t", file: !34, line: 117, baseType: !35)
!34 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 86, size: 928, elements: !36)
!36 = !{!37, !39, !40, !45, !46, !47, !48, !49, !51, !52, !53, !54, !60, !62, !66, !69, !77, !78, !79, !80, !253}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !35, file: !34, line: 87, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_flag_t", file: !17, line: 80, baseType: !22)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !35, file: !34, line: 88, baseType: !38, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "timer_resolution", scope: !35, file: !34, line: 90, baseType: !41, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !42, line: 16, baseType: !43)
!42 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !44, line: 16, baseType: !16)
!44 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timeout", scope: !35, file: !34, line: 91, baseType: !41, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "worker_processes", scope: !35, file: !34, line: 93, baseType: !21, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "debug_points", scope: !35, file: !34, line: 94, baseType: !21, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_nofile", scope: !35, file: !34, line: 96, baseType: !21, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rlimit_core", scope: !35, file: !34, line: 97, baseType: !50, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !13, line: 222, baseType: !23)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !35, file: !34, line: 99, baseType: !23, size: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_auto", scope: !35, file: !34, line: 101, baseType: !16, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity_n", scope: !35, file: !34, line: 102, baseType: !16, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_affinity", scope: !35, file: !34, line: 103, baseType: !55, size: 32, offset: 352)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cpuset_t", file: !57, line: 32, baseType: !58)
!57 = !DIFile(filename: "src/os/unix/ngx_setaffinity.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 196, baseType: !59)
!59 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !35, file: !34, line: 105, baseType: !61, size: 32, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !35, file: !34, line: 106, baseType: !63, size: 32, offset: 416)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uid_t", file: !64, line: 16, baseType: !65)
!64 = !DIFile(filename: "src/os/unix/ngx_user.h", directory: "/home/sam/Projects/nginx-1.12.2")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !13, line: 304, baseType: !19)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !35, file: !34, line: 107, baseType: !67, size: 32, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_gid_t", file: !64, line: 17, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !13, line: 309, baseType: !19)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "working_directory", scope: !35, file: !34, line: 109, baseType: !70, size: 64, offset: 480)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !71, line: 19, baseType: !72)
!71 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 16, size: 64, elements: !73)
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !72, file: !71, line: 17, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 120, baseType: !19)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !71, line: 18, baseType: !28, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !35, file: !34, line: 110, baseType: !70, size: 64, offset: 544)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !35, file: !34, line: 112, baseType: !70, size: 64, offset: 608)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "oldpid", scope: !35, file: !34, line: 113, baseType: !70, size: 64, offset: 672)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !35, file: !34, line: 115, baseType: !81, size: 160, offset: 736)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !82, line: 22, baseType: !83)
!82 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 16, size: 160, elements: !84)
!84 = !{!85, !86, !87, !88, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !83, file: !82, line: 17, baseType: !24, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !83, file: !82, line: 18, baseType: !16, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !82, line: 19, baseType: !75, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !83, file: !82, line: 20, baseType: !16, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !83, file: !82, line: 21, baseType: !90, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !92, line: 18, baseType: !93)
!92 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !94, line: 57, size: 320, elements: !95)
!94 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!95 = !{!96, !104, !105, !106, !233, !240, !252}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !93, file: !94, line: 58, baseType: !97, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !94, line: 54, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !94, line: 49, size: 128, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !98, file: !94, line: 50, baseType: !28, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !98, file: !94, line: 51, baseType: !28, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !94, line: 52, baseType: !90, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !98, file: !94, line: 53, baseType: !16, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !93, file: !94, line: 59, baseType: !75, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !93, file: !94, line: 60, baseType: !90, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !93, file: !94, line: 61, baseType: !107, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !92, line: 19, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !110, line: 59, size: 64, elements: !111)
!110 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !{!112, !232}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !109, file: !110, line: 60, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !110, line: 18, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !110, line: 20, size: 352, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !125, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !115, file: !110, line: 21, baseType: !28, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !115, file: !110, line: 22, baseType: !28, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !115, file: !110, line: 23, baseType: !50, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !115, file: !110, line: 24, baseType: !50, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !115, file: !110, line: 26, baseType: !28, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !115, file: !110, line: 27, baseType: !28, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !115, file: !110, line: 28, baseType: !124, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !110, line: 16, baseType: !24)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !115, file: !110, line: 29, baseType: !126, size: 32, offset: 224)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !92, line: 23, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !129, line: 16, size: 1216, elements: !130)
!129 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!130 = !{!131, !134, !135, !176, !177, !178, !217, !218}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !128, file: !129, line: 17, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !133, line: 16, baseType: !23)
!133 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 18, baseType: !70, size: 64, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !128, file: !129, line: 19, baseType: !136, size: 960, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !133, line: 17, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !138, line: 4, size: 960, elements: !139)
!138 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!139 = !{!140, !142, !143, !145, !146, !148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !160, !161, !163, !164, !169, !170, !171}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !137, file: !138, line: 6, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !13, line: 232, baseType: !19)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !137, file: !138, line: 7, baseType: !141, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !137, file: !138, line: 8, baseType: !144, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !13, line: 227, baseType: !19)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !137, file: !138, line: 9, baseType: !144, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !137, file: !138, line: 10, baseType: !147, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !13, line: 217, baseType: !19)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !137, file: !138, line: 11, baseType: !147, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !137, file: !138, line: 13, baseType: !150, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !13, line: 212, baseType: !19)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !137, file: !138, line: 14, baseType: !65, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !137, file: !138, line: 15, baseType: !68, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !137, file: !138, line: 16, baseType: !19, size: 32, offset: 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !137, file: !138, line: 17, baseType: !141, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !137, file: !138, line: 18, baseType: !141, size: 32, offset: 352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !137, file: !138, line: 19, baseType: !50, size: 32, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !137, file: !138, line: 20, baseType: !50, size: 32, offset: 416)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !137, file: !138, line: 21, baseType: !159, size: 32, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !13, line: 237, baseType: !14)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !137, file: !138, line: 22, baseType: !159, size: 32, offset: 480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !137, file: !138, line: 23, baseType: !162, size: 32, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !13, line: 242, baseType: !23)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !137, file: !138, line: 24, baseType: !162, size: 32, offset: 544)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !137, file: !138, line: 26, baseType: !165, size: 64, offset: 576)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !13, line: 288, size: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !165, file: !13, line: 288, baseType: !12, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !165, file: !13, line: 288, baseType: !14, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !137, file: !138, line: 27, baseType: !165, size: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !137, file: !138, line: 28, baseType: !165, size: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !137, file: !138, line: 29, baseType: !172, size: 192, offset: 768)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 192, elements: !174)
!173 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!174 = !{!175}
!175 = !DISubrange(count: 3)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !128, file: !129, line: 21, baseType: !50, size: 32, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !128, file: !129, line: 22, baseType: !50, size: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !128, file: !129, line: 24, baseType: !179, size: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !92, line: 20, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !182, line: 50, size: 320, elements: !183)
!182 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!183 = !{!184, !185, !198, !202, !203, !208, !209, !214, !215, !216}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !181, file: !182, line: 51, baseType: !16, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !181, file: !182, line: 52, baseType: !186, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !92, line: 21, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !189, line: 89, size: 160, elements: !190)
!189 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!190 = !{!191, !192, !193, !197}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !188, file: !189, line: 90, baseType: !132, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 91, baseType: !70, size: 64, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !188, file: !189, line: 93, baseType: !194, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !186, !179}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 94, baseType: !24, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !181, file: !182, line: 54, baseType: !199, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !200, line: 98, baseType: !201)
!200 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !181, file: !182, line: 56, baseType: !12, size: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !181, file: !182, line: 58, baseType: !204, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !182, line: 45, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{!28, !179, !28, !75}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !182, line: 59, baseType: !24, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !181, file: !182, line: 61, baseType: !210, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !182, line: 46, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !179, !16, !28, !75}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !181, file: !182, line: 62, baseType: !24, size: 32, offset: 224)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !181, file: !182, line: 70, baseType: !61, size: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !182, line: 72, baseType: !179, size: 32, offset: 288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !128, file: !129, line: 37, baseType: !19, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !128, file: !129, line: 38, baseType: !19, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !115, file: !110, line: 30, baseType: !113, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !115, file: !110, line: 34, baseType: !19, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !115, file: !110, line: 40, baseType: !19, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !115, file: !110, line: 43, baseType: !19, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !115, file: !110, line: 45, baseType: !19, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !115, file: !110, line: 46, baseType: !19, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !115, file: !110, line: 47, baseType: !19, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !115, file: !110, line: 48, baseType: !19, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !115, file: !110, line: 49, baseType: !19, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !115, file: !110, line: 50, baseType: !19, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !115, file: !110, line: 52, baseType: !19, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !115, file: !110, line: 53, baseType: !19, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !115, file: !110, line: 55, baseType: !23, size: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !110, line: 61, baseType: !107, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !93, file: !94, line: 62, baseType: !234, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !94, line: 41, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !94, line: 43, size: 64, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !94, line: 44, baseType: !234, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !236, file: !94, line: 45, baseType: !24, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !93, file: !94, line: 63, baseType: !241, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !94, line: 32, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !94, line: 34, size: 96, elements: !244)
!244 = !{!245, !250, !251}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !243, file: !94, line: 35, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !94, line: 30, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !24}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !94, line: 36, baseType: !24, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !94, line: 37, baseType: !241, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !93, file: !94, line: 64, baseType: !179, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "environment", scope: !35, file: !34, line: 116, baseType: !254, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !256, line: 17, baseType: !23)
!256 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pid_t", file: !258, line: 16, baseType: !259)
!258 = !DIFile(filename: "src/os/unix/ngx_process.h", directory: "/home/sam/Projects/nginx-1.12.2")
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !13, line: 294, baseType: !23)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !42, line: 17, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !44, line: 17, baseType: !21)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_pool_t", file: !264, line: 59, baseType: !265)
!264 = !DIFile(filename: "src/core/ngx_slab.h", directory: "/home/sam/Projects/nginx-1.12.2")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 34, size: 800, elements: !266)
!266 = !{!267, !276, !277, !278, !286, !287, !288, !297, !298, !299, !300, !319, !320, !321, !322, !323}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !265, file: !264, line: 35, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_sh_t", file: !269, line: 21, baseType: !270)
!269 = !DIFile(filename: "src/core/ngx_shmtx.h", directory: "/home/sam/Projects/nginx-1.12.2")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 16, size: 64, elements: !271)
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !269, line: 17, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !200, line: 106, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !199)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !270, file: !269, line: 19, baseType: !273, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !265, file: !264, line: 37, baseType: !75, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min_shift", scope: !265, file: !264, line: 38, baseType: !75, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !265, file: !264, line: 40, baseType: !279, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_page_t", file: !264, line: 16, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_slab_page_s", file: !264, line: 18, size: 96, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !281, file: !264, line: 19, baseType: !18, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !264, line: 20, baseType: !279, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !281, file: !264, line: 21, baseType: !18, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !265, file: !264, line: 41, baseType: !279, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !265, file: !264, line: 42, baseType: !280, size: 96, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !265, file: !264, line: 44, baseType: !289, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_slab_stat_t", file: !264, line: 31, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 25, size: 128, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !291, file: !264, line: 26, baseType: !16, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !291, file: !264, line: 27, baseType: !16, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reqs", scope: !291, file: !264, line: 29, baseType: !16, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fails", scope: !291, file: !264, line: 30, baseType: !16, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pfree", scope: !265, file: !264, line: 45, baseType: !16, size: 32, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !265, file: !264, line: 47, baseType: !28, size: 32, offset: 352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !265, file: !264, line: 48, baseType: !28, size: 32, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !265, file: !264, line: 50, baseType: !301, size: 256, offset: 416)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shmtx_t", file: !269, line: 37, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 24, size: 256, elements: !303)
!303 = !{!304, !306, !307, !308, !318}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !302, file: !269, line: 26, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !302, file: !269, line: 28, baseType: !305, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !302, file: !269, line: 29, baseType: !16, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !302, file: !269, line: 30, baseType: !309, size: 128, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !310, line: 19, baseType: !311)
!310 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/semaphore.h", directory: "/home/sam/Projects/nginx-1.12.2")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !310, line: 17, size: 128, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !311, file: !310, line: 18, baseType: !314, size: 128)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 128, elements: !316)
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!316 = !{!317}
!317 = !DISubrange(count: 4)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "spin", scope: !302, file: !269, line: 36, baseType: !16, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !265, file: !264, line: 52, baseType: !28, size: 32, offset: 672)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !265, file: !264, line: 53, baseType: !29, size: 8, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "log_nomem", scope: !265, file: !264, line: 55, baseType: !19, size: 1, offset: 712, flags: DIFlagBitField, extraData: i64 712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !265, file: !264, line: 57, baseType: !24, size: 32, offset: 736)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !265, file: !264, line: 58, baseType: !24, size: 32, offset: 768)
!324 = !{!325, !645, !647, !649, !651, !0, !653, !655, !657}
!325 = !DIGlobalVariableExpression(var: !326)
!326 = distinct !DIGlobalVariable(name: "ngx_cycle", scope: !2, file: !3, line: 21, type: !327, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !92, line: 17, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !34, line: 38, size: 2496, elements: !331)
!331 = !{!332, !336, !337, !338, !339, !340, !513, !514, !515, !596, !597, !598, !599, !600, !601, !602, !603, !614, !615, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !330, file: !34, line: 39, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !330, file: !34, line: 40, baseType: !90, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !330, file: !34, line: 42, baseType: !179, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !330, file: !34, line: 43, baseType: !180, size: 320, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !330, file: !34, line: 45, baseType: !16, size: 32, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !330, file: !34, line: 47, baseType: !341, size: 32, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !92, line: 26, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !345, line: 121, size: 896, elements: !346)
!345 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!346 = !{!347, !348, !402, !403, !404, !411, !413, !418, !423, !481, !482, !483, !484, !485, !486, !487, !488, !489, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !345, line: 122, baseType: !24, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !344, file: !345, line: 123, baseType: !349, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !92, line: 24, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !352, line: 30, size: 384, elements: !353)
!352 = !DIFile(filename: "src/event/ngx_event.h", directory: "/home/sam/Projects/nginx-1.12.2")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !381, !382, !383, !394}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !352, line: 31, baseType: !24, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !351, file: !352, line: 33, baseType: !19, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !351, file: !352, line: 35, baseType: !19, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !351, file: !352, line: 38, baseType: !19, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !351, file: !352, line: 44, baseType: !19, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !351, file: !352, line: 46, baseType: !19, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !351, file: !352, line: 49, baseType: !19, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "oneshot", scope: !351, file: !352, line: 51, baseType: !19, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "complete", scope: !351, file: !352, line: 54, baseType: !19, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !351, file: !352, line: 56, baseType: !19, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !351, file: !352, line: 57, baseType: !19, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !351, file: !352, line: 59, baseType: !19, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !351, file: !352, line: 60, baseType: !19, size: 1, offset: 43, flags: DIFlagBitField, extraData: i64 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "delayed", scope: !351, file: !352, line: 62, baseType: !19, size: 1, offset: 44, flags: DIFlagBitField, extraData: i64 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !351, file: !352, line: 64, baseType: !19, size: 1, offset: 45, flags: DIFlagBitField, extraData: i64 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pending_eof", scope: !351, file: !352, line: 67, baseType: !19, size: 1, offset: 46, flags: DIFlagBitField, extraData: i64 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "posted", scope: !351, file: !352, line: 69, baseType: !19, size: 1, offset: 47, flags: DIFlagBitField, extraData: i64 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !351, file: !352, line: 71, baseType: !19, size: 1, offset: 48, flags: DIFlagBitField, extraData: i64 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !351, file: !352, line: 74, baseType: !19, size: 1, offset: 49, flags: DIFlagBitField, extraData: i64 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "resolver", scope: !351, file: !352, line: 75, baseType: !19, size: 1, offset: 50, flags: DIFlagBitField, extraData: i64 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cancelable", scope: !351, file: !352, line: 77, baseType: !19, size: 1, offset: 51, flags: DIFlagBitField, extraData: i64 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !351, file: !352, line: 107, baseType: !19, size: 1, offset: 52, flags: DIFlagBitField, extraData: i64 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !351, file: !352, line: 110, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_handler_pt", file: !92, line: 31, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !349}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !351, file: !352, line: 117, baseType: !16, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !351, file: !352, line: 119, baseType: !179, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !351, file: !352, line: 121, baseType: !384, size: 160, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !44, line: 20, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !44, line: 22, size: 160, elements: !386)
!386 = !{!387, !388, !390, !391, !392, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !385, file: !44, line: 23, baseType: !43, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !385, file: !44, line: 24, baseType: !389, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !385, file: !44, line: 25, baseType: !389, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !385, file: !44, line: 26, baseType: !389, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !385, file: !44, line: 27, baseType: !29, size: 8, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !385, file: !44, line: 28, baseType: !29, size: 8, offset: 136)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !351, file: !352, line: 124, baseType: !395, size: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !396, line: 16, baseType: !397)
!396 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !396, line: 18, size: 64, elements: !398)
!398 = !{!399, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !397, file: !396, line: 19, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !396, line: 20, baseType: !400, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !344, file: !345, line: 124, baseType: !349, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !344, file: !345, line: 126, baseType: !255, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !344, file: !345, line: 128, baseType: !405, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !406, line: 19, baseType: !407)
!406 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !342, !28, !75}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 135, baseType: !23)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !344, file: !345, line: 129, baseType: !412, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !406, line: 22, baseType: !407)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !344, file: !345, line: 130, baseType: !414, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !406, line: 20, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DISubroutineType(types: !417)
!417 = !{!410, !342, !107, !50}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !344, file: !345, line: 131, baseType: !419, size: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !406, line: 23, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DISubroutineType(types: !422)
!422 = !{!107, !342, !107, !50}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !344, file: !345, line: 133, baseType: !424, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !345, line: 16, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !345, line: 18, size: 960, elements: !427)
!427 = !{!428, !429, !441, !443, !444, !445, !446, !447, !448, !449, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !426, file: !345, line: 19, baseType: !255, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !426, file: !345, line: 21, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !432, line: 297, size: 128, elements: !433)
!432 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!433 = !{!434, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !431, file: !432, line: 298, baseType: !435, size: 16)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !13, line: 409, baseType: !436)
!436 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !431, file: !432, line: 299, baseType: !438, size: 112, offset: 16)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 14)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !426, file: !345, line: 22, baseType: !442, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !13, line: 404, baseType: !19)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !426, file: !345, line: 23, baseType: !75, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !426, file: !345, line: 24, baseType: !70, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !345, line: 26, baseType: !23, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !426, file: !345, line: 28, baseType: !23, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !426, file: !345, line: 29, baseType: !23, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !426, file: !345, line: 30, baseType: !23, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !426, file: !345, line: 38, baseType: !450, size: 32, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !92, line: 32, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !342}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !426, file: !345, line: 40, baseType: !24, size: 32, offset: 352)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !426, file: !345, line: 42, baseType: !180, size: 320, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !426, file: !345, line: 43, baseType: !179, size: 32, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !426, file: !345, line: 45, baseType: !75, size: 32, offset: 736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !426, file: !345, line: 47, baseType: !75, size: 32, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !426, file: !345, line: 49, baseType: !41, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !426, file: !345, line: 51, baseType: !424, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !426, file: !345, line: 52, baseType: !342, size: 32, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !426, file: !345, line: 54, baseType: !16, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !426, file: !345, line: 56, baseType: !19, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !426, file: !345, line: 57, baseType: !19, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !426, file: !345, line: 58, baseType: !19, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !426, file: !345, line: 60, baseType: !19, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !426, file: !345, line: 61, baseType: !19, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !426, file: !345, line: 62, baseType: !19, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !426, file: !345, line: 63, baseType: !19, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !426, file: !345, line: 64, baseType: !19, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !426, file: !345, line: 65, baseType: !19, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !426, file: !345, line: 66, baseType: !19, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !426, file: !345, line: 67, baseType: !19, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !426, file: !345, line: 70, baseType: !19, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !426, file: !345, line: 72, baseType: !19, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !426, file: !345, line: 73, baseType: !19, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !426, file: !345, line: 74, baseType: !19, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !426, file: !345, line: 76, baseType: !19, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !426, file: !345, line: 77, baseType: !19, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !426, file: !345, line: 78, baseType: !19, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !344, file: !345, line: 135, baseType: !50, size: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !344, file: !345, line: 137, baseType: !179, size: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !344, file: !345, line: 139, baseType: !90, size: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !345, line: 141, baseType: !23, size: 32, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !344, file: !345, line: 143, baseType: !430, size: 32, offset: 416)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !344, file: !345, line: 144, baseType: !442, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !344, file: !345, line: 145, baseType: !70, size: 64, offset: 480)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !344, file: !345, line: 147, baseType: !70, size: 64, offset: 544)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !344, file: !345, line: 148, baseType: !490, size: 16, offset: 608)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !491, line: 12, baseType: !492)
!491 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 186, baseType: !436)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !344, file: !345, line: 154, baseType: !430, size: 32, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !344, file: !345, line: 155, baseType: !442, size: 32, offset: 672)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !344, file: !345, line: 157, baseType: !113, size: 32, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !344, file: !345, line: 159, baseType: !395, size: 64, offset: 736)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !344, file: !345, line: 161, baseType: !199, size: 32, offset: 800)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !344, file: !345, line: 163, baseType: !16, size: 32, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !344, file: !345, line: 165, baseType: !19, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !344, file: !345, line: 167, baseType: !19, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !344, file: !345, line: 169, baseType: !19, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !344, file: !345, line: 170, baseType: !19, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !344, file: !345, line: 171, baseType: !19, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !344, file: !345, line: 173, baseType: !19, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !344, file: !345, line: 174, baseType: !19, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !344, file: !345, line: 175, baseType: !19, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !344, file: !345, line: 176, baseType: !19, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !344, file: !345, line: 178, baseType: !19, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !344, file: !345, line: 179, baseType: !19, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !344, file: !345, line: 180, baseType: !19, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !344, file: !345, line: 181, baseType: !19, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !344, file: !345, line: 183, baseType: !19, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !330, file: !34, line: 48, baseType: !342, size: 32, offset: 480)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !330, file: !34, line: 49, baseType: !16, size: 32, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !330, file: !34, line: 51, baseType: !516, size: 32, offset: 544)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !92, line: 15, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !520, line: 222, size: 800, elements: !521)
!520 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !571, !572, !576, !580, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !519, file: !520, line: 223, baseType: !16, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !519, file: !520, line: 224, baseType: !16, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !519, file: !520, line: 226, baseType: !61, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !519, file: !520, line: 228, baseType: !16, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !519, file: !520, line: 229, baseType: !16, size: 32, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !519, file: !520, line: 231, baseType: !16, size: 32, offset: 160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !519, file: !520, line: 232, baseType: !25, size: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !519, file: !520, line: 234, baseType: !24, size: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !519, file: !520, line: 235, baseType: !531, size: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !92, line: 22, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !189, line: 77, size: 224, elements: !534)
!534 = !{!535, !536, !537, !568, !569, !570}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !189, line: 78, baseType: !70, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !533, file: !189, line: 79, baseType: !16, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !533, file: !189, line: 80, baseType: !538, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DISubroutineType(types: !540)
!540 = !{!61, !541, !531, !24}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !92, line: 16, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !189, line: 116, size: 384, elements: !544)
!544 = !{!545, !546, !548, !550, !551, !552, !561, !562, !563, !564, !565, !567}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !543, file: !189, line: 117, baseType: !61, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !543, file: !189, line: 118, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !543, file: !189, line: 120, baseType: !549, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !543, file: !189, line: 121, baseType: !90, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !543, file: !189, line: 122, baseType: !90, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !543, file: !189, line: 123, baseType: !553, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !189, line: 103, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 98, size: 1344, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !555, file: !189, line: 99, baseType: !127, size: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !555, file: !189, line: 100, baseType: !113, size: 32, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !555, file: !189, line: 101, baseType: !113, size: 32, offset: 1248)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !555, file: !189, line: 102, baseType: !16, size: 32, offset: 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !543, file: !189, line: 124, baseType: !179, size: 32, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !543, file: !189, line: 126, baseType: !24, size: 32, offset: 224)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !543, file: !189, line: 127, baseType: !16, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !543, file: !189, line: 128, baseType: !16, size: 32, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !543, file: !189, line: 130, baseType: !566, size: 32, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !189, line: 112, baseType: !538)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !543, file: !189, line: 131, baseType: !61, size: 32, offset: 352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !533, file: !189, line: 81, baseType: !16, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !533, file: !189, line: 82, baseType: !16, size: 32, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !533, file: !189, line: 83, baseType: !24, size: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !520, line: 236, baseType: !16, size: 32, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !519, file: !520, line: 238, baseType: !573, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!21, !179}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !519, file: !520, line: 240, baseType: !577, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!21, !549}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !519, file: !520, line: 242, baseType: !577, size: 32, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !519, file: !520, line: 243, baseType: !577, size: 32, offset: 416)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !519, file: !520, line: 244, baseType: !583, size: 32, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !549}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !519, file: !520, line: 245, baseType: !583, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !519, file: !520, line: 247, baseType: !583, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !519, file: !520, line: 249, baseType: !18, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !519, file: !520, line: 250, baseType: !18, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !519, file: !520, line: 251, baseType: !18, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !519, file: !520, line: 252, baseType: !18, size: 32, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !519, file: !520, line: 253, baseType: !18, size: 32, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !519, file: !520, line: 254, baseType: !18, size: 32, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !519, file: !520, line: 255, baseType: !18, size: 32, offset: 736)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !519, file: !520, line: 256, baseType: !18, size: 32, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !330, file: !34, line: 52, baseType: !16, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !330, file: !34, line: 53, baseType: !16, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !330, file: !34, line: 55, baseType: !395, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !330, file: !34, line: 56, baseType: !16, size: 32, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !330, file: !34, line: 58, baseType: !81, size: 160, offset: 736)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !330, file: !34, line: 59, baseType: !81, size: 160, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !330, file: !34, line: 61, baseType: !81, size: 160, offset: 1056)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !330, file: !34, line: 62, baseType: !604, size: 96, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !44, line: 32, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !44, line: 37, size: 96, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !605, file: !44, line: 38, baseType: !389, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !605, file: !44, line: 39, baseType: !389, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !605, file: !44, line: 40, baseType: !610, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !44, line: 34, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !389, !389, !389}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !330, file: !34, line: 63, baseType: !384, size: 160, offset: 1312)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !330, file: !34, line: 65, baseType: !616, size: 224, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !617, line: 31, baseType: !618)
!617 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 25, size: 224, elements: !619)
!619 = !{!620, !628, !629, !630, !631}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !618, file: !617, line: 26, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !617, line: 16, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !617, line: 18, size: 96, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !623, file: !617, line: 19, baseType: !24, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !623, file: !617, line: 20, baseType: !16, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !617, line: 21, baseType: !621, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !618, file: !617, line: 27, baseType: !622, size: 96, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !618, file: !617, line: 28, baseType: !75, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !618, file: !617, line: 29, baseType: !16, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !618, file: !617, line: 30, baseType: !90, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !330, file: !34, line: 66, baseType: !616, size: 224, offset: 1696)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !330, file: !34, line: 68, baseType: !16, size: 32, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !330, file: !34, line: 69, baseType: !16, size: 32, offset: 1952)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !330, file: !34, line: 71, baseType: !342, size: 32, offset: 1984)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !330, file: !34, line: 72, baseType: !349, size: 32, offset: 2016)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !330, file: !34, line: 73, baseType: !349, size: 32, offset: 2048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !330, file: !34, line: 75, baseType: !549, size: 32, offset: 2080)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !330, file: !34, line: 77, baseType: !70, size: 64, offset: 2112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !330, file: !34, line: 78, baseType: !70, size: 64, offset: 2176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !330, file: !34, line: 79, baseType: !70, size: 64, offset: 2240)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !330, file: !34, line: 80, baseType: !70, size: 64, offset: 2304)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !330, file: !34, line: 81, baseType: !70, size: 64, offset: 2368)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !330, file: !34, line: 82, baseType: !70, size: 64, offset: 2432)
!645 = !DIGlobalVariableExpression(var: !646)
!646 = distinct !DIGlobalVariable(name: "ngx_old_cycles", scope: !2, file: !3, line: 22, type: !81, isLocal: false, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648)
!648 = distinct !DIGlobalVariable(name: "ngx_temp_pool", scope: !2, file: !3, line: 24, type: !90, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650)
!650 = distinct !DIGlobalVariable(name: "ngx_cleaner_event", scope: !2, file: !3, line: 25, type: !350, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652)
!652 = distinct !DIGlobalVariable(name: "ngx_shutdown_event", scope: !2, file: !3, line: 26, type: !350, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654)
!654 = distinct !DIGlobalVariable(name: "ngx_dump_config", scope: !2, file: !3, line: 29, type: !16, isLocal: false, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656)
!656 = distinct !DIGlobalVariable(name: "ngx_quiet_mode", scope: !2, file: !3, line: 30, type: !16, isLocal: false, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658)
!658 = distinct !DIGlobalVariable(name: "dumb", scope: !2, file: !3, line: 34, type: !343, isLocal: true, isDefinition: true)
!659 = !{i32 2, !"Dwarf Version", i32 4}
!660 = !{i32 2, !"Debug Info Version", i32 3}
!661 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!662 = distinct !DISubprogram(name: "ngx_init_cycle", scope: !3, file: !3, line: 39, type: !663, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!549, !549}
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !678, !701, !702, !703, !704, !705, !706, !707, !708, !709, !723, !727}
!666 = !DILocalVariable(name: "old_cycle", arg: 1, scope: !662, file: !3, line: 39, type: !549)
!667 = !DILocalVariable(name: "rv", scope: !662, file: !3, line: 41, type: !24)
!668 = !DILocalVariable(name: "senv", scope: !662, file: !3, line: 42, type: !254)
!669 = !DILocalVariable(name: "i", scope: !662, file: !3, line: 43, type: !16)
!670 = !DILocalVariable(name: "n", scope: !662, file: !3, line: 43, type: !16)
!671 = !DILocalVariable(name: "log", scope: !662, file: !3, line: 44, type: !179)
!672 = !DILocalVariable(name: "tp", scope: !662, file: !3, line: 45, type: !6)
!673 = !DILocalVariable(name: "conf", scope: !662, file: !3, line: 46, type: !542)
!674 = !DILocalVariable(name: "pool", scope: !662, file: !3, line: 47, type: !90)
!675 = !DILocalVariable(name: "cycle", scope: !662, file: !3, line: 48, type: !549)
!676 = !DILocalVariable(name: "old", scope: !662, file: !3, line: 48, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!678 = !DILocalVariable(name: "shm_zone", scope: !662, file: !3, line: 49, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_t", file: !34, line: 25, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_shm_zone_s", file: !34, line: 29, size: 320, elements: !682)
!682 = !{!683, !684, !694, !699, !700}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !681, file: !34, line: 30, baseType: !24, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "shm", scope: !681, file: !34, line: 31, baseType: !685, size: 192, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_t", file: !686, line: 22, baseType: !687)
!686 = !DIFile(filename: "src/os/unix/ngx_shmem.h", directory: "/home/sam/Projects/nginx-1.12.2")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !686, line: 16, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692, !693}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !687, file: !686, line: 17, baseType: !28, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !686, line: 18, baseType: !75, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !687, file: !686, line: 19, baseType: !70, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !687, file: !686, line: 20, baseType: !179, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "exists", scope: !687, file: !686, line: 21, baseType: !16, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !681, file: !34, line: 32, baseType: !695, size: 32, offset: 224)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_shm_zone_init_pt", file: !34, line: 27, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!21, !679, !24}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !681, file: !34, line: 33, baseType: !24, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "noreuse", scope: !681, file: !34, line: 34, baseType: !16, size: 32, offset: 288)
!701 = !DILocalVariable(name: "oshm_zone", scope: !662, file: !3, line: 49, type: !679)
!702 = !DILocalVariable(name: "part", scope: !662, file: !3, line: 50, type: !621)
!703 = !DILocalVariable(name: "opart", scope: !662, file: !3, line: 50, type: !621)
!704 = !DILocalVariable(name: "file", scope: !662, file: !3, line: 51, type: !186)
!705 = !DILocalVariable(name: "ls", scope: !662, file: !3, line: 52, type: !424)
!706 = !DILocalVariable(name: "nls", scope: !662, file: !3, line: 52, type: !424)
!707 = !DILocalVariable(name: "ccf", scope: !662, file: !3, line: 53, type: !32)
!708 = !DILocalVariable(name: "old_ccf", scope: !662, file: !3, line: 53, type: !32)
!709 = !DILocalVariable(name: "module", scope: !662, file: !3, line: 54, type: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_module_t", file: !520, line: 264, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 260, size: 128, elements: !713)
!713 = !{!714, !715, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !520, line: 261, baseType: !70, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !712, file: !520, line: 262, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{!24, !549}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !712, file: !520, line: 263, baseType: !720, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!721 = !DISubroutineType(types: !722)
!722 = !{!61, !549, !24}
!723 = !DILocalVariable(name: "hostname", scope: !662, file: !3, line: 55, type: !724)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 256)
!727 = !DILocalVariable(name: "name", scope: !728, file: !3, line: 703, type: !28)
!728 = distinct !DILexicalBlock(scope: !729, file: !3, line: 702, column: 51)
!729 = distinct !DILexicalBlock(scope: !730, file: !3, line: 702, column: 13)
!730 = distinct !DILexicalBlock(scope: !731, file: !3, line: 688, column: 54)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 688, column: 5)
!732 = distinct !DILexicalBlock(scope: !662, file: !3, line: 688, column: 5)
!733 = !{!734, !734, i64 0}
!734 = !{!"any pointer", !735, i64 0}
!735 = !{!"omnipotent char", !736, i64 0}
!736 = !{!"Simple C/C++ TBAA"}
!737 = !DIExpression()
!738 = !DILocation(line: 39, column: 29, scope: !662)
!739 = !DILocation(line: 41, column: 5, scope: !662)
!740 = !DILocation(line: 41, column: 26, scope: !662)
!741 = !DILocation(line: 42, column: 5, scope: !662)
!742 = !DILocation(line: 42, column: 26, scope: !662)
!743 = !DILocation(line: 43, column: 5, scope: !662)
!744 = !DILocation(line: 43, column: 26, scope: !662)
!745 = !DILocation(line: 43, column: 29, scope: !662)
!746 = !DILocation(line: 44, column: 5, scope: !662)
!747 = !DILocation(line: 44, column: 26, scope: !662)
!748 = !DILocation(line: 45, column: 5, scope: !662)
!749 = !DILocation(line: 45, column: 26, scope: !662)
!750 = !DILocation(line: 46, column: 5, scope: !662)
!751 = !DILocation(line: 46, column: 26, scope: !662)
!752 = !DILocation(line: 47, column: 5, scope: !662)
!753 = !DILocation(line: 47, column: 26, scope: !662)
!754 = !DILocation(line: 48, column: 5, scope: !662)
!755 = !DILocation(line: 48, column: 26, scope: !662)
!756 = !DILocation(line: 48, column: 35, scope: !662)
!757 = !DILocation(line: 49, column: 5, scope: !662)
!758 = !DILocation(line: 49, column: 26, scope: !662)
!759 = !DILocation(line: 49, column: 37, scope: !662)
!760 = !DILocation(line: 50, column: 5, scope: !662)
!761 = !DILocation(line: 50, column: 26, scope: !662)
!762 = !DILocation(line: 50, column: 33, scope: !662)
!763 = !DILocation(line: 51, column: 5, scope: !662)
!764 = !DILocation(line: 51, column: 26, scope: !662)
!765 = !DILocation(line: 52, column: 5, scope: !662)
!766 = !DILocation(line: 52, column: 26, scope: !662)
!767 = !DILocation(line: 52, column: 31, scope: !662)
!768 = !DILocation(line: 53, column: 5, scope: !662)
!769 = !DILocation(line: 53, column: 26, scope: !662)
!770 = !DILocation(line: 53, column: 32, scope: !662)
!771 = !DILocation(line: 54, column: 5, scope: !662)
!772 = !DILocation(line: 54, column: 26, scope: !662)
!773 = !DILocation(line: 55, column: 5, scope: !662)
!774 = !DILocation(line: 55, column: 26, scope: !662)
!775 = !DILocation(line: 57, column: 5, scope: !662)
!776 = !DILocation(line: 61, column: 10, scope: !662)
!777 = !DILocation(line: 61, column: 8, scope: !662)
!778 = !DILocation(line: 62, column: 5, scope: !662)
!779 = !DILocation(line: 62, column: 9, scope: !662)
!780 = !DILocation(line: 62, column: 13, scope: !662)
!781 = !{!782, !783, i64 0}
!782 = !{!"", !783, i64 0, !784, i64 4, !784, i64 8}
!783 = !{!"long", !735, i64 0}
!784 = !{!"int", !735, i64 0}
!785 = !DILocation(line: 64, column: 5, scope: !662)
!786 = !DILocation(line: 67, column: 11, scope: !662)
!787 = !DILocation(line: 67, column: 22, scope: !662)
!788 = !{!789, !734, i64 8}
