; ModuleID = 'src/core/ngx_inet.c'
source_filename = "src/core/ngx_inet.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.sockaddr_un = type { i16, [108 x i8] }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_cidr_t = type { i32, %union.anon.0 }
%union.anon.0 = type { %struct.ngx_in6_cidr_t }
%struct.ngx_in6_cidr_t = type { %struct.in6_addr, %struct.in6_addr }
%struct.ngx_in_cidr_t = type { i32, i32 }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "src/core/ngx_inet.c", directory: "/home/sam/Projects/nginx-1.12.2")
!2 = !{}
!3 = !{!4, !9, !12, !13, !31, !32, !55, !65, !66, !6, !69, !70, !20, !71, !72, !81}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !5, line: 13, baseType: !6)
!5 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 191, baseType: !8)
!7 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !10, line: 64, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !5, line: 16, size: 128, elements: !15)
!15 = !{!16, !19, !22, !26}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !14, file: !5, line: 17, baseType: !17, size: 16)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !7, line: 409, baseType: !18)
!18 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !14, file: !5, line: 18, baseType: !20, size: 16, offset: 16)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !5, line: 12, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 186, baseType: !18)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !14, file: !5, line: 19, baseType: !23, size: 32, offset: 32)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !5, line: 14, size: 32, elements: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !23, file: !5, line: 14, baseType: !4, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !14, file: !5, line: 20, baseType: !27, size: 64, offset: 64)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !29)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 181, baseType: !11)
!29 = !{!30}
!30 = !DISubrange(count: 8)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !5, line: 34, size: 224, elements: !34)
!34 = !{!35, !36, !37, !38, !54}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !33, file: !5, line: 35, baseType: !17, size: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !33, file: !5, line: 36, baseType: !20, size: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !33, file: !5, line: 37, baseType: !6, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !33, file: !5, line: 38, baseType: !39, size: 128, offset: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !5, line: 23, size: 128, elements: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_union", scope: !39, file: !5, line: 28, baseType: !42, size: 128)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !5, line: 24, size: 128, elements: !43)
!43 = !{!44, !48, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr", scope: !42, file: !5, line: 25, baseType: !45, size: 128)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 16)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr16", scope: !42, file: !5, line: 26, baseType: !49, size: 128)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !29)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__s6_addr32", scope: !42, file: !5, line: 27, baseType: !51, size: 128)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 4)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !33, file: !5, line: 39, baseType: !6, size: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !57, line: 17, size: 880, elements: !58)
!57 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/un.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !56, file: !57, line: 18, baseType: !17, size: 16)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !56, file: !57, line: 19, baseType: !61, size: 864, offset: 16)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 864, elements: !63)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!63 = !{!64}
!64 = !DISubrange(count: 108)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !7, line: 404, baseType: !8)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !67, line: 79, baseType: !68)
!67 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !7, line: 125, baseType: !8)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !74, line: 297, size: 128, elements: !75)
!74 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !73, file: !74, line: 298, baseType: !17, size: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !73, file: !74, line: 299, baseType: !78, size: 112, offset: 16)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 112, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 14)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!86 = distinct !DISubprogram(name: "ngx_inet_addr", scope: !1, file: !1, line: 18, type: !87, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !90)
!87 = !DISubroutineType(types: !88)
!88 = !{!4, !31, !89}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 120, baseType: !8)
!90 = !{!91, !92, !93, !94, !95, !96, !97}
!91 = !DILocalVariable(name: "text", arg: 1, scope: !86, file: !1, line: 18, type: !31)
!92 = !DILocalVariable(name: "len", arg: 2, scope: !86, file: !1, line: 18, type: !89)
!93 = !DILocalVariable(name: "p", scope: !86, file: !1, line: 20, type: !31)
!94 = !DILocalVariable(name: "c", scope: !86, file: !1, line: 20, type: !9)
!95 = !DILocalVariable(name: "addr", scope: !86, file: !1, line: 21, type: !4)
!96 = !DILocalVariable(name: "octet", scope: !86, file: !1, line: 22, type: !66)
!97 = !DILocalVariable(name: "n", scope: !86, file: !1, line: 22, type: !66)
!98 = !{!99, !99, i64 0}
!99 = !{!"any pointer", !100, i64 0}
!100 = !{!"omnipotent char", !101, i64 0}
!101 = !{!"Simple C/C++ TBAA"}
!102 = !DIExpression()
!103 = !DILocation(line: 18, column: 23, scope: !86)
!104 = !{!105, !105, i64 0}
!105 = !{!"int", !100, i64 0}
!106 = !DILocation(line: 18, column: 36, scope: !86)
!107 = !DILocation(line: 20, column: 5, scope: !86)
!108 = !DILocation(line: 20, column: 18, scope: !86)
!109 = !DILocation(line: 20, column: 21, scope: !86)
!110 = !DILocation(line: 21, column: 5, scope: !86)
!111 = !DILocation(line: 21, column: 18, scope: !86)
!112 = !DILocation(line: 22, column: 5, scope: !86)
!113 = !DILocation(line: 22, column: 18, scope: !86)
!114 = !DILocation(line: 22, column: 25, scope: !86)
!115 = !DILocation(line: 24, column: 10, scope: !86)
!116 = !DILocation(line: 25, column: 11, scope: !86)
!117 = !DILocation(line: 26, column: 7, scope: !86)
!118 = !DILocation(line: 28, column: 14, scope: !119)
!119 = distinct !DILexicalBlock(scope: !86, file: !1, line: 28, column: 5)
!120 = !DILocation(line: 28, column: 12, scope: !119)
!121 = !DILocation(line: 28, column: 10, scope: !119)
!122 = !DILocation(line: 28, column: 20, scope: !123)
!123 = distinct !DILexicalBlock(scope: !119, file: !1, line: 28, column: 5)
!124 = !DILocation(line: 28, column: 24, scope: !123)
!125 = !DILocation(line: 28, column: 31, scope: !123)
!126 = !DILocation(line: 28, column: 29, scope: !123)
!127 = !DILocation(line: 28, column: 22, scope: !123)
!128 = !DILocation(line: 28, column: 5, scope: !119)
!129 = !DILocation(line: 29, column: 14, scope: !130)
!130 = distinct !DILexicalBlock(scope: !123, file: !1, line: 28, column: 41)
!131 = !DILocation(line: 29, column: 13, scope: !130)
!132 = !{!100, !100, i64 0}
!133 = !DILocation(line: 29, column: 11, scope: !130)
!134 = !DILocation(line: 31, column: 13, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !1, line: 31, column: 13)
!136 = !DILocation(line: 31, column: 15, scope: !135)
!137 = !DILocation(line: 31, column: 22, scope: !135)
!138 = !DILocation(line: 31, column: 25, scope: !135)
!139 = !DILocation(line: 31, column: 27, scope: !135)
!140 = !DILocation(line: 31, column: 13, scope: !130)
!141 = !DILocation(line: 32, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !135, file: !1, line: 31, column: 35)
!143 = !DILocation(line: 32, column: 27, scope: !142)
!144 = !DILocation(line: 32, column: 35, scope: !142)
!145 = !DILocation(line: 32, column: 37, scope: !142)
!146 = !DILocation(line: 32, column: 32, scope: !142)
!147 = !DILocation(line: 32, column: 19, scope: !142)
!148 = !DILocation(line: 34, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !1, line: 34, column: 17)
!150 = !DILocation(line: 34, column: 23, scope: !149)
!151 = !DILocation(line: 34, column: 17, scope: !142)
!152 = !DILocation(line: 35, column: 17, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !1, line: 34, column: 30)
!154 = !DILocation(line: 38, column: 13, scope: !142)
!155 = !DILocation(line: 41, column: 13, scope: !156)
!156 = distinct !DILexicalBlock(scope: !130, file: !1, line: 41, column: 13)
!157 = !DILocation(line: 41, column: 15, scope: !156)
!158 = !DILocation(line: 41, column: 13, scope: !130)
!159 = !DILocation(line: 42, column: 21, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !1, line: 41, column: 23)
!161 = !DILocation(line: 42, column: 26, scope: !160)
!162 = !DILocation(line: 42, column: 34, scope: !160)
!163 = !DILocation(line: 42, column: 32, scope: !160)
!164 = !DILocation(line: 42, column: 18, scope: !160)
!165 = !DILocation(line: 43, column: 19, scope: !160)
!166 = !DILocation(line: 44, column: 14, scope: !160)
!167 = !DILocation(line: 45, column: 13, scope: !160)
!168 = !DILocation(line: 48, column: 9, scope: !130)
!169 = !DILocation(line: 28, column: 37, scope: !123)
!170 = !DILocation(line: 28, column: 5, scope: !123)
!171 = distinct !{!171, !128, !172}
!172 = !DILocation(line: 49, column: 5, scope: !119)
!173 = !DILocation(line: 51, column: 9, scope: !174)
!174 = distinct !DILexicalBlock(scope: !86, file: !1, line: 51, column: 9)
!175 = !DILocation(line: 51, column: 11, scope: !174)
!176 = !DILocation(line: 51, column: 9, scope: !86)
!177 = !DILocation(line: 52, column: 17, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !1, line: 51, column: 17)
!179 = !DILocation(line: 52, column: 22, scope: !178)
!180 = !DILocation(line: 52, column: 30, scope: !178)
!181 = !DILocation(line: 52, column: 28, scope: !178)
!182 = !DILocation(line: 52, column: 14, scope: !178)
!183 = !DILocation(line: 53, column: 22, scope: !178)
!184 = !DILocation(line: 53, column: 16, scope: !178)
!185 = !DILocation(line: 53, column: 9, scope: !178)
!186 = !DILocation(line: 56, column: 5, scope: !86)
!187 = !DILocation(line: 57, column: 1, scope: !86)
!188 = distinct !DISubprogram(name: "ngx_inet6_addr", scope: !1, file: !1, line: 63, type: !189, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !194)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !31, !89, !31}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !67, line: 78, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !7, line: 140, baseType: !193)
!193 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!195 = !DILocalVariable(name: "p", arg: 1, scope: !188, file: !1, line: 63, type: !31)
!196 = !DILocalVariable(name: "len", arg: 2, scope: !188, file: !1, line: 63, type: !89)
!197 = !DILocalVariable(name: "addr", arg: 3, scope: !188, file: !1, line: 63, type: !31)
!198 = !DILocalVariable(name: "c", scope: !188, file: !1, line: 65, type: !9)
!199 = !DILocalVariable(name: "zero", scope: !188, file: !1, line: 65, type: !31)
!200 = !DILocalVariable(name: "digit", scope: !188, file: !1, line: 65, type: !31)
!201 = !DILocalVariable(name: "s", scope: !188, file: !1, line: 65, type: !31)
!202 = !DILocalVariable(name: "d", scope: !188, file: !1, line: 65, type: !31)
!203 = !DILocalVariable(name: "len4", scope: !188, file: !1, line: 66, type: !89)
!204 = !DILocalVariable(name: "n", scope: !188, file: !1, line: 67, type: !66)
!205 = !DILocalVariable(name: "nibbles", scope: !188, file: !1, line: 67, type: !66)
!206 = !DILocalVariable(name: "word", scope: !188, file: !1, line: 67, type: !66)
!207 = !DILocation(line: 63, column: 24, scope: !188)
!208 = !DILocation(line: 63, column: 34, scope: !188)
!209 = !DILocation(line: 63, column: 47, scope: !188)
!210 = !DILocation(line: 65, column: 5, scope: !188)
!211 = !DILocation(line: 65, column: 17, scope: !188)
!212 = !DILocation(line: 65, column: 21, scope: !188)
!213 = !DILocation(line: 65, column: 28, scope: !188)
!214 = !DILocation(line: 65, column: 36, scope: !188)
!215 = !DILocation(line: 65, column: 40, scope: !188)
!216 = !DILocation(line: 66, column: 5, scope: !188)
!217 = !DILocation(line: 66, column: 17, scope: !188)
!218 = !DILocation(line: 67, column: 5, scope: !188)
!219 = !DILocation(line: 67, column: 17, scope: !188)
!220 = !DILocation(line: 67, column: 20, scope: !188)
!221 = !DILocation(line: 67, column: 29, scope: !188)
!222 = !DILocation(line: 69, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !188, file: !1, line: 69, column: 9)
!224 = !DILocation(line: 69, column: 13, scope: !223)
!225 = !DILocation(line: 69, column: 9, scope: !188)
!226 = !DILocation(line: 70, column: 9, scope: !227)
!227 = distinct !DILexicalBlock(scope: !223, file: !1, line: 69, column: 19)
!228 = !DILocation(line: 73, column: 10, scope: !188)
!229 = !DILocation(line: 74, column: 11, scope: !188)
!230 = !DILocation(line: 75, column: 10, scope: !188)
!231 = !DILocation(line: 76, column: 13, scope: !188)
!232 = !DILocation(line: 77, column: 10, scope: !188)
!233 = !DILocation(line: 78, column: 7, scope: !188)
!234 = !DILocation(line: 80, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !188, file: !1, line: 80, column: 9)
!236 = !DILocation(line: 80, column: 14, scope: !235)
!237 = !DILocation(line: 80, column: 9, scope: !188)
!238 = !DILocation(line: 81, column: 10, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !1, line: 80, column: 22)
!240 = !DILocation(line: 82, column: 12, scope: !239)
!241 = !DILocation(line: 83, column: 5, scope: !239)
!242 = !DILocation(line: 85, column: 5, scope: !188)
!243 = !DILocation(line: 85, column: 22, scope: !244)
!244 = distinct !DILexicalBlock(scope: !245, file: !1, line: 85, column: 5)
!245 = distinct !DILexicalBlock(scope: !188, file: !1, line: 85, column: 5)
!246 = !DILocation(line: 85, column: 5, scope: !245)
!247 = !DILocation(line: 86, column: 15, scope: !248)
!248 = distinct !DILexicalBlock(scope: !244, file: !1, line: 85, column: 34)
!249 = !DILocation(line: 86, column: 13, scope: !248)
!250 = !DILocation(line: 86, column: 11, scope: !248)
!251 = !DILocation(line: 88, column: 13, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !1, line: 88, column: 13)
!253 = !DILocation(line: 88, column: 15, scope: !252)
!254 = !DILocation(line: 88, column: 13, scope: !248)
!255 = !DILocation(line: 89, column: 17, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !1, line: 89, column: 17)
!257 = distinct !DILexicalBlock(scope: !252, file: !1, line: 88, column: 23)
!258 = !DILocation(line: 89, column: 17, scope: !257)
!259 = !DILocation(line: 90, column: 25, scope: !260)
!260 = distinct !DILexicalBlock(scope: !256, file: !1, line: 89, column: 26)
!261 = !DILocation(line: 90, column: 23, scope: !260)
!262 = !DILocation(line: 91, column: 24, scope: !260)
!263 = !DILocation(line: 91, column: 22, scope: !260)
!264 = !DILocation(line: 92, column: 37, scope: !260)
!265 = !DILocation(line: 92, column: 42, scope: !260)
!266 = !DILocation(line: 92, column: 27, scope: !260)
!267 = !DILocation(line: 92, column: 22, scope: !260)
!268 = !DILocation(line: 92, column: 25, scope: !260)
!269 = !DILocation(line: 93, column: 37, scope: !260)
!270 = !DILocation(line: 93, column: 42, scope: !260)
!271 = !DILocation(line: 93, column: 27, scope: !260)
!272 = !DILocation(line: 93, column: 22, scope: !260)
!273 = !DILocation(line: 93, column: 25, scope: !260)
!274 = !DILocation(line: 95, column: 21, scope: !275)
!275 = distinct !DILexicalBlock(scope: !260, file: !1, line: 95, column: 21)
!276 = !DILocation(line: 95, column: 21, scope: !260)
!277 = !DILocation(line: 96, column: 29, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !1, line: 95, column: 26)
!279 = !DILocation(line: 97, column: 26, scope: !278)
!280 = !DILocation(line: 98, column: 21, scope: !278)
!281 = !DILocation(line: 101, column: 13, scope: !260)
!282 = !DILocation(line: 102, column: 21, scope: !283)
!283 = distinct !DILexicalBlock(scope: !284, file: !1, line: 102, column: 21)
!284 = distinct !DILexicalBlock(scope: !256, file: !1, line: 101, column: 20)
!285 = !DILocation(line: 102, column: 26, scope: !283)
!286 = !DILocation(line: 102, column: 21, scope: !284)
!287 = !DILocation(line: 103, column: 29, scope: !288)
!288 = distinct !DILexicalBlock(scope: !283, file: !1, line: 102, column: 35)
!289 = !DILocation(line: 103, column: 27, scope: !288)
!290 = !DILocation(line: 104, column: 28, scope: !288)
!291 = !DILocation(line: 104, column: 26, scope: !288)
!292 = !DILocation(line: 105, column: 28, scope: !288)
!293 = !DILocation(line: 105, column: 26, scope: !288)
!294 = !DILocation(line: 106, column: 21, scope: !288)
!295 = !DILocation(line: 110, column: 13, scope: !257)
!296 = !DILocation(line: 113, column: 13, scope: !297)
!297 = distinct !DILexicalBlock(scope: !248, file: !1, line: 113, column: 13)
!298 = !DILocation(line: 113, column: 15, scope: !297)
!299 = !DILocation(line: 113, column: 22, scope: !297)
!300 = !DILocation(line: 113, column: 25, scope: !297)
!301 = !DILocation(line: 113, column: 13, scope: !248)
!302 = !DILocation(line: 114, column: 17, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !1, line: 114, column: 17)
!304 = distinct !DILexicalBlock(scope: !297, file: !1, line: 113, column: 34)
!305 = !DILocation(line: 114, column: 19, scope: !303)
!306 = !DILocation(line: 114, column: 23, scope: !303)
!307 = !DILocation(line: 114, column: 26, scope: !303)
!308 = !DILocation(line: 114, column: 32, scope: !303)
!309 = !DILocation(line: 114, column: 17, scope: !304)
!310 = !DILocation(line: 115, column: 17, scope: !311)
!311 = distinct !DILexicalBlock(scope: !303, file: !1, line: 114, column: 41)
!312 = !DILocation(line: 118, column: 34, scope: !304)
!313 = !DILocation(line: 118, column: 41, scope: !304)
!314 = !DILocation(line: 118, column: 46, scope: !304)
!315 = !DILocation(line: 118, column: 20, scope: !304)
!316 = !DILocation(line: 118, column: 18, scope: !304)
!317 = !DILocation(line: 119, column: 17, scope: !318)
!318 = distinct !DILexicalBlock(scope: !304, file: !1, line: 119, column: 17)
!319 = !DILocation(line: 119, column: 22, scope: !318)
!320 = !DILocation(line: 119, column: 17, scope: !304)
!321 = !DILocation(line: 120, column: 17, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !1, line: 119, column: 38)
!323 = !DILocation(line: 123, column: 26, scope: !304)
!324 = !DILocation(line: 123, column: 20, scope: !304)
!325 = !DILocation(line: 123, column: 18, scope: !304)
!326 = !DILocation(line: 124, column: 34, scope: !304)
!327 = !DILocation(line: 124, column: 39, scope: !304)
!328 = !DILocation(line: 124, column: 46, scope: !304)
!329 = !DILocation(line: 124, column: 23, scope: !304)
!330 = !DILocation(line: 124, column: 18, scope: !304)
!331 = !DILocation(line: 124, column: 21, scope: !304)
!332 = !DILocation(line: 125, column: 34, scope: !304)
!333 = !DILocation(line: 125, column: 39, scope: !304)
!334 = !DILocation(line: 125, column: 46, scope: !304)
!335 = !DILocation(line: 125, column: 23, scope: !304)
!336 = !DILocation(line: 125, column: 18, scope: !304)
!337 = !DILocation(line: 125, column: 21, scope: !304)
!338 = !DILocation(line: 126, column: 14, scope: !304)
!339 = !DILocation(line: 127, column: 13, scope: !304)
!340 = !DILocation(line: 130, column: 13, scope: !341)
!341 = distinct !DILexicalBlock(scope: !248, file: !1, line: 130, column: 13)
!342 = !DILocation(line: 130, column: 23, scope: !341)
!343 = !DILocation(line: 130, column: 13, scope: !248)
!344 = !DILocation(line: 131, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !341, file: !1, line: 130, column: 28)
!346 = !DILocation(line: 134, column: 13, scope: !347)
!347 = distinct !DILexicalBlock(scope: !248, file: !1, line: 134, column: 13)
!348 = !DILocation(line: 134, column: 15, scope: !347)
!349 = !DILocation(line: 134, column: 22, scope: !347)
!350 = !DILocation(line: 134, column: 25, scope: !347)
!351 = !DILocation(line: 134, column: 27, scope: !347)
!352 = !DILocation(line: 134, column: 13, scope: !248)
!353 = !DILocation(line: 135, column: 20, scope: !354)
!354 = distinct !DILexicalBlock(scope: !347, file: !1, line: 134, column: 35)
!355 = !DILocation(line: 135, column: 25, scope: !354)
!356 = !DILocation(line: 135, column: 33, scope: !354)
!357 = !DILocation(line: 135, column: 35, scope: !354)
!358 = !DILocation(line: 135, column: 30, scope: !354)
!359 = !DILocation(line: 135, column: 18, scope: !354)
!360 = !DILocation(line: 136, column: 13, scope: !354)
!361 = !DILocation(line: 139, column: 11, scope: !248)
!362 = !DILocation(line: 141, column: 13, scope: !363)
!363 = distinct !DILexicalBlock(scope: !248, file: !1, line: 141, column: 13)
!364 = !DILocation(line: 141, column: 15, scope: !363)
!365 = !DILocation(line: 141, column: 22, scope: !363)
!366 = !DILocation(line: 141, column: 25, scope: !363)
!367 = !DILocation(line: 141, column: 27, scope: !363)
!368 = !DILocation(line: 141, column: 13, scope: !248)
!369 = !DILocation(line: 142, column: 20, scope: !370)
!370 = distinct !DILexicalBlock(scope: !363, file: !1, line: 141, column: 35)
!371 = !DILocation(line: 142, column: 25, scope: !370)
!372 = !DILocation(line: 142, column: 33, scope: !370)
!373 = !DILocation(line: 142, column: 35, scope: !370)
!374 = !DILocation(line: 142, column: 30, scope: !370)
!375 = !DILocation(line: 142, column: 42, scope: !370)
!376 = !DILocation(line: 142, column: 18, scope: !370)
!377 = !DILocation(line: 143, column: 13, scope: !370)
!378 = !DILocation(line: 146, column: 9, scope: !248)
!379 = !DILocation(line: 85, column: 30, scope: !244)
!380 = !DILocation(line: 85, column: 5, scope: !244)
!381 = distinct !{!381, !246, !382}
!382 = !DILocation(line: 147, column: 5, scope: !245)
!383 = !DILocation(line: 149, column: 9, scope: !384)
!384 = distinct !DILexicalBlock(scope: !188, file: !1, line: 149, column: 9)
!385 = !DILocation(line: 149, column: 17, scope: !384)
!386 = !DILocation(line: 149, column: 22, scope: !384)
!387 = !DILocation(line: 149, column: 25, scope: !384)
!388 = !DILocation(line: 149, column: 30, scope: !384)
!389 = !DILocation(line: 149, column: 9, scope: !188)
!390 = !DILocation(line: 150, column: 9, scope: !391)
!391 = distinct !DILexicalBlock(scope: !384, file: !1, line: 149, column: 39)
!392 = !DILocation(line: 153, column: 25, scope: !188)
!393 = !DILocation(line: 153, column: 30, scope: !188)
!394 = !DILocation(line: 153, column: 15, scope: !188)
!395 = !DILocation(line: 153, column: 10, scope: !188)
!396 = !DILocation(line: 153, column: 13, scope: !188)
!397 = !DILocation(line: 154, column: 25, scope: !188)
!398 = !DILocation(line: 154, column: 30, scope: !188)
!399 = !DILocation(line: 154, column: 15, scope: !188)
!400 = !DILocation(line: 154, column: 10, scope: !188)
!401 = !DILocation(line: 154, column: 13, scope: !188)
!402 = !DILocation(line: 156, column: 9, scope: !403)
!403 = distinct !DILexicalBlock(scope: !188, file: !1, line: 156, column: 9)
!404 = !DILocation(line: 156, column: 9, scope: !188)
!405 = !DILocation(line: 157, column: 13, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !1, line: 157, column: 13)
!407 = distinct !DILexicalBlock(scope: !403, file: !1, line: 156, column: 14)
!408 = !DILocation(line: 157, column: 13, scope: !407)
!409 = !DILocation(line: 158, column: 15, scope: !410)
!410 = distinct !DILexicalBlock(scope: !406, file: !1, line: 157, column: 19)
!411 = !DILocation(line: 159, column: 17, scope: !410)
!412 = !DILocation(line: 159, column: 22, scope: !410)
!413 = !DILocation(line: 159, column: 15, scope: !410)
!414 = !DILocation(line: 160, column: 17, scope: !410)
!415 = !DILocation(line: 160, column: 21, scope: !410)
!416 = !DILocation(line: 160, column: 19, scope: !410)
!417 = !DILocation(line: 160, column: 15, scope: !410)
!418 = !DILocation(line: 161, column: 13, scope: !410)
!419 = !DILocation(line: 161, column: 20, scope: !410)
!420 = !DILocation(line: 161, column: 25, scope: !410)
!421 = !DILocation(line: 161, column: 22, scope: !410)
!422 = !DILocation(line: 162, column: 26, scope: !423)
!423 = distinct !DILexicalBlock(scope: !410, file: !1, line: 161, column: 31)
!424 = !DILocation(line: 162, column: 24, scope: !423)
!425 = !DILocation(line: 162, column: 19, scope: !423)
!426 = !DILocation(line: 162, column: 22, scope: !423)
!427 = distinct !{!427, !418, !428}
!428 = !DILocation(line: 163, column: 13, scope: !410)
!429 = !DILocation(line: 164, column: 13, scope: !410)
!430 = !DILocation(line: 165, column: 13, scope: !410)
!431 = !DILocation(line: 168, column: 5, scope: !407)
!432 = !DILocation(line: 169, column: 13, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 169, column: 13)
!434 = distinct !DILexicalBlock(scope: !403, file: !1, line: 168, column: 12)
!435 = !DILocation(line: 169, column: 18, scope: !433)
!436 = !DILocation(line: 169, column: 13, scope: !434)
!437 = !DILocation(line: 170, column: 13, scope: !438)
!438 = distinct !DILexicalBlock(scope: !433, file: !1, line: 169, column: 27)
!439 = !DILocation(line: 174, column: 5, scope: !188)
!440 = !DILocation(line: 175, column: 1, scope: !188)
!441 = distinct !DISubprogram(name: "ngx_sock_ntop", scope: !1, file: !1, line: 181, type: !442, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!89, !72, !65, !31, !89, !66}
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!445 = !DILocalVariable(name: "sa", arg: 1, scope: !441, file: !1, line: 181, type: !72)
!446 = !DILocalVariable(name: "socklen", arg: 2, scope: !441, file: !1, line: 181, type: !65)
!447 = !DILocalVariable(name: "text", arg: 3, scope: !441, file: !1, line: 181, type: !31)
!448 = !DILocalVariable(name: "len", arg: 4, scope: !441, file: !1, line: 181, type: !89)
!449 = !DILocalVariable(name: "port", arg: 5, scope: !441, file: !1, line: 182, type: !66)
!450 = !DILocalVariable(name: "p", scope: !441, file: !1, line: 184, type: !31)
!451 = !DILocalVariable(name: "n", scope: !441, file: !1, line: 186, type: !89)
!452 = !DILocalVariable(name: "sin", scope: !441, file: !1, line: 188, type: !13)
!453 = !DILocalVariable(name: "sin6", scope: !441, file: !1, line: 190, type: !32)
!454 = !DILocalVariable(name: "saun", scope: !441, file: !1, line: 193, type: !55)
!455 = !DILocation(line: 181, column: 32, scope: !441)
!456 = !DILocation(line: 181, column: 46, scope: !441)
!457 = !DILocation(line: 181, column: 63, scope: !441)
!458 = !DILocation(line: 181, column: 76, scope: !441)
!459 = !DILocation(line: 182, column: 16, scope: !441)
!460 = !DILocation(line: 184, column: 5, scope: !441)
!461 = !DILocation(line: 184, column: 27, scope: !441)
!462 = !DILocation(line: 186, column: 5, scope: !441)
!463 = !DILocation(line: 186, column: 27, scope: !441)
!464 = !DILocation(line: 188, column: 5, scope: !441)
!465 = !DILocation(line: 188, column: 27, scope: !441)
!466 = !DILocation(line: 190, column: 5, scope: !441)
!467 = !DILocation(line: 190, column: 27, scope: !441)
!468 = !DILocation(line: 193, column: 5, scope: !441)
!469 = !DILocation(line: 193, column: 27, scope: !441)
!470 = !DILocation(line: 196, column: 13, scope: !441)
!471 = !DILocation(line: 196, column: 17, scope: !441)
!472 = !{!473, !474, i64 0}
!473 = !{!"sockaddr", !474, i64 0, !100, i64 2}
!474 = !{!"short", !100, i64 0}
!475 = !DILocation(line: 196, column: 5, scope: !441)
!476 = !DILocation(line: 200, column: 38, scope: !477)
!477 = distinct !DILexicalBlock(scope: !441, file: !1, line: 196, column: 28)
!478 = !DILocation(line: 200, column: 15, scope: !477)
!479 = !DILocation(line: 200, column: 13, scope: !477)
!480 = !DILocation(line: 201, column: 25, scope: !477)
!481 = !DILocation(line: 201, column: 30, scope: !477)
!482 = !DILocation(line: 201, column: 13, scope: !477)
!483 = !DILocation(line: 201, column: 11, scope: !477)
!484 = !DILocation(line: 203, column: 13, scope: !485)
!485 = distinct !DILexicalBlock(scope: !477, file: !1, line: 203, column: 13)
!486 = !DILocation(line: 203, column: 13, scope: !477)
!487 = !DILocation(line: 204, column: 30, scope: !488)
!488 = distinct !DILexicalBlock(scope: !485, file: !1, line: 203, column: 19)
!489 = !DILocation(line: 204, column: 36, scope: !488)
!490 = !DILocation(line: 205, column: 30, scope: !488)
!491 = !DILocation(line: 205, column: 36, scope: !488)
!492 = !DILocation(line: 205, column: 42, scope: !488)
!493 = !DILocation(line: 205, column: 48, scope: !488)
!494 = !DILocation(line: 205, column: 60, scope: !488)
!495 = !DILocation(line: 205, column: 65, scope: !488)
!496 = !{!497, !474, i64 2}
!497 = !{!"sockaddr_in", !474, i64 0, !474, i64 2, !498, i64 4, !100, i64 8}
!498 = !{!"in_addr", !105, i64 0}
!499 = !DILocation(line: 205, column: 54, scope: !488)
!500 = !DILocation(line: 204, column: 17, scope: !488)
!501 = !DILocation(line: 204, column: 15, scope: !488)
!502 = !DILocation(line: 206, column: 9, scope: !488)
!503 = !DILocation(line: 207, column: 30, scope: !504)
!504 = distinct !DILexicalBlock(scope: !485, file: !1, line: 206, column: 16)
!505 = !DILocation(line: 207, column: 36, scope: !504)
!506 = !DILocation(line: 208, column: 30, scope: !504)
!507 = !DILocation(line: 208, column: 36, scope: !504)
!508 = !DILocation(line: 208, column: 42, scope: !504)
!509 = !DILocation(line: 208, column: 48, scope: !504)
!510 = !DILocation(line: 207, column: 17, scope: !504)
!511 = !DILocation(line: 207, column: 15, scope: !504)
!512 = !DILocation(line: 211, column: 17, scope: !477)
!513 = !DILocation(line: 211, column: 21, scope: !477)
!514 = !DILocation(line: 211, column: 19, scope: !477)
!515 = !DILocation(line: 211, column: 9, scope: !477)
!516 = !DILocation(line: 217, column: 40, scope: !477)
!517 = !DILocation(line: 217, column: 16, scope: !477)
!518 = !DILocation(line: 217, column: 14, scope: !477)
!519 = !DILocation(line: 219, column: 11, scope: !477)
!520 = !DILocation(line: 221, column: 13, scope: !521)
!521 = distinct !DILexicalBlock(scope: !477, file: !1, line: 221, column: 13)
!522 = !DILocation(line: 221, column: 13, scope: !477)
!523 = !DILocation(line: 222, column: 13, scope: !524)
!524 = distinct !DILexicalBlock(scope: !521, file: !1, line: 221, column: 19)
!525 = !DILocation(line: 222, column: 19, scope: !524)
!526 = !DILocation(line: 222, column: 23, scope: !524)
!527 = !DILocation(line: 223, column: 9, scope: !524)
!528 = !DILocation(line: 225, column: 28, scope: !477)
!529 = !DILocation(line: 225, column: 34, scope: !477)
!530 = !DILocation(line: 225, column: 44, scope: !477)
!531 = !DILocation(line: 225, column: 54, scope: !477)
!532 = !DILocation(line: 225, column: 59, scope: !477)
!533 = !DILocation(line: 225, column: 63, scope: !477)
!534 = !DILocation(line: 225, column: 13, scope: !477)
!535 = !DILocation(line: 225, column: 11, scope: !477)
!536 = !DILocation(line: 227, column: 13, scope: !537)
!537 = distinct !DILexicalBlock(scope: !477, file: !1, line: 227, column: 13)
!538 = !DILocation(line: 227, column: 13, scope: !477)
!539 = !DILocation(line: 228, column: 30, scope: !540)
!540 = distinct !DILexicalBlock(scope: !537, file: !1, line: 227, column: 19)
!541 = !DILocation(line: 228, column: 39, scope: !540)
!542 = !DILocation(line: 228, column: 37, scope: !540)
!543 = !DILocation(line: 229, column: 35, scope: !540)
!544 = !DILocation(line: 229, column: 41, scope: !540)
!545 = !{!546, !474, i64 2}
!546 = !{!"sockaddr_in6", !474, i64 0, !474, i64 2, !105, i64 4, !547, i64 8, !105, i64 24}
!547 = !{!"in6_addr", !100, i64 0}
!548 = !DILocation(line: 229, column: 29, scope: !540)
!549 = !DILocation(line: 228, column: 17, scope: !540)
!550 = !DILocation(line: 229, column: 55, scope: !540)
!551 = !DILocation(line: 229, column: 53, scope: !540)
!552 = !DILocation(line: 228, column: 15, scope: !540)
!553 = !DILocation(line: 230, column: 9, scope: !540)
!554 = !DILocation(line: 232, column: 16, scope: !477)
!555 = !DILocation(line: 232, column: 9, scope: !477)
!556 = !DILocation(line: 238, column: 39, scope: !477)
!557 = !DILocation(line: 238, column: 16, scope: !477)
!558 = !DILocation(line: 238, column: 14, scope: !477)
!559 = !DILocation(line: 242, column: 13, scope: !560)
!560 = distinct !DILexicalBlock(scope: !477, file: !1, line: 242, column: 13)
!561 = !DILocation(line: 242, column: 21, scope: !560)
!562 = !DILocation(line: 242, column: 13, scope: !477)
!563 = !DILocation(line: 243, column: 30, scope: !564)
!564 = distinct !DILexicalBlock(scope: !560, file: !1, line: 242, column: 76)
!565 = !DILocation(line: 243, column: 36, scope: !564)
!566 = !DILocation(line: 243, column: 17, scope: !564)
!567 = !DILocation(line: 243, column: 15, scope: !564)
!568 = !DILocation(line: 245, column: 9, scope: !564)
!569 = !DILocation(line: 246, column: 40, scope: !570)
!570 = distinct !DILexicalBlock(scope: !560, file: !1, line: 245, column: 16)
!571 = !DILocation(line: 246, column: 46, scope: !570)
!572 = !DILocation(line: 247, column: 29, scope: !570)
!573 = !DILocation(line: 247, column: 37, scope: !570)
!574 = !DILocation(line: 246, column: 17, scope: !570)
!575 = !DILocation(line: 246, column: 15, scope: !570)
!576 = !DILocation(line: 248, column: 30, scope: !570)
!577 = !DILocation(line: 248, column: 36, scope: !570)
!578 = !DILocation(line: 248, column: 55, scope: !570)
!579 = !DILocation(line: 248, column: 58, scope: !570)
!580 = !DILocation(line: 248, column: 64, scope: !570)
!581 = !DILocation(line: 248, column: 17, scope: !570)
!582 = !DILocation(line: 248, column: 15, scope: !570)
!583 = !DILocation(line: 253, column: 17, scope: !477)
!584 = !DILocation(line: 253, column: 21, scope: !477)
!585 = !DILocation(line: 253, column: 19, scope: !477)
!586 = !DILocation(line: 253, column: 26, scope: !477)
!587 = !DILocation(line: 253, column: 9, scope: !477)
!588 = !DILocation(line: 258, column: 9, scope: !477)
!589 = !DILocation(line: 260, column: 1, scope: !441)
!590 = distinct !DISubprogram(name: "ngx_inet6_ntop", scope: !1, file: !1, line: 294, type: !591, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{!89, !31, !31, !89}
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602}
!594 = !DILocalVariable(name: "p", arg: 1, scope: !590, file: !1, line: 294, type: !31)
!595 = !DILocalVariable(name: "text", arg: 2, scope: !590, file: !1, line: 294, type: !31)
!596 = !DILocalVariable(name: "len", arg: 3, scope: !590, file: !1, line: 294, type: !89)
!597 = !DILocalVariable(name: "dst", scope: !590, file: !1, line: 296, type: !31)
!598 = !DILocalVariable(name: "max", scope: !590, file: !1, line: 297, type: !89)
!599 = !DILocalVariable(name: "n", scope: !590, file: !1, line: 297, type: !89)
!600 = !DILocalVariable(name: "i", scope: !590, file: !1, line: 298, type: !66)
!601 = !DILocalVariable(name: "zero", scope: !590, file: !1, line: 298, type: !66)
!602 = !DILocalVariable(name: "last", scope: !590, file: !1, line: 298, type: !66)
!603 = !DILocation(line: 294, column: 24, scope: !590)
!604 = !DILocation(line: 294, column: 35, scope: !590)
!605 = !DILocation(line: 294, column: 48, scope: !590)
!606 = !DILocation(line: 296, column: 5, scope: !590)
!607 = !DILocation(line: 296, column: 18, scope: !590)
!608 = !DILocation(line: 297, column: 5, scope: !590)
!609 = !DILocation(line: 297, column: 18, scope: !590)
!610 = !DILocation(line: 297, column: 23, scope: !590)
!611 = !DILocation(line: 298, column: 5, scope: !590)
!612 = !DILocation(line: 298, column: 18, scope: !590)
!613 = !DILocation(line: 298, column: 21, scope: !590)
!614 = !DILocation(line: 298, column: 27, scope: !590)
!615 = !DILocation(line: 300, column: 9, scope: !616)
!616 = distinct !DILexicalBlock(scope: !590, file: !1, line: 300, column: 9)
!617 = !DILocation(line: 300, column: 13, scope: !616)
!618 = !DILocation(line: 300, column: 9, scope: !590)
!619 = !DILocation(line: 301, column: 9, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !1, line: 300, column: 37)
!621 = !DILocation(line: 304, column: 10, scope: !590)
!622 = !DILocation(line: 305, column: 10, scope: !590)
!623 = !DILocation(line: 306, column: 9, scope: !590)
!624 = !DILocation(line: 307, column: 7, scope: !590)
!625 = !DILocation(line: 309, column: 12, scope: !626)
!626 = distinct !DILexicalBlock(scope: !590, file: !1, line: 309, column: 5)
!627 = !DILocation(line: 309, column: 10, scope: !626)
!628 = !DILocation(line: 309, column: 17, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !1, line: 309, column: 5)
!630 = !DILocation(line: 309, column: 19, scope: !629)
!631 = !DILocation(line: 309, column: 5, scope: !626)
!632 = !DILocation(line: 311, column: 13, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 311, column: 13)
!634 = distinct !DILexicalBlock(scope: !629, file: !1, line: 309, column: 33)
!635 = !DILocation(line: 311, column: 15, scope: !633)
!636 = !DILocation(line: 311, column: 18, scope: !633)
!637 = !DILocation(line: 311, column: 21, scope: !633)
!638 = !DILocation(line: 311, column: 23, scope: !633)
!639 = !DILocation(line: 311, column: 25, scope: !633)
!640 = !DILocation(line: 311, column: 13, scope: !634)
!641 = !DILocation(line: 313, column: 17, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 313, column: 17)
!643 = distinct !DILexicalBlock(scope: !633, file: !1, line: 311, column: 31)
!644 = !DILocation(line: 313, column: 23, scope: !642)
!645 = !DILocation(line: 313, column: 21, scope: !642)
!646 = !DILocation(line: 313, column: 17, scope: !643)
!647 = !DILocation(line: 314, column: 24, scope: !648)
!648 = distinct !DILexicalBlock(scope: !642, file: !1, line: 313, column: 26)
!649 = !DILocation(line: 314, column: 22, scope: !648)
!650 = !DILocation(line: 315, column: 23, scope: !648)
!651 = !DILocation(line: 315, column: 21, scope: !648)
!652 = !DILocation(line: 316, column: 13, scope: !648)
!653 = !DILocation(line: 318, column: 15, scope: !643)
!654 = !DILocation(line: 319, column: 13, scope: !643)
!655 = !DILocation(line: 322, column: 14, scope: !656)
!656 = distinct !DILexicalBlock(scope: !634, file: !1, line: 322, column: 13)
!657 = !DILocation(line: 322, column: 17, scope: !656)
!658 = !DILocation(line: 322, column: 13, scope: !634)
!659 = !DILocation(line: 323, column: 20, scope: !660)
!660 = distinct !DILexicalBlock(scope: !656, file: !1, line: 322, column: 23)
!661 = !DILocation(line: 323, column: 18, scope: !660)
!662 = !DILocation(line: 324, column: 9, scope: !660)
!663 = !DILocation(line: 325, column: 5, scope: !634)
!664 = !DILocation(line: 309, column: 27, scope: !629)
!665 = !DILocation(line: 309, column: 5, scope: !629)
!666 = distinct !{!666, !631, !667}
!667 = !DILocation(line: 325, column: 5, scope: !626)
!668 = !DILocation(line: 327, column: 9, scope: !669)
!669 = distinct !DILexicalBlock(scope: !590, file: !1, line: 327, column: 9)
!670 = !DILocation(line: 327, column: 15, scope: !669)
!671 = !DILocation(line: 327, column: 13, scope: !669)
!672 = !DILocation(line: 327, column: 9, scope: !590)
!673 = !DILocation(line: 328, column: 16, scope: !674)
!674 = distinct !DILexicalBlock(scope: !669, file: !1, line: 327, column: 18)
!675 = !DILocation(line: 328, column: 14, scope: !674)
!676 = !DILocation(line: 329, column: 15, scope: !674)
!677 = !DILocation(line: 329, column: 13, scope: !674)
!678 = !DILocation(line: 330, column: 5, scope: !674)
!679 = !DILocation(line: 332, column: 11, scope: !590)
!680 = !DILocation(line: 332, column: 9, scope: !590)
!681 = !DILocation(line: 333, column: 7, scope: !590)
!682 = !DILocation(line: 335, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !590, file: !1, line: 335, column: 9)
!684 = !DILocation(line: 335, column: 14, scope: !683)
!685 = !DILocation(line: 335, column: 9, scope: !590)
!686 = !DILocation(line: 337, column: 14, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !1, line: 337, column: 13)
!688 = distinct !DILexicalBlock(scope: !683, file: !1, line: 335, column: 20)
!689 = !DILocation(line: 337, column: 18, scope: !687)
!690 = !DILocation(line: 337, column: 23, scope: !687)
!691 = !DILocation(line: 337, column: 26, scope: !687)
!692 = !DILocation(line: 337, column: 32, scope: !687)
!693 = !DILocation(line: 337, column: 40, scope: !687)
!694 = !DILocation(line: 337, column: 43, scope: !687)
!695 = !DILocation(line: 337, column: 49, scope: !687)
!696 = !DILocation(line: 338, column: 13, scope: !687)
!697 = !DILocation(line: 338, column: 17, scope: !687)
!698 = !DILocation(line: 338, column: 21, scope: !687)
!699 = !DILocation(line: 339, column: 13, scope: !687)
!700 = !DILocation(line: 339, column: 17, scope: !687)
!701 = !DILocation(line: 339, column: 21, scope: !687)
!702 = !DILocation(line: 339, column: 26, scope: !687)
!703 = !DILocation(line: 339, column: 29, scope: !687)
!704 = !DILocation(line: 339, column: 35, scope: !687)
!705 = !DILocation(line: 339, column: 40, scope: !687)
!706 = !DILocation(line: 339, column: 43, scope: !687)
!707 = !DILocation(line: 339, column: 49, scope: !687)
!708 = !DILocation(line: 337, column: 13, scope: !688)
!709 = !DILocation(line: 341, column: 15, scope: !710)
!710 = distinct !DILexicalBlock(scope: !687, file: !1, line: 340, column: 9)
!711 = !DILocation(line: 342, column: 9, scope: !710)
!712 = !DILocation(line: 344, column: 13, scope: !688)
!713 = !DILocation(line: 344, column: 16, scope: !688)
!714 = !DILocation(line: 345, column: 5, scope: !688)
!715 = !DILocation(line: 347, column: 12, scope: !716)
!716 = distinct !DILexicalBlock(scope: !590, file: !1, line: 347, column: 5)
!717 = !DILocation(line: 347, column: 10, scope: !716)
!718 = !DILocation(line: 347, column: 17, scope: !719)
!719 = distinct !DILexicalBlock(scope: !716, file: !1, line: 347, column: 5)
!720 = !DILocation(line: 347, column: 21, scope: !719)
!721 = !DILocation(line: 347, column: 19, scope: !719)
!722 = !DILocation(line: 347, column: 5, scope: !716)
!723 = !DILocation(line: 349, column: 13, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 349, column: 13)
!725 = distinct !DILexicalBlock(scope: !719, file: !1, line: 347, column: 32)
!726 = !DILocation(line: 349, column: 18, scope: !724)
!727 = !DILocation(line: 349, column: 15, scope: !724)
!728 = !DILocation(line: 349, column: 13, scope: !725)
!729 = !DILocation(line: 350, column: 17, scope: !730)
!730 = distinct !DILexicalBlock(scope: !724, file: !1, line: 349, column: 24)
!731 = !DILocation(line: 350, column: 20, scope: !730)
!732 = !DILocation(line: 351, column: 19, scope: !730)
!733 = !DILocation(line: 351, column: 23, scope: !730)
!734 = !DILocation(line: 351, column: 28, scope: !730)
!735 = !DILocation(line: 351, column: 15, scope: !730)
!736 = !DILocation(line: 352, column: 13, scope: !730)
!737 = !DILocation(line: 355, column: 27, scope: !725)
!738 = !DILocation(line: 355, column: 39, scope: !725)
!739 = !DILocation(line: 355, column: 41, scope: !725)
!740 = !DILocation(line: 355, column: 44, scope: !725)
!741 = !DILocation(line: 355, column: 52, scope: !725)
!742 = !DILocation(line: 355, column: 54, scope: !725)
!743 = !DILocation(line: 355, column: 56, scope: !725)
!744 = !DILocation(line: 355, column: 50, scope: !725)
!745 = !DILocation(line: 355, column: 15, scope: !725)
!746 = !DILocation(line: 355, column: 13, scope: !725)
!747 = !DILocation(line: 357, column: 13, scope: !748)
!748 = distinct !DILexicalBlock(scope: !725, file: !1, line: 357, column: 13)
!749 = !DILocation(line: 357, column: 15, scope: !748)
!750 = !DILocation(line: 357, column: 13, scope: !725)
!751 = !DILocation(line: 358, column: 17, scope: !752)
!752 = distinct !DILexicalBlock(scope: !748, file: !1, line: 357, column: 21)
!753 = !DILocation(line: 358, column: 20, scope: !752)
!754 = !DILocation(line: 359, column: 9, scope: !752)
!755 = !DILocation(line: 360, column: 5, scope: !725)
!756 = !DILocation(line: 347, column: 26, scope: !719)
!757 = !DILocation(line: 347, column: 5, scope: !719)
!758 = distinct !{!758, !722, !759}
!759 = !DILocation(line: 360, column: 5, scope: !716)
!760 = !DILocation(line: 362, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !590, file: !1, line: 362, column: 9)
!762 = !DILocation(line: 362, column: 11, scope: !761)
!763 = !DILocation(line: 362, column: 9, scope: !590)
!764 = !DILocation(line: 363, column: 27, scope: !765)
!765 = distinct !DILexicalBlock(scope: !761, file: !1, line: 362, column: 18)
!766 = !DILocation(line: 363, column: 51, scope: !765)
!767 = !DILocation(line: 363, column: 58, scope: !765)
!768 = !DILocation(line: 363, column: 65, scope: !765)
!769 = !DILocation(line: 363, column: 72, scope: !765)
!770 = !DILocation(line: 363, column: 15, scope: !765)
!771 = !DILocation(line: 363, column: 13, scope: !765)
!772 = !DILocation(line: 364, column: 5, scope: !765)
!773 = !DILocation(line: 366, column: 12, scope: !590)
!774 = !DILocation(line: 366, column: 18, scope: !590)
!775 = !DILocation(line: 366, column: 16, scope: !590)
!776 = !DILocation(line: 366, column: 5, scope: !590)
!777 = !DILocation(line: 367, column: 1, scope: !590)
!778 = distinct !DISubprogram(name: "ngx_inet_ntop", scope: !1, file: !1, line: 264, type: !779, isLocal: false, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!89, !193, !12, !31, !89}
!781 = !{!782, !783, !784, !785, !786}
!782 = !DILocalVariable(name: "family", arg: 1, scope: !778, file: !1, line: 264, type: !193)
!783 = !DILocalVariable(name: "addr", arg: 2, scope: !778, file: !1, line: 264, type: !12)
!784 = !DILocalVariable(name: "text", arg: 3, scope: !778, file: !1, line: 264, type: !31)
!785 = !DILocalVariable(name: "len", arg: 4, scope: !778, file: !1, line: 264, type: !89)
!786 = !DILocalVariable(name: "p", scope: !778, file: !1, line: 266, type: !31)
!787 = !DILocation(line: 264, column: 19, scope: !778)
!788 = !DILocation(line: 264, column: 33, scope: !778)
!789 = !DILocation(line: 264, column: 47, scope: !778)
!790 = !DILocation(line: 264, column: 60, scope: !778)
!791 = !DILocation(line: 266, column: 5, scope: !778)
!792 = !DILocation(line: 266, column: 14, scope: !778)
!793 = !DILocation(line: 268, column: 13, scope: !778)
!794 = !DILocation(line: 268, column: 5, scope: !778)
!795 = !DILocation(line: 272, column: 13, scope: !796)
!796 = distinct !DILexicalBlock(scope: !778, file: !1, line: 268, column: 21)
!797 = !DILocation(line: 272, column: 11, scope: !796)
!798 = !DILocation(line: 274, column: 29, scope: !796)
!799 = !DILocation(line: 274, column: 35, scope: !796)
!800 = !DILocation(line: 275, column: 29, scope: !796)
!801 = !DILocation(line: 275, column: 35, scope: !796)
!802 = !DILocation(line: 275, column: 41, scope: !796)
!803 = !DILocation(line: 275, column: 47, scope: !796)
!804 = !DILocation(line: 274, column: 16, scope: !796)
!805 = !DILocation(line: 276, column: 18, scope: !796)
!806 = !DILocation(line: 276, column: 16, scope: !796)
!807 = !DILocation(line: 274, column: 9, scope: !796)
!808 = !DILocation(line: 281, column: 31, scope: !796)
!809 = !DILocation(line: 281, column: 37, scope: !796)
!810 = !DILocation(line: 281, column: 43, scope: !796)
!811 = !DILocation(line: 281, column: 16, scope: !796)
!812 = !DILocation(line: 281, column: 9, scope: !796)
!813 = !DILocation(line: 286, column: 9, scope: !796)
!814 = !DILocation(line: 288, column: 1, scope: !778)
!815 = distinct !DISubprogram(name: "ngx_ptocidr", scope: !1, file: !1, line: 373, type: !816, isLocal: false, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !846)
!816 = !DISubroutineType(types: !817)
!817 = !{!191, !818, !825}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !820, line: 19, baseType: !821)
!820 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 16, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !821, file: !820, line: 17, baseType: !89, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !821, file: !820, line: 18, baseType: !31, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cidr_t", file: !827, line: 71, baseType: !828)
!827 = !DIFile(filename: "src/core/ngx_inet.h", directory: "/home/sam/Projects/nginx-1.12.2")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 63, size: 288, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !828, file: !827, line: 64, baseType: !66, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !828, file: !827, line: 70, baseType: !832, size: 256, offset: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !828, file: !827, line: 65, size: 256, elements: !833)
!833 = !{!834, !840}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !832, file: !827, line: 66, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_in_cidr_t", file: !827, line: 50, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 47, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !836, file: !827, line: 48, baseType: !4, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !836, file: !827, line: 49, baseType: !4, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !832, file: !827, line: 68, baseType: !841, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_in6_cidr_t", file: !827, line: 58, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !827, line: 55, size: 256, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !842, file: !827, line: 56, baseType: !39, size: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !842, file: !827, line: 57, baseType: !39, size: 128, offset: 128)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!847 = !DILocalVariable(name: "text", arg: 1, scope: !815, file: !1, line: 373, type: !818)
!848 = !DILocalVariable(name: "cidr", arg: 2, scope: !815, file: !1, line: 373, type: !825)
!849 = !DILocalVariable(name: "addr", scope: !815, file: !1, line: 375, type: !31)
!850 = !DILocalVariable(name: "mask", scope: !815, file: !1, line: 375, type: !31)
!851 = !DILocalVariable(name: "last", scope: !815, file: !1, line: 375, type: !31)
!852 = !DILocalVariable(name: "len", scope: !815, file: !1, line: 376, type: !89)
!853 = !DILocalVariable(name: "shift", scope: !815, file: !1, line: 377, type: !191)
!854 = !DILocalVariable(name: "rc", scope: !815, file: !1, line: 379, type: !191)
!855 = !DILocalVariable(name: "s", scope: !815, file: !1, line: 380, type: !66)
!856 = !DILocalVariable(name: "i", scope: !815, file: !1, line: 380, type: !66)
!857 = !DILocation(line: 373, column: 24, scope: !815)
!858 = !DILocation(line: 373, column: 42, scope: !815)
!859 = !DILocation(line: 375, column: 5, scope: !815)
!860 = !DILocation(line: 375, column: 18, scope: !815)
!861 = !DILocation(line: 375, column: 25, scope: !815)
!862 = !DILocation(line: 375, column: 32, scope: !815)
!863 = !DILocation(line: 376, column: 5, scope: !815)
!864 = !DILocation(line: 376, column: 18, scope: !815)
!865 = !DILocation(line: 377, column: 5, scope: !815)
!866 = !DILocation(line: 377, column: 18, scope: !815)
!867 = !DILocation(line: 379, column: 5, scope: !815)
!868 = !DILocation(line: 379, column: 18, scope: !815)
!869 = !DILocation(line: 380, column: 5, scope: !815)
!870 = !DILocation(line: 380, column: 18, scope: !815)
!871 = !DILocation(line: 380, column: 21, scope: !815)
!872 = !DILocation(line: 383, column: 12, scope: !815)
!873 = !DILocation(line: 383, column: 18, scope: !815)
!874 = !{!875, !99, i64 4}
!875 = !{!"", !105, i64 0, !99, i64 4}
!876 = !DILocation(line: 383, column: 10, scope: !815)
!877 = !DILocation(line: 384, column: 12, scope: !815)
!878 = !DILocation(line: 384, column: 19, scope: !815)
!879 = !DILocation(line: 384, column: 25, scope: !815)
!880 = !{!875, !105, i64 0}
!881 = !DILocation(line: 384, column: 17, scope: !815)
!882 = !DILocation(line: 384, column: 10, scope: !815)
!883 = !DILocation(line: 386, column: 24, scope: !815)
!884 = !DILocation(line: 386, column: 30, scope: !815)
!885 = !DILocation(line: 386, column: 12, scope: !815)
!886 = !DILocation(line: 386, column: 10, scope: !815)
!887 = !DILocation(line: 387, column: 12, scope: !815)
!888 = !DILocation(line: 387, column: 19, scope: !815)
!889 = !DILocation(line: 387, column: 26, scope: !815)
!890 = !DILocation(line: 387, column: 34, scope: !815)
!891 = !DILocation(line: 387, column: 32, scope: !815)
!892 = !DILocation(line: 387, column: 9, scope: !815)
!893 = !DILocation(line: 389, column: 37, scope: !815)
!894 = !DILocation(line: 389, column: 43, scope: !815)
!895 = !DILocation(line: 389, column: 23, scope: !815)
!896 = !DILocation(line: 389, column: 5, scope: !815)
!897 = !DILocation(line: 389, column: 11, scope: !815)
!898 = !DILocation(line: 389, column: 13, scope: !815)
!899 = !DILocation(line: 389, column: 16, scope: !815)
!900 = !DILocation(line: 389, column: 21, scope: !815)
!901 = !{!902, !105, i64 0}
!902 = !{!"", !105, i64 0, !105, i64 4}
!903 = !DILocation(line: 391, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !815, file: !1, line: 391, column: 9)
!905 = !DILocation(line: 391, column: 15, scope: !904)
!906 = !DILocation(line: 391, column: 17, scope: !904)
!907 = !DILocation(line: 391, column: 20, scope: !904)
!908 = !DILocation(line: 391, column: 25, scope: !904)
!909 = !DILocation(line: 391, column: 9, scope: !815)
!910 = !DILocation(line: 392, column: 9, scope: !911)
!911 = distinct !DILexicalBlock(scope: !904, file: !1, line: 391, column: 41)
!912 = !DILocation(line: 392, column: 15, scope: !911)
!913 = !DILocation(line: 392, column: 22, scope: !911)
!914 = !{!915, !105, i64 0}
!915 = !{!"", !105, i64 0, !100, i64 4}
!916 = !DILocation(line: 394, column: 13, scope: !917)
!917 = distinct !DILexicalBlock(scope: !911, file: !1, line: 394, column: 13)
!918 = !DILocation(line: 394, column: 18, scope: !917)
!919 = !DILocation(line: 394, column: 13, scope: !911)
!920 = !DILocation(line: 395, column: 13, scope: !921)
!921 = distinct !DILexicalBlock(scope: !917, file: !1, line: 394, column: 27)
!922 = !DILocation(line: 395, column: 19, scope: !921)
!923 = !DILocation(line: 395, column: 21, scope: !921)
!924 = !DILocation(line: 395, column: 24, scope: !921)
!925 = !DILocation(line: 395, column: 29, scope: !921)
!926 = !{!902, !105, i64 4}
!927 = !DILocation(line: 396, column: 13, scope: !921)
!928 = !DILocation(line: 400, column: 5, scope: !911)
!929 = !DILocation(line: 400, column: 31, scope: !930)
!930 = distinct !DILexicalBlock(scope: !904, file: !1, line: 400, column: 16)
!931 = !DILocation(line: 400, column: 37, scope: !930)
!932 = !DILocation(line: 400, column: 42, scope: !930)
!933 = !DILocation(line: 400, column: 48, scope: !930)
!934 = !DILocation(line: 400, column: 50, scope: !930)
!935 = !DILocation(line: 400, column: 54, scope: !930)
!936 = !DILocation(line: 400, column: 59, scope: !930)
!937 = !DILocation(line: 400, column: 16, scope: !930)
!938 = !DILocation(line: 400, column: 68, scope: !930)
!939 = !DILocation(line: 400, column: 16, scope: !904)
!940 = !DILocation(line: 401, column: 9, scope: !941)
!941 = distinct !DILexicalBlock(scope: !930, file: !1, line: 400, column: 79)
!942 = !DILocation(line: 401, column: 15, scope: !941)
!943 = !DILocation(line: 401, column: 22, scope: !941)
!944 = !DILocation(line: 403, column: 13, scope: !945)
!945 = distinct !DILexicalBlock(scope: !941, file: !1, line: 403, column: 13)
!946 = !DILocation(line: 403, column: 18, scope: !945)
!947 = !DILocation(line: 403, column: 13, scope: !941)
!948 = !DILocation(line: 404, column: 13, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !1, line: 403, column: 27)
!950 = !DILocation(line: 405, column: 13, scope: !949)
!951 = !DILocation(line: 409, column: 5, scope: !941)
!952 = !DILocation(line: 410, column: 9, scope: !953)
!953 = distinct !DILexicalBlock(scope: !930, file: !1, line: 409, column: 12)
!954 = !DILocation(line: 413, column: 9, scope: !815)
!955 = !DILocation(line: 415, column: 22, scope: !815)
!956 = !DILocation(line: 415, column: 28, scope: !815)
!957 = !DILocation(line: 415, column: 35, scope: !815)
!958 = !DILocation(line: 415, column: 33, scope: !815)
!959 = !DILocation(line: 415, column: 13, scope: !815)
!960 = !DILocation(line: 415, column: 11, scope: !815)
!961 = !DILocation(line: 416, column: 9, scope: !962)
!962 = distinct !DILexicalBlock(scope: !815, file: !1, line: 416, column: 9)
!963 = !DILocation(line: 416, column: 15, scope: !962)
!964 = !DILocation(line: 416, column: 9, scope: !815)
!965 = !DILocation(line: 417, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !962, file: !1, line: 416, column: 29)
!967 = !DILocation(line: 420, column: 13, scope: !815)
!968 = !DILocation(line: 420, column: 19, scope: !815)
!969 = !DILocation(line: 420, column: 5, scope: !815)
!970 = !DILocation(line: 424, column: 13, scope: !971)
!971 = distinct !DILexicalBlock(scope: !972, file: !1, line: 424, column: 13)
!972 = distinct !DILexicalBlock(scope: !815, file: !1, line: 420, column: 27)
!973 = !DILocation(line: 424, column: 19, scope: !971)
!974 = !DILocation(line: 424, column: 13, scope: !972)
!975 = !DILocation(line: 425, column: 13, scope: !976)
!976 = distinct !DILexicalBlock(scope: !971, file: !1, line: 424, column: 26)
!977 = !DILocation(line: 428, column: 16, scope: !972)
!978 = !DILocation(line: 428, column: 22, scope: !972)
!979 = !DILocation(line: 428, column: 24, scope: !972)
!980 = !DILocation(line: 428, column: 28, scope: !972)
!981 = !DILocation(line: 428, column: 33, scope: !972)
!982 = !DILocation(line: 428, column: 14, scope: !972)
!983 = !DILocation(line: 429, column: 16, scope: !972)
!984 = !DILocation(line: 429, column: 22, scope: !972)
!985 = !DILocation(line: 429, column: 24, scope: !972)
!986 = !DILocation(line: 429, column: 28, scope: !972)
!987 = !DILocation(line: 429, column: 33, scope: !972)
!988 = !DILocation(line: 429, column: 14, scope: !972)
!989 = !DILocation(line: 430, column: 12, scope: !972)
!990 = !DILocation(line: 432, column: 16, scope: !991)
!991 = distinct !DILexicalBlock(scope: !972, file: !1, line: 432, column: 9)
!992 = !DILocation(line: 432, column: 14, scope: !991)
!993 = !DILocation(line: 432, column: 21, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !1, line: 432, column: 9)
!995 = !DILocation(line: 432, column: 23, scope: !994)
!996 = !DILocation(line: 432, column: 9, scope: !991)
!997 = !DILocation(line: 434, column: 18, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !1, line: 432, column: 34)
!999 = !DILocation(line: 434, column: 24, scope: !998)
!1000 = !DILocation(line: 434, column: 17, scope: !998)
!1001 = !DILocation(line: 434, column: 35, scope: !998)
!1002 = !DILocation(line: 434, column: 15, scope: !998)
!1003 = !DILocation(line: 435, column: 22, scope: !998)
!1004 = !DILocation(line: 435, column: 19, scope: !998)
!1005 = !DILocation(line: 437, column: 47, scope: !998)
!1006 = !DILocation(line: 437, column: 45, scope: !998)
!1007 = !DILocation(line: 437, column: 39, scope: !998)
!1008 = !DILocation(line: 437, column: 23, scope: !998)
!1009 = !DILocation(line: 437, column: 13, scope: !998)
!1010 = !DILocation(line: 437, column: 18, scope: !998)
!1011 = !DILocation(line: 437, column: 21, scope: !998)
!1012 = !DILocation(line: 439, column: 17, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !998, file: !1, line: 439, column: 17)
!1014 = !DILocation(line: 439, column: 22, scope: !1013)
!1015 = !DILocation(line: 439, column: 29, scope: !1013)
!1016 = !DILocation(line: 439, column: 34, scope: !1013)
!1017 = !DILocation(line: 439, column: 39, scope: !1013)
!1018 = !DILocation(line: 439, column: 44, scope: !1013)
!1019 = !DILocation(line: 439, column: 37, scope: !1013)
!1020 = !DILocation(line: 439, column: 25, scope: !1013)
!1021 = !DILocation(line: 439, column: 17, scope: !998)
!1022 = !DILocation(line: 440, column: 20, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 439, column: 49)
!1024 = !DILocation(line: 441, column: 28, scope: !1023)
!1025 = !DILocation(line: 441, column: 33, scope: !1023)
!1026 = !DILocation(line: 441, column: 17, scope: !1023)
!1027 = !DILocation(line: 441, column: 22, scope: !1023)
!1028 = !DILocation(line: 441, column: 25, scope: !1023)
!1029 = !DILocation(line: 442, column: 13, scope: !1023)
!1030 = !DILocation(line: 443, column: 9, scope: !998)
!1031 = !DILocation(line: 432, column: 30, scope: !994)
!1032 = !DILocation(line: 432, column: 9, scope: !994)
!1033 = distinct !{!1033, !996, !1034}
!1034 = !DILocation(line: 443, column: 9, scope: !991)
!1035 = !DILocation(line: 445, column: 16, scope: !972)
!1036 = !DILocation(line: 445, column: 9, scope: !972)
!1037 = !DILocation(line: 449, column: 13, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !972, file: !1, line: 449, column: 13)
!1039 = !DILocation(line: 449, column: 19, scope: !1038)
!1040 = !DILocation(line: 449, column: 13, scope: !972)
!1041 = !DILocation(line: 450, column: 13, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 449, column: 25)
!1043 = !DILocation(line: 453, column: 13, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !972, file: !1, line: 453, column: 13)
!1045 = !DILocation(line: 453, column: 13, scope: !972)
!1046 = !DILocation(line: 454, column: 70, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 453, column: 20)
!1048 = !DILocation(line: 454, column: 68, scope: !1047)
!1049 = !DILocation(line: 454, column: 61, scope: !1047)
!1050 = !DILocation(line: 454, column: 31, scope: !1047)
!1051 = !DILocation(line: 454, column: 13, scope: !1047)
!1052 = !DILocation(line: 454, column: 19, scope: !1047)
!1053 = !DILocation(line: 454, column: 21, scope: !1047)
!1054 = !DILocation(line: 454, column: 24, scope: !1047)
!1055 = !DILocation(line: 454, column: 29, scope: !1047)
!1056 = !DILocation(line: 456, column: 9, scope: !1047)
!1057 = !DILocation(line: 458, column: 13, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 456, column: 16)
!1059 = !DILocation(line: 458, column: 19, scope: !1058)
!1060 = !DILocation(line: 458, column: 21, scope: !1058)
!1061 = !DILocation(line: 458, column: 24, scope: !1058)
!1062 = !DILocation(line: 458, column: 29, scope: !1058)
!1063 = !DILocation(line: 461, column: 13, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !972, file: !1, line: 461, column: 13)
!1065 = !DILocation(line: 461, column: 19, scope: !1064)
!1066 = !DILocation(line: 461, column: 21, scope: !1064)
!1067 = !DILocation(line: 461, column: 24, scope: !1064)
!1068 = !DILocation(line: 461, column: 33, scope: !1064)
!1069 = !DILocation(line: 461, column: 39, scope: !1064)
!1070 = !DILocation(line: 461, column: 41, scope: !1064)
!1071 = !DILocation(line: 461, column: 44, scope: !1064)
!1072 = !DILocation(line: 461, column: 51, scope: !1064)
!1073 = !DILocation(line: 461, column: 57, scope: !1064)
!1074 = !DILocation(line: 461, column: 59, scope: !1064)
!1075 = !DILocation(line: 461, column: 62, scope: !1064)
!1076 = !DILocation(line: 461, column: 49, scope: !1064)
!1077 = !DILocation(line: 461, column: 29, scope: !1064)
!1078 = !DILocation(line: 461, column: 13, scope: !972)
!1079 = !DILocation(line: 462, column: 13, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 461, column: 69)
!1081 = !DILocation(line: 465, column: 28, scope: !972)
!1082 = !DILocation(line: 465, column: 34, scope: !972)
!1083 = !DILocation(line: 465, column: 36, scope: !972)
!1084 = !DILocation(line: 465, column: 39, scope: !972)
!1085 = !DILocation(line: 465, column: 9, scope: !972)
!1086 = !DILocation(line: 465, column: 15, scope: !972)
!1087 = !DILocation(line: 465, column: 17, scope: !972)
!1088 = !DILocation(line: 465, column: 20, scope: !972)
!1089 = !DILocation(line: 465, column: 25, scope: !972)
!1090 = !DILocation(line: 467, column: 9, scope: !972)
!1091 = !DILocation(line: 469, column: 1, scope: !815)
!1092 = distinct !DISubprogram(name: "ngx_strlchr", scope: !820, file: !820, line: 68, type: !1093, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!31, !31, !31, !9}
!1095 = !{!1096, !1097, !1098}
!1096 = !DILocalVariable(name: "p", arg: 1, scope: !1092, file: !820, line: 68, type: !31)
!1097 = !DILocalVariable(name: "last", arg: 2, scope: !1092, file: !820, line: 68, type: !31)
!1098 = !DILocalVariable(name: "c", arg: 3, scope: !1092, file: !820, line: 68, type: !9)
!1099 = !DILocation(line: 68, column: 21, scope: !1092)
!1100 = !DILocation(line: 68, column: 32, scope: !1092)
!1101 = !DILocation(line: 68, column: 45, scope: !1092)
!1102 = !DILocation(line: 70, column: 5, scope: !1092)
!1103 = !DILocation(line: 70, column: 12, scope: !1092)
!1104 = !DILocation(line: 70, column: 16, scope: !1092)
!1105 = !DILocation(line: 70, column: 14, scope: !1092)
!1106 = !DILocation(line: 72, column: 14, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !820, line: 72, column: 13)
!1108 = distinct !DILexicalBlock(scope: !1092, file: !820, line: 70, column: 22)
!1109 = !DILocation(line: 72, column: 13, scope: !1107)
!1110 = !DILocation(line: 72, column: 19, scope: !1107)
!1111 = !DILocation(line: 72, column: 16, scope: !1107)
!1112 = !DILocation(line: 72, column: 13, scope: !1108)
!1113 = !DILocation(line: 73, column: 20, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1107, file: !820, line: 72, column: 22)
!1115 = !DILocation(line: 73, column: 13, scope: !1114)
!1116 = !DILocation(line: 76, column: 10, scope: !1108)
!1117 = distinct !{!1117, !1102, !1118}
!1118 = !DILocation(line: 77, column: 5, scope: !1092)
!1119 = !DILocation(line: 79, column: 5, scope: !1092)
!1120 = !DILocation(line: 80, column: 1, scope: !1092)
!1121 = distinct !DISubprogram(name: "ngx_cidr_match", scope: !1, file: !1, line: 473, type: !1122, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1302)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!191, !72, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !1126, line: 22, baseType: !1127)
!1126 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1126, line: 16, size: 160, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1127, file: !1126, line: 17, baseType: !12, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !1127, file: !1126, line: 18, baseType: !66, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !1126, line: 19, baseType: !89, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !1127, file: !1126, line: 20, baseType: !66, size: 32, offset: 96)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1127, file: !1126, line: 21, baseType: !1134, size: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !1136, line: 18, baseType: !1137)
!1136 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !1138, line: 57, size: 320, elements: !1139)
!1138 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1139 = !{!1140, !1148, !1149, !1150, !1282, !1289, !1301}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !1137, file: !1138, line: 58, baseType: !1141, size: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !1138, line: 54, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1138, line: 49, size: 128, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1142, file: !1138, line: 50, baseType: !31, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1142, file: !1138, line: 51, baseType: !31, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1142, file: !1138, line: 52, baseType: !1134, size: 32, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !1142, file: !1138, line: 53, baseType: !66, size: 32, offset: 96)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1137, file: !1138, line: 59, baseType: !89, size: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1137, file: !1138, line: 60, baseType: !1134, size: 32, offset: 160)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1137, file: !1138, line: 61, baseType: !1151, size: 32, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !1136, line: 19, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !1154, line: 59, size: 64, elements: !1155)
!1154 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1155 = !{!1156, !1281}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !1154, line: 60, baseType: !1157, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 32)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !1154, line: 18, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !1154, line: 20, size: 352, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1165, !1166, !1167, !1168, !1170, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1159, file: !1154, line: 21, baseType: !31, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1159, file: !1154, line: 22, baseType: !31, size: 32, offset: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !1159, file: !1154, line: 23, baseType: !1164, size: 32, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !7, line: 222, baseType: !193)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !1159, file: !1154, line: 24, baseType: !1164, size: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1159, file: !1154, line: 26, baseType: !31, size: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1159, file: !1154, line: 27, baseType: !31, size: 32, offset: 160)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1159, file: !1154, line: 28, baseType: !1169, size: 32, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !1154, line: 16, baseType: !12)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1159, file: !1154, line: 29, baseType: !1171, size: 32, offset: 224)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !1136, line: 23, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !1174, line: 16, size: 1216, elements: !1175)
!1174 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1175 = !{!1176, !1179, !1180, !1225, !1226, !1227, !1266, !1267}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1173, file: !1174, line: 17, baseType: !1177, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !1178, line: 16, baseType: !193)
!1178 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1173, file: !1174, line: 18, baseType: !819, size: 64, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1173, file: !1174, line: 19, baseType: !1181, size: 960, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !1178, line: 17, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1183, line: 4, size: 960, elements: !1184)
!1183 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1184 = !{!1185, !1187, !1188, !1190, !1191, !1193, !1194, !1196, !1198, !1200, !1201, !1202, !1203, !1204, !1205, !1208, !1209, !1211, !1212, !1218, !1219, !1220}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1182, file: !1183, line: 6, baseType: !1186, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !7, line: 232, baseType: !8)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !1182, file: !1183, line: 7, baseType: !1186, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1182, file: !1183, line: 8, baseType: !1189, size: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !7, line: 227, baseType: !8)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !1182, file: !1183, line: 9, baseType: !1189, size: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1182, file: !1183, line: 10, baseType: !1192, size: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !7, line: 217, baseType: !8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !1182, file: !1183, line: 11, baseType: !1192, size: 32, offset: 160)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1182, file: !1183, line: 13, baseType: !1195, size: 32, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !7, line: 212, baseType: !8)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1182, file: !1183, line: 14, baseType: !1197, size: 32, offset: 224)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !7, line: 304, baseType: !8)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1182, file: !1183, line: 15, baseType: !1199, size: 32, offset: 256)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !7, line: 309, baseType: !8)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1182, file: !1183, line: 16, baseType: !8, size: 32, offset: 288)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1182, file: !1183, line: 17, baseType: !1186, size: 32, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !1182, file: !1183, line: 18, baseType: !1186, size: 32, offset: 352)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1182, file: !1183, line: 19, baseType: !1164, size: 32, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !1182, file: !1183, line: 20, baseType: !1164, size: 32, offset: 416)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1182, file: !1183, line: 21, baseType: !1206, size: 32, offset: 448)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !7, line: 237, baseType: !1207)
!1207 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !1182, file: !1183, line: 22, baseType: !1206, size: 32, offset: 480)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1182, file: !1183, line: 23, baseType: !1210, size: 32, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !7, line: 242, baseType: !193)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !1182, file: !1183, line: 24, baseType: !1210, size: 32, offset: 544)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1182, file: !1183, line: 26, baseType: !1213, size: 64, offset: 576)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !7, line: 288, size: 64, elements: !1214)
!1214 = !{!1215, !1217}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1213, file: !7, line: 288, baseType: !1216, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !7, line: 75, baseType: !1207)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1213, file: !7, line: 288, baseType: !1207, size: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1182, file: !1183, line: 27, baseType: !1213, size: 64, offset: 640)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1182, file: !1183, line: 28, baseType: !1213, size: 64, offset: 704)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !1182, file: !1183, line: 29, baseType: !1221, size: 192, offset: 768)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 192, elements: !1223)
!1222 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1223 = !{!1224}
!1224 = !DISubrange(count: 3)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1173, file: !1174, line: 21, baseType: !1164, size: 32, offset: 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !1173, file: !1174, line: 22, baseType: !1164, size: 32, offset: 1120)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1173, file: !1174, line: 24, baseType: !1228, size: 32, offset: 1152)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !1136, line: 20, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !1231, line: 50, size: 320, elements: !1232)
!1231 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1232 = !{!1233, !1234, !1247, !1251, !1252, !1257, !1258, !1263, !1264, !1265}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1230, file: !1231, line: 51, baseType: !66, size: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1230, file: !1231, line: 52, baseType: !1235, size: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !1136, line: 21, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !1238, line: 89, size: 160, elements: !1239)
!1238 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1239 = !{!1240, !1241, !1242, !1246}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1237, file: !1238, line: 90, baseType: !1177, size: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1237, file: !1238, line: 91, baseType: !819, size: 64, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1237, file: !1238, line: 93, baseType: !1243, size: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 32)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !1235, !1228}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !1238, line: 94, baseType: !12, size: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !1230, file: !1231, line: 54, baseType: !1248, size: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !1249, line: 98, baseType: !1250)
!1249 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!1250 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !1230, file: !1231, line: 56, baseType: !1216, size: 32, offset: 96)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1230, file: !1231, line: 58, baseType: !1253, size: 32, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !1231, line: 45, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 32)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!31, !1228, !31, !89}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1230, file: !1231, line: 59, baseType: !12, size: 32, offset: 160)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !1230, file: !1231, line: 61, baseType: !1259, size: 32, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !1231, line: 46, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 32)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !1228, !66, !31, !89}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !1230, file: !1231, line: 62, baseType: !12, size: 32, offset: 224)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1230, file: !1231, line: 70, baseType: !71, size: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1230, file: !1231, line: 72, baseType: !1228, size: 32, offset: 288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !1173, file: !1174, line: 37, baseType: !8, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !1173, file: !1174, line: 38, baseType: !8, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !1159, file: !1154, line: 30, baseType: !1157, size: 32, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1159, file: !1154, line: 34, baseType: !8, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1159, file: !1154, line: 40, baseType: !8, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !1159, file: !1154, line: 43, baseType: !8, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !1159, file: !1154, line: 45, baseType: !8, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !1159, file: !1154, line: 46, baseType: !8, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1159, file: !1154, line: 47, baseType: !8, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !1159, file: !1154, line: 48, baseType: !8, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !1159, file: !1154, line: 49, baseType: !8, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !1159, file: !1154, line: 50, baseType: !8, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !1159, file: !1154, line: 52, baseType: !8, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !1159, file: !1154, line: 53, baseType: !8, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1159, file: !1154, line: 55, baseType: !193, size: 32, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !1154, line: 61, baseType: !1151, size: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !1137, file: !1138, line: 62, baseType: !1283, size: 32, offset: 224)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !1138, line: 41, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !1138, line: 43, size: 64, elements: !1286)
!1286 = !{!1287, !1288}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1285, file: !1138, line: 44, baseType: !1283, size: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1285, file: !1138, line: 45, baseType: !12, size: 32, offset: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1137, file: !1138, line: 63, baseType: !1290, size: 32, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !1138, line: 32, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !1138, line: 34, size: 96, elements: !1293)
!1293 = !{!1294, !1299, !1300}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1292, file: !1138, line: 35, baseType: !1295, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !1138, line: 30, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 32)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{null, !12}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1292, file: !1138, line: 36, baseType: !12, size: 32, offset: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1292, file: !1138, line: 37, baseType: !1290, size: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1137, file: !1138, line: 64, baseType: !1228, size: 32, offset: 288)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1303 = !DILocalVariable(name: "sa", arg: 1, scope: !1121, file: !1, line: 473, type: !72)
!1304 = !DILocalVariable(name: "cidrs", arg: 2, scope: !1121, file: !1, line: 473, type: !1124)
!1305 = !DILocalVariable(name: "p", scope: !1121, file: !1, line: 476, type: !31)
!1306 = !DILocalVariable(name: "inaddr", scope: !1121, file: !1, line: 478, type: !4)
!1307 = !DILocalVariable(name: "cidr", scope: !1121, file: !1, line: 479, type: !825)
!1308 = !DILocalVariable(name: "family", scope: !1121, file: !1, line: 480, type: !66)
!1309 = !DILocalVariable(name: "i", scope: !1121, file: !1, line: 480, type: !66)
!1310 = !DILocalVariable(name: "n", scope: !1121, file: !1, line: 482, type: !66)
!1311 = !DILocalVariable(name: "inaddr6", scope: !1121, file: !1, line: 483, type: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!1313 = !DILocation(line: 473, column: 33, scope: !1121)
!1314 = !DILocation(line: 473, column: 50, scope: !1121)
!1315 = !DILocation(line: 476, column: 5, scope: !1121)
!1316 = !DILocation(line: 476, column: 23, scope: !1121)
!1317 = !DILocation(line: 478, column: 5, scope: !1121)
!1318 = !DILocation(line: 478, column: 23, scope: !1121)
!1319 = !DILocation(line: 479, column: 5, scope: !1121)
!1320 = !DILocation(line: 479, column: 23, scope: !1121)
!1321 = !DILocation(line: 480, column: 5, scope: !1121)
!1322 = !DILocation(line: 480, column: 23, scope: !1121)
!1323 = !DILocation(line: 480, column: 31, scope: !1121)
!1324 = !DILocation(line: 482, column: 5, scope: !1121)
!1325 = !DILocation(line: 482, column: 23, scope: !1121)
!1326 = !DILocation(line: 483, column: 5, scope: !1121)
!1327 = !DILocation(line: 483, column: 23, scope: !1121)
!1328 = !DILocation(line: 487, column: 12, scope: !1121)
!1329 = !DILocation(line: 489, column: 13, scope: !1121)
!1330 = !DILocation(line: 493, column: 14, scope: !1121)
!1331 = !DILocation(line: 493, column: 18, scope: !1121)
!1332 = !DILocation(line: 493, column: 12, scope: !1121)
!1333 = !DILocation(line: 495, column: 9, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 495, column: 9)
!1335 = !DILocation(line: 495, column: 16, scope: !1334)
!1336 = !DILocation(line: 495, column: 9, scope: !1121)
!1337 = !DILocation(line: 496, column: 42, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1334, file: !1, line: 495, column: 28)
!1339 = !DILocation(line: 496, column: 47, scope: !1338)
!1340 = !DILocation(line: 496, column: 56, scope: !1338)
!1341 = !{!497, !105, i64 4}
!1342 = !DILocation(line: 496, column: 16, scope: !1338)
!1343 = !DILocation(line: 497, column: 5, scope: !1338)
!1344 = !DILocation(line: 500, column: 14, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1334, file: !1, line: 500, column: 14)
!1346 = !DILocation(line: 500, column: 21, scope: !1345)
!1347 = !DILocation(line: 500, column: 14, scope: !1334)
!1348 = !DILocation(line: 501, column: 45, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1345, file: !1, line: 500, column: 34)
!1350 = !DILocation(line: 501, column: 50, scope: !1349)
!1351 = !DILocation(line: 501, column: 17, scope: !1349)
!1352 = !DILocation(line: 503, column: 13, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1349, file: !1, line: 503, column: 13)
!1354 = !DILocation(line: 503, column: 13, scope: !1349)
!1355 = !DILocation(line: 504, column: 20, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1353, file: !1, line: 503, column: 44)
!1357 = !DILocation(line: 506, column: 17, scope: !1356)
!1358 = !DILocation(line: 506, column: 26, scope: !1356)
!1359 = !DILocation(line: 506, column: 15, scope: !1356)
!1360 = !DILocation(line: 508, column: 22, scope: !1356)
!1361 = !DILocation(line: 508, column: 28, scope: !1356)
!1362 = !DILocation(line: 508, column: 20, scope: !1356)
!1363 = !DILocation(line: 509, column: 23, scope: !1356)
!1364 = !DILocation(line: 509, column: 29, scope: !1356)
!1365 = !DILocation(line: 509, column: 20, scope: !1356)
!1366 = !DILocation(line: 510, column: 23, scope: !1356)
!1367 = !DILocation(line: 510, column: 29, scope: !1356)
!1368 = !DILocation(line: 510, column: 20, scope: !1356)
!1369 = !DILocation(line: 511, column: 23, scope: !1356)
!1370 = !DILocation(line: 511, column: 20, scope: !1356)
!1371 = !DILocation(line: 513, column: 28, scope: !1356)
!1372 = !DILocation(line: 513, column: 22, scope: !1356)
!1373 = !DILocation(line: 513, column: 20, scope: !1356)
!1374 = !DILocation(line: 514, column: 9, scope: !1356)
!1375 = !DILocation(line: 515, column: 5, scope: !1349)
!1376 = !DILocation(line: 518, column: 17, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 518, column: 5)
!1378 = !DILocation(line: 518, column: 24, scope: !1377)
!1379 = !{!1380, !99, i64 0}
!1380 = !{!"", !99, i64 0, !105, i64 4, !105, i64 8, !105, i64 12, !99, i64 16}
!1381 = !DILocation(line: 518, column: 15, scope: !1377)
!1382 = !DILocation(line: 518, column: 32, scope: !1377)
!1383 = !DILocation(line: 518, column: 10, scope: !1377)
!1384 = !DILocation(line: 518, column: 37, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1377, file: !1, line: 518, column: 5)
!1386 = !DILocation(line: 518, column: 41, scope: !1385)
!1387 = !DILocation(line: 518, column: 48, scope: !1385)
!1388 = !{!1380, !105, i64 4}
!1389 = !DILocation(line: 518, column: 39, scope: !1385)
!1390 = !DILocation(line: 518, column: 5, scope: !1377)
!1391 = !DILocation(line: 519, column: 13, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1393, file: !1, line: 519, column: 13)
!1393 = distinct !DILexicalBlock(scope: !1385, file: !1, line: 518, column: 60)
!1394 = !DILocation(line: 519, column: 18, scope: !1392)
!1395 = !DILocation(line: 519, column: 21, scope: !1392)
!1396 = !DILocation(line: 519, column: 31, scope: !1392)
!1397 = !DILocation(line: 519, column: 28, scope: !1392)
!1398 = !DILocation(line: 519, column: 13, scope: !1393)
!1399 = !DILocation(line: 520, column: 13, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1392, file: !1, line: 519, column: 39)
!1401 = !DILocation(line: 523, column: 17, scope: !1393)
!1402 = !DILocation(line: 523, column: 9, scope: !1393)
!1403 = !DILocation(line: 527, column: 20, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1405, file: !1, line: 527, column: 13)
!1405 = distinct !DILexicalBlock(scope: !1393, file: !1, line: 523, column: 25)
!1406 = !DILocation(line: 527, column: 18, scope: !1404)
!1407 = !DILocation(line: 527, column: 25, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 527, column: 13)
!1409 = !DILocation(line: 527, column: 27, scope: !1408)
!1410 = !DILocation(line: 527, column: 13, scope: !1404)
!1411 = !DILocation(line: 528, column: 22, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1413, file: !1, line: 528, column: 21)
!1413 = distinct !DILexicalBlock(scope: !1408, file: !1, line: 527, column: 38)
!1414 = !DILocation(line: 528, column: 31, scope: !1412)
!1415 = !DILocation(line: 528, column: 39, scope: !1412)
!1416 = !DILocation(line: 528, column: 44, scope: !1412)
!1417 = !DILocation(line: 528, column: 49, scope: !1412)
!1418 = !DILocation(line: 528, column: 52, scope: !1412)
!1419 = !DILocation(line: 528, column: 54, scope: !1412)
!1420 = !DILocation(line: 528, column: 58, scope: !1412)
!1421 = !DILocation(line: 528, column: 63, scope: !1412)
!1422 = !DILocation(line: 528, column: 71, scope: !1412)
!1423 = !DILocation(line: 528, column: 42, scope: !1412)
!1424 = !DILocation(line: 529, column: 24, scope: !1412)
!1425 = !DILocation(line: 529, column: 29, scope: !1412)
!1426 = !DILocation(line: 529, column: 32, scope: !1412)
!1427 = !DILocation(line: 529, column: 34, scope: !1412)
!1428 = !DILocation(line: 529, column: 38, scope: !1412)
!1429 = !DILocation(line: 529, column: 43, scope: !1412)
!1430 = !DILocation(line: 529, column: 51, scope: !1412)
!1431 = !DILocation(line: 529, column: 21, scope: !1412)
!1432 = !DILocation(line: 528, column: 21, scope: !1413)
