; ModuleID = 'src/core/ngx_times.c'
source_filename = "src/core/ngx_times.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_time_t = type { i32, i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8* }
%struct.timeval = type { i32, i32 }

@ngx_cached_err_log_time = common global %struct.ngx_str_t zeroinitializer, align 4, !dbg !0
@ngx_cached_http_time = common global %struct.ngx_str_t zeroinitializer, align 4, !dbg !45
@ngx_cached_http_log_time = common global %struct.ngx_str_t zeroinitializer, align 4, !dbg !59
@ngx_cached_http_log_iso8601 = common global %struct.ngx_str_t zeroinitializer, align 4, !dbg !61
@ngx_cached_syslog_time = common global %struct.ngx_str_t zeroinitializer, align 4, !dbg !63
@cached_time = internal global [64 x %struct.ngx_time_t] zeroinitializer, align 4, !dbg !67
@ngx_cached_time = common global %struct.ngx_time_t* null, align 4, !dbg !32
@ngx_time_lock = internal global i32 0, align 4, !dbg !22
@ngx_current_msec = common global i32 0, align 4, !dbg !29
@slot = internal global i32 0, align 4, !dbg !20
@cached_http_time = internal global [64 x [30 x i8]] zeroinitializer, align 1, !dbg !77
@.str = private unnamed_addr constant [35 x i8] c"%s, %02d %s %4d %02d:%02d:%02d GMT\00", align 1

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_cached_err_log_time", scope: !2, file: !3, line: 28, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !19)
!3 = !DIFile(filename: "src/core/ngx_times.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !16, !11, !18}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !8, line: 16, baseType: !9)
!8 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !10, line: 16, baseType: !11)
!10 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !12, line: 79, baseType: !13)
!12 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !14, line: 125, baseType: !15)
!14 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !12, line: 78, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !14, line: 140, baseType: !18)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !{!20, !22, !29, !32, !0, !45, !59, !61, !63, !65, !67, !72, !77, !82, !87, !92, !97, !104}
!20 = !DIGlobalVariableExpression(var: !21)
!21 = distinct !DIGlobalVariable(name: "slot", scope: !2, file: !3, line: 23, type: !11, isLocal: true, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23)
!23 = distinct !DIGlobalVariable(name: "ngx_time_lock", scope: !2, file: !3, line: 24, type: !24, isLocal: true, isDefinition: true)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_t", file: !25, line: 106, baseType: !26)
!25 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!26 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !25, line: 98, baseType: !28)
!28 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIGlobalVariableExpression(var: !30)
!30 = distinct !DIGlobalVariable(name: "ngx_current_msec", scope: !2, file: !3, line: 26, type: !31, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!32 = !DIGlobalVariableExpression(var: !33)
!33 = distinct !DIGlobalVariable(name: "ngx_cached_time", scope: !2, file: !3, line: 27, type: !34, isLocal: false, isDefinition: true)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_time_t", file: !37, line: 20, baseType: !38)
!37 = !DIFile(filename: "src/core/ngx_times.h", directory: "/home/sam/Projects/nginx-1.12.2")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 16, size: 96, elements: !39)
!39 = !{!40, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !38, file: !37, line: 17, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !14, line: 75, baseType: !42)
!42 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "msec", scope: !38, file: !37, line: 18, baseType: !11, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "gmtoff", scope: !38, file: !37, line: 19, baseType: !16, size: 32, offset: 64)
!45 = !DIGlobalVariableExpression(var: !46)
!46 = distinct !DIGlobalVariable(name: "ngx_cached_http_time", scope: !2, file: !3, line: 29, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !49, line: 19, baseType: !50)
!49 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 16, size: 64, elements: !51)
!51 = !{!52, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !50, file: !49, line: 17, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 120, baseType: !15)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !49, line: 18, baseType: !55, size: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !57, line: 64, baseType: !58)
!57 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIGlobalVariableExpression(var: !60)
!60 = distinct !DIGlobalVariable(name: "ngx_cached_http_log_time", scope: !2, file: !3, line: 30, type: !47, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62)
!62 = distinct !DIGlobalVariable(name: "ngx_cached_http_log_iso8601", scope: !2, file: !3, line: 31, type: !47, isLocal: false, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64)
!64 = distinct !DIGlobalVariable(name: "ngx_cached_syslog_time", scope: !2, file: !3, line: 32, type: !47, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66)
!66 = distinct !DIGlobalVariable(name: "cached_gmtoff", scope: !2, file: !3, line: 42, type: !16, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68)
!68 = distinct !DIGlobalVariable(name: "cached_time", scope: !2, file: !3, line: 45, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 6144, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 64)
!72 = !DIGlobalVariableExpression(var: !73)
!73 = distinct !DIGlobalVariable(name: "cached_err_log_time", scope: !2, file: !3, line: 46, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 10240, elements: !75)
!75 = !{!71, !76}
!76 = !DISubrange(count: 20)
!77 = !DIGlobalVariableExpression(var: !78)
!78 = distinct !DIGlobalVariable(name: "cached_http_time", scope: !2, file: !3, line: 48, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 15360, elements: !80)
!80 = !{!71, !81}
!81 = !DISubrange(count: 30)
!82 = !DIGlobalVariableExpression(var: !83)
!83 = distinct !DIGlobalVariable(name: "cached_http_log_time", scope: !2, file: !3, line: 50, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 13824, elements: !85)
!85 = !{!71, !86}
!86 = !DISubrange(count: 27)
!87 = !DIGlobalVariableExpression(var: !88)
!88 = distinct !DIGlobalVariable(name: "cached_http_log_iso8601", scope: !2, file: !3, line: 52, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 13312, elements: !90)
!90 = !{!71, !91}
!91 = !DISubrange(count: 26)
!92 = !DIGlobalVariableExpression(var: !93)
!93 = distinct !DIGlobalVariable(name: "cached_syslog_time", scope: !2, file: !3, line: 54, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8192, elements: !95)
!95 = !{!71, !96}
!96 = !DISubrange(count: 16)
!97 = !DIGlobalVariableExpression(var: !98)
!98 = distinct !DIGlobalVariable(name: "week", scope: !2, file: !3, line: 58, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 224, elements: !102)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !{!103}
!103 = !DISubrange(count: 7)
!104 = !DIGlobalVariableExpression(var: !105)
!105 = distinct !DIGlobalVariable(name: "months", scope: !2, file: !3, line: 59, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 384, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 12)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!112 = distinct !DISubprogram(name: "ngx_time_init", scope: !3, file: !3, line: 63, type: !113, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !4)
!113 = !DISubroutineType(types: !114)
!114 = !{null}
!115 = !DILocation(line: 65, column: 33, scope: !112)
!116 = !{!117, !118, i64 0}
!117 = !{!"", !118, i64 0, !121, i64 4}
!118 = !{!"int", !119, i64 0}
!119 = !{!"omnipotent char", !120, i64 0}
!120 = !{!"Simple C/C++ TBAA"}
!121 = !{!"any pointer", !119, i64 0}
!122 = !DILocation(line: 66, column: 30, scope: !112)
!123 = !DILocation(line: 67, column: 34, scope: !112)
!124 = !DILocation(line: 68, column: 37, scope: !112)
!125 = !DILocation(line: 69, column: 32, scope: !112)
!126 = !DILocation(line: 71, column: 21, scope: !112)
!127 = !{!121, !121, i64 0}
!128 = !DILocation(line: 73, column: 5, scope: !112)
!129 = !DILocation(line: 74, column: 1, scope: !112)
!130 = distinct !DISubprogram(name: "ngx_time_update", scope: !3, file: !3, line: 78, type: !113, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !155, !156, !157, !158, !160}
!132 = !DILocalVariable(name: "p0", scope: !130, file: !3, line: 80, type: !55)
!133 = !DILocalVariable(name: "p1", scope: !130, file: !3, line: 80, type: !55)
!134 = !DILocalVariable(name: "p2", scope: !130, file: !3, line: 80, type: !55)
!135 = !DILocalVariable(name: "p3", scope: !130, file: !3, line: 80, type: !55)
!136 = !DILocalVariable(name: "p4", scope: !130, file: !3, line: 80, type: !55)
!137 = !DILocalVariable(name: "tm", scope: !130, file: !3, line: 81, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_tm_t", file: !8, line: 19, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !140, line: 38, size: 352, elements: !141)
!140 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !139, file: !140, line: 39, baseType: !18, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !139, file: !140, line: 40, baseType: !18, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !139, file: !140, line: 41, baseType: !18, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !139, file: !140, line: 42, baseType: !18, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !139, file: !140, line: 43, baseType: !18, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !139, file: !140, line: 44, baseType: !18, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !139, file: !140, line: 45, baseType: !18, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !139, file: !140, line: 46, baseType: !18, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !139, file: !140, line: 47, baseType: !18, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !139, file: !140, line: 48, baseType: !42, size: 32, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !139, file: !140, line: 49, baseType: !153, size: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!155 = !DILocalVariable(name: "gmt", scope: !130, file: !3, line: 81, type: !138)
!156 = !DILocalVariable(name: "sec", scope: !130, file: !3, line: 82, type: !41)
!157 = !DILocalVariable(name: "msec", scope: !130, file: !3, line: 83, type: !11)
!158 = !DILocalVariable(name: "tp", scope: !130, file: !3, line: 84, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!160 = !DILocalVariable(name: "tv", scope: !130, file: !3, line: 85, type: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !14, line: 283, size: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !161, file: !14, line: 283, baseType: !41, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !161, file: !14, line: 283, baseType: !165, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !14, line: 80, baseType: !42)
!166 = !DILocation(line: 80, column: 5, scope: !130)
!167 = !DIExpression()
!168 = !DILocation(line: 80, column: 22, scope: !130)
!169 = !DILocation(line: 80, column: 27, scope: !130)
!170 = !DILocation(line: 80, column: 32, scope: !130)
!171 = !DILocation(line: 80, column: 37, scope: !130)
!172 = !DILocation(line: 80, column: 42, scope: !130)
!173 = !DILocation(line: 81, column: 5, scope: !130)
!174 = !DILocation(line: 81, column: 22, scope: !130)
!175 = !DILocation(line: 81, column: 26, scope: !130)
!176 = !DILocation(line: 82, column: 5, scope: !130)
!177 = !DILocation(line: 82, column: 22, scope: !130)
!178 = !DILocation(line: 83, column: 5, scope: !130)
!179 = !DILocation(line: 83, column: 22, scope: !130)
!180 = !DILocation(line: 84, column: 5, scope: !130)
!181 = !DILocation(line: 84, column: 22, scope: !130)
!182 = !DILocation(line: 85, column: 5, scope: !130)
!183 = !DILocation(line: 85, column: 22, scope: !130)
!184 = !DILocation(line: 87, column: 10, scope: !185)
!185 = distinct !DILexicalBlock(scope: !130, file: !3, line: 87, column: 9)
!186 = !{!187, !187, i64 0}
!187 = !{!"long", !119, i64 0}
!188 = !DILocation(line: 87, column: 9, scope: !130)
!189 = !DILocation(line: 88, column: 9, scope: !190)
!190 = distinct !DILexicalBlock(scope: !185, file: !3, line: 87, column: 39)
!191 = !DILocation(line: 91, column: 5, scope: !130)
!192 = !DILocation(line: 93, column: 14, scope: !130)
!193 = !{!194, !187, i64 0}
!194 = !{!"timeval", !187, i64 0, !187, i64 4}
!195 = !DILocation(line: 93, column: 9, scope: !130)
!196 = !DILocation(line: 94, column: 15, scope: !130)
!197 = !{!194, !187, i64 4}
!198 = !DILocation(line: 94, column: 23, scope: !130)
!199 = !DILocation(line: 94, column: 10, scope: !130)
!200 = !{!118, !118, i64 0}
!201 = !DILocation(line: 96, column: 37, scope: !130)
!202 = !DILocation(line: 96, column: 41, scope: !130)
!203 = !DILocation(line: 96, column: 50, scope: !130)
!204 = !DILocation(line: 96, column: 48, scope: !130)
!205 = !DILocation(line: 96, column: 22, scope: !130)
!206 = !DILocation(line: 98, column: 23, scope: !130)
!207 = !DILocation(line: 98, column: 11, scope: !130)
!208 = !DILocation(line: 98, column: 8, scope: !130)
!209 = !DILocation(line: 100, column: 9, scope: !210)
!210 = distinct !DILexicalBlock(scope: !130, file: !3, line: 100, column: 9)
!211 = !DILocation(line: 100, column: 13, scope: !210)
!212 = !{!213, !187, i64 0}
!213 = !{!"", !187, i64 0, !118, i64 4, !118, i64 8}
!214 = !DILocation(line: 100, column: 20, scope: !210)
!215 = !DILocation(line: 100, column: 17, scope: !210)
!216 = !DILocation(line: 100, column: 9, scope: !130)
!217 = !DILocation(line: 101, column: 20, scope: !218)
!218 = distinct !DILexicalBlock(scope: !210, file: !3, line: 100, column: 25)
!219 = !DILocation(line: 101, column: 9, scope: !218)
!220 = !DILocation(line: 101, column: 13, scope: !218)
!221 = !DILocation(line: 101, column: 18, scope: !218)
!222 = !{!213, !118, i64 4}
!223 = !DILocation(line: 102, column: 9, scope: !218)
!224 = !DILocation(line: 103, column: 9, scope: !218)
!225 = !DILocation(line: 106, column: 9, scope: !226)
!226 = distinct !DILexicalBlock(scope: !130, file: !3, line: 106, column: 9)
!227 = !DILocation(line: 106, column: 14, scope: !226)
!228 = !DILocation(line: 106, column: 9, scope: !130)
!229 = !DILocation(line: 107, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !3, line: 106, column: 37)
!231 = !DILocation(line: 108, column: 5, scope: !230)
!232 = !DILocation(line: 109, column: 13, scope: !233)
!233 = distinct !DILexicalBlock(scope: !226, file: !3, line: 108, column: 12)
!234 = !DILocation(line: 112, column: 23, scope: !130)
!235 = !DILocation(line: 112, column: 11, scope: !130)
!236 = !DILocation(line: 112, column: 8, scope: !130)
