; ModuleID = 'src/core/ngx_string.c'
source_filename = "src/core/ngx_string.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_cycle_s = type { i8****, %struct.ngx_pool_s*, %struct.ngx_log_s*, %struct.ngx_log_s, i32, %struct.ngx_connection_s**, %struct.ngx_connection_s*, i32, %struct.ngx_module_s**, i32, i32, %struct.ngx_queue_s, i32, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_array_t, %struct.ngx_rbtree_s, %struct.ngx_rbtree_node_s, %struct.ngx_list_t, %struct.ngx_list_t, i32, i32, %struct.ngx_connection_s*, %struct.ngx_event_s*, %struct.ngx_event_s*, %struct.ngx_cycle_s*, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t, %struct.ngx_str_t }
%struct.ngx_pool_s = type { %struct.ngx_pool_data_t, i32, %struct.ngx_pool_s*, %struct.ngx_chain_s*, %struct.ngx_pool_large_s*, %struct.ngx_pool_cleanup_s*, %struct.ngx_log_s* }
%struct.ngx_pool_data_t = type { i8*, i8*, %struct.ngx_pool_s*, i32 }
%struct.ngx_chain_s = type { %struct.ngx_buf_s*, %struct.ngx_chain_s* }
%struct.ngx_buf_s = type { i8*, i8*, i32, i32, i8*, i8*, i8*, %struct.ngx_file_s*, %struct.ngx_buf_s*, i16, i32 }
%struct.ngx_file_s = type { i32, %struct.ngx_str_t, %struct.stat, i32, i32, %struct.ngx_log_s*, i8 }
%struct.stat = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "hex", scope: !2, file: !3, line: 1126, type: !129, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ngx_hex_dump", scope: !3, file: !3, line: 1124, type: !4, isLocal: false, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !173)
!3 = !DIFile(filename: "src/core/ngx_string.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !6, !10}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !8, line: 64, baseType: !9)
!8 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 120, baseType: !12)
!11 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !38, globals: !80)
!14 = !{!15}
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !16, file: !3, line: 1613, size: 32, elements: !34)
!16 = distinct !DISubprogram(name: "ngx_unescape_uri", scope: !3, file: !3, line: 1610, type: !17, isLocal: false, isDefinition: true, scopeLine: 1611, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !23)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !19, !10, !20}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !21, line: 79, baseType: !22)
!21 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !11, line: 125, baseType: !12)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!24 = !DILocalVariable(name: "dst", arg: 1, scope: !16, file: !3, line: 1610, type: !19)
!25 = !DILocalVariable(name: "src", arg: 2, scope: !16, file: !3, line: 1610, type: !19)
!26 = !DILocalVariable(name: "size", arg: 3, scope: !16, file: !3, line: 1610, type: !10)
!27 = !DILocalVariable(name: "type", arg: 4, scope: !16, file: !3, line: 1610, type: !20)
!28 = !DILocalVariable(name: "d", scope: !16, file: !3, line: 1612, type: !6)
!29 = !DILocalVariable(name: "s", scope: !16, file: !3, line: 1612, type: !6)
!30 = !DILocalVariable(name: "ch", scope: !16, file: !3, line: 1612, type: !7)
!31 = !DILocalVariable(name: "c", scope: !16, file: !3, line: 1612, type: !7)
!32 = !DILocalVariable(name: "decoded", scope: !16, file: !3, line: 1612, type: !7)
!33 = !DILocalVariable(name: "state", scope: !16, file: !3, line: 1617, type: !15)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "sw_usual", value: 0)
!36 = !DIEnumerator(name: "sw_quoted", value: 1)
!37 = !DIEnumerator(name: "sw_quoted_second", value: 2)
!38 = !{!7, !39, !10, !6, !40, !42, !46, !51, !53, !22, !20, !54, !57, !79}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !11, line: 171, baseType: !41)
!41 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !43, line: 16, baseType: !44)
!43 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !45, line: 16, baseType: !20)
!45 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_int_t", file: !43, line: 17, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_int_t", file: !45, line: 17, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !21, line: 78, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !11, line: 140, baseType: !50)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 196, baseType: !52)
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_node_t", file: !59, line: 218, baseType: !60)
!59 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 215, size: 224, elements: !61)
!61 = !{!62, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !60, file: !59, line: 216, baseType: !63, size: 160)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !45, line: 20, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !45, line: 22, size: 160, elements: !65)
!65 = !{!66, !67, !69, !70, !71, !72}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !64, file: !45, line: 23, baseType: !44, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !64, file: !45, line: 24, baseType: !68, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !64, file: !45, line: 25, baseType: !68, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !64, file: !45, line: 26, baseType: !68, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !64, file: !45, line: 27, baseType: !7, size: 8, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !45, line: 28, baseType: !7, size: 8, offset: 136)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !60, file: !59, line: 217, baseType: !74, size: 64, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !59, line: 19, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 16, size: 64, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !75, file: !59, line: 17, baseType: !10, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !75, file: !59, line: 18, baseType: !6, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 191, baseType: !12)
!80 = !{!0, !81, !93, !99, !110, !116, !132, !137, !139, !141, !143, !145, !147, !152, !171}
!81 = !DIGlobalVariableExpression(var: !82)
!82 = distinct !DIGlobalVariable(name: "basis64", scope: !83, file: !3, line: 1140, type: !90, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "ngx_encode_base64", scope: !3, file: !3, line: 1138, type: !84, isLocal: false, isDefinition: true, scopeLine: 1139, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !87)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!87 = !{!88, !89}
!88 = !DILocalVariable(name: "dst", arg: 1, scope: !83, file: !3, line: 1138, type: !86)
!89 = !DILocalVariable(name: "src", arg: 2, scope: !83, file: !3, line: 1138, type: !86)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 520, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 65)
!93 = !DIGlobalVariableExpression(var: !94)
!94 = distinct !DIGlobalVariable(name: "basis64", scope: !95, file: !3, line: 1150, type: !90, isLocal: true, isDefinition: true)
!95 = distinct !DISubprogram(name: "ngx_encode_base64url", scope: !3, file: !3, line: 1148, type: !84, isLocal: false, isDefinition: true, scopeLine: 1149, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !96)
!96 = !{!97, !98}
!97 = !DILocalVariable(name: "dst", arg: 1, scope: !95, file: !3, line: 1148, type: !86)
!98 = !DILocalVariable(name: "src", arg: 2, scope: !95, file: !3, line: 1148, type: !86)
!99 = !DIGlobalVariableExpression(var: !100)
!100 = distinct !DIGlobalVariable(name: "basis64", scope: !101, file: !3, line: 1204, type: !107, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "ngx_decode_base64", scope: !3, file: !3, line: 1202, type: !102, isLocal: false, isDefinition: true, scopeLine: 1203, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{!48, !86, !86}
!104 = !{!105, !106}
!105 = !DILocalVariable(name: "dst", arg: 1, scope: !101, file: !3, line: 1202, type: !86)
!106 = !DILocalVariable(name: "src", arg: 2, scope: !101, file: !3, line: 1202, type: !86)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 256)
!110 = !DIGlobalVariableExpression(var: !111)
!111 = distinct !DIGlobalVariable(name: "basis64", scope: !112, file: !3, line: 1231, type: !107, isLocal: true, isDefinition: true)
!112 = distinct !DISubprogram(name: "ngx_decode_base64url", scope: !3, file: !3, line: 1229, type: !102, isLocal: false, isDefinition: true, scopeLine: 1230, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !113)
!113 = !{!114, !115}
!114 = !DILocalVariable(name: "dst", arg: 1, scope: !112, file: !3, line: 1229, type: !86)
!115 = !DILocalVariable(name: "src", arg: 2, scope: !112, file: !3, line: 1229, type: !86)
!116 = !DIGlobalVariableExpression(var: !117)
!117 = distinct !DIGlobalVariable(name: "hex", scope: !118, file: !3, line: 1445, type: !129, isLocal: true, isDefinition: true)
!118 = distinct !DISubprogram(name: "ngx_escape_uri", scope: !3, file: !3, line: 1441, type: !119, isLocal: false, isDefinition: true, scopeLine: 1442, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{!22, !6, !6, !10, !20}
!121 = !{!122, !123, !124, !125, !126, !127}
!122 = !DILocalVariable(name: "dst", arg: 1, scope: !118, file: !3, line: 1441, type: !6)
!123 = !DILocalVariable(name: "src", arg: 2, scope: !118, file: !3, line: 1441, type: !6)
!124 = !DILocalVariable(name: "size", arg: 3, scope: !118, file: !3, line: 1441, type: !10)
!125 = !DILocalVariable(name: "type", arg: 4, scope: !118, file: !3, line: 1441, type: !20)
!126 = !DILocalVariable(name: "n", scope: !118, file: !3, line: 1443, type: !20)
!127 = !DILocalVariable(name: "escape", scope: !118, file: !3, line: 1444, type: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 136, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 17)
!132 = !DIGlobalVariableExpression(var: !133)
!133 = distinct !DIGlobalVariable(name: "uri", scope: !118, file: !3, line: 1449, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 8)
!137 = !DIGlobalVariableExpression(var: !138)
!138 = distinct !DIGlobalVariable(name: "args", scope: !118, file: !3, line: 1469, type: !134, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140)
!140 = distinct !DIGlobalVariable(name: "uri_component", scope: !118, file: !3, line: 1489, type: !134, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142)
!142 = distinct !DIGlobalVariable(name: "html", scope: !118, file: !3, line: 1509, type: !134, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144)
!144 = distinct !DIGlobalVariable(name: "refresh", scope: !118, file: !3, line: 1529, type: !134, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146)
!146 = distinct !DIGlobalVariable(name: "memcached", scope: !118, file: !3, line: 1549, type: !134, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148)
!148 = distinct !DIGlobalVariable(name: "map", scope: !118, file: !3, line: 1569, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 224, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 7)
!152 = !DIGlobalVariableExpression(var: !153)
!153 = distinct !DIGlobalVariable(name: "hex", scope: !154, file: !3, line: 504, type: !129, isLocal: true, isDefinition: true)
!154 = distinct !DISubprogram(name: "ngx_sprintf_num", scope: !3, file: !3, line: 494, type: !155, isLocal: true, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!6, !6, !6, !51, !7, !20, !20}
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !169, !170}
!158 = !DILocalVariable(name: "buf", arg: 1, scope: !154, file: !3, line: 494, type: !6)
!159 = !DILocalVariable(name: "last", arg: 2, scope: !154, file: !3, line: 494, type: !6)
!160 = !DILocalVariable(name: "ui64", arg: 3, scope: !154, file: !3, line: 494, type: !51)
!161 = !DILocalVariable(name: "zero", arg: 4, scope: !154, file: !3, line: 494, type: !7)
!162 = !DILocalVariable(name: "hexadecimal", arg: 5, scope: !154, file: !3, line: 495, type: !20)
!163 = !DILocalVariable(name: "width", arg: 6, scope: !154, file: !3, line: 495, type: !20)
!164 = !DILocalVariable(name: "p", scope: !154, file: !3, line: 497, type: !6)
!165 = !DILocalVariable(name: "temp", scope: !154, file: !3, line: 497, type: !166)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 21)
!169 = !DILocalVariable(name: "len", scope: !154, file: !3, line: 502, type: !10)
!170 = !DILocalVariable(name: "ui32", scope: !154, file: !3, line: 503, type: !79)
!171 = !DIGlobalVariableExpression(var: !172)
!172 = distinct !DIGlobalVariable(name: "HEX", scope: !154, file: !3, line: 505, type: !129, isLocal: true, isDefinition: true)
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(name: "dst", arg: 1, scope: !2, file: !3, line: 1124, type: !6)
!175 = !DILocalVariable(name: "src", arg: 2, scope: !2, file: !3, line: 1124, type: !6)
!176 = !DILocalVariable(name: "len", arg: 3, scope: !2, file: !3, line: 1124, type: !10)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!180 = distinct !DISubprogram(name: "ngx_strlow", scope: !3, file: !3, line: 21, type: !181, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !183)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !6, !6, !10}
!183 = !{!184, !185, !186}
!184 = !DILocalVariable(name: "dst", arg: 1, scope: !180, file: !3, line: 21, type: !6)
!185 = !DILocalVariable(name: "src", arg: 2, scope: !180, file: !3, line: 21, type: !6)
!186 = !DILocalVariable(name: "n", arg: 3, scope: !180, file: !3, line: 21, type: !10)
!187 = !{!188, !188, i64 0}
!188 = !{!"any pointer", !189, i64 0}
!189 = !{!"omnipotent char", !190, i64 0}
!190 = !{!"Simple C/C++ TBAA"}
!191 = !DIExpression()
!192 = !DILocation(line: 21, column: 20, scope: !180)
!193 = !DILocation(line: 21, column: 33, scope: !180)
!194 = !{!195, !195, i64 0}
!195 = !{!"int", !189, i64 0}
!196 = !DILocation(line: 21, column: 45, scope: !180)
!197 = !DILocation(line: 23, column: 5, scope: !180)
!198 = !DILocation(line: 23, column: 12, scope: !180)
!199 = !DILocation(line: 24, column: 16, scope: !200)
!200 = distinct !DILexicalBlock(scope: !180, file: !3, line: 23, column: 15)
!201 = !{!189, !189, i64 0}
!202 = !DILocation(line: 24, column: 10, scope: !200)
!203 = !DILocation(line: 24, column: 14, scope: !200)
!204 = !DILocation(line: 25, column: 12, scope: !200)
!205 = !DILocation(line: 26, column: 12, scope: !200)
!206 = !DILocation(line: 27, column: 10, scope: !200)
!207 = distinct !{!207, !197, !208}
!208 = !DILocation(line: 28, column: 5, scope: !180)
!209 = !DILocation(line: 29, column: 1, scope: !180)
!210 = distinct !DISubprogram(name: "ngx_strnlen", scope: !3, file: !3, line: 33, type: !211, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!10, !6, !10}
!213 = !{!214, !215, !216}
!214 = !DILocalVariable(name: "p", arg: 1, scope: !210, file: !3, line: 33, type: !6)
!215 = !DILocalVariable(name: "n", arg: 2, scope: !210, file: !3, line: 33, type: !10)
!216 = !DILocalVariable(name: "i", scope: !210, file: !3, line: 35, type: !10)
!217 = !DILocation(line: 33, column: 21, scope: !210)
!218 = !DILocation(line: 33, column: 31, scope: !210)
!219 = !DILocation(line: 35, column: 5, scope: !210)
!220 = !DILocation(line: 35, column: 13, scope: !210)
!221 = !DILocation(line: 37, column: 12, scope: !222)
!222 = distinct !DILexicalBlock(scope: !210, file: !3, line: 37, column: 5)
!223 = !DILocation(line: 37, column: 10, scope: !222)
!224 = !DILocation(line: 37, column: 17, scope: !225)
!225 = distinct !DILexicalBlock(scope: !222, file: !3, line: 37, column: 5)
!226 = !DILocation(line: 37, column: 21, scope: !225)
!227 = !DILocation(line: 37, column: 19, scope: !225)
!228 = !DILocation(line: 37, column: 5, scope: !222)
!229 = !DILocation(line: 39, column: 13, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 39, column: 13)
!231 = distinct !DILexicalBlock(scope: !225, file: !3, line: 37, column: 29)
!232 = !DILocation(line: 39, column: 15, scope: !230)
!233 = !DILocation(line: 39, column: 18, scope: !230)
!234 = !DILocation(line: 39, column: 13, scope: !231)
!235 = !DILocation(line: 40, column: 20, scope: !236)
!236 = distinct !DILexicalBlock(scope: !230, file: !3, line: 39, column: 27)
!237 = !DILocation(line: 40, column: 13, scope: !236)
!238 = !DILocation(line: 42, column: 5, scope: !231)
!239 = !DILocation(line: 37, column: 25, scope: !225)
!240 = !DILocation(line: 37, column: 5, scope: !225)
!241 = distinct !{!241, !228, !242}
!242 = !DILocation(line: 42, column: 5, scope: !222)
!243 = !DILocation(line: 44, column: 12, scope: !210)
!244 = !DILocation(line: 44, column: 5, scope: !210)
!245 = !DILocation(line: 45, column: 1, scope: !210)
!246 = distinct !DISubprogram(name: "ngx_cpystrn", scope: !3, file: !3, line: 49, type: !4, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !247)
!247 = !{!248, !249, !250}
!248 = !DILocalVariable(name: "dst", arg: 1, scope: !246, file: !3, line: 49, type: !6)
!249 = !DILocalVariable(name: "src", arg: 2, scope: !246, file: !3, line: 49, type: !6)
!250 = !DILocalVariable(name: "n", arg: 3, scope: !246, file: !3, line: 49, type: !10)
!251 = !DILocation(line: 49, column: 21, scope: !246)
!252 = !DILocation(line: 49, column: 34, scope: !246)
!253 = !DILocation(line: 49, column: 46, scope: !246)
!254 = !DILocation(line: 51, column: 9, scope: !255)
!255 = distinct !DILexicalBlock(scope: !246, file: !3, line: 51, column: 9)
!256 = !DILocation(line: 51, column: 11, scope: !255)
!257 = !DILocation(line: 51, column: 9, scope: !246)
!258 = !DILocation(line: 52, column: 16, scope: !259)
!259 = distinct !DILexicalBlock(scope: !255, file: !3, line: 51, column: 17)
!260 = !DILocation(line: 52, column: 9, scope: !259)
!261 = !DILocation(line: 55, column: 5, scope: !246)
!262 = !DILocation(line: 55, column: 12, scope: !246)
!263 = !DILocation(line: 56, column: 17, scope: !264)
!264 = distinct !DILexicalBlock(scope: !246, file: !3, line: 55, column: 17)
!265 = !DILocation(line: 56, column: 16, scope: !264)
!266 = !DILocation(line: 56, column: 10, scope: !264)
!267 = !DILocation(line: 56, column: 14, scope: !264)
!268 = !DILocation(line: 58, column: 14, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !3, line: 58, column: 13)
!270 = !DILocation(line: 58, column: 13, scope: !269)
!271 = !DILocation(line: 58, column: 18, scope: !269)
!272 = !DILocation(line: 58, column: 13, scope: !264)
!273 = !DILocation(line: 59, column: 20, scope: !274)
!274 = distinct !DILexicalBlock(scope: !269, file: !3, line: 58, column: 27)
!275 = !DILocation(line: 59, column: 13, scope: !274)
!276 = !DILocation(line: 62, column: 12, scope: !264)
!277 = !DILocation(line: 63, column: 12, scope: !264)
!278 = distinct !{!278, !261, !279}
!279 = !DILocation(line: 64, column: 5, scope: !246)
!280 = !DILocation(line: 66, column: 6, scope: !246)
!281 = !DILocation(line: 66, column: 10, scope: !246)
!282 = !DILocation(line: 68, column: 12, scope: !246)
!283 = !DILocation(line: 68, column: 5, scope: !246)
!284 = !DILocation(line: 69, column: 1, scope: !246)
!285 = distinct !DISubprogram(name: "ngx_pstrdup", scope: !3, file: !3, line: 73, type: !286, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !456)
!286 = !DISubroutineType(types: !287)
!287 = !{!6, !288, !86}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !290, line: 18, baseType: !291)
!290 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !292, line: 57, size: 320, elements: !293)
!292 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!293 = !{!294, !302, !303, !304, !436, !443, !455}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !291, file: !292, line: 58, baseType: !295, size: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !292, line: 54, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 49, size: 128, elements: !297)
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !296, file: !292, line: 50, baseType: !6, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !296, file: !292, line: 51, baseType: !6, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !292, line: 52, baseType: !288, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !296, file: !292, line: 53, baseType: !20, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !291, file: !292, line: 59, baseType: !10, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !291, file: !292, line: 60, baseType: !288, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !291, file: !292, line: 61, baseType: !305, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !290, line: 19, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !308, line: 59, size: 64, elements: !309)
!308 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!309 = !{!310, !435}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !307, file: !308, line: 60, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !308, line: 18, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !308, line: 20, size: 352, elements: !314)
!314 = !{!315, !316, !317, !319, !320, !321, !322, !324, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !313, file: !308, line: 21, baseType: !6, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !313, file: !308, line: 22, baseType: !6, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !313, file: !308, line: 23, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !11, line: 222, baseType: !50)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !313, file: !308, line: 24, baseType: !318, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !313, file: !308, line: 26, baseType: !6, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !313, file: !308, line: 27, baseType: !6, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !313, file: !308, line: 28, baseType: !323, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !308, line: 16, baseType: !39)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !313, file: !308, line: 29, baseType: !325, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !290, line: 23, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !328, line: 16, size: 1216, elements: !329)
!328 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!329 = !{!330, !333, !334, !378, !379, !380, !420, !421}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !327, file: !328, line: 17, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !332, line: 16, baseType: !50)
!332 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 18, baseType: !74, size: 64, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !327, file: !328, line: 19, baseType: !335, size: 960, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !332, line: 17, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !337, line: 4, size: 960, elements: !338)
!337 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!338 = !{!339, !341, !342, !344, !345, !347, !348, !350, !352, !354, !355, !356, !357, !358, !359, !362, !363, !365, !366, !372, !373, !374}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !336, file: !337, line: 6, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !11, line: 232, baseType: !12)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !336, file: !337, line: 7, baseType: !340, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !336, file: !337, line: 8, baseType: !343, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !11, line: 227, baseType: !12)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !336, file: !337, line: 9, baseType: !343, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !336, file: !337, line: 10, baseType: !346, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !11, line: 217, baseType: !12)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !336, file: !337, line: 11, baseType: !346, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !336, file: !337, line: 13, baseType: !349, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !11, line: 212, baseType: !12)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !336, file: !337, line: 14, baseType: !351, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !11, line: 304, baseType: !12)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !336, file: !337, line: 15, baseType: !353, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !11, line: 309, baseType: !12)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !336, file: !337, line: 16, baseType: !12, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !336, file: !337, line: 17, baseType: !340, size: 32, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !336, file: !337, line: 18, baseType: !340, size: 32, offset: 352)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !336, file: !337, line: 19, baseType: !318, size: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !336, file: !337, line: 20, baseType: !318, size: 32, offset: 416)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !336, file: !337, line: 21, baseType: !360, size: 32, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !11, line: 237, baseType: !361)
!361 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !336, file: !337, line: 22, baseType: !360, size: 32, offset: 480)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !336, file: !337, line: 23, baseType: !364, size: 32, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !11, line: 242, baseType: !50)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !336, file: !337, line: 24, baseType: !364, size: 32, offset: 544)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !336, file: !337, line: 26, baseType: !367, size: 64, offset: 576)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !11, line: 288, size: 64, elements: !368)
!368 = !{!369, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !367, file: !11, line: 288, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !11, line: 75, baseType: !361)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !367, file: !11, line: 288, baseType: !361, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !336, file: !337, line: 27, baseType: !367, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !336, file: !337, line: 28, baseType: !367, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !336, file: !337, line: 29, baseType: !375, size: 192, offset: 768)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 192, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 3)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !327, file: !328, line: 21, baseType: !318, size: 32, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !327, file: !328, line: 22, baseType: !318, size: 32, offset: 1120)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !327, file: !328, line: 24, baseType: !381, size: 32, offset: 1152)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !290, line: 20, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !384, line: 50, size: 320, elements: !385)
!384 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!385 = !{!386, !387, !400, !404, !405, !410, !411, !416, !417, !419}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !383, file: !384, line: 51, baseType: !20, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !383, file: !384, line: 52, baseType: !388, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !290, line: 21, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !391, line: 89, size: 160, elements: !392)
!391 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!392 = !{!393, !394, !395, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !390, file: !391, line: 90, baseType: !331, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !391, line: 91, baseType: !74, size: 64, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !390, file: !391, line: 93, baseType: !396, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !388, !381}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !391, line: 94, baseType: !39, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !383, file: !384, line: 54, baseType: !401, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !402, line: 98, baseType: !403)
!402 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!403 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !383, file: !384, line: 56, baseType: !370, size: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !383, file: !384, line: 58, baseType: !406, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !384, line: 45, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DISubroutineType(types: !409)
!409 = !{!6, !381, !6, !10}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !384, line: 59, baseType: !39, size: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !383, file: !384, line: 61, baseType: !412, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !384, line: 46, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !381, !20, !6, !10}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !383, file: !384, line: 62, baseType: !39, size: 32, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !383, file: !384, line: 70, baseType: !418, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !384, line: 72, baseType: !381, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !327, file: !328, line: 37, baseType: !12, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !327, file: !328, line: 38, baseType: !12, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !313, file: !308, line: 30, baseType: !311, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !313, file: !308, line: 34, baseType: !12, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !313, file: !308, line: 40, baseType: !12, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !313, file: !308, line: 43, baseType: !12, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !313, file: !308, line: 45, baseType: !12, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !313, file: !308, line: 46, baseType: !12, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !313, file: !308, line: 47, baseType: !12, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !313, file: !308, line: 48, baseType: !12, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !313, file: !308, line: 49, baseType: !12, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !313, file: !308, line: 50, baseType: !12, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !313, file: !308, line: 52, baseType: !12, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !313, file: !308, line: 53, baseType: !12, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !313, file: !308, line: 55, baseType: !50, size: 32, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !308, line: 61, baseType: !305, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !291, file: !292, line: 62, baseType: !437, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !292, line: 41, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !292, line: 43, size: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !292, line: 44, baseType: !437, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !439, file: !292, line: 45, baseType: !39, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !291, file: !292, line: 63, baseType: !444, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !292, line: 32, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !292, line: 34, size: 96, elements: !447)
!447 = !{!448, !453, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !446, file: !292, line: 35, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !292, line: 30, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !39}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !446, file: !292, line: 36, baseType: !39, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !292, line: 37, baseType: !444, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !291, file: !292, line: 64, baseType: !381, size: 32, offset: 288)
!456 = !{!457, !458, !459}
!457 = !DILocalVariable(name: "pool", arg: 1, scope: !285, file: !3, line: 73, type: !288)
!458 = !DILocalVariable(name: "src", arg: 2, scope: !285, file: !3, line: 73, type: !86)
!459 = !DILocalVariable(name: "dst", scope: !285, file: !3, line: 75, type: !6)
!460 = !DILocation(line: 73, column: 25, scope: !285)
!461 = !DILocation(line: 73, column: 42, scope: !285)
!462 = !DILocation(line: 75, column: 5, scope: !285)
!463 = !DILocation(line: 75, column: 14, scope: !285)
!464 = !DILocation(line: 77, column: 23, scope: !285)
!465 = !DILocation(line: 77, column: 29, scope: !285)
!466 = !DILocation(line: 77, column: 34, scope: !285)
!467 = !{!468, !195, i64 0}
!468 = !{!"", !195, i64 0, !188, i64 4}
!469 = !DILocation(line: 77, column: 11, scope: !285)
!470 = !DILocation(line: 77, column: 9, scope: !285)
!471 = !DILocation(line: 78, column: 9, scope: !472)
!472 = distinct !DILexicalBlock(scope: !285, file: !3, line: 78, column: 9)
!473 = !DILocation(line: 78, column: 13, scope: !472)
!474 = !DILocation(line: 78, column: 9, scope: !285)
!475 = !DILocation(line: 79, column: 9, scope: !476)
!476 = distinct !DILexicalBlock(scope: !472, file: !3, line: 78, column: 22)
!477 = !DILocation(line: 82, column: 5, scope: !285)
!478 = !{!468, !188, i64 4}
!479 = !DILocation(line: 84, column: 12, scope: !285)
!480 = !DILocation(line: 84, column: 5, scope: !285)
!481 = !DILocation(line: 85, column: 1, scope: !285)
!482 = distinct !DISubprogram(name: "ngx_sprintf", scope: !3, file: !3, line: 121, type: !483, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!6, !6, !54, null}
!485 = !{!486, !487, !488, !489}
!486 = !DILocalVariable(name: "buf", arg: 1, scope: !482, file: !3, line: 121, type: !6)
!487 = !DILocalVariable(name: "fmt", arg: 2, scope: !482, file: !3, line: 121, type: !54)
!488 = !DILocalVariable(name: "p", scope: !482, file: !3, line: 123, type: !6)
!489 = !DILocalVariable(name: "args", scope: !482, file: !3, line: 124, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !11, line: 7, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 124, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 4)
!495 = !DILocation(line: 121, column: 21, scope: !482)
!496 = !DILocation(line: 121, column: 38, scope: !482)
!497 = !DILocation(line: 123, column: 5, scope: !482)
!498 = !DILocation(line: 123, column: 15, scope: !482)
!499 = !DILocation(line: 124, column: 5, scope: !482)
!500 = !DILocation(line: 124, column: 15, scope: !482)
!501 = !DILocation(line: 126, column: 5, scope: !482)
!502 = !DILocation(line: 127, column: 23, scope: !482)
!503 = !DILocation(line: 127, column: 41, scope: !482)
!504 = !DILocation(line: 127, column: 46, scope: !482)
!505 = !DILocation(line: 127, column: 9, scope: !482)
!506 = !DILocation(line: 127, column: 7, scope: !482)
!507 = !DILocation(line: 128, column: 5, scope: !482)
!508 = !DILocation(line: 130, column: 12, scope: !482)
!509 = !DILocation(line: 131, column: 1, scope: !482)
!510 = !DILocation(line: 130, column: 5, scope: !482)
!511 = distinct !DISubprogram(name: "ngx_vslprintf", scope: !3, file: !3, line: 163, type: !512, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !515)
!512 = !DISubroutineType(types: !513)
!513 = !{!6, !6, !6, !54, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!516 = !DILocalVariable(name: "buf", arg: 1, scope: !511, file: !3, line: 163, type: !6)
!517 = !DILocalVariable(name: "last", arg: 2, scope: !511, file: !3, line: 163, type: !6)
!518 = !DILocalVariable(name: "fmt", arg: 3, scope: !511, file: !3, line: 163, type: !54)
!519 = !DILocalVariable(name: "args", arg: 4, scope: !511, file: !3, line: 163, type: !514)
!520 = !DILocalVariable(name: "p", scope: !511, file: !3, line: 165, type: !6)
!521 = !DILocalVariable(name: "zero", scope: !511, file: !3, line: 165, type: !7)
!522 = !DILocalVariable(name: "d", scope: !511, file: !3, line: 166, type: !50)
!523 = !DILocalVariable(name: "f", scope: !511, file: !3, line: 167, type: !53)
!524 = !DILocalVariable(name: "len", scope: !511, file: !3, line: 168, type: !10)
!525 = !DILocalVariable(name: "slen", scope: !511, file: !3, line: 168, type: !10)
!526 = !DILocalVariable(name: "i64", scope: !511, file: !3, line: 169, type: !40)
!527 = !DILocalVariable(name: "ui64", scope: !511, file: !3, line: 170, type: !51)
!528 = !DILocalVariable(name: "frac", scope: !511, file: !3, line: 170, type: !51)
!529 = !DILocalVariable(name: "ms", scope: !511, file: !3, line: 171, type: !42)
!530 = !DILocalVariable(name: "width", scope: !511, file: !3, line: 172, type: !20)
!531 = !DILocalVariable(name: "sign", scope: !511, file: !3, line: 172, type: !20)
!532 = !DILocalVariable(name: "hex", scope: !511, file: !3, line: 172, type: !20)
!533 = !DILocalVariable(name: "max_width", scope: !511, file: !3, line: 172, type: !20)
!534 = !DILocalVariable(name: "frac_width", scope: !511, file: !3, line: 172, type: !20)
!535 = !DILocalVariable(name: "scale", scope: !511, file: !3, line: 172, type: !20)
!536 = !DILocalVariable(name: "n", scope: !511, file: !3, line: 172, type: !20)
!537 = !DILocalVariable(name: "v", scope: !511, file: !3, line: 173, type: !86)
!538 = !DILocalVariable(name: "vv", scope: !511, file: !3, line: 174, type: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_variable_value_t", file: !59, line: 37, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 28, size: 64, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !541, file: !59, line: 29, baseType: !12, size: 28, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !541, file: !59, line: 31, baseType: !12, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "no_cacheable", scope: !541, file: !59, line: 32, baseType: !12, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "not_found", scope: !541, file: !59, line: 33, baseType: !12, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !541, file: !59, line: 34, baseType: !12, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !541, file: !59, line: 36, baseType: !6, size: 32, offset: 32)
!549 = !DILocation(line: 163, column: 23, scope: !511)
!550 = !DILocation(line: 163, column: 36, scope: !511)
!551 = !DILocation(line: 163, column: 54, scope: !511)
!552 = !DILocation(line: 163, column: 67, scope: !511)
!553 = !DILocation(line: 165, column: 5, scope: !511)
!554 = !DILocation(line: 165, column: 28, scope: !511)
!555 = !DILocation(line: 165, column: 31, scope: !511)
!556 = !DILocation(line: 166, column: 5, scope: !511)
!557 = !DILocation(line: 166, column: 28, scope: !511)
!558 = !DILocation(line: 167, column: 5, scope: !511)
!559 = !DILocation(line: 167, column: 28, scope: !511)
!560 = !DILocation(line: 168, column: 5, scope: !511)
!561 = !DILocation(line: 168, column: 28, scope: !511)
!562 = !DILocation(line: 168, column: 33, scope: !511)
!563 = !DILocation(line: 169, column: 5, scope: !511)
!564 = !DILocation(line: 169, column: 28, scope: !511)
!565 = !DILocation(line: 170, column: 5, scope: !511)
!566 = !DILocation(line: 170, column: 28, scope: !511)
!567 = !DILocation(line: 170, column: 34, scope: !511)
!568 = !DILocation(line: 171, column: 5, scope: !511)
!569 = !DILocation(line: 171, column: 28, scope: !511)
!570 = !DILocation(line: 172, column: 5, scope: !511)
!571 = !DILocation(line: 172, column: 28, scope: !511)
!572 = !DILocation(line: 172, column: 35, scope: !511)
!573 = !DILocation(line: 172, column: 41, scope: !511)
!574 = !DILocation(line: 172, column: 46, scope: !511)
!575 = !DILocation(line: 172, column: 57, scope: !511)
!576 = !DILocation(line: 172, column: 69, scope: !511)
!577 = !DILocation(line: 172, column: 76, scope: !511)
!578 = !DILocation(line: 173, column: 5, scope: !511)
!579 = !DILocation(line: 173, column: 28, scope: !511)
!580 = !DILocation(line: 174, column: 5, scope: !511)
!581 = !DILocation(line: 174, column: 28, scope: !511)
!582 = !DILocation(line: 176, column: 5, scope: !511)
!583 = !DILocation(line: 176, column: 13, scope: !511)
!584 = !DILocation(line: 176, column: 12, scope: !511)
!585 = !DILocation(line: 176, column: 17, scope: !511)
!586 = !DILocation(line: 176, column: 20, scope: !511)
!587 = !DILocation(line: 176, column: 26, scope: !511)
!588 = !DILocation(line: 176, column: 24, scope: !511)
!589 = !DILocation(line: 183, column: 14, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !3, line: 183, column: 13)
!591 = distinct !DILexicalBlock(scope: !511, file: !3, line: 176, column: 32)
!592 = !DILocation(line: 183, column: 13, scope: !590)
!593 = !DILocation(line: 183, column: 18, scope: !590)
!594 = !DILocation(line: 183, column: 13, scope: !591)
!595 = !DILocation(line: 185, column: 17, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !3, line: 183, column: 26)
!597 = !{!598, !598, i64 0}
!598 = !{!"long long", !189, i64 0}
!599 = !DILocation(line: 186, column: 18, scope: !596)
!600 = !DILocation(line: 188, column: 32, scope: !596)
!601 = !DILocation(line: 188, column: 31, scope: !596)
!602 = !DILocation(line: 188, column: 38, scope: !596)
!603 = !DILocation(line: 188, column: 30, scope: !596)
!604 = !DILocation(line: 188, column: 20, scope: !596)
!605 = !DILocation(line: 188, column: 18, scope: !596)
!606 = !DILocation(line: 189, column: 19, scope: !596)
!607 = !DILocation(line: 190, column: 18, scope: !596)
!608 = !DILocation(line: 191, column: 17, scope: !596)
!609 = !DILocation(line: 192, column: 23, scope: !596)
!610 = !DILocation(line: 193, column: 24, scope: !596)
!611 = !DILocation(line: 194, column: 18, scope: !596)
!612 = !DILocation(line: 196, column: 13, scope: !596)
!613 = !DILocation(line: 196, column: 21, scope: !596)
!614 = !DILocation(line: 196, column: 20, scope: !596)
!615 = !DILocation(line: 196, column: 25, scope: !596)
!616 = !DILocation(line: 196, column: 32, scope: !596)
!617 = !DILocation(line: 196, column: 36, scope: !596)
!618 = !DILocation(line: 196, column: 35, scope: !596)
!619 = !DILocation(line: 196, column: 40, scope: !596)
!620 = !DILocation(line: 197, column: 25, scope: !621)
!621 = distinct !DILexicalBlock(scope: !596, file: !3, line: 196, column: 48)
!622 = !DILocation(line: 197, column: 31, scope: !621)
!623 = !DILocation(line: 197, column: 42, scope: !621)
!624 = !DILocation(line: 197, column: 38, scope: !621)
!625 = !DILocation(line: 197, column: 36, scope: !621)
!626 = !DILocation(line: 197, column: 45, scope: !621)
!627 = !DILocation(line: 197, column: 23, scope: !621)
!628 = distinct !{!628, !612, !629}
!629 = !DILocation(line: 198, column: 13, scope: !596)
!630 = !DILocation(line: 201, column: 13, scope: !596)
!631 = !DILocation(line: 202, column: 26, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 201, column: 24)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 201, column: 13)
!634 = distinct !DILexicalBlock(scope: !596, file: !3, line: 201, column: 13)
!635 = !DILocation(line: 202, column: 25, scope: !632)
!636 = !DILocation(line: 202, column: 17, scope: !632)
!637 = !DILocation(line: 205, column: 26, scope: !638)
!638 = distinct !DILexicalBlock(scope: !632, file: !3, line: 202, column: 31)
!639 = !DILocation(line: 206, column: 24, scope: !638)
!640 = !DILocation(line: 207, column: 21, scope: !638)
!641 = distinct !{!641, !642, !643}
!642 = !DILocation(line: 201, column: 13, scope: !634)
!643 = !DILocation(line: 245, column: 13, scope: !634)
!644 = !DILocation(line: 210, column: 31, scope: !638)
!645 = !DILocation(line: 211, column: 24, scope: !638)
!646 = !DILocation(line: 212, column: 21, scope: !638)
!647 = !DILocation(line: 215, column: 25, scope: !638)
!648 = !DILocation(line: 216, column: 26, scope: !638)
!649 = !DILocation(line: 217, column: 24, scope: !638)
!650 = !DILocation(line: 218, column: 21, scope: !638)
!651 = !DILocation(line: 221, column: 25, scope: !638)
!652 = !DILocation(line: 222, column: 26, scope: !638)
!653 = !DILocation(line: 223, column: 24, scope: !638)
!654 = !DILocation(line: 224, column: 21, scope: !638)
!655 = !DILocation(line: 227, column: 24, scope: !638)
!656 = !DILocation(line: 229, column: 21, scope: !638)
!657 = !DILocation(line: 229, column: 29, scope: !638)
!658 = !DILocation(line: 229, column: 28, scope: !638)
!659 = !DILocation(line: 229, column: 33, scope: !638)
!660 = !DILocation(line: 229, column: 40, scope: !638)
!661 = !DILocation(line: 229, column: 44, scope: !638)
!662 = !DILocation(line: 229, column: 43, scope: !638)
!663 = !DILocation(line: 229, column: 48, scope: !638)
!664 = !DILocation(line: 230, column: 38, scope: !665)
!665 = distinct !DILexicalBlock(scope: !638, file: !3, line: 229, column: 56)
!666 = !DILocation(line: 230, column: 49, scope: !665)
!667 = !DILocation(line: 230, column: 60, scope: !665)
!668 = !DILocation(line: 230, column: 56, scope: !665)
!669 = !DILocation(line: 230, column: 54, scope: !665)
!670 = !DILocation(line: 230, column: 63, scope: !665)
!671 = !DILocation(line: 230, column: 36, scope: !665)
!672 = distinct !{!672, !656, !673}
!673 = !DILocation(line: 231, column: 21, scope: !638)
!674 = !DILocation(line: 233, column: 21, scope: !638)
!675 = !DILocation(line: 236, column: 28, scope: !638)
!676 = !DILocation(line: 236, column: 26, scope: !638)
!677 = !DILocation(line: 237, column: 24, scope: !638)
!678 = !DILocation(line: 238, column: 21, scope: !638)
!679 = !DILocation(line: 241, column: 21, scope: !638)
!680 = !DILocation(line: 244, column: 17, scope: !632)
!681 = !DILocation(line: 248, column: 22, scope: !596)
!682 = !DILocation(line: 248, column: 21, scope: !596)
!683 = !DILocation(line: 248, column: 13, scope: !596)
!684 = !DILocation(line: 251, column: 21, scope: !685)
!685 = distinct !DILexicalBlock(scope: !596, file: !3, line: 248, column: 27)
!686 = !DILocation(line: 251, column: 19, scope: !685)
!687 = !DILocation(line: 253, column: 23, scope: !685)
!688 = !DILocation(line: 253, column: 21, scope: !685)
!689 = !DILocation(line: 254, column: 23, scope: !685)
!690 = !DILocation(line: 254, column: 21, scope: !685)
!691 = !DILocation(line: 255, column: 20, scope: !685)
!692 = !DILocation(line: 257, column: 17, scope: !685)
!693 = distinct !{!693, !582, !694}
!694 = !DILocation(line: 487, column: 5, scope: !511)
!695 = !DILocation(line: 260, column: 22, scope: !685)
!696 = !DILocation(line: 260, column: 20, scope: !685)
!697 = !DILocation(line: 262, column: 23, scope: !685)
!698 = !DILocation(line: 262, column: 21, scope: !685)
!699 = !DILocation(line: 263, column: 23, scope: !685)
!700 = !{!701, !188, i64 4}
!701 = !{!"", !195, i64 0, !195, i64 3, !195, i64 3, !195, i64 3, !195, i64 3, !188, i64 4}
!702 = !DILocation(line: 263, column: 21, scope: !685)
!703 = !DILocation(line: 264, column: 20, scope: !685)
!704 = !DILocation(line: 266, column: 17, scope: !685)
!705 = !DILocation(line: 269, column: 21, scope: !685)
!706 = !DILocation(line: 269, column: 19, scope: !685)
!707 = !DILocation(line: 271, column: 21, scope: !708)
!708 = distinct !DILexicalBlock(scope: !685, file: !3, line: 271, column: 21)
!709 = !DILocation(line: 271, column: 26, scope: !708)
!710 = !DILocation(line: 271, column: 21, scope: !685)
!711 = !DILocation(line: 272, column: 21, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !3, line: 271, column: 42)
!713 = !DILocation(line: 272, column: 29, scope: !712)
!714 = !DILocation(line: 272, column: 28, scope: !712)
!715 = !DILocation(line: 272, column: 31, scope: !712)
!716 = !DILocation(line: 272, column: 34, scope: !712)
!717 = !DILocation(line: 272, column: 40, scope: !712)
!718 = !DILocation(line: 272, column: 38, scope: !712)
!719 = !DILocation(line: 273, column: 36, scope: !720)
!720 = distinct !DILexicalBlock(scope: !712, file: !3, line: 272, column: 46)
!721 = !DILocation(line: 273, column: 34, scope: !720)
!722 = !DILocation(line: 273, column: 29, scope: !720)
!723 = !DILocation(line: 273, column: 32, scope: !720)
!724 = distinct !{!724, !711, !725}
!725 = !DILocation(line: 274, column: 21, scope: !712)
!726 = !DILocation(line: 276, column: 17, scope: !712)
!727 = !DILocation(line: 277, column: 27, scope: !728)
!728 = distinct !DILexicalBlock(scope: !708, file: !3, line: 276, column: 24)
!729 = !DILocation(line: 277, column: 25, scope: !728)
!730 = !DILocation(line: 278, column: 27, scope: !728)
!731 = !DILocation(line: 278, column: 25, scope: !728)
!732 = !DILocation(line: 281, column: 20, scope: !685)
!733 = !DILocation(line: 283, column: 17, scope: !685)
!734 = !DILocation(line: 286, column: 33, scope: !685)
!735 = !DILocation(line: 286, column: 23, scope: !685)
!736 = !DILocation(line: 286, column: 21, scope: !685)
!737 = !DILocation(line: 287, column: 22, scope: !685)
!738 = !DILocation(line: 288, column: 17, scope: !685)
!739 = !DILocation(line: 291, column: 33, scope: !685)
!740 = !DILocation(line: 291, column: 23, scope: !685)
!741 = !DILocation(line: 291, column: 21, scope: !685)
!742 = !DILocation(line: 292, column: 22, scope: !685)
!743 = !DILocation(line: 293, column: 17, scope: !685)
!744 = !DILocation(line: 296, column: 33, scope: !685)
!745 = !DILocation(line: 296, column: 23, scope: !685)
!746 = !DILocation(line: 296, column: 21, scope: !685)
!747 = !DILocation(line: 297, column: 22, scope: !685)
!748 = !DILocation(line: 298, column: 17, scope: !685)
!749 = !DILocation(line: 301, column: 35, scope: !685)
!750 = !DILocation(line: 301, column: 20, scope: !685)
!751 = !DILocation(line: 302, column: 38, scope: !752)
!752 = distinct !DILexicalBlock(scope: !685, file: !3, line: 302, column: 21)
!753 = !DILocation(line: 302, column: 41, scope: !752)
!754 = !DILocation(line: 302, column: 21, scope: !685)
!755 = !DILocation(line: 303, column: 26, scope: !756)
!756 = distinct !DILexicalBlock(scope: !752, file: !3, line: 302, column: 48)
!757 = !DILocation(line: 304, column: 25, scope: !756)
!758 = !DILocation(line: 305, column: 17, scope: !756)
!759 = !DILocation(line: 306, column: 26, scope: !760)
!760 = distinct !DILexicalBlock(scope: !752, file: !3, line: 305, column: 24)
!761 = !DILocation(line: 307, column: 39, scope: !760)
!762 = !DILocation(line: 307, column: 28, scope: !760)
!763 = !DILocation(line: 307, column: 26, scope: !760)
!764 = !DILocation(line: 309, column: 17, scope: !685)
!765 = !DILocation(line: 312, column: 21, scope: !766)
!766 = distinct !DILexicalBlock(scope: !685, file: !3, line: 312, column: 21)
!767 = !DILocation(line: 312, column: 21, scope: !685)
!768 = !DILocation(line: 313, column: 37, scope: !769)
!769 = distinct !DILexicalBlock(scope: !766, file: !3, line: 312, column: 27)
!770 = !DILocation(line: 313, column: 27, scope: !769)
!771 = !DILocation(line: 313, column: 25, scope: !769)
!772 = !DILocation(line: 314, column: 17, scope: !769)
!773 = !DILocation(line: 315, column: 39, scope: !774)
!774 = distinct !DILexicalBlock(scope: !766, file: !3, line: 314, column: 24)
!775 = !DILocation(line: 315, column: 28, scope: !774)
!776 = !DILocation(line: 315, column: 26, scope: !774)
!777 = !DILocation(line: 317, column: 17, scope: !685)
!778 = !DILocation(line: 320, column: 21, scope: !779)
!779 = distinct !DILexicalBlock(scope: !685, file: !3, line: 320, column: 21)
!780 = !DILocation(line: 320, column: 21, scope: !685)
!781 = !DILocation(line: 321, column: 37, scope: !782)
!782 = distinct !DILexicalBlock(scope: !779, file: !3, line: 320, column: 27)
!783 = !DILocation(line: 321, column: 27, scope: !782)
!784 = !DILocation(line: 321, column: 25, scope: !782)
!785 = !DILocation(line: 322, column: 17, scope: !782)
!786 = !DILocation(line: 323, column: 39, scope: !787)
!787 = distinct !DILexicalBlock(scope: !779, file: !3, line: 322, column: 24)
!788 = !DILocation(line: 323, column: 28, scope: !787)
!789 = !DILocation(line: 323, column: 26, scope: !787)
!790 = !DILocation(line: 326, column: 21, scope: !791)
!791 = distinct !DILexicalBlock(scope: !685, file: !3, line: 326, column: 21)
!792 = !DILocation(line: 326, column: 21, scope: !685)
!793 = !DILocation(line: 327, column: 27, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !3, line: 326, column: 32)
!795 = !DILocation(line: 328, column: 17, scope: !794)
!796 = !DILocation(line: 330, column: 17, scope: !685)
!797 = !DILocation(line: 333, column: 21, scope: !798)
!798 = distinct !DILexicalBlock(scope: !685, file: !3, line: 333, column: 21)
!799 = !DILocation(line: 333, column: 21, scope: !685)
!800 = !DILocation(line: 334, column: 37, scope: !801)
!801 = distinct !DILexicalBlock(scope: !798, file: !3, line: 333, column: 27)
!802 = !DILocation(line: 334, column: 27, scope: !801)
!803 = !DILocation(line: 334, column: 25, scope: !801)
!804 = !DILocation(line: 335, column: 17, scope: !801)
!805 = !DILocation(line: 336, column: 39, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !3, line: 335, column: 24)
!807 = !DILocation(line: 336, column: 28, scope: !806)
!808 = !DILocation(line: 336, column: 26, scope: !806)
!809 = !DILocation(line: 338, column: 17, scope: !685)
!810 = !DILocation(line: 341, column: 21, scope: !811)
!811 = distinct !DILexicalBlock(scope: !685, file: !3, line: 341, column: 21)
!812 = !DILocation(line: 341, column: 21, scope: !685)
!813 = !DILocation(line: 342, column: 37, scope: !814)
!814 = distinct !DILexicalBlock(scope: !811, file: !3, line: 341, column: 27)
!815 = !DILocation(line: 342, column: 27, scope: !814)
!816 = !DILocation(line: 342, column: 25, scope: !814)
!817 = !DILocation(line: 343, column: 17, scope: !814)
!818 = !DILocation(line: 344, column: 39, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !3, line: 343, column: 24)
!820 = !DILocation(line: 344, column: 28, scope: !819)
!821 = !DILocation(line: 344, column: 26, scope: !819)
!822 = !DILocation(line: 346, column: 17, scope: !685)
!823 = !DILocation(line: 349, column: 21, scope: !824)
!824 = distinct !DILexicalBlock(scope: !685, file: !3, line: 349, column: 21)
!825 = !DILocation(line: 349, column: 21, scope: !685)
!826 = !DILocation(line: 350, column: 37, scope: !827)
!827 = distinct !DILexicalBlock(scope: !824, file: !3, line: 349, column: 27)
!828 = !DILocation(line: 350, column: 27, scope: !827)
!829 = !DILocation(line: 350, column: 25, scope: !827)
!830 = !DILocation(line: 351, column: 17, scope: !827)
!831 = !DILocation(line: 352, column: 39, scope: !832)
!832 = distinct !DILexicalBlock(scope: !824, file: !3, line: 351, column: 24)
!833 = !DILocation(line: 352, column: 28, scope: !832)
!834 = !DILocation(line: 352, column: 26, scope: !832)
!835 = !DILocation(line: 354, column: 17, scope: !685)
!836 = !DILocation(line: 357, column: 21, scope: !837)
!837 = distinct !DILexicalBlock(scope: !685, file: !3, line: 357, column: 21)
!838 = !DILocation(line: 357, column: 21, scope: !685)
!839 = !DILocation(line: 358, column: 27, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !3, line: 357, column: 27)
!841 = !DILocation(line: 358, column: 25, scope: !840)
!842 = !DILocation(line: 359, column: 17, scope: !840)
!843 = !DILocation(line: 360, column: 28, scope: !844)
!844 = distinct !DILexicalBlock(scope: !837, file: !3, line: 359, column: 24)
!845 = !DILocation(line: 360, column: 26, scope: !844)
!846 = !DILocation(line: 362, column: 17, scope: !685)
!847 = !DILocation(line: 365, column: 21, scope: !848)
!848 = distinct !DILexicalBlock(scope: !685, file: !3, line: 365, column: 21)
!849 = !DILocation(line: 365, column: 21, scope: !685)
!850 = !DILocation(line: 366, column: 37, scope: !851)
!851 = distinct !DILexicalBlock(scope: !848, file: !3, line: 365, column: 27)
!852 = !DILocation(line: 366, column: 27, scope: !851)
!853 = !DILocation(line: 366, column: 25, scope: !851)
!854 = !DILocation(line: 367, column: 17, scope: !851)
!855 = !DILocation(line: 368, column: 39, scope: !856)
!856 = distinct !DILexicalBlock(scope: !848, file: !3, line: 367, column: 24)
!857 = !DILocation(line: 368, column: 28, scope: !856)
!858 = !DILocation(line: 368, column: 26, scope: !856)
!859 = !DILocation(line: 371, column: 21, scope: !860)
!860 = distinct !DILexicalBlock(scope: !685, file: !3, line: 371, column: 21)
!861 = !DILocation(line: 371, column: 21, scope: !685)
!862 = !DILocation(line: 372, column: 27, scope: !863)
!863 = distinct !DILexicalBlock(scope: !860, file: !3, line: 371, column: 32)
!864 = !DILocation(line: 373, column: 17, scope: !863)
!865 = !DILocation(line: 375, column: 17, scope: !685)
!866 = !DILocation(line: 378, column: 21, scope: !685)
!867 = !DILocation(line: 378, column: 19, scope: !685)
!868 = !{!869, !869, i64 0}
!869 = !{!"double", !189, i64 0}
!870 = !DILocation(line: 380, column: 21, scope: !871)
!871 = distinct !DILexicalBlock(scope: !685, file: !3, line: 380, column: 21)
!872 = !DILocation(line: 380, column: 23, scope: !871)
!873 = !DILocation(line: 380, column: 21, scope: !685)
!874 = !DILocation(line: 381, column: 25, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !3, line: 380, column: 28)
!876 = !DILocation(line: 381, column: 28, scope: !875)
!877 = !DILocation(line: 382, column: 26, scope: !875)
!878 = !DILocation(line: 382, column: 25, scope: !875)
!879 = !DILocation(line: 382, column: 23, scope: !875)
!880 = !DILocation(line: 383, column: 17, scope: !875)
!881 = !DILocation(line: 385, column: 34, scope: !685)
!882 = !DILocation(line: 385, column: 24, scope: !685)
!883 = !DILocation(line: 385, column: 22, scope: !685)
!884 = !DILocation(line: 386, column: 22, scope: !685)
!885 = !DILocation(line: 388, column: 21, scope: !886)
!886 = distinct !DILexicalBlock(scope: !685, file: !3, line: 388, column: 21)
!887 = !DILocation(line: 388, column: 21, scope: !685)
!888 = !DILocation(line: 390, column: 27, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !3, line: 388, column: 33)
!890 = !DILocation(line: 391, column: 30, scope: !891)
!891 = distinct !DILexicalBlock(scope: !889, file: !3, line: 391, column: 21)
!892 = !DILocation(line: 391, column: 28, scope: !891)
!893 = !DILocation(line: 391, column: 26, scope: !891)
!894 = !DILocation(line: 391, column: 42, scope: !895)
!895 = distinct !DILexicalBlock(scope: !891, file: !3, line: 391, column: 21)
!896 = !DILocation(line: 391, column: 21, scope: !891)
!897 = !DILocation(line: 392, column: 31, scope: !898)
!898 = distinct !DILexicalBlock(scope: !895, file: !3, line: 391, column: 50)
!899 = !DILocation(line: 393, column: 21, scope: !898)
!900 = !DILocation(line: 391, column: 46, scope: !895)
!901 = !DILocation(line: 391, column: 21, scope: !895)
!902 = distinct !{!902, !896, !903}
!903 = !DILocation(line: 393, column: 21, scope: !891)
!904 = !DILocation(line: 395, column: 41, scope: !889)
!905 = !DILocation(line: 395, column: 54, scope: !889)
!906 = !DILocation(line: 395, column: 45, scope: !889)
!907 = !DILocation(line: 395, column: 43, scope: !889)
!908 = !DILocation(line: 395, column: 62, scope: !889)
!909 = !DILocation(line: 395, column: 60, scope: !889)
!910 = !DILocation(line: 395, column: 68, scope: !889)
!911 = !DILocation(line: 395, column: 28, scope: !889)
!912 = !DILocation(line: 395, column: 26, scope: !889)
!913 = !DILocation(line: 397, column: 25, scope: !914)
!914 = distinct !DILexicalBlock(scope: !889, file: !3, line: 397, column: 25)
!915 = !DILocation(line: 397, column: 33, scope: !914)
!916 = !DILocation(line: 397, column: 30, scope: !914)
!917 = !DILocation(line: 397, column: 25, scope: !889)
!918 = !DILocation(line: 398, column: 29, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !3, line: 397, column: 40)
!920 = !DILocation(line: 399, column: 30, scope: !919)
!921 = !DILocation(line: 400, column: 21, scope: !919)
!922 = !DILocation(line: 401, column: 17, scope: !889)
!923 = !DILocation(line: 403, column: 39, scope: !685)
!924 = !DILocation(line: 403, column: 44, scope: !685)
!925 = !DILocation(line: 403, column: 50, scope: !685)
!926 = !DILocation(line: 403, column: 56, scope: !685)
!927 = !DILocation(line: 403, column: 65, scope: !685)
!928 = !DILocation(line: 403, column: 23, scope: !685)
!929 = !DILocation(line: 403, column: 21, scope: !685)
!930 = !DILocation(line: 405, column: 21, scope: !931)
!931 = distinct !DILexicalBlock(scope: !685, file: !3, line: 405, column: 21)
!932 = !DILocation(line: 405, column: 21, scope: !685)
!933 = !DILocation(line: 406, column: 25, scope: !934)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 406, column: 25)
!935 = distinct !DILexicalBlock(scope: !931, file: !3, line: 405, column: 33)
!936 = !DILocation(line: 406, column: 31, scope: !934)
!937 = !DILocation(line: 406, column: 29, scope: !934)
!938 = !DILocation(line: 406, column: 25, scope: !935)
!939 = !DILocation(line: 407, column: 29, scope: !940)
!940 = distinct !DILexicalBlock(scope: !934, file: !3, line: 406, column: 37)
!941 = !DILocation(line: 407, column: 32, scope: !940)
!942 = !DILocation(line: 408, column: 21, scope: !940)
!943 = !DILocation(line: 410, column: 43, scope: !935)
!944 = !DILocation(line: 410, column: 48, scope: !935)
!945 = !DILocation(line: 410, column: 54, scope: !935)
!946 = !DILocation(line: 410, column: 68, scope: !935)
!947 = !DILocation(line: 410, column: 27, scope: !935)
!948 = !DILocation(line: 410, column: 25, scope: !935)
!949 = !DILocation(line: 411, column: 17, scope: !935)
!950 = !DILocation(line: 413, column: 20, scope: !685)
!951 = !DILocation(line: 415, column: 17, scope: !685)
!952 = !DILocation(line: 419, column: 33, scope: !685)
!953 = !DILocation(line: 419, column: 21, scope: !685)
!954 = !DILocation(line: 420, column: 22, scope: !685)
!955 = !DILocation(line: 421, column: 17, scope: !685)
!956 = !DILocation(line: 425, column: 36, scope: !685)
!957 = !DILocation(line: 425, column: 24, scope: !685)
!958 = !DILocation(line: 425, column: 22, scope: !685)
!959 = !DILocation(line: 426, column: 21, scope: !685)
!960 = !DILocation(line: 427, column: 22, scope: !685)
!961 = !DILocation(line: 428, column: 22, scope: !685)
!962 = !DILocation(line: 429, column: 23, scope: !685)
!963 = !DILocation(line: 430, column: 17, scope: !685)
!964 = !DILocation(line: 433, column: 21, scope: !685)
!965 = !DILocation(line: 433, column: 19, scope: !685)
!966 = !DILocation(line: 434, column: 36, scope: !685)
!967 = !DILocation(line: 434, column: 38, scope: !685)
!968 = !DILocation(line: 434, column: 26, scope: !685)
!969 = !DILocation(line: 434, column: 21, scope: !685)
!970 = !DILocation(line: 434, column: 24, scope: !685)
!971 = !DILocation(line: 435, column: 20, scope: !685)
!972 = !DILocation(line: 437, column: 17, scope: !685)
!973 = !DILocation(line: 440, column: 21, scope: !685)
!974 = !DILocation(line: 440, column: 24, scope: !685)
!975 = !DILocation(line: 441, column: 20, scope: !685)
!976 = !DILocation(line: 443, column: 17, scope: !685)
!977 = !DILocation(line: 452, column: 21, scope: !685)
!978 = !DILocation(line: 452, column: 24, scope: !685)
!979 = !DILocation(line: 454, column: 20, scope: !685)
!980 = !DILocation(line: 456, column: 17, scope: !685)
!981 = !DILocation(line: 459, column: 21, scope: !685)
!982 = !DILocation(line: 459, column: 24, scope: !685)
!983 = !DILocation(line: 460, column: 20, scope: !685)
!984 = !DILocation(line: 462, column: 17, scope: !685)
!985 = !DILocation(line: 465, column: 30, scope: !685)
!986 = !DILocation(line: 465, column: 26, scope: !685)
!987 = !DILocation(line: 465, column: 21, scope: !685)
!988 = !DILocation(line: 465, column: 24, scope: !685)
!989 = !DILocation(line: 467, column: 17, scope: !685)
!990 = !DILocation(line: 470, column: 17, scope: !991)
!991 = distinct !DILexicalBlock(scope: !596, file: !3, line: 470, column: 17)
!992 = !DILocation(line: 470, column: 17, scope: !596)
!993 = !DILocation(line: 471, column: 21, scope: !994)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 471, column: 21)
!995 = distinct !DILexicalBlock(scope: !991, file: !3, line: 470, column: 23)
!996 = !DILocation(line: 471, column: 25, scope: !994)
!997 = !DILocation(line: 471, column: 21, scope: !995)
!998 = !DILocation(line: 472, column: 25, scope: !999)
!999 = distinct !DILexicalBlock(scope: !994, file: !3, line: 471, column: 30)
!1000 = !DILocation(line: 472, column: 28, scope: !999)
!1001 = !DILocation(line: 473, column: 40, scope: !999)
!1002 = !DILocation(line: 473, column: 39, scope: !999)
!1003 = !DILocation(line: 473, column: 26, scope: !999)
!1004 = !DILocation(line: 475, column: 17, scope: !999)
!1005 = !DILocation(line: 476, column: 39, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !994, file: !3, line: 475, column: 24)
!1007 = !DILocation(line: 476, column: 26, scope: !1006)
!1008 = !DILocation(line: 478, column: 13, scope: !995)
!1009 = !DILocation(line: 480, column: 35, scope: !596)
!1010 = !DILocation(line: 480, column: 40, scope: !596)
!1011 = !DILocation(line: 480, column: 46, scope: !596)
!1012 = !DILocation(line: 480, column: 52, scope: !596)
!1013 = !DILocation(line: 480, column: 58, scope: !596)
!1014 = !DILocation(line: 480, column: 63, scope: !596)
!1015 = !DILocation(line: 480, column: 19, scope: !596)
!1016 = !DILocation(line: 480, column: 17, scope: !596)
!1017 = !DILocation(line: 482, column: 16, scope: !596)
!1018 = !DILocation(line: 484, column: 9, scope: !596)
!1019 = !DILocation(line: 485, column: 26, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !590, file: !3, line: 484, column: 16)
!1021 = !DILocation(line: 485, column: 22, scope: !1020)
!1022 = !DILocation(line: 485, column: 17, scope: !1020)
!1023 = !DILocation(line: 485, column: 20, scope: !1020)
!1024 = !DILocation(line: 489, column: 12, scope: !511)
!1025 = !DILocation(line: 490, column: 1, scope: !511)
!1026 = !DILocation(line: 489, column: 5, scope: !511)
!1027 = distinct !DISubprogram(name: "ngx_snprintf", scope: !3, file: !3, line: 135, type: !1028, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!6, !6, !10, !54, null}
!1030 = !{!1031, !1032, !1033, !1034, !1035}
!1031 = !DILocalVariable(name: "buf", arg: 1, scope: !1027, file: !3, line: 135, type: !6)
!1032 = !DILocalVariable(name: "max", arg: 2, scope: !1027, file: !3, line: 135, type: !10)
!1033 = !DILocalVariable(name: "fmt", arg: 3, scope: !1027, file: !3, line: 135, type: !54)
!1034 = !DILocalVariable(name: "p", scope: !1027, file: !3, line: 137, type: !6)
!1035 = !DILocalVariable(name: "args", scope: !1027, file: !3, line: 138, type: !490)
!1036 = !DILocation(line: 135, column: 22, scope: !1027)
!1037 = !DILocation(line: 135, column: 34, scope: !1027)
!1038 = !DILocation(line: 135, column: 51, scope: !1027)
!1039 = !DILocation(line: 137, column: 5, scope: !1027)
!1040 = !DILocation(line: 137, column: 15, scope: !1027)
!1041 = !DILocation(line: 138, column: 5, scope: !1027)
!1042 = !DILocation(line: 138, column: 15, scope: !1027)
!1043 = !DILocation(line: 140, column: 5, scope: !1027)
!1044 = !DILocation(line: 141, column: 23, scope: !1027)
!1045 = !DILocation(line: 141, column: 28, scope: !1027)
!1046 = !DILocation(line: 141, column: 34, scope: !1027)
!1047 = !DILocation(line: 141, column: 32, scope: !1027)
!1048 = !DILocation(line: 141, column: 39, scope: !1027)
!1049 = !DILocation(line: 141, column: 44, scope: !1027)
!1050 = !DILocation(line: 141, column: 9, scope: !1027)
!1051 = !DILocation(line: 141, column: 7, scope: !1027)
!1052 = !DILocation(line: 142, column: 5, scope: !1027)
!1053 = !DILocation(line: 144, column: 12, scope: !1027)
!1054 = !DILocation(line: 145, column: 1, scope: !1027)
!1055 = !DILocation(line: 144, column: 5, scope: !1027)
!1056 = distinct !DISubprogram(name: "ngx_slprintf", scope: !3, file: !3, line: 149, type: !1057, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !1059)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!6, !6, !6, !54, null}
!1059 = !{!1060, !1061, !1062, !1063, !1064}
!1060 = !DILocalVariable(name: "buf", arg: 1, scope: !1056, file: !3, line: 149, type: !6)
!1061 = !DILocalVariable(name: "last", arg: 2, scope: !1056, file: !3, line: 149, type: !6)
!1062 = !DILocalVariable(name: "fmt", arg: 3, scope: !1056, file: !3, line: 149, type: !54)
!1063 = !DILocalVariable(name: "p", scope: !1056, file: !3, line: 151, type: !6)
!1064 = !DILocalVariable(name: "args", scope: !1056, file: !3, line: 152, type: !490)
!1065 = !DILocation(line: 149, column: 22, scope: !1056)
!1066 = !DILocation(line: 149, column: 35, scope: !1056)
!1067 = !DILocation(line: 149, column: 53, scope: !1056)
!1068 = !DILocation(line: 151, column: 5, scope: !1056)
!1069 = !DILocation(line: 151, column: 15, scope: !1056)
!1070 = !DILocation(line: 152, column: 5, scope: !1056)
!1071 = !DILocation(line: 152, column: 15, scope: !1056)
!1072 = !DILocation(line: 154, column: 5, scope: !1056)
!1073 = !DILocation(line: 155, column: 23, scope: !1056)
!1074 = !DILocation(line: 155, column: 28, scope: !1056)
!1075 = !DILocation(line: 155, column: 34, scope: !1056)
!1076 = !DILocation(line: 155, column: 39, scope: !1056)
!1077 = !DILocation(line: 155, column: 9, scope: !1056)
!1078 = !DILocation(line: 155, column: 7, scope: !1056)
!1079 = !DILocation(line: 156, column: 5, scope: !1056)
!1080 = !DILocation(line: 158, column: 12, scope: !1056)
!1081 = !DILocation(line: 159, column: 1, scope: !1056)
!1082 = !DILocation(line: 158, column: 5, scope: !1056)
!1083 = !DILocation(line: 494, column: 25, scope: !154)
!1084 = !DILocation(line: 494, column: 38, scope: !154)
!1085 = !DILocation(line: 494, column: 53, scope: !154)
!1086 = !DILocation(line: 494, column: 66, scope: !154)
!1087 = !DILocation(line: 495, column: 16, scope: !154)
!1088 = !DILocation(line: 495, column: 40, scope: !154)
!1089 = !DILocation(line: 497, column: 5, scope: !154)
!1090 = !DILocation(line: 497, column: 21, scope: !154)
!1091 = !DILocation(line: 497, column: 24, scope: !154)
!1092 = !DILocation(line: 502, column: 5, scope: !154)
!1093 = !DILocation(line: 502, column: 21, scope: !154)
!1094 = !DILocation(line: 503, column: 5, scope: !154)
!1095 = !DILocation(line: 503, column: 21, scope: !154)
!1096 = !DILocation(line: 507, column: 9, scope: !154)
!1097 = !DILocation(line: 507, column: 14, scope: !154)
!1098 = !DILocation(line: 507, column: 7, scope: !154)
!1099 = !DILocation(line: 509, column: 9, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !154, file: !3, line: 509, column: 9)
!1101 = !DILocation(line: 509, column: 21, scope: !1100)
!1102 = !DILocation(line: 509, column: 9, scope: !154)
!1103 = !DILocation(line: 511, column: 13, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 511, column: 13)
!1105 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 509, column: 27)
!1106 = !DILocation(line: 511, column: 18, scope: !1104)
!1107 = !DILocation(line: 511, column: 13, scope: !1105)
!1108 = !DILocation(line: 528, column: 31, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 511, column: 54)
!1110 = !DILocation(line: 528, column: 20, scope: !1109)
!1111 = !DILocation(line: 528, column: 18, scope: !1109)
!1112 = !DILocation(line: 530, column: 13, scope: !1109)
!1113 = distinct !{!1113, !1112, !1114}
!1114 = !DILocation(line: 532, column: 32, scope: !1109)
!1115 = !DILocation(line: 531, column: 34, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 530, column: 16)
!1117 = !DILocation(line: 531, column: 39, scope: !1116)
!1118 = !DILocation(line: 531, column: 44, scope: !1116)
!1119 = !DILocation(line: 531, column: 24, scope: !1116)
!1120 = !DILocation(line: 531, column: 18, scope: !1116)
!1121 = !DILocation(line: 531, column: 22, scope: !1116)
!1122 = !DILocation(line: 532, column: 13, scope: !1116)
!1123 = !DILocation(line: 532, column: 27, scope: !1109)
!1124 = !DILocation(line: 534, column: 9, scope: !1109)
!1125 = !DILocation(line: 535, column: 13, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 534, column: 16)
!1127 = distinct !{!1127, !1125, !1128}
!1128 = !DILocation(line: 537, column: 32, scope: !1126)
!1129 = !DILocation(line: 536, column: 34, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 535, column: 16)
!1131 = !DILocation(line: 536, column: 39, scope: !1130)
!1132 = !DILocation(line: 536, column: 44, scope: !1130)
!1133 = !DILocation(line: 536, column: 24, scope: !1130)
!1134 = !DILocation(line: 536, column: 18, scope: !1130)
!1135 = !DILocation(line: 536, column: 22, scope: !1130)
!1136 = !DILocation(line: 537, column: 13, scope: !1130)
!1137 = !DILocation(line: 537, column: 27, scope: !1126)
!1138 = !DILocation(line: 540, column: 5, scope: !1105)
!1139 = !DILocation(line: 540, column: 16, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 540, column: 16)
!1141 = !DILocation(line: 540, column: 28, scope: !1140)
!1142 = !DILocation(line: 540, column: 16, scope: !1100)
!1143 = !DILocation(line: 542, column: 9, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 540, column: 34)
!1145 = distinct !{!1145, !1143, !1146}
!1146 = !DILocation(line: 547, column: 28, scope: !1144)
!1147 = !DILocation(line: 545, column: 36, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 542, column: 12)
!1149 = !DILocation(line: 545, column: 41, scope: !1148)
!1150 = !DILocation(line: 545, column: 24, scope: !1148)
!1151 = !DILocation(line: 545, column: 20, scope: !1148)
!1152 = !DILocation(line: 545, column: 14, scope: !1148)
!1153 = !DILocation(line: 545, column: 18, scope: !1148)
!1154 = !DILocation(line: 547, column: 9, scope: !1148)
!1155 = !DILocation(line: 547, column: 23, scope: !1144)
!1156 = !DILocation(line: 549, column: 5, scope: !1144)
!1157 = !DILocation(line: 551, column: 9, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 549, column: 12)
!1159 = distinct !{!1159, !1157, !1160}
!1160 = !DILocation(line: 556, column: 28, scope: !1158)
!1161 = !DILocation(line: 554, column: 36, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 551, column: 12)
!1163 = !DILocation(line: 554, column: 41, scope: !1162)
!1164 = !DILocation(line: 554, column: 24, scope: !1162)
!1165 = !DILocation(line: 554, column: 20, scope: !1162)
!1166 = !DILocation(line: 554, column: 14, scope: !1162)
!1167 = !DILocation(line: 554, column: 18, scope: !1162)
!1168 = !DILocation(line: 556, column: 9, scope: !1162)
!1169 = !DILocation(line: 556, column: 23, scope: !1158)
!1170 = !DILocation(line: 561, column: 12, scope: !154)
!1171 = !DILocation(line: 561, column: 17, scope: !154)
!1172 = !DILocation(line: 561, column: 36, scope: !154)
!1173 = !DILocation(line: 561, column: 34, scope: !154)
!1174 = !DILocation(line: 561, column: 9, scope: !154)
!1175 = !DILocation(line: 563, column: 5, scope: !154)
!1176 = !DILocation(line: 563, column: 15, scope: !154)
!1177 = !DILocation(line: 563, column: 20, scope: !154)
!1178 = !DILocation(line: 563, column: 18, scope: !154)
!1179 = !DILocation(line: 563, column: 26, scope: !154)
!1180 = !DILocation(line: 563, column: 29, scope: !154)
!1181 = !DILocation(line: 563, column: 35, scope: !154)
!1182 = !DILocation(line: 563, column: 33, scope: !154)
!1183 = !DILocation(line: 564, column: 18, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !154, file: !3, line: 563, column: 41)
!1185 = !DILocation(line: 564, column: 13, scope: !1184)
!1186 = !DILocation(line: 564, column: 16, scope: !1184)
!1187 = distinct !{!1187, !1175, !1188}
!1188 = !DILocation(line: 565, column: 5, scope: !154)
!1189 = !DILocation(line: 569, column: 12, scope: !154)
!1190 = !DILocation(line: 569, column: 17, scope: !154)
!1191 = !DILocation(line: 569, column: 36, scope: !154)
!1192 = !DILocation(line: 569, column: 34, scope: !154)
!1193 = !DILocation(line: 569, column: 9, scope: !154)
!1194 = !DILocation(line: 571, column: 9, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !154, file: !3, line: 571, column: 9)
!1196 = !DILocation(line: 571, column: 15, scope: !1195)
!1197 = !DILocation(line: 571, column: 13, scope: !1195)
!1198 = !DILocation(line: 571, column: 21, scope: !1195)
!1199 = !DILocation(line: 571, column: 19, scope: !1195)
!1200 = !DILocation(line: 571, column: 9, scope: !154)
!1201 = !DILocation(line: 572, column: 15, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 571, column: 27)
!1203 = !DILocation(line: 572, column: 22, scope: !1202)
!1204 = !DILocation(line: 572, column: 20, scope: !1202)
!1205 = !DILocation(line: 572, column: 13, scope: !1202)
!1206 = !DILocation(line: 573, column: 5, scope: !1202)
!1207 = !DILocation(line: 575, column: 12, scope: !154)
!1208 = !DILocation(line: 576, column: 1, scope: !154)
!1209 = !DILocation(line: 575, column: 5, scope: !154)
!1210 = distinct !DISubprogram(name: "ngx_strcasecmp", scope: !3, file: !3, line: 587, type: !1211, isLocal: false, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !1213)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!48, !6, !6}
!1213 = !{!1214, !1215, !1216, !1217}
!1214 = !DILocalVariable(name: "s1", arg: 1, scope: !1210, file: !3, line: 587, type: !6)
!1215 = !DILocalVariable(name: "s2", arg: 2, scope: !1210, file: !3, line: 587, type: !6)
!1216 = !DILocalVariable(name: "c1", scope: !1210, file: !3, line: 589, type: !20)
!1217 = !DILocalVariable(name: "c2", scope: !1210, file: !3, line: 589, type: !20)
!1218 = !DILocation(line: 587, column: 24, scope: !1210)
!1219 = !DILocation(line: 587, column: 36, scope: !1210)
!1220 = !DILocation(line: 589, column: 5, scope: !1210)
!1221 = !DILocation(line: 589, column: 17, scope: !1210)
!1222 = !DILocation(line: 589, column: 21, scope: !1210)
!1223 = !DILocation(line: 591, column: 5, scope: !1210)
!1224 = !DILocation(line: 592, column: 30, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 591, column: 16)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 591, column: 5)
!1227 = distinct !DILexicalBlock(scope: !1210, file: !3, line: 591, column: 5)
!1228 = !DILocation(line: 592, column: 27, scope: !1225)
!1229 = !DILocation(line: 592, column: 14, scope: !1225)
!1230 = !DILocation(line: 592, column: 12, scope: !1225)
!1231 = !DILocation(line: 593, column: 30, scope: !1225)
!1232 = !DILocation(line: 593, column: 27, scope: !1225)
!1233 = !DILocation(line: 593, column: 14, scope: !1225)
!1234 = !DILocation(line: 593, column: 12, scope: !1225)
!1235 = !DILocation(line: 595, column: 15, scope: !1225)
!1236 = !DILocation(line: 595, column: 18, scope: !1225)
!1237 = !DILocation(line: 595, column: 25, scope: !1225)
!1238 = !DILocation(line: 595, column: 28, scope: !1225)
!1239 = !DILocation(line: 595, column: 31, scope: !1225)
!1240 = !DILocation(line: 595, column: 14, scope: !1225)
!1241 = !DILocation(line: 595, column: 42, scope: !1225)
!1242 = !DILocation(line: 595, column: 45, scope: !1225)
!1243 = !DILocation(line: 595, column: 55, scope: !1225)
!1244 = !DILocation(line: 595, column: 12, scope: !1225)
!1245 = !DILocation(line: 596, column: 15, scope: !1225)
!1246 = !DILocation(line: 596, column: 18, scope: !1225)
!1247 = !DILocation(line: 596, column: 25, scope: !1225)
!1248 = !DILocation(line: 596, column: 28, scope: !1225)
!1249 = !DILocation(line: 596, column: 31, scope: !1225)
!1250 = !DILocation(line: 596, column: 14, scope: !1225)
!1251 = !DILocation(line: 596, column: 42, scope: !1225)
!1252 = !DILocation(line: 596, column: 45, scope: !1225)
!1253 = !DILocation(line: 596, column: 55, scope: !1225)
!1254 = !DILocation(line: 596, column: 12, scope: !1225)
!1255 = !DILocation(line: 598, column: 13, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 598, column: 13)
!1257 = !DILocation(line: 598, column: 19, scope: !1256)
!1258 = !DILocation(line: 598, column: 16, scope: !1256)
!1259 = !DILocation(line: 598, column: 13, scope: !1225)
!1260 = !DILocation(line: 600, column: 17, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 600, column: 17)
!1262 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 598, column: 23)
!1263 = !DILocation(line: 600, column: 17, scope: !1262)
!1264 = !DILocation(line: 601, column: 17, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 600, column: 21)
!1266 = distinct !{!1266, !1267, !1268}
!1267 = !DILocation(line: 591, column: 5, scope: !1227)
!1268 = !DILocation(line: 608, column: 5, scope: !1227)
!1269 = !DILocation(line: 604, column: 13, scope: !1262)
!1270 = !DILocation(line: 607, column: 16, scope: !1225)
!1271 = !DILocation(line: 607, column: 21, scope: !1225)
!1272 = !DILocation(line: 607, column: 19, scope: !1225)
!1273 = !DILocation(line: 607, column: 9, scope: !1225)
!1274 = !DILocation(line: 609, column: 1, scope: !1210)
!1275 = distinct !DISubprogram(name: "ngx_strncasecmp", scope: !3, file: !3, line: 613, type: !1276, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !1278)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!48, !6, !6, !10}
!1278 = !{!1279, !1280, !1281, !1282, !1283}
!1279 = !DILocalVariable(name: "s1", arg: 1, scope: !1275, file: !3, line: 613, type: !6)
!1280 = !DILocalVariable(name: "s2", arg: 2, scope: !1275, file: !3, line: 613, type: !6)
!1281 = !DILocalVariable(name: "n", arg: 3, scope: !1275, file: !3, line: 613, type: !10)
!1282 = !DILocalVariable(name: "c1", scope: !1275, file: !3, line: 615, type: !20)
!1283 = !DILocalVariable(name: "c2", scope: !1275, file: !3, line: 615, type: !20)
!1284 = !DILocation(line: 613, column: 25, scope: !1275)
!1285 = !DILocation(line: 613, column: 37, scope: !1275)
!1286 = !DILocation(line: 613, column: 48, scope: !1275)
!1287 = !DILocation(line: 615, column: 5, scope: !1275)
!1288 = !DILocation(line: 615, column: 17, scope: !1275)
!1289 = !DILocation(line: 615, column: 21, scope: !1275)
!1290 = !DILocation(line: 617, column: 5, scope: !1275)
!1291 = !DILocation(line: 617, column: 12, scope: !1275)
!1292 = !DILocation(line: 618, column: 30, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1275, file: !3, line: 617, column: 15)
!1294 = !DILocation(line: 618, column: 27, scope: !1293)
!1295 = !DILocation(line: 618, column: 14, scope: !1293)
!1296 = !DILocation(line: 618, column: 12, scope: !1293)
!1297 = !DILocation(line: 619, column: 30, scope: !1293)
!1298 = !DILocation(line: 619, column: 27, scope: !1293)
!1299 = !DILocation(line: 619, column: 14, scope: !1293)
!1300 = !DILocation(line: 619, column: 12, scope: !1293)
!1301 = !DILocation(line: 621, column: 15, scope: !1293)
!1302 = !DILocation(line: 621, column: 18, scope: !1293)
!1303 = !DILocation(line: 621, column: 25, scope: !1293)
!1304 = !DILocation(line: 621, column: 28, scope: !1293)
!1305 = !DILocation(line: 621, column: 31, scope: !1293)
!1306 = !DILocation(line: 621, column: 14, scope: !1293)
!1307 = !DILocation(line: 621, column: 42, scope: !1293)
!1308 = !DILocation(line: 621, column: 45, scope: !1293)
!1309 = !DILocation(line: 621, column: 55, scope: !1293)
!1310 = !DILocation(line: 621, column: 12, scope: !1293)
!1311 = !DILocation(line: 622, column: 15, scope: !1293)
!1312 = !DILocation(line: 622, column: 18, scope: !1293)
!1313 = !DILocation(line: 622, column: 25, scope: !1293)
!1314 = !DILocation(line: 622, column: 28, scope: !1293)
!1315 = !DILocation(line: 622, column: 31, scope: !1293)
!1316 = !DILocation(line: 622, column: 14, scope: !1293)
!1317 = !DILocation(line: 622, column: 42, scope: !1293)
!1318 = !DILocation(line: 622, column: 45, scope: !1293)
!1319 = !DILocation(line: 622, column: 55, scope: !1293)
!1320 = !DILocation(line: 622, column: 12, scope: !1293)
!1321 = !DILocation(line: 624, column: 13, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1293, file: !3, line: 624, column: 13)
!1323 = !DILocation(line: 624, column: 19, scope: !1322)
!1324 = !DILocation(line: 624, column: 16, scope: !1322)
!1325 = !DILocation(line: 624, column: 13, scope: !1293)
!1326 = !DILocation(line: 626, column: 17, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1328, file: !3, line: 626, column: 17)
!1328 = distinct !DILexicalBlock(scope: !1322, file: !3, line: 624, column: 23)
!1329 = !DILocation(line: 626, column: 17, scope: !1328)
!1330 = !DILocation(line: 627, column: 18, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1327, file: !3, line: 626, column: 21)
!1332 = !DILocation(line: 628, column: 17, scope: !1331)
!1333 = distinct !{!1333, !1290, !1334}
!1334 = !DILocation(line: 635, column: 5, scope: !1275)
!1335 = !DILocation(line: 631, column: 13, scope: !1328)
!1336 = !DILocation(line: 634, column: 16, scope: !1293)
!1337 = !DILocation(line: 634, column: 21, scope: !1293)
!1338 = !DILocation(line: 634, column: 19, scope: !1293)
!1339 = !DILocation(line: 634, column: 9, scope: !1293)
!1340 = !DILocation(line: 637, column: 5, scope: !1275)
!1341 = !DILocation(line: 638, column: 1, scope: !1275)
!1342 = distinct !DISubprogram(name: "ngx_strnstr", scope: !3, file: !3, line: 642, type: !1343, isLocal: false, isDefinition: true, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true, unit: !13, variables: !1345)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!6, !6, !418, !10}
!1345 = !{!1346, !1347, !1348, !1349, !1350, !1351}
!1346 = !DILocalVariable(name: "s1", arg: 1, scope: !1342, file: !3, line: 642, type: !6)
!1347 = !DILocalVariable(name: "s2", arg: 2, scope: !1342, file: !3, line: 642, type: !418)
!1348 = !DILocalVariable(name: "len", arg: 3, scope: !1342, file: !3, line: 642, type: !10)
!1349 = !DILocalVariable(name: "c1", scope: !1342, file: !3, line: 644, type: !7)
!1350 = !DILocalVariable(name: "c2", scope: !1342, file: !3, line: 644, type: !7)
!1351 = !DILocalVariable(name: "n", scope: !1342, file: !3, line: 645, type: !10)
!1352 = !DILocation(line: 642, column: 21, scope: !1342)
!1353 = !DILocation(line: 642, column: 31, scope: !1342)
!1354 = !DILocation(line: 642, column: 42, scope: !1342)
!1355 = !DILocation(line: 644, column: 5, scope: !1342)
!1356 = !DILocation(line: 644, column: 13, scope: !1342)
!1357 = !DILocation(line: 644, column: 17, scope: !1342)
!1358 = !DILocation(line: 645, column: 5, scope: !1342)
!1359 = !DILocation(line: 645, column: 13, scope: !1342)
!1360 = !DILocation(line: 647, column: 24, scope: !1342)
!1361 = !DILocation(line: 647, column: 10, scope: !1342)
!1362 = !DILocation(line: 647, column: 8, scope: !1342)
!1363 = !DILocation(line: 649, column: 9, scope: !1342)
!1364 = !DILocation(line: 649, column: 7, scope: !1342)
!1365 = !DILocation(line: 651, column: 5, scope: !1342)
!1366 = distinct !{!1366, !1365, !1367}
!1367 = !DILocation(line: 669, column: 52, scope: !1342)
!1368 = !DILocation(line: 652, column: 9, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1342, file: !3, line: 651, column: 8)
!1370 = distinct !{!1370, !1368, !1371}
!1371 = !DILocation(line: 663, column: 26, scope: !1369)
!1372 = !DILocation(line: 653, column: 20, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1374, file: !3, line: 653, column: 17)
!1374 = distinct !DILexicalBlock(scope: !1369, file: !3, line: 652, column: 12)
!1375 = !DILocation(line: 653, column: 23, scope: !1373)
!1376 = !DILocation(line: 653, column: 17, scope: !1374)
!1377 = !DILocation(line: 654, column: 17, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1373, file: !3, line: 653, column: 29)
!1379 = !DILocation(line: 657, column: 21, scope: !1374)
!1380 = !DILocation(line: 657, column: 18, scope: !1374)
!1381 = !DILocation(line: 657, column: 16, scope: !1374)
!1382 = !DILocation(line: 659, column: 17, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1374, file: !3, line: 659, column: 17)
!1384 = !DILocation(line: 659, column: 20, scope: !1383)
!1385 = !DILocation(line: 659, column: 17, scope: !1374)
!1386 = !DILocation(line: 660, column: 17, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1383, file: !3, line: 659, column: 26)
!1388 = !DILocation(line: 663, column: 9, scope: !1374)
!1389 = !DILocation(line: 663, column: 18, scope: !1369)
!1390 = !DILocation(line: 663, column: 24, scope: !1369)
!1391 = !DILocation(line: 663, column: 21, scope: !1369)
!1392 = !DILocation(line: 665, column: 13, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1369, file: !3, line: 665, column: 13)
!1394 = !DILocation(line: 665, column: 17, scope: !1393)
!1395 = !DILocation(line: 665, column: 15, scope: !1393)
!1396 = !DILocation(line: 665, column: 13, scope: !1369)
!1397 = !DILocation(line: 666, column: 13, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1393, file: !3, line: 665, column: 22)
!1399 = !DILocation(line: 669, column: 5, scope: !1369)
!1400 = !DILocation(line: 669, column: 14, scope: !1342)
!1401 = !DILocation(line: 669, column: 48, scope: !1342)
!1402 = !DILocation(line: 671, column: 12, scope: !1342)
!1403 = !DILocation(line: 671, column: 5, scope: !1342)
!1404 = !DILocation(line: 672, column: 1, scope: !1342)
