; ModuleID = 'src/core/ngx_module.c'
source_filename = "src/core/ngx_module.c"
target datalayout = "e-p:32:32-i64:64-v128:32:128-n32-S128"
target triple = "asmjs-unknown-emscripten"

%struct.ngx_module_s = type { i32, i32, i8*, i32, i32, i32, i8*, i8*, %struct.ngx_command_s*, i32, i32 (%struct.ngx_log_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, i32 (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, void (%struct.ngx_cycle_s*)*, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ngx_command_s = type { %struct.ngx_str_t, i32, i8* (%struct.ngx_conf_s*, %struct.ngx_command_s*, i8*)*, i32, i32, i8* }
%struct.ngx_str_t = type { i32, i8* }
%struct.ngx_conf_s = type { i8*, %struct.ngx_array_t*, %struct.ngx_cycle_s*, %struct.ngx_pool_s*, %struct.ngx_pool_s*, %struct.ngx_conf_file_t*, %struct.ngx_log_s*, i8*, i32, i32, {}*, i8* }
%struct.ngx_array_t = type { i8*, i32, i32, i32, %struct.ngx_pool_s* }

!0 = !DIGlobalVariableExpression(var: !1)
!1 = distinct !DIGlobalVariable(name: "ngx_modules_n", scope: !2, file: !3, line: 22, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15)
!3 = !DIFile(filename: "src/core/ngx_module.c", directory: "/home/sam/Projects/nginx-1.12.2")
!4 = !{}
!5 = !{!6, !7, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_uint_t", file: !8, line: 79, baseType: !9)
!8 = !DIFile(filename: "src/core/ngx_config.h", directory: "/home/sam/Projects/nginx-1.12.2")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/alltypes.h", directory: "/home/sam/Projects/nginx-1.12.2")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !{!16, !0}
!16 = !DIGlobalVariableExpression(var: !17)
!17 = distinct !DIGlobalVariable(name: "ngx_max_module", scope: !2, file: !3, line: 21, type: !7, isLocal: false, isDefinition: true)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{!"clang version 4.0.0  (emscripten 1.37.22 : 1.37.22)"}
!21 = distinct !DISubprogram(name: "ngx_preinit_modules", scope: !3, file: !3, line: 26, type: !22, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !27)
!22 = !DISubroutineType(types: !23)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_int_t", file: !8, line: 78, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 140, baseType: !26)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28}
!28 = !DILocalVariable(name: "i", scope: !21, file: !3, line: 28, type: !7)
!29 = !DILocation(line: 28, column: 5, scope: !21)
!30 = !DIExpression()
!31 = !DILocation(line: 28, column: 17, scope: !21)
!32 = !DILocation(line: 30, column: 12, scope: !33)
!33 = distinct !DILexicalBlock(scope: !21, file: !3, line: 30, column: 5)
!34 = !{!35, !35, i64 0}
!35 = !{!"int", !36, i64 0}
!36 = !{!"omnipotent char", !37, i64 0}
!37 = !{!"Simple C/C++ TBAA"}
!38 = !DILocation(line: 30, column: 10, scope: !33)
!39 = !DILocation(line: 30, column: 29, scope: !40)
!40 = distinct !DILexicalBlock(scope: !33, file: !3, line: 30, column: 5)
!41 = !DILocation(line: 30, column: 17, scope: !40)
!42 = !{!43, !43, i64 0}
!43 = !{!"any pointer", !36, i64 0}
!44 = !DILocation(line: 30, column: 5, scope: !33)
!45 = !DILocation(line: 31, column: 33, scope: !46)
!46 = distinct !DILexicalBlock(scope: !40, file: !3, line: 30, column: 38)
!47 = !DILocation(line: 31, column: 21, scope: !46)
!48 = !DILocation(line: 31, column: 9, scope: !46)
!49 = !DILocation(line: 31, column: 25, scope: !46)
!50 = !DILocation(line: 31, column: 31, scope: !46)
!51 = !{!52, !35, i64 4}
!52 = !{!"ngx_module_s", !35, i64 0, !35, i64 4, !43, i64 8, !35, i64 12, !35, i64 16, !35, i64 20, !43, i64 24, !43, i64 28, !43, i64 32, !35, i64 36, !43, i64 40, !43, i64 44, !43, i64 48, !43, i64 52, !43, i64 56, !43, i64 60, !43, i64 64, !35, i64 68, !35, i64 72, !35, i64 76, !35, i64 80, !35, i64 84, !35, i64 88, !35, i64 92, !35, i64 96}
!53 = !DILocation(line: 32, column: 49, scope: !46)
!54 = !DILocation(line: 32, column: 32, scope: !46)
!55 = !DILocation(line: 32, column: 21, scope: !46)
!56 = !DILocation(line: 32, column: 9, scope: !46)
!57 = !DILocation(line: 32, column: 25, scope: !46)
!58 = !DILocation(line: 32, column: 30, scope: !46)
!59 = !{!52, !43, i64 8}
!60 = !DILocation(line: 33, column: 5, scope: !46)
!61 = !DILocation(line: 30, column: 34, scope: !40)
!62 = !DILocation(line: 30, column: 5, scope: !40)
!63 = distinct !{!63, !44, !64}
!64 = !DILocation(line: 33, column: 5, scope: !33)
!65 = !DILocation(line: 35, column: 21, scope: !21)
!66 = !DILocation(line: 35, column: 19, scope: !21)
!67 = !DILocation(line: 36, column: 22, scope: !21)
!68 = !DILocation(line: 36, column: 36, scope: !21)
!69 = !DILocation(line: 36, column: 20, scope: !21)
!70 = !DILocation(line: 39, column: 1, scope: !21)
!71 = !DILocation(line: 38, column: 5, scope: !21)
!72 = distinct !DISubprogram(name: "ngx_cycle_modules", scope: !3, file: !3, line: 43, type: !73, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !552)
!73 = !DISubroutineType(types: !74)
!74 = !{!24, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_cycle_t", file: !77, line: 17, baseType: !78)
!77 = !DIFile(filename: "src/core/ngx_core.h", directory: "/home/sam/Projects/nginx-1.12.2")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_cycle_s", file: !79, line: 38, size: 2496, elements: !80)
!79 = !DIFile(filename: "src/core/ngx_cycle.h", directory: "/home/sam/Projects/nginx-1.12.2")
!80 = !{!81, !85, !265, !266, !267, !268, !404, !405, !406, !493, !494, !495, !496, !497, !498, !499, !500, !521, !522, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "conf_ctx", scope: !78, file: !79, line: 39, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !78, file: !79, line: 40, baseType: !86, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_t", file: !77, line: 18, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_s", file: !89, line: 57, size: 320, elements: !90)
!89 = !DIFile(filename: "src/core/ngx_palloc.h", directory: "/home/sam/Projects/nginx-1.12.2")
!90 = !{!91, !103, !105, !106, !245, !252, !264}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !88, file: !89, line: 58, baseType: !92, size: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_data_t", file: !89, line: 54, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 49, size: 128, elements: !94)
!94 = !{!95, !100, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !93, file: !89, line: 50, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !98, line: 64, baseType: !99)
!98 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/types.h", directory: "/home/sam/Projects/nginx-1.12.2")
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !93, file: !89, line: 51, baseType: !96, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !89, line: 52, baseType: !86, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !93, file: !89, line: 53, baseType: !7, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !88, file: !89, line: 59, baseType: !104, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 120, baseType: !11)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !88, file: !89, line: 60, baseType: !86, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !88, file: !89, line: 61, baseType: !107, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_chain_t", file: !77, line: 19, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_chain_s", file: !110, line: 59, size: 64, elements: !111)
!110 = !DIFile(filename: "src/core/ngx_buf.h", directory: "/home/sam/Projects/nginx-1.12.2")
!111 = !{!112, !244}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !109, file: !110, line: 60, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_t", file: !110, line: 18, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_buf_s", file: !110, line: 20, size: 352, elements: !116)
!116 = !{!117, !118, !119, !121, !122, !123, !124, !126, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !115, file: !110, line: 21, baseType: !96, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !115, file: !110, line: 22, baseType: !96, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "file_pos", scope: !115, file: !110, line: 23, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !10, line: 222, baseType: !26)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "file_last", scope: !115, file: !110, line: 24, baseType: !120, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !115, file: !110, line: 26, baseType: !96, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !115, file: !110, line: 27, baseType: !96, size: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !115, file: !110, line: 28, baseType: !125, size: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_buf_tag_t", file: !110, line: 16, baseType: !6)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !115, file: !110, line: 29, baseType: !127, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_t", file: !77, line: 23, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_file_s", file: !130, line: 16, size: 1216, elements: !131)
!130 = !DIFile(filename: "src/core/ngx_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!131 = !{!132, !135, !142, !187, !188, !189, !229, !230}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !129, file: !130, line: 17, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_fd_t", file: !134, line: 16, baseType: !26)
!134 = !DIFile(filename: "src/os/unix/ngx_files.h", directory: "/home/sam/Projects/nginx-1.12.2")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 18, baseType: !136, size: 64, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_str_t", file: !137, line: 19, baseType: !138)
!137 = !DIFile(filename: "src/core/ngx_string.h", directory: "/home/sam/Projects/nginx-1.12.2")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !137, line: 16, size: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !137, line: 17, baseType: !104, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !137, line: 18, baseType: !96, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !129, file: !130, line: 19, baseType: !143, size: 960, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_file_info_t", file: !134, line: 17, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !145, line: 4, size: 960, elements: !146)
!145 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/bits/stat.h", directory: "/home/sam/Projects/nginx-1.12.2")
!146 = !{!147, !149, !150, !152, !153, !155, !156, !158, !160, !162, !163, !164, !165, !166, !167, !170, !171, !173, !174, !180, !181, !182}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !144, file: !145, line: 6, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !10, line: 232, baseType: !11)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__st_dev_pad", scope: !144, file: !145, line: 7, baseType: !148, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !144, file: !145, line: 8, baseType: !151, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !10, line: 227, baseType: !11)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__st_ino_pad", scope: !144, file: !145, line: 9, baseType: !151, size: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !144, file: !145, line: 10, baseType: !154, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !10, line: 217, baseType: !11)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__st_nlink_pad", scope: !144, file: !145, line: 11, baseType: !154, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !144, file: !145, line: 13, baseType: !157, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !10, line: 212, baseType: !11)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !144, file: !145, line: 14, baseType: !159, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !10, line: 304, baseType: !11)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !144, file: !145, line: 15, baseType: !161, size: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !10, line: 309, baseType: !11)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !144, file: !145, line: 16, baseType: !11, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !144, file: !145, line: 17, baseType: !148, size: 32, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__st_rdev_pad", scope: !144, file: !145, line: 18, baseType: !148, size: 32, offset: 352)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !144, file: !145, line: 19, baseType: !120, size: 32, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__st_size_pad", scope: !144, file: !145, line: 20, baseType: !120, size: 32, offset: 416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !144, file: !145, line: 21, baseType: !168, size: 32, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !10, line: 237, baseType: !169)
!169 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blksize_pad", scope: !144, file: !145, line: 22, baseType: !168, size: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !144, file: !145, line: 23, baseType: !172, size: 32, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !10, line: 242, baseType: !26)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__st_blocks_pad", scope: !144, file: !145, line: 24, baseType: !172, size: 32, offset: 544)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !144, file: !145, line: 26, baseType: !175, size: 64, offset: 576)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !10, line: 288, size: 64, elements: !176)
!176 = !{!177, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !175, file: !10, line: 288, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !169)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !175, file: !10, line: 288, baseType: !169, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !144, file: !145, line: 27, baseType: !175, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !144, file: !145, line: 28, baseType: !175, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !144, file: !145, line: 29, baseType: !183, size: 192, offset: 768)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 192, elements: !185)
!184 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!185 = !{!186}
!186 = !DISubrange(count: 3)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !129, file: !130, line: 21, baseType: !120, size: 32, offset: 1088)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sys_offset", scope: !129, file: !130, line: 22, baseType: !120, size: 32, offset: 1120)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !129, file: !130, line: 24, baseType: !190, size: 32, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_t", file: !77, line: 20, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_log_s", file: !193, line: 50, size: 320, elements: !194)
!193 = !DIFile(filename: "src/core/ngx_log.h", directory: "/home/sam/Projects/nginx-1.12.2")
!194 = !{!195, !196, !209, !213, !214, !219, !220, !225, !226, !228}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !192, file: !193, line: 51, baseType: !7, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !192, file: !193, line: 52, baseType: !197, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_open_file_t", file: !77, line: 21, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_open_file_s", file: !200, line: 89, size: 160, elements: !201)
!200 = !DIFile(filename: "src/core/ngx_conf_file.h", directory: "/home/sam/Projects/nginx-1.12.2")
!201 = !{!202, !203, !204, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !199, file: !200, line: 90, baseType: !133, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !200, line: 91, baseType: !136, size: 64, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !199, file: !200, line: 93, baseType: !205, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !197, !190}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !199, file: !200, line: 94, baseType: !6, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !192, file: !193, line: 54, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_atomic_uint_t", file: !211, line: 98, baseType: !212)
!211 = !DIFile(filename: "src/os/unix/ngx_atomic.h", directory: "/home/sam/Projects/nginx-1.12.2")
!212 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "disk_full_time", scope: !192, file: !193, line: 56, baseType: !178, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !192, file: !193, line: 58, baseType: !215, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_handler_pt", file: !193, line: 45, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{!96, !190, !96, !104}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !193, line: 59, baseType: !6, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !192, file: !193, line: 61, baseType: !221, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_log_writer_pt", file: !193, line: 46, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !190, !7, !96, !104}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "wdata", scope: !192, file: !193, line: 62, baseType: !6, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !192, file: !193, line: 70, baseType: !227, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !193, line: 72, baseType: !190, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "valid_info", scope: !129, file: !130, line: 37, baseType: !11, size: 1, offset: 1184, flags: DIFlagBitField, extraData: i64 1184)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "directio", scope: !129, file: !130, line: 38, baseType: !11, size: 1, offset: 1185, flags: DIFlagBitField, extraData: i64 1184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !115, file: !110, line: 30, baseType: !113, size: 32, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !115, file: !110, line: 34, baseType: !11, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !115, file: !110, line: 40, baseType: !11, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !115, file: !110, line: 43, baseType: !11, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "recycled", scope: !115, file: !110, line: 45, baseType: !11, size: 1, offset: 291, flags: DIFlagBitField, extraData: i64 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "in_file", scope: !115, file: !110, line: 46, baseType: !11, size: 1, offset: 292, flags: DIFlagBitField, extraData: i64 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !115, file: !110, line: 47, baseType: !11, size: 1, offset: 293, flags: DIFlagBitField, extraData: i64 288)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !115, file: !110, line: 48, baseType: !11, size: 1, offset: 294, flags: DIFlagBitField, extraData: i64 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "last_buf", scope: !115, file: !110, line: 49, baseType: !11, size: 1, offset: 295, flags: DIFlagBitField, extraData: i64 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last_in_chain", scope: !115, file: !110, line: 50, baseType: !11, size: 1, offset: 296, flags: DIFlagBitField, extraData: i64 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "last_shadow", scope: !115, file: !110, line: 52, baseType: !11, size: 1, offset: 297, flags: DIFlagBitField, extraData: i64 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "temp_file", scope: !115, file: !110, line: 53, baseType: !11, size: 1, offset: 298, flags: DIFlagBitField, extraData: i64 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !115, file: !110, line: 55, baseType: !26, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !110, line: 61, baseType: !107, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !88, file: !89, line: 62, baseType: !246, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_large_t", file: !89, line: 41, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_large_s", file: !89, line: 43, size: 64, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !89, line: 44, baseType: !246, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !248, file: !89, line: 45, baseType: !6, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !88, file: !89, line: 63, baseType: !253, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_t", file: !89, line: 32, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_pool_cleanup_s", file: !89, line: 34, size: 96, elements: !256)
!256 = !{!257, !262, !263}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !255, file: !89, line: 35, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_pool_cleanup_pt", file: !89, line: 30, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !6}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !89, line: 36, baseType: !6, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !89, line: 37, baseType: !253, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !88, file: !89, line: 64, baseType: !190, size: 32, offset: 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !78, file: !79, line: 42, baseType: !190, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "new_log", scope: !78, file: !79, line: 43, baseType: !191, size: 320, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "log_use_stderr", scope: !78, file: !79, line: 45, baseType: !7, size: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !78, file: !79, line: 47, baseType: !269, size: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_t", file: !77, line: 26, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_connection_s", file: !273, line: 121, size: 896, elements: !274)
!273 = !DIFile(filename: "src/core/ngx_connection.h", directory: "/home/sam/Projects/nginx-1.12.2")
!274 = !{!275, !276, !280, !281, !284, !291, !293, !298, !303, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !378, !379, !380, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !273, line: 122, baseType: !6, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !272, file: !273, line: 123, baseType: !277, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_event_t", file: !77, line: 24, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_event_s", file: !77, line: 24, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !272, file: !273, line: 124, baseType: !277, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !272, file: !273, line: 126, baseType: !282, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_socket_t", file: !283, line: 17, baseType: !26)
!283 = !DIFile(filename: "src/os/unix/ngx_socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !272, file: !273, line: 128, baseType: !285, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_pt", file: !286, line: 19, baseType: !287)
!286 = !DIFile(filename: "src/os/unix/ngx_os.h", directory: "/home/sam/Projects/nginx-1.12.2")
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !270, !96, !104}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !10, line: 135, baseType: !26)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !272, file: !273, line: 129, baseType: !292, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_pt", file: !286, line: 22, baseType: !287)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "recv_chain", scope: !272, file: !273, line: 130, baseType: !294, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_recv_chain_pt", file: !286, line: 20, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!290, !270, !107, !120}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "send_chain", scope: !272, file: !273, line: 131, baseType: !299, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_send_chain_pt", file: !286, line: 23, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DISubroutineType(types: !302)
!302 = !{!107, !270, !107, !120}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !272, file: !273, line: 133, baseType: !304, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_listening_t", file: !273, line: 16, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_listening_s", file: !273, line: 18, size: 960, elements: !307)
!307 = !{!308, !309, !321, !323, !324, !325, !326, !327, !328, !329, !334, !335, !336, !337, !338, !339, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !306, file: !273, line: 19, baseType: !282, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !306, file: !273, line: 21, baseType: !310, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !312, line: 297, size: 128, elements: !313)
!312 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/sys/socket.h", directory: "/home/sam/Projects/nginx-1.12.2")
!313 = !{!314, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !311, file: !312, line: 298, baseType: !315, size: 16)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !10, line: 409, baseType: !316)
!316 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !311, file: !312, line: 299, baseType: !318, size: 112, offset: 16)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !306, file: !273, line: 22, baseType: !322, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !10, line: 404, baseType: !11)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text_max_len", scope: !306, file: !273, line: 23, baseType: !104, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !306, file: !273, line: 24, baseType: !136, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !273, line: 26, baseType: !26, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "backlog", scope: !306, file: !273, line: 28, baseType: !26, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !306, file: !273, line: 29, baseType: !26, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !306, file: !273, line: 30, baseType: !26, size: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !306, file: !273, line: 38, baseType: !330, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_connection_handler_pt", file: !77, line: 32, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !270}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "servers", scope: !306, file: !273, line: 40, baseType: !6, size: 32, offset: 352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !306, file: !273, line: 42, baseType: !191, size: 320, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "logp", scope: !306, file: !273, line: 43, baseType: !190, size: 32, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pool_size", scope: !306, file: !273, line: 45, baseType: !104, size: 32, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_buffer_size", scope: !306, file: !273, line: 47, baseType: !104, size: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "post_accept_timeout", scope: !306, file: !273, line: 49, baseType: !340, size: 32, offset: 800)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_msec_t", file: !341, line: 16, baseType: !342)
!341 = !DIFile(filename: "src/os/unix/ngx_time.h", directory: "/home/sam/Projects/nginx-1.12.2")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_key_t", file: !343, line: 16, baseType: !7)
!343 = !DIFile(filename: "src/core/ngx_rbtree.h", directory: "/home/sam/Projects/nginx-1.12.2")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !306, file: !273, line: 51, baseType: !304, size: 32, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !306, file: !273, line: 52, baseType: !270, size: 32, offset: 864)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !306, file: !273, line: 54, baseType: !7, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !306, file: !273, line: 56, baseType: !11, size: 1, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "remain", scope: !306, file: !273, line: 57, baseType: !11, size: 1, offset: 929, flags: DIFlagBitField, extraData: i64 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !306, file: !273, line: 58, baseType: !11, size: 1, offset: 930, flags: DIFlagBitField, extraData: i64 928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !306, file: !273, line: 60, baseType: !11, size: 1, offset: 931, flags: DIFlagBitField, extraData: i64 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inherited", scope: !306, file: !273, line: 61, baseType: !11, size: 1, offset: 932, flags: DIFlagBitField, extraData: i64 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking_accept", scope: !306, file: !273, line: 62, baseType: !11, size: 1, offset: 933, flags: DIFlagBitField, extraData: i64 928)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "listen", scope: !306, file: !273, line: 63, baseType: !11, size: 1, offset: 934, flags: DIFlagBitField, extraData: i64 928)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nonblocking", scope: !306, file: !273, line: 64, baseType: !11, size: 1, offset: 935, flags: DIFlagBitField, extraData: i64 928)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !306, file: !273, line: 65, baseType: !11, size: 1, offset: 936, flags: DIFlagBitField, extraData: i64 928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "addr_ntop", scope: !306, file: !273, line: 66, baseType: !11, size: 1, offset: 937, flags: DIFlagBitField, extraData: i64 928)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !306, file: !273, line: 67, baseType: !11, size: 1, offset: 938, flags: DIFlagBitField, extraData: i64 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6only", scope: !306, file: !273, line: 70, baseType: !11, size: 1, offset: 939, flags: DIFlagBitField, extraData: i64 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reuseport", scope: !306, file: !273, line: 72, baseType: !11, size: 1, offset: 940, flags: DIFlagBitField, extraData: i64 928)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "add_reuseport", scope: !306, file: !273, line: 73, baseType: !11, size: 1, offset: 941, flags: DIFlagBitField, extraData: i64 928)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !306, file: !273, line: 74, baseType: !11, size: 2, offset: 942, flags: DIFlagBitField, extraData: i64 928)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_accept", scope: !306, file: !273, line: 76, baseType: !11, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "delete_deferred", scope: !306, file: !273, line: 77, baseType: !11, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "add_deferred", scope: !306, file: !273, line: 78, baseType: !11, size: 1, offset: 946, flags: DIFlagBitField, extraData: i64 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sent", scope: !272, file: !273, line: 135, baseType: !120, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !272, file: !273, line: 137, baseType: !190, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !272, file: !273, line: 139, baseType: !86, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !273, line: 141, baseType: !26, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sockaddr", scope: !272, file: !273, line: 143, baseType: !310, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "socklen", scope: !272, file: !273, line: 144, baseType: !322, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "addr_text", scope: !272, file: !273, line: 145, baseType: !136, size: 64, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_addr", scope: !272, file: !273, line: 147, baseType: !136, size: 64, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_protocol_port", scope: !272, file: !273, line: 148, baseType: !374, size: 16, offset: 608)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !375, line: 12, baseType: !376)
!375 = !DIFile(filename: "/home/sam/Projects/emscripten/system/include/libc/netinet/in.h", directory: "/home/sam/Projects/nginx-1.12.2")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 186, baseType: !316)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_sockaddr", scope: !272, file: !273, line: 154, baseType: !310, size: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "local_socklen", scope: !272, file: !273, line: 155, baseType: !322, size: 32, offset: 672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !272, file: !273, line: 157, baseType: !113, size: 32, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !272, file: !273, line: 159, baseType: !381, size: 64, offset: 736)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_queue_t", file: !382, line: 16, baseType: !383)
!382 = !DIFile(filename: "src/core/ngx_queue.h", directory: "/home/sam/Projects/nginx-1.12.2")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_queue_s", file: !382, line: 18, size: 64, elements: !384)
!384 = !{!385, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !382, line: 19, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !382, line: 20, baseType: !386, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !272, file: !273, line: 161, baseType: !210, size: 32, offset: 800)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "requests", scope: !272, file: !273, line: 163, baseType: !7, size: 32, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffered", scope: !272, file: !273, line: 165, baseType: !11, size: 8, offset: 864, flags: DIFlagBitField, extraData: i64 864)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "log_error", scope: !272, file: !273, line: 167, baseType: !11, size: 3, offset: 872, flags: DIFlagBitField, extraData: i64 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "timedout", scope: !272, file: !273, line: 169, baseType: !11, size: 1, offset: 875, flags: DIFlagBitField, extraData: i64 864)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !272, file: !273, line: 170, baseType: !11, size: 1, offset: 876, flags: DIFlagBitField, extraData: i64 864)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !272, file: !273, line: 171, baseType: !11, size: 1, offset: 877, flags: DIFlagBitField, extraData: i64 864)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !272, file: !273, line: 173, baseType: !11, size: 1, offset: 878, flags: DIFlagBitField, extraData: i64 864)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reusable", scope: !272, file: !273, line: 174, baseType: !11, size: 1, offset: 879, flags: DIFlagBitField, extraData: i64 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !272, file: !273, line: 175, baseType: !11, size: 1, offset: 880, flags: DIFlagBitField, extraData: i64 864)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !272, file: !273, line: 176, baseType: !11, size: 1, offset: 881, flags: DIFlagBitField, extraData: i64 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sendfile", scope: !272, file: !273, line: 178, baseType: !11, size: 1, offset: 882, flags: DIFlagBitField, extraData: i64 864)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sndlowat", scope: !272, file: !273, line: 179, baseType: !11, size: 1, offset: 883, flags: DIFlagBitField, extraData: i64 864)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nodelay", scope: !272, file: !273, line: 180, baseType: !11, size: 2, offset: 884, flags: DIFlagBitField, extraData: i64 864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_nopush", scope: !272, file: !273, line: 181, baseType: !11, size: 2, offset: 886, flags: DIFlagBitField, extraData: i64 864)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "need_last_buf", scope: !272, file: !273, line: 183, baseType: !11, size: 1, offset: 888, flags: DIFlagBitField, extraData: i64 864)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "free_connections", scope: !78, file: !79, line: 48, baseType: !270, size: 32, offset: 480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "free_connection_n", scope: !78, file: !79, line: 49, baseType: !7, size: 32, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !78, file: !79, line: 51, baseType: !407, size: 32, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_module_t", file: !77, line: 15, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_module_s", file: !411, line: 222, size: 800, elements: !412)
!411 = !DIFile(filename: "src/core/ngx_module.h", directory: "/home/sam/Projects/nginx-1.12.2")
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !470, !471, !475, !477, !478, !479, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_index", scope: !410, file: !411, line: 223, baseType: !7, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !410, file: !411, line: 224, baseType: !7, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 226, baseType: !227, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "spare0", scope: !410, file: !411, line: 228, baseType: !7, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "spare1", scope: !410, file: !411, line: 229, baseType: !7, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !410, file: !411, line: 231, baseType: !7, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !410, file: !411, line: 232, baseType: !12, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !410, file: !411, line: 234, baseType: !6, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !410, file: !411, line: 235, baseType: !422, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_command_t", file: !77, line: 22, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_command_s", file: !200, line: 77, size: 224, elements: !425)
!425 = !{!426, !427, !428, !467, !468, !469}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !424, file: !200, line: 78, baseType: !136, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !200, line: 79, baseType: !7, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !424, file: !200, line: 80, baseType: !429, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DISubroutineType(types: !431)
!431 = !{!227, !432, !422, !6}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_t", file: !77, line: 16, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_conf_s", file: !200, line: 116, size: 384, elements: !435)
!435 = !{!436, !437, !448, !449, !450, !451, !460, !461, !462, !463, !464, !466}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !434, file: !200, line: 117, baseType: !227, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !434, file: !200, line: 118, baseType: !438, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_array_t", file: !440, line: 22, baseType: !441)
!440 = !DIFile(filename: "src/core/ngx_array.h", directory: "/home/sam/Projects/nginx-1.12.2")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 16, size: 160, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !441, file: !440, line: 17, baseType: !6, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !441, file: !440, line: 18, baseType: !7, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !441, file: !440, line: 19, baseType: !104, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !441, file: !440, line: 20, baseType: !7, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !441, file: !440, line: 21, baseType: !86, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !434, file: !200, line: 120, baseType: !75, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !434, file: !200, line: 121, baseType: !86, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "temp_pool", scope: !434, file: !200, line: 122, baseType: !86, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !434, file: !200, line: 123, baseType: !452, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_file_t", file: !200, line: 103, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !200, line: 98, size: 1344, elements: !455)
!455 = !{!456, !457, !458, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !454, file: !200, line: 99, baseType: !128, size: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !454, file: !200, line: 100, baseType: !113, size: 32, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !454, file: !200, line: 101, baseType: !113, size: 32, offset: 1248)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !454, file: !200, line: 102, baseType: !7, size: 32, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !434, file: !200, line: 124, baseType: !190, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !434, file: !200, line: 126, baseType: !6, size: 32, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "module_type", scope: !434, file: !200, line: 127, baseType: !7, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_type", scope: !434, file: !200, line: 128, baseType: !7, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !434, file: !200, line: 130, baseType: !465, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_conf_handler_pt", file: !200, line: 112, baseType: !429)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "handler_conf", scope: !434, file: !200, line: 131, baseType: !227, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "conf", scope: !424, file: !200, line: 81, baseType: !7, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !424, file: !200, line: 82, baseType: !7, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !424, file: !200, line: 83, baseType: !6, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !411, line: 236, baseType: !7, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_master", scope: !410, file: !411, line: 238, baseType: !472, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!24, !190}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !410, file: !411, line: 240, baseType: !476, size: 32, offset: 352)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_process", scope: !410, file: !411, line: 242, baseType: !476, size: 32, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !410, file: !411, line: 243, baseType: !476, size: 32, offset: 416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exit_thread", scope: !410, file: !411, line: 244, baseType: !480, size: 32, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !75}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "exit_process", scope: !410, file: !411, line: 245, baseType: !480, size: 32, offset: 480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "exit_master", scope: !410, file: !411, line: 247, baseType: !480, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook0", scope: !410, file: !411, line: 249, baseType: !9, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook1", scope: !410, file: !411, line: 250, baseType: !9, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook2", scope: !410, file: !411, line: 251, baseType: !9, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook3", scope: !410, file: !411, line: 252, baseType: !9, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook4", scope: !410, file: !411, line: 253, baseType: !9, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook5", scope: !410, file: !411, line: 254, baseType: !9, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook6", scope: !410, file: !411, line: 255, baseType: !9, size: 32, offset: 736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "spare_hook7", scope: !410, file: !411, line: 256, baseType: !9, size: 32, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "modules_n", scope: !78, file: !79, line: 52, baseType: !7, size: 32, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "modules_used", scope: !78, file: !79, line: 53, baseType: !7, size: 32, offset: 608)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_queue", scope: !78, file: !79, line: 55, baseType: !381, size: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reusable_connections_n", scope: !78, file: !79, line: 56, baseType: !7, size: 32, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "listening", scope: !78, file: !79, line: 58, baseType: !439, size: 160, offset: 736)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "paths", scope: !78, file: !79, line: 59, baseType: !439, size: 160, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump", scope: !78, file: !79, line: 61, baseType: !439, size: 160, offset: 1056)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_rbtree", scope: !78, file: !79, line: 62, baseType: !501, size: 96, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_t", file: !343, line: 32, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_s", file: !343, line: 37, size: 96, elements: !503)
!503 = !{!504, !515, !516}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !502, file: !343, line: 38, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_node_t", file: !343, line: 20, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_rbtree_node_s", file: !343, line: 22, size: 160, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !507, file: !343, line: 23, baseType: !342, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !507, file: !343, line: 24, baseType: !505, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !507, file: !343, line: 25, baseType: !505, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !507, file: !343, line: 26, baseType: !505, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !507, file: !343, line: 27, baseType: !97, size: 8, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !507, file: !343, line: 28, baseType: !97, size: 8, offset: 136)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !502, file: !343, line: 39, baseType: !505, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !502, file: !343, line: 40, baseType: !517, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_rbtree_insert_pt", file: !343, line: 34, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !505, !505, !505}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "config_dump_sentinel", scope: !78, file: !79, line: 63, baseType: !506, size: 160, offset: 1312)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !78, file: !79, line: 65, baseType: !523, size: 224, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_t", file: !524, line: 31, baseType: !525)
!524 = !DIFile(filename: "src/core/ngx_list.h", directory: "/home/sam/Projects/nginx-1.12.2")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 25, size: 224, elements: !526)
!526 = !{!527, !535, !536, !537, !538}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !525, file: !524, line: 26, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_list_part_t", file: !524, line: 16, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ngx_list_part_s", file: !524, line: 18, size: 96, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !530, file: !524, line: 19, baseType: !6, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nelts", scope: !530, file: !524, line: 20, baseType: !7, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !524, line: 21, baseType: !528, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "part", scope: !525, file: !524, line: 27, baseType: !529, size: 96, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !525, file: !524, line: 28, baseType: !104, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !525, file: !524, line: 29, baseType: !7, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !525, file: !524, line: 30, baseType: !86, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory", scope: !78, file: !79, line: 66, baseType: !523, size: 224, offset: 1696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "connection_n", scope: !78, file: !79, line: 68, baseType: !7, size: 32, offset: 1920)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "files_n", scope: !78, file: !79, line: 69, baseType: !7, size: 32, offset: 1952)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "connections", scope: !78, file: !79, line: 71, baseType: !270, size: 32, offset: 1984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "read_events", scope: !78, file: !79, line: 72, baseType: !277, size: 32, offset: 2016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "write_events", scope: !78, file: !79, line: 73, baseType: !277, size: 32, offset: 2048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "old_cycle", scope: !78, file: !79, line: 75, baseType: !75, size: 32, offset: 2080)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !78, file: !79, line: 77, baseType: !136, size: 64, offset: 2112)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "conf_param", scope: !78, file: !79, line: 78, baseType: !136, size: 64, offset: 2176)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "conf_prefix", scope: !78, file: !79, line: 79, baseType: !136, size: 64, offset: 2240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !79, line: 80, baseType: !136, size: 64, offset: 2304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lock_file", scope: !78, file: !79, line: 81, baseType: !136, size: 64, offset: 2368)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !78, file: !79, line: 82, baseType: !136, size: 64, offset: 2432)
!552 = !{!553}
!553 = !DILocalVariable(name: "cycle", arg: 1, scope: !72, file: !3, line: 43, type: !75)
!554 = !DILocation(line: 43, column: 32, scope: !72)
!555 = !DILocation(line: 50, column: 34, scope: !72)
!556 = !DILocation(line: 50, column: 41, scope: !72)
!557 = !{!558, !43, i64 4}
!558 = !{!"ngx_cycle_s", !43, i64 0, !43, i64 4, !43, i64 8, !559, i64 12, !35, i64 52, !43, i64 56, !43, i64 60, !35, i64 64, !43, i64 68, !35, i64 72, !35, i64 76, !561, i64 80, !35, i64 88, !562, i64 92, !562, i64 112, !562, i64 132, !563, i64 152, !564, i64 164, !565, i64 184, !565, i64 212, !35, i64 240, !35, i64 244, !43, i64 248, !43, i64 252, !43, i64 256, !43, i64 260, !567, i64 264, !567, i64 272, !567, i64 280, !567, i64 288, !567, i64 296, !567, i64 304}
!559 = !{!"ngx_log_s", !35, i64 0, !43, i64 4, !560, i64 8, !560, i64 12, !43, i64 16, !43, i64 20, !43, i64 24, !43, i64 28, !43, i64 32, !43, i64 36}
!560 = !{!"long", !36, i64 0}
!561 = !{!"ngx_queue_s", !43, i64 0, !43, i64 4}
!562 = !{!"", !43, i64 0, !35, i64 4, !35, i64 8, !35, i64 12, !43, i64 16}
!563 = !{!"ngx_rbtree_s", !43, i64 0, !43, i64 4, !43, i64 8}
!564 = !{!"ngx_rbtree_node_s", !35, i64 0, !43, i64 4, !43, i64 8, !43, i64 12, !36, i64 16, !36, i64 17}
!565 = !{!"", !43, i64 0, !566, i64 4, !35, i64 16, !35, i64 20, !43, i64 24}
!566 = !{!"ngx_list_part_s", !43, i64 0, !35, i64 4, !43, i64 8}
!567 = !{!"", !35, i64 0, !43, i64 4}
!568 = !DILocation(line: 50, column: 48, scope: !72)
!569 = !DILocation(line: 50, column: 63, scope: !72)
!570 = !DILocation(line: 51, column: 47, scope: !72)
!571 = !DILocation(line: 50, column: 22, scope: !72)
!572 = !DILocation(line: 50, column: 5, scope: !72)
!573 = !DILocation(line: 50, column: 12, scope: !72)
!574 = !DILocation(line: 50, column: 20, scope: !72)
!575 = !{!558, !43, i64 68}
!576 = !DILocation(line: 52, column: 9, scope: !577)
!577 = distinct !DILexicalBlock(scope: !72, file: !3, line: 52, column: 9)
!578 = !DILocation(line: 52, column: 16, scope: !577)
!579 = !DILocation(line: 52, column: 24, scope: !577)
!580 = !DILocation(line: 52, column: 9, scope: !72)
!581 = !DILocation(line: 53, column: 9, scope: !582)
!582 = distinct !DILexicalBlock(scope: !577, file: !3, line: 52, column: 33)
!583 = !DILocation(line: 56, column: 5, scope: !72)
!584 = !DILocation(line: 59, column: 24, scope: !72)
!585 = !DILocation(line: 59, column: 5, scope: !72)
!586 = !DILocation(line: 59, column: 12, scope: !72)
!587 = !DILocation(line: 59, column: 22, scope: !72)
!588 = !{!558, !35, i64 72}
!589 = !DILocation(line: 61, column: 5, scope: !72)
!590 = !DILocation(line: 62, column: 1, scope: !72)
!591 = distinct !DISubprogram(name: "ngx_init_modules", scope: !3, file: !3, line: 66, type: !73, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !592)
!592 = !{!593, !594}
!593 = !DILocalVariable(name: "cycle", arg: 1, scope: !591, file: !3, line: 66, type: !75)
!594 = !DILocalVariable(name: "i", scope: !591, file: !3, line: 68, type: !7)
!595 = !DILocation(line: 66, column: 31, scope: !591)
!596 = !DILocation(line: 68, column: 5, scope: !591)
!597 = !DILocation(line: 68, column: 17, scope: !591)
!598 = !DILocation(line: 70, column: 12, scope: !599)
!599 = distinct !DILexicalBlock(scope: !591, file: !3, line: 70, column: 5)
!600 = !DILocation(line: 70, column: 10, scope: !599)
!601 = !DILocation(line: 70, column: 17, scope: !602)
!602 = distinct !DILexicalBlock(scope: !599, file: !3, line: 70, column: 5)
!603 = !DILocation(line: 70, column: 24, scope: !602)
!604 = !DILocation(line: 70, column: 32, scope: !602)
!605 = !DILocation(line: 70, column: 5, scope: !599)
!606 = !DILocation(line: 71, column: 13, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !3, line: 71, column: 13)
!608 = distinct !DILexicalBlock(scope: !602, file: !3, line: 70, column: 41)
!609 = !DILocation(line: 71, column: 20, scope: !607)
!610 = !DILocation(line: 71, column: 28, scope: !607)
!611 = !DILocation(line: 71, column: 32, scope: !607)
!612 = !{!52, !43, i64 44}
!613 = !DILocation(line: 71, column: 13, scope: !608)
!614 = !DILocation(line: 72, column: 17, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !3, line: 72, column: 17)
!616 = distinct !DILexicalBlock(scope: !607, file: !3, line: 71, column: 45)
!617 = !DILocation(line: 72, column: 24, scope: !615)
!618 = !DILocation(line: 72, column: 32, scope: !615)
!619 = !DILocation(line: 72, column: 36, scope: !615)
!620 = !DILocation(line: 72, column: 48, scope: !615)
!621 = !DILocation(line: 72, column: 55, scope: !615)
!622 = !DILocation(line: 72, column: 17, scope: !616)
!623 = !DILocation(line: 73, column: 17, scope: !624)
!624 = distinct !DILexicalBlock(scope: !615, file: !3, line: 72, column: 66)
!625 = !DILocation(line: 75, column: 9, scope: !616)
!626 = !DILocation(line: 76, column: 5, scope: !608)
!627 = !DILocation(line: 70, column: 37, scope: !602)
!628 = !DILocation(line: 70, column: 5, scope: !602)
!629 = distinct !{!629, !605, !630}
!630 = !DILocation(line: 76, column: 5, scope: !599)
!631 = !DILocation(line: 78, column: 5, scope: !591)
!632 = !DILocation(line: 79, column: 1, scope: !591)
!633 = distinct !DISubprogram(name: "ngx_count_modules", scope: !3, file: !3, line: 83, type: !634, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{!24, !75, !7}
!636 = !{!637, !638, !639, !640, !641, !642}
!637 = !DILocalVariable(name: "cycle", arg: 1, scope: !633, file: !3, line: 83, type: !75)
!638 = !DILocalVariable(name: "type", arg: 2, scope: !633, file: !3, line: 83, type: !7)
!639 = !DILocalVariable(name: "i", scope: !633, file: !3, line: 85, type: !7)
!640 = !DILocalVariable(name: "next", scope: !633, file: !3, line: 85, type: !7)
!641 = !DILocalVariable(name: "max", scope: !633, file: !3, line: 85, type: !7)
!642 = !DILocalVariable(name: "module", scope: !633, file: !3, line: 86, type: !408)
!643 = !DILocation(line: 83, column: 32, scope: !633)
!644 = !DILocation(line: 83, column: 50, scope: !633)
!645 = !DILocation(line: 85, column: 5, scope: !633)
!646 = !DILocation(line: 85, column: 20, scope: !633)
!647 = !DILocation(line: 85, column: 23, scope: !633)
!648 = !DILocation(line: 85, column: 29, scope: !633)
!649 = !DILocation(line: 86, column: 5, scope: !633)
!650 = !DILocation(line: 86, column: 20, scope: !633)
!651 = !DILocation(line: 88, column: 10, scope: !633)
!652 = !DILocation(line: 89, column: 9, scope: !633)
!653 = !DILocation(line: 93, column: 12, scope: !654)
!654 = distinct !DILexicalBlock(scope: !633, file: !3, line: 93, column: 5)
!655 = !DILocation(line: 93, column: 10, scope: !654)
!656 = !DILocation(line: 93, column: 17, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !3, line: 93, column: 5)
!658 = !DILocation(line: 93, column: 24, scope: !657)
!659 = !DILocation(line: 93, column: 32, scope: !657)
!660 = !DILocation(line: 93, column: 5, scope: !654)
!661 = !DILocation(line: 94, column: 18, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !3, line: 93, column: 41)
!663 = !DILocation(line: 94, column: 25, scope: !662)
!664 = !DILocation(line: 94, column: 33, scope: !662)
!665 = !DILocation(line: 94, column: 16, scope: !662)
!666 = !DILocation(line: 96, column: 13, scope: !667)
!667 = distinct !DILexicalBlock(scope: !662, file: !3, line: 96, column: 13)
!668 = !DILocation(line: 96, column: 21, scope: !667)
!669 = !{!52, !35, i64 36}
!670 = !DILocation(line: 96, column: 29, scope: !667)
!671 = !DILocation(line: 96, column: 26, scope: !667)
!672 = !DILocation(line: 96, column: 13, scope: !662)
!673 = !DILocation(line: 97, column: 13, scope: !674)
!674 = distinct !DILexicalBlock(scope: !667, file: !3, line: 96, column: 35)
!675 = !DILocation(line: 100, column: 13, scope: !676)
!676 = distinct !DILexicalBlock(scope: !662, file: !3, line: 100, column: 13)
!677 = !DILocation(line: 100, column: 21, scope: !676)
!678 = !{!52, !35, i64 0}
!679 = !DILocation(line: 100, column: 31, scope: !676)
!680 = !DILocation(line: 100, column: 13, scope: !662)
!681 = !DILocation(line: 104, column: 17, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !3, line: 104, column: 17)
!683 = distinct !DILexicalBlock(scope: !676, file: !3, line: 100, column: 58)
!684 = !DILocation(line: 104, column: 25, scope: !682)
!685 = !DILocation(line: 104, column: 37, scope: !682)
!686 = !DILocation(line: 104, column: 35, scope: !682)
!687 = !DILocation(line: 104, column: 17, scope: !683)
!688 = !DILocation(line: 105, column: 23, scope: !689)
!689 = distinct !DILexicalBlock(scope: !682, file: !3, line: 104, column: 42)
!690 = !DILocation(line: 105, column: 31, scope: !689)
!691 = !DILocation(line: 105, column: 21, scope: !689)
!692 = !DILocation(line: 106, column: 13, scope: !689)
!693 = !DILocation(line: 108, column: 17, scope: !694)
!694 = distinct !DILexicalBlock(scope: !683, file: !3, line: 108, column: 17)
!695 = !DILocation(line: 108, column: 25, scope: !694)
!696 = !DILocation(line: 108, column: 38, scope: !694)
!697 = !DILocation(line: 108, column: 35, scope: !694)
!698 = !DILocation(line: 108, column: 17, scope: !683)
!699 = !DILocation(line: 109, column: 21, scope: !700)
!700 = distinct !DILexicalBlock(scope: !694, file: !3, line: 108, column: 44)
!701 = !DILocation(line: 110, column: 13, scope: !700)
!702 = !DILocation(line: 112, column: 13, scope: !683)
!703 = !DILocation(line: 117, column: 50, scope: !662)
!704 = !DILocation(line: 117, column: 57, scope: !662)
!705 = !DILocation(line: 117, column: 63, scope: !662)
!706 = !DILocation(line: 117, column: 29, scope: !662)
!707 = !DILocation(line: 117, column: 9, scope: !662)
!708 = !DILocation(line: 117, column: 17, scope: !662)
!709 = !DILocation(line: 117, column: 27, scope: !662)
!710 = !DILocation(line: 119, column: 13, scope: !711)
!711 = distinct !DILexicalBlock(scope: !662, file: !3, line: 119, column: 13)
!712 = !DILocation(line: 119, column: 21, scope: !711)
!713 = !DILocation(line: 119, column: 33, scope: !711)
!714 = !DILocation(line: 119, column: 31, scope: !711)
!715 = !DILocation(line: 119, column: 13, scope: !662)
!716 = !DILocation(line: 120, column: 19, scope: !717)
!717 = distinct !DILexicalBlock(scope: !711, file: !3, line: 119, column: 38)
!718 = !DILocation(line: 120, column: 27, scope: !717)
!719 = !DILocation(line: 120, column: 17, scope: !717)
!720 = !DILocation(line: 121, column: 9, scope: !717)
!721 = !DILocation(line: 123, column: 16, scope: !662)
!722 = !DILocation(line: 123, column: 24, scope: !662)
!723 = !DILocation(line: 123, column: 34, scope: !662)
!724 = !DILocation(line: 123, column: 14, scope: !662)
!725 = !DILocation(line: 124, column: 5, scope: !662)
!726 = !DILocation(line: 93, column: 37, scope: !657)
!727 = !DILocation(line: 93, column: 5, scope: !657)
!728 = distinct !{!728, !660, !729}
!729 = !DILocation(line: 124, column: 5, scope: !654)
!730 = !DILocation(line: 133, column: 9, scope: !731)
!731 = distinct !DILexicalBlock(scope: !633, file: !3, line: 133, column: 9)
!732 = !DILocation(line: 133, column: 16, scope: !731)
!733 = !{!558, !43, i64 260}
!734 = !DILocation(line: 133, column: 26, scope: !731)
!735 = !DILocation(line: 133, column: 29, scope: !731)
!736 = !DILocation(line: 133, column: 36, scope: !731)
!737 = !DILocation(line: 133, column: 47, scope: !731)
!738 = !DILocation(line: 133, column: 9, scope: !633)
!739 = !DILocation(line: 135, column: 16, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !3, line: 135, column: 9)
!741 = distinct !DILexicalBlock(scope: !731, file: !3, line: 133, column: 56)
!742 = !DILocation(line: 135, column: 14, scope: !740)
!743 = !DILocation(line: 135, column: 21, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !3, line: 135, column: 9)
!745 = !DILocation(line: 135, column: 28, scope: !744)
!746 = !DILocation(line: 135, column: 39, scope: !744)
!747 = !DILocation(line: 135, column: 47, scope: !744)
!748 = !DILocation(line: 135, column: 9, scope: !740)
!749 = !DILocation(line: 136, column: 22, scope: !750)
!750 = distinct !DILexicalBlock(scope: !744, file: !3, line: 135, column: 56)
!751 = !DILocation(line: 136, column: 29, scope: !750)
!752 = !DILocation(line: 136, column: 40, scope: !750)
!753 = !DILocation(line: 136, column: 48, scope: !750)
!754 = !DILocation(line: 136, column: 20, scope: !750)
!755 = !DILocation(line: 138, column: 17, scope: !756)
!756 = distinct !DILexicalBlock(scope: !750, file: !3, line: 138, column: 17)
!757 = !DILocation(line: 138, column: 25, scope: !756)
!758 = !DILocation(line: 138, column: 33, scope: !756)
!759 = !DILocation(line: 138, column: 30, scope: !756)
!760 = !DILocation(line: 138, column: 17, scope: !750)
!761 = !DILocation(line: 139, column: 17, scope: !762)
!762 = distinct !DILexicalBlock(scope: !756, file: !3, line: 138, column: 39)
!763 = !DILocation(line: 142, column: 17, scope: !764)
!764 = distinct !DILexicalBlock(scope: !750, file: !3, line: 142, column: 17)
!765 = !DILocation(line: 142, column: 25, scope: !764)
!766 = !DILocation(line: 142, column: 37, scope: !764)
!767 = !DILocation(line: 142, column: 35, scope: !764)
!768 = !DILocation(line: 142, column: 17, scope: !750)
!769 = !DILocation(line: 143, column: 23, scope: !770)
!770 = distinct !DILexicalBlock(scope: !764, file: !3, line: 142, column: 42)
!771 = !DILocation(line: 143, column: 31, scope: !770)
!772 = !DILocation(line: 143, column: 21, scope: !770)
!773 = !DILocation(line: 144, column: 13, scope: !770)
!774 = !DILocation(line: 145, column: 9, scope: !750)
!775 = !DILocation(line: 135, column: 52, scope: !744)
!776 = !DILocation(line: 135, column: 9, scope: !744)
!777 = distinct !{!777, !748, !778}
!778 = !DILocation(line: 145, column: 9, scope: !740)
!779 = !DILocation(line: 146, column: 5, scope: !741)
!780 = !DILocation(line: 150, column: 5, scope: !633)
!781 = !DILocation(line: 150, column: 12, scope: !633)
!782 = !DILocation(line: 150, column: 25, scope: !633)
!783 = !{!558, !35, i64 76}
!784 = !DILocation(line: 152, column: 12, scope: !633)
!785 = !DILocation(line: 152, column: 16, scope: !633)
!786 = !DILocation(line: 153, column: 1, scope: !633)
!787 = !DILocation(line: 152, column: 5, scope: !633)
!788 = distinct !DISubprogram(name: "ngx_module_ctx_index", scope: !3, file: !3, line: 319, type: !789, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!7, !75, !7, !7}
!791 = !{!792, !793, !794, !795, !796}
!792 = !DILocalVariable(name: "cycle", arg: 1, scope: !788, file: !3, line: 319, type: !75)
!793 = !DILocalVariable(name: "type", arg: 2, scope: !788, file: !3, line: 319, type: !7)
!794 = !DILocalVariable(name: "index", arg: 3, scope: !788, file: !3, line: 319, type: !7)
!795 = !DILocalVariable(name: "i", scope: !788, file: !3, line: 321, type: !7)
!796 = !DILocalVariable(name: "module", scope: !788, file: !3, line: 322, type: !408)
!797 = !DILocation(line: 319, column: 35, scope: !788)
!798 = !DILocation(line: 319, column: 53, scope: !788)
!799 = !DILocation(line: 319, column: 70, scope: !788)
!800 = !DILocation(line: 321, column: 5, scope: !788)
!801 = !DILocation(line: 321, column: 20, scope: !788)
!802 = !DILocation(line: 322, column: 5, scope: !788)
!803 = !DILocation(line: 322, column: 20, scope: !788)
!804 = !DILocation(line: 328, column: 12, scope: !805)
!805 = distinct !DILexicalBlock(scope: !788, file: !3, line: 328, column: 5)
!806 = !DILocation(line: 328, column: 10, scope: !805)
!807 = !DILocation(line: 328, column: 17, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !3, line: 328, column: 5)
!809 = !DILocation(line: 328, column: 24, scope: !808)
!810 = !DILocation(line: 328, column: 32, scope: !808)
!811 = !DILocation(line: 328, column: 5, scope: !805)
!812 = !DILocation(line: 329, column: 18, scope: !813)
!813 = distinct !DILexicalBlock(scope: !808, file: !3, line: 328, column: 41)
!814 = !DILocation(line: 329, column: 25, scope: !813)
!815 = !DILocation(line: 329, column: 33, scope: !813)
!816 = !DILocation(line: 329, column: 16, scope: !813)
!817 = !DILocation(line: 331, column: 13, scope: !818)
!818 = distinct !DILexicalBlock(scope: !813, file: !3, line: 331, column: 13)
!819 = !DILocation(line: 331, column: 21, scope: !818)
!820 = !DILocation(line: 331, column: 29, scope: !818)
!821 = !DILocation(line: 331, column: 26, scope: !818)
!822 = !DILocation(line: 331, column: 13, scope: !813)
!823 = !DILocation(line: 332, column: 13, scope: !824)
!824 = distinct !DILexicalBlock(scope: !818, file: !3, line: 331, column: 35)
!825 = !DILocation(line: 335, column: 13, scope: !826)
!826 = distinct !DILexicalBlock(scope: !813, file: !3, line: 335, column: 13)
!827 = !DILocation(line: 335, column: 21, scope: !826)
!828 = !DILocation(line: 335, column: 34, scope: !826)
!829 = !DILocation(line: 335, column: 31, scope: !826)
!830 = !DILocation(line: 335, column: 13, scope: !813)
!831 = !DILocation(line: 336, column: 18, scope: !832)
!832 = distinct !DILexicalBlock(scope: !826, file: !3, line: 335, column: 41)
!833 = !DILocation(line: 337, column: 13, scope: !832)
!834 = !DILocation(line: 339, column: 5, scope: !813)
!835 = !DILocation(line: 328, column: 37, scope: !808)
!836 = !DILocation(line: 328, column: 5, scope: !808)
!837 = distinct !{!837, !811, !838}
!838 = !DILocation(line: 339, column: 5, scope: !805)
!839 = !DILocation(line: 343, column: 9, scope: !840)
!840 = distinct !DILexicalBlock(scope: !788, file: !3, line: 343, column: 9)
!841 = !DILocation(line: 343, column: 16, scope: !840)
!842 = !DILocation(line: 343, column: 26, scope: !840)
!843 = !DILocation(line: 343, column: 29, scope: !840)
!844 = !DILocation(line: 343, column: 36, scope: !840)
!845 = !DILocation(line: 343, column: 47, scope: !840)
!846 = !DILocation(line: 343, column: 9, scope: !788)
!847 = !DILocation(line: 345, column: 16, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 345, column: 9)
!849 = distinct !DILexicalBlock(scope: !840, file: !3, line: 343, column: 56)
!850 = !DILocation(line: 345, column: 14, scope: !848)
!851 = !DILocation(line: 345, column: 21, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !3, line: 345, column: 9)
!853 = !DILocation(line: 345, column: 28, scope: !852)
!854 = !DILocation(line: 345, column: 39, scope: !852)
!855 = !DILocation(line: 345, column: 47, scope: !852)
!856 = !DILocation(line: 345, column: 9, scope: !848)
!857 = !DILocation(line: 346, column: 22, scope: !858)
!858 = distinct !DILexicalBlock(scope: !852, file: !3, line: 345, column: 56)
!859 = !DILocation(line: 346, column: 29, scope: !858)
!860 = !DILocation(line: 346, column: 40, scope: !858)
!861 = !DILocation(line: 346, column: 48, scope: !858)
!862 = !DILocation(line: 346, column: 20, scope: !858)
!863 = !DILocation(line: 348, column: 17, scope: !864)
!864 = distinct !DILexicalBlock(scope: !858, file: !3, line: 348, column: 17)
!865 = !DILocation(line: 348, column: 25, scope: !864)
!866 = !DILocation(line: 348, column: 33, scope: !864)
!867 = !DILocation(line: 348, column: 30, scope: !864)
!868 = !DILocation(line: 348, column: 17, scope: !858)
!869 = !DILocation(line: 349, column: 17, scope: !870)
!870 = distinct !DILexicalBlock(scope: !864, file: !3, line: 348, column: 39)
!871 = !DILocation(line: 352, column: 17, scope: !872)
!872 = distinct !DILexicalBlock(scope: !858, file: !3, line: 352, column: 17)
!873 = !DILocation(line: 352, column: 25, scope: !872)
!874 = !DILocation(line: 352, column: 38, scope: !872)
!875 = !DILocation(line: 352, column: 35, scope: !872)
!876 = !DILocation(line: 352, column: 17, scope: !858)
!877 = !DILocation(line: 353, column: 22, scope: !878)
!878 = distinct !DILexicalBlock(scope: !872, file: !3, line: 352, column: 45)
!879 = !DILocation(line: 354, column: 17, scope: !878)
!880 = !DILocation(line: 356, column: 9, scope: !858)
!881 = !DILocation(line: 345, column: 52, scope: !852)
!882 = !DILocation(line: 345, column: 9, scope: !852)
!883 = distinct !{!883, !856, !884}
!884 = !DILocation(line: 356, column: 9, scope: !848)
!885 = !DILocation(line: 357, column: 5, scope: !849)
!886 = !DILocation(line: 359, column: 12, scope: !788)
!887 = !DILocation(line: 360, column: 1, scope: !788)
!888 = !DILocation(line: 359, column: 5, scope: !788)
!889 = distinct !DISubprogram(name: "ngx_add_module", scope: !3, file: !3, line: 157, type: !890, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !894)
!890 = !DISubroutineType(types: !891)
!891 = !{!24, !432, !892, !408, !893}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903}
!895 = !DILocalVariable(name: "cf", arg: 1, scope: !889, file: !3, line: 157, type: !432)
!896 = !DILocalVariable(name: "file", arg: 2, scope: !889, file: !3, line: 157, type: !892)
!897 = !DILocalVariable(name: "module", arg: 3, scope: !889, file: !3, line: 157, type: !408)
!898 = !DILocalVariable(name: "order", arg: 4, scope: !889, file: !3, line: 158, type: !893)
!899 = !DILocalVariable(name: "rv", scope: !889, file: !3, line: 160, type: !6)
!900 = !DILocalVariable(name: "i", scope: !889, file: !3, line: 161, type: !7)
!901 = !DILocalVariable(name: "m", scope: !889, file: !3, line: 161, type: !7)
!902 = !DILocalVariable(name: "before", scope: !889, file: !3, line: 161, type: !7)
!903 = !DILocalVariable(name: "core_module", scope: !889, file: !3, line: 162, type: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ngx_core_module_t", file: !411, line: 264, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 260, size: 128, elements: !907)
!907 = !{!908, !909, !913}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !411, line: 261, baseType: !136, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "create_conf", scope: !906, file: !411, line: 262, baseType: !910, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{!6, !75}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "init_conf", scope: !906, file: !411, line: 263, baseType: !914, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{!227, !75, !6}
!917 = !DILocation(line: 157, column: 28, scope: !889)
!918 = !DILocation(line: 157, column: 43, scope: !889)
!919 = !DILocation(line: 157, column: 63, scope: !889)
!920 = !DILocation(line: 158, column: 12, scope: !889)
!921 = !DILocation(line: 160, column: 5, scope: !889)
!922 = !DILocation(line: 160, column: 25, scope: !889)
!923 = !DILocation(line: 161, column: 5, scope: !889)
!924 = !DILocation(line: 161, column: 25, scope: !889)
!925 = !DILocation(line: 161, column: 28, scope: !889)
!926 = !DILocation(line: 161, column: 31, scope: !889)
!927 = !DILocation(line: 162, column: 5, scope: !889)
!928 = !DILocation(line: 162, column: 25, scope: !889)
!929 = !DILocation(line: 164, column: 9, scope: !930)
!930 = distinct !DILexicalBlock(scope: !889, file: !3, line: 164, column: 9)
!931 = !DILocation(line: 164, column: 13, scope: !930)
!932 = !{!933, !43, i64 8}
!933 = !{!"ngx_conf_s", !43, i64 0, !43, i64 4, !43, i64 8, !43, i64 12, !43, i64 16, !43, i64 20, !43, i64 24, !43, i64 28, !35, i64 32, !35, i64 36, !43, i64 40, !43, i64 44}
!934 = !DILocation(line: 164, column: 20, scope: !930)
!935 = !DILocation(line: 164, column: 33, scope: !930)
!936 = !DILocation(line: 164, column: 30, scope: !930)
!937 = !DILocation(line: 164, column: 9, scope: !889)
!938 = !DILocation(line: 165, column: 43, scope: !939)
!939 = distinct !DILexicalBlock(scope: !930, file: !3, line: 164, column: 49)
!940 = !DILocation(line: 165, column: 9, scope: !939)
!941 = !DILocation(line: 167, column: 9, scope: !939)
!942 = !DILocation(line: 170, column: 9, scope: !943)
!943 = distinct !DILexicalBlock(scope: !889, file: !3, line: 170, column: 9)
!944 = !DILocation(line: 170, column: 17, scope: !943)
!945 = !{!52, !35, i64 20}
!946 = !DILocation(line: 170, column: 25, scope: !943)
!947 = !DILocation(line: 170, column: 9, scope: !889)
!948 = !DILocation(line: 171, column: 43, scope: !949)
!949 = distinct !DILexicalBlock(scope: !943, file: !3, line: 170, column: 43)
!950 = !DILocation(line: 173, column: 28, scope: !949)
!951 = !DILocation(line: 173, column: 34, scope: !949)
!952 = !DILocation(line: 173, column: 42, scope: !949)
!953 = !DILocation(line: 171, column: 9, scope: !949)
!954 = !DILocation(line: 174, column: 9, scope: !949)
!955 = !DILocation(line: 177, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !889, file: !3, line: 177, column: 9)
!957 = !{!52, !43, i64 24}
!958 = !DILocation(line: 177, column: 61, scope: !956)
!959 = !DILocation(line: 177, column: 9, scope: !889)
!960 = !DILocation(line: 178, column: 43, scope: !961)
!961 = distinct !DILexicalBlock(scope: !956, file: !3, line: 177, column: 67)
!962 = !DILocation(line: 180, column: 28, scope: !961)
!963 = !DILocation(line: 178, column: 9, scope: !961)
!964 = !DILocation(line: 181, column: 9, scope: !961)
!965 = !DILocation(line: 184, column: 12, scope: !966)
!966 = distinct !DILexicalBlock(scope: !889, file: !3, line: 184, column: 5)
!967 = !DILocation(line: 184, column: 10, scope: !966)
!968 = !DILocation(line: 184, column: 17, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !3, line: 184, column: 5)
!970 = !DILocation(line: 184, column: 21, scope: !969)
!971 = !DILocation(line: 184, column: 28, scope: !969)
!972 = !DILocation(line: 184, column: 36, scope: !969)
!973 = !DILocation(line: 184, column: 5, scope: !966)
!974 = !DILocation(line: 185, column: 13, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 185, column: 13)
!976 = distinct !DILexicalBlock(scope: !969, file: !3, line: 184, column: 45)
!977 = !DILocation(line: 185, column: 67, scope: !975)
!978 = !DILocation(line: 185, column: 13, scope: !976)
!979 = !DILocation(line: 186, column: 47, scope: !980)
